{"title": "Tinker Tailor Soldier Spy", "film_link": "/Movie Scripts/Tinker Tailor Soldier Spy Script.html", "script_link": "/scripts/Tinker-Tailor-Soldier-Spy.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Tinker Tailor Soldier Spy Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Tinker-Tailor-Soldier-Spy.jpg\" title=\"Tinker Tailor Soldier Spy Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Bridget O'Connor\" title=\"Scripts by Bridget O'Connor\">Bridget O'Connor</a><br/>  <a href=\"/writer.php?w=Peter Straughan\" title=\"Scripts by Peter Straughan\">Peter Straughan</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Movie Release Date</b> : December 2011<br/>\n<br/>\n<a href=\"/scripts/Tinker-Tailor-Soldier-Spy.html\">Read \"Tinker Tailor Soldier Spy\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\r\n\r\n\r\n<b>                      TINKER TAILOR SOLDIER SPY\r\n</b>\r\n\r\n\r\n                            Written by\r\n\r\n                Bridget O'Connor &amp; Peter Straughan\r\n\r\n\r\n\r\n\r\n<b>1   EXT. HUNGARY - BUDAPEST - 1973 - DAY                          1\r\n</b>\r\n    Budapest skyline, looking towards the Parliament building.\r\n    From here the world looks serene, peaceful. Then, as we\r\n    begin to PULL BACK, we hear a faint whine, increasing in\r\n    volume, until it's the roar of two MiG jet fighters,\r\n    cutting across the skyline. The PULL BACK reveals a YOUNG\r\n    BOY watching the jets, exclaiming excitedly in Hungarian.\r\n\r\n\r\n<b>2   EXT. BUDAPEST STREET - DAY                                    2\r\n</b>\r\n    LATERALLY TRACKING down a bustling street, as the jets\r\n    scream by overhead. Pedestrians look up. All except one man\r\n    who continues walking. This is JIM PRIDEAUX.\r\n\r\n    ACROSS THE STREET: More pedestrians. We're not sure who\r\n    we're supposed to be looking at - the short stocky man? The\r\n    girl in the mini skirt? The man in the checked jacket?\r\n\r\n    A car driving beside Prideaux accelerates out of the frame.\r\n    Across the street the girl in the mini-skirt peels off into\r\n    a shop. The stocky man turns and waves to us. But it isn't\r\n    Prideaux he's greeting but another passerby, who walks\r\n    over, shakes hands.\r\n\r\n    Now we're left with Prideaux and the Magyar in the checked\r\n    shirt, neither paying any attention to each other.\r\n\r\n    Just as we are wondering if there is any connection, the\r\n    two reach a corner and the Magyar, pausing to cross the\r\n    road, collides with another passerby. He looks over and\r\n    sees Prideaux has caught the moment of slight clumsiness\r\n    and gives the smallest of rueful smiles. A tiny moment of\r\n    contact between the two. Then both men walk on around the\r\n    corner, just two strangers headed in the same direction...\r\n\r\n\r\n<b>3   EXT. SUBWAY EXIT - DAY                                        3\r\n</b>\r\n    Shooting up the steps of the exit to the imposing GALERIA\r\n    building on the corner ahead. Prideaux and the Magyar walk\r\n    up the steps, still paying no attention to each other, and\r\n    head towards...\r\n\r\n\r\n<b>4   INT. BUDAPEST - GALERIA - DAY                                 4\r\n</b>\r\n    A formerly grand arcade. Many of the shops are now closed,\r\n    the one's that are open don't have much to sell. A CAFE\r\n    occupies the middle space under the high vaulted ceiling. A\r\n    JAZZ ROCK band rehearses in one of the nearby disused\r\n    shops, incongruous in the window, music muffled by the\r\n    glass. Customers sit around tables playing chess, drinking\r\n    coffee, a mother breast-feeding, the hum of chatter. The\r\n    ordinary world.\r\n<b>                                                               2.\r\n</b>\r\n\r\n\r\nWe find Prideaux and the Magyar sitting at one of the\r\ntables.\r\n\r\n<b>                    MAGYAR\r\n</b>              (Hungarian, subtitled)\r\n          And porkolts. You know porkolts?\r\n\r\n<b>                    JIM PRIDEAUX\r\n</b>              (Hungarian, subtitled)\r\n          Yes, I've had it.\r\n\r\n<b>                    MAGYAR\r\n</b>          It's very good. Better than\r\n          goulash. But you won't get it in\r\n          Budapest now.\r\n\r\n<b>                    JIM PRIDEAUX\r\n</b>          Why's that?\r\n\r\n<b>                    MAGYAR\r\n</b>          All the pigs have gone to Moscow.\r\n\r\nHe gives a sly laugh. Prideaux smiles, draws   on his\r\ncigarette, nonchalantly examining the people   at the tables\r\naround them. A WAITER arrives, belly bulging   out of his\r\ngrubby shirt, hair plastered to his head. He   puts two\r\nwizened-looking sandwiches in front of them.\r\n\r\nPRIDEAUX'S P.O.V. - A DROP OF SWEAT trickles from the\r\nWaiter's face, drips onto the table top.\r\n\r\nThe Magyar catches Jim looking at the droplet and gives a\r\nwry smile - \"nice service.\" Jim smiles back but a bell has\r\nbegun to ring inside him.\r\n\r\n<b>                    JIM PRIDEAUX\r\n</b>          When do I get to meet your\r\n          friend?\r\n\r\nThe Magyar chews on his sandwich, notices Prideaux is\r\nignoring his.\r\n\r\n<b>                    MAGYAR\r\n</b>          I'll take you to him. Not eating?\r\n\r\nPrideaux pushes his sandwich across the table, his manner\r\nstill easy, but his eyes flick after the Waiter, who stands\r\nat the entrance to the coffee shop, arguing with another\r\nman. He looks around the Galeria again, looking low -\r\nchecking the feet of the other customers? Then raising his\r\ngaze, he checks the windows of the apartments above which\r\nlook down into the arcade.\r\n\r\nPRIDEAUX'S P.O.V. - An OLD WOMAN stands in the shadows by a\r\nwindow above. She is watching him. Catching his gaze she\r\nshrinks back into the darkness and disappears.\r\n<b>                                                                3.\r\n</b>\r\n\r\n\r\nPrideaux's expression doesn't change but he sets his coffee\r\ncup down and casually stands. The Magyar looks up in\r\nsurprise.\r\n\r\n<b>                    JIM PRIDEAUX\r\n</b>          Would you excuse me a moment?\r\n\r\nHe starts to walk towards the exit of the Galeria. Behind\r\nhim his chair teeters for a moment, then slowly falls back\r\nand lands with a CRASH, sending pigeons fluttering up to\r\nthe domed ceiling.\r\n\r\nThe WAITER starts, turns, sees Prideaux leaving. Panic\r\nflashes across his face, he draws a GUN from the back of\r\nhis belt, aims after Prideaux and FIRES - the shot echoing\r\nin the cavernous space.\r\n\r\nThe shot misses, RICOCHETING off the tiled wall and\r\nPrideaux keeps walking, fighting down the impulse to run,\r\nas behind him, out of focus - an image from a surreal\r\nNIGHTMARE: the other CUSTOMERS stop what they are doing,\r\nlike actors at the end of a scene, and begin to rise, some\r\ndrawing guns. We hear a muffled voice shouting distantly in\r\nRussian.\r\n\r\n<b>                       KGB MAN\r\n</b>          No firing!\r\n\r\nAhead of Prideaux   more figures appear, blocking the exit.\r\nHe looks over his   shoulder just as another SHOT rings out -\r\nthis one catching   him above the shoulder blade and sending\r\nhim flying out of   frame.\r\n\r\nFrom around a corner a tall, over-coated man - KGB -\r\nstrides towards the scene, still bellowing in Russian.\r\n\r\n<b>                    KGB MAN (CONT'D)\r\n</b>          Who told you to fire? Who told\r\n          you to fucking fire?\r\n\r\nTHE JAZZ BAND have stopped playing and are staring at the\r\nground, arms at their sides, anxious not to see anything.\r\n\r\nIn the TOP WINDOW - the OLD WOMAN slips back into sight.\r\n\r\nHER P.O.V. - Prideaux lies face down in the arcade below.\r\nAs we watch one of his arms slides out, leaving a slick of\r\nblood. Then he's still.\r\n\r\nBELOW - The KGB Man has grabbed the Waiter and started to\r\nbeat him.\r\n\r\n<b>                    KGB MAN (CONT'D)\r\n</b>          Fucking Hungarian amateur! We\r\n          wanted him alive!\r\n<b>                                                                       4.\r\n</b>\r\n\r\n\r\n     Behind him we can see the breast-feeding MOTHER. She's\r\n     dead, a bullet hole in the centre of her forehead from the\r\n     ricochet. The baby continues to suckle on, undisturbed.\r\n\r\n     Through the cafe window we can see a MAN, partly obscured\r\n     by the crowd in front of us, the only man still seated. He\r\n     lights a cigarette.\r\n\r\n     CLOSE ON THE LIGHTER as he replaces it. We can make out an\r\n     inscription: \"To George, from Ann. All my love.\"\r\n\r\n     In the Galeria the KGB Man continues to bellow at the\r\n     Waiter. The baby begins to WAIL.\r\n\r\n<b>                                               FADE TO BLACK.\r\n</b>\r\n<b>                                                       FADE IN:\r\n</b>\r\n\r\n<b>4A   EXT. HQ OF BRITISH INTELLIGENCE - \"THE CIRCUS\" - DAY         4A\r\n</b>\r\n     A bird's eye view of the Circus.\r\n\r\n\r\n<b>4B   INT. CIRCUS - FIFTH FLOOR -   - \"MOTHERS\" OFFICE - DAY       4B\r\n</b>\r\n     A woman, CONNIE SACHS, a face that's seen it all, leans\r\n     against a wall, smoking. A middle-aged woman, one of the\r\n     secretaries or \"MOTHERS\" walks past, pushing a trolley of\r\n     documents. She nods at Connie mournfully. Connie looks\r\n     stricken. The Mother walks on into...\r\n\r\n\r\n<b>5    INT. CIRCUS - CONFERENCE ROOM - DAY                           5\r\n</b>\r\n     A long conference table. We are looking at an ELDERLY MAN\r\n     at the head of the table. He's sitting on a rather ornate\r\n     carving chair - a little like a throne - and he looks ill.\r\n     He is signing documents, his signature a simple \"C,\"\r\n     scrawled in GREEN INK, aware all eyes are on him. A\r\n     cigarette burns away in an already loaded ashtray.\r\n\r\n     This is the head of the Circus - known as CONTROL.\r\n\r\n     Around him are four lieutenants - the inner circle of the\r\n     intelligence service - PERCY ALLELINE, TOBY ESTERHASE, ROY\r\n     BLAND and BILL HAYDON.\r\n\r\n     Beside him, his right-hand man - GEORGE SMILEY.\r\n\r\n     From the thick and embarrassed atmosphere we might guess we\r\n     are at the end of a coup, the final ousting of a King. All\r\n     we hear is the ticking of a loud clock and the scratch of\r\n     the pen.\r\n\r\n     Smiley looks up to find Alleline's gaze fixed on him.\r\n     Alleline quickly looks down at his hands.\r\n<b>                                                                      5.\r\n</b>\r\n\r\n\r\n    CLOSE ON SMILEY - as he examines the others, gauging the\r\n    SHIFT OF POWER occurring in the room.\r\n\r\n    - Bill Haydon - handsome, urbane, frowning with tension,\r\n    pulls on his cigarette.\r\n\r\n     - Roy Bland - heavy set and moustached, flicking a guilty\r\n    look up at Smiley and away.\r\n\r\n     - Toby Esterhase - immaculate hair and suit, eyes on\r\n    Alleline, watching for a cue, like a dog told to `stay'.\r\n\r\n    No-one will look at him.\r\n\r\n    ON SMILEY - realising there is no hope.\r\n\r\n    Control finishes, puts the pen back in his pocket. He hands\r\n    the file to the MOTHER who, red-eyed, walks with it out of\r\n    the room.\r\n\r\n<b>                        PERCY ALLELINE\r\n</b>                  (Scottish accent)\r\n              I wish I could have done more,\r\n              Control.\r\n\r\n<b>                        CONTROL\r\n</b>                  (Coolly)\r\n              You did all you could, Percy.\r\n              (Beat) Well, a man should know\r\n              when to leave the party.\r\n\r\n    Beat. The clock suddenly gives a discordant chime as it\r\n    sounds the hour. A hint of bitter amusement on Control's\r\n    face, as though he's been waiting for this wrong little\r\n    note to make his move. He grinds his cigarette out.\r\n\r\n    Toby can't wait any longer.\r\n\r\n<b>                        TOBY ESTERHASE\r\n</b>              What about Smiley?\r\n\r\n    Control looks at Smiley. His gaze impersonal...\r\n\r\n    ON SMILEY - the faintest flicker in his eyes as he tries to\r\n    prepare himself for the shock of dismissal.\r\n\r\n<b>                        CONTROL\r\n</b>              Smiley is leaving with me.\r\n\r\n\r\n<b>6   OMITTED                                                       6\r\n</b>\r\n\r\n<b>7   INT. CIRCUS - FIFTH FLOOR - DAY                               7\r\n</b>\r\n    PUSHING Control and Smiley as they walk down the corridor.\r\n<b>                                                                       6.\r\n</b>\r\n\r\n\r\n     Alleline and the Lieutenants are waiting for them. A\r\n     horribly awkward moment. Toby pulls open the cage lift\r\n     doors for them, as if to hasten the eviction. Haydon looks\r\n     at him with contempt.\r\n\r\n<b>                         BILL HAYDON\r\n</b>               You little prick Esterhase.\r\n\r\n     Control sweeps past them and the lift, determined to walk\r\n     every step of the way. Smiley follows.\r\n\r\n\r\n<b>8    INT. CIRCUS - STAIRCASE - DAY                                 8\r\n</b>\r\n     Control and Smiley, begin their descent through the rigid\r\n     hierarchy of the Circus. As we TRACK with them, we see that\r\n     each floor is its own WORLD. The two men walk past the\r\n     fourth floor REGISTRY - the vast archive of intelligence,\r\n     staffed by RESEARCHERS.\r\n\r\n     Smiley and Control pass down another flight and along the\r\n     third floor - INTELLIGENCE OFFICERS - heads poking out of\r\n     offices, amongst them JERRY WESTERBY.\r\n\r\n     Down to the second floor - SCALPHUNTERS - the muscle of the\r\n     Circus. The boredom of an air-port lounge, a sunken sofa\r\n     and pool-table. The Scalphunters watching them go in\r\n     respectful silence.\r\n\r\n     On down to the first floor TYPING POOL - staffed by pretty\r\n     young society girls - the DEBS - who watch open-mouthed, as\r\n     their Chief passes them for the last time. And finally\r\n     down to...\r\n\r\n\r\n<b>9    INT. CIRCUS - GROUND-FLOOR LOBBY - DAY                        9\r\n</b>\r\n     An ancient doorman - BRYANT - feeling the moment must be\r\n     marked in some way - leaves his sentry box and opens the\r\n     main door for Control. Control acknowledges the salute with\r\n     a flick of his eyes and we push through the doors...\r\n\r\n\r\n<b>10   EXT. CIRCUS - ROOF OF THE CIRCUS - DAY                       10\r\n</b>\r\n     Alleline and Bland stand smoking, watching Control and\r\n     Smiley emerge onto the pavement.\r\n\r\n\r\n<b>11   EXT. CIRCUS - DAY                                            11\r\n</b>\r\n     CONTROL and SMILEY stand on the street. They stare at each\r\n     other for a moment. This is goodbye. They shake hands.\r\n     Perhaps there's a little reserve in Control's manner, a\r\n     lack of warmth. From the expression on Smiley's face we see\r\n     that he is pained by this.\r\n<b>                                                                       7.\r\n</b>\r\n\r\n\r\n     Control puts his collar up and walks away. Smiley stands\r\n     forlornly as Control disappears into the crowd.\r\n\r\n<b>     TITLES OVER A MONTAGE\r\n</b>\r\n\r\n<b>12   EXT. HAMPSTEAD POND - AUTUMN DAY                             12\r\n</b>\r\n     THE WATER OF THE POND - still, glassy.\r\n\r\n     A MAN'S head breaks the surface - Smiley swimming through\r\n     his retirement.\r\n\r\n     He takes a breath and submerges again. Beyond him we see a\r\n     straggled diagonal line of elderly heads, bobbing through\r\n     the water.\r\n\r\n\r\n<b>13   EXT. HAMPSTEAD POND - DAY                                    13\r\n</b>\r\n     Smiley dries himself under the trees, pink and raw in the\r\n     cold fresh air. He smooths his hair down, feeling a little\r\n     less ridiculous. He looks over to where a VERY ELDERLY\r\n     SWIMMER is being helped into the water - little more than\r\n     trembling bones.\r\n\r\n     Is this his world now?\r\n\r\n\r\n<b>14   INT. CIRCUS - FIFTH FLOOR - DAY                              14\r\n</b>\r\n     A MOTHER unloads a stack of files from a LIFT shaft and\r\n     places them into her wheeled safe. A piece of CHRISTMAS\r\n     TINSEL is wound along the trolley. We track with her\r\n     through the HIVE-LIKE atmosphere of the fifth floor, behind\r\n     her the conference room - a glimpse of Alleline in\r\n     Control's chair, surrounded by his lieutenants - smoke and\r\n     whiskey - engaged in the business of the world.\r\n\r\n     She pushes on into Alleline's OFFICE - loads the new files\r\n     into the LARGE SAFE there, locks and spins the combination.\r\n\r\n\r\n<b>15   INT. SMILEY'S HOUSE - WINTER DAY                             15\r\n</b>\r\n     Smiley stands frying an egg in his small kitchen.\r\n\r\n\r\n<b>16   INT. SMILEY'S HOUSE - DAY                                    16\r\n</b>\r\n     Smiley sits eating his solitary lunch, reading a volume of\r\n     Grimmelshausen. He turns a page, examines the illustration\r\n     of a knight and a dragon - holds it at arms length, trying\r\n     to focus on it.\r\n<b>                                                                        8.\r\n</b>\r\n\r\n\r\n<b>16A   INT. SMILEY'S HOUSE - BEDROOM - NIGHT                      16A\r\n</b>\r\n      Smiley lies in the double bed, a conspicuous empty space next\r\n      to him. He leans over and turns the light out.\r\n\r\n\r\n<b>17    INT. CIRCUS - FIFTH FLOOR - ALLELINE'S OFFICE - NIGHT        17\r\n</b>\r\n      A HAND removes files from the LARGE SAFE.\r\n\r\n      ON A BRIEFCASE - as the files - marked TOP SECRET - are\r\n      slipped inside.\r\n\r\n\r\n<b>18    INT. CIRCUS - FIFTH FLOOR - EVENING                          18\r\n</b>\r\n<b>      P.O.V. MYSTERY MAN\r\n</b>\r\n      ... TRACKING through the near-empty offices. All the\r\n      drawers of the desks are OPEN. BINS on the tables. A few\r\n      mothers working late, illuminated by their desk lamps. One\r\n      of them is applying lipstick, prior to leaving. She doesn't\r\n      react as we track by.\r\n\r\n\r\n<b>19    EXT. OPTICIANS - SPRING DAY                                  19\r\n</b>\r\n      We are looking at large blurred LETTERS. A lens is slotted\r\n      into our frame and the letters leap into BOLD.\r\n\r\n      Smiley is in a chair, being fitted for spectacles.\r\n\r\n\r\n<b>20    INT. OPTICIANS - DAY                                         20\r\n</b>\r\n      Smiley is selecting frames from a display. He tries on a\r\n      pair, watched by a bored shop assistant, used to the\r\n      pedantic ways of the retired.\r\n\r\n\r\n<b>21    INT. CIRCUS - GROUND-FLOOR LOBBY - EVENING                   21\r\n</b>\r\n      TRACKING with the BRIEFCASE as the mystery man walks\r\n      towards the main entrance. The ELDERLY PORTER- BRYANT -\r\n      nods respectfully.\r\n\r\n\r\n<b>22    INT. LONDON UNDERGROUND - EVENING                            22\r\n</b>\r\n      A packed train - Businessmen in bowler hats, long-haired\r\n      seventies youth - the old and the new bumping underneath\r\n      the city. We track low level until we find our MYSTERY MAN,\r\n      the BRIEFCASE clutched in his hand.\r\n<b>                                                                      9.\r\n</b>\r\n\r\n\r\n<b>23   EXT. SAFE HOUSE - EVENING                                   23\r\n</b>\r\n     Tracking with the BRIEFCASE as it is carried towards the\r\n     house...\r\n\r\n\r\n<b>24   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                      24\r\n</b>\r\n     An elderly lady - MRS McCRAIG - stands at the sink. Through\r\n     the window she catches a glimpse of the Mystery Man's legs\r\n     passing, the briefcase in his hand as he walks up the steps\r\n     towards the front door. Calmly she dries her hands as the\r\n     doorbell rings and her DOG begins to bark furiously.\r\n\r\n\r\n<b>25   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                      25\r\n</b>\r\n     Mrs McCraig opens the door and the figure passes her and\r\n     the barking dog without a word and begins to walk up the\r\n     stairs...\r\n\r\n\r\n<b>26   INT. SMILEY'S HOUSE - DRAWING ROOM - DAY                    26\r\n</b>\r\n     Smiley adds a LETTER to a pile on the mantelpiece. We see\r\n     the letters are all addressed to ANN SMILEY.\r\n\r\n     He straightens up, finds himself staring at a PAINTING on\r\n     the wall - a muddy abstract.\r\n\r\n\r\n<b>27   INT. SAFE HOUSE - MEETING ROOM - NIGHT                      27\r\n</b>\r\n     The room is almost bare - two chairs at a small table on\r\n     which stands two desk lamps and a CAMERA. The Mystery Man\r\n     has crossed to the wall by the window and opens the GRILL\r\n     on an AIR DUCT.\r\n\r\n\r\n<b>28   EXT. SAFE HOUSE - NIGHT                                     28\r\n</b>\r\n     From across the street a tall good-looking man - POLYAKOV -\r\n     watches as the opened duct spills a star pattern of light\r\n     out into the night air. He walks towards the house...\r\n\r\n\r\n<b>29   INT. SAFE HOUSE - MEETING ROOM - NIGHT                      29\r\n</b>\r\n     The Mystery man settles at the table, sorting through the\r\n     contents of the briefcase as, from down below, we hear the\r\n     sound of the door bell, the dog barking and footsteps on\r\n     the stairs. Polyakov walks into the room and joins the\r\n     Mystery Man at the small table. He picks up the camera with\r\n     a smile.\r\n\r\n<b>                         POLYAKOV\r\n</b>                   (In Russian)\r\n               Shall we begin?\r\n<b>                                                                        10.\r\n</b>\r\n\r\n\r\n<b>      END OF TITLES\r\n</b>\r\n\r\n<b>30    EXT. LACON'S HOUSE - EARLY MORNING                           30\r\n</b>\r\n      Lights glowing in the early morning gloom, an ultra-modern\r\n      cube of a building sits in rather traditional grounds. This\r\n      is the unlikely home of Oliver Lacon, Permanent under-\r\n      secretary.\r\n\r\n\r\n<b>30A   INT./EXT. LACON'S HOUSE - MORNING                           30A\r\n</b>\r\n      As we watch a young girl - JACKIE LACON - appears at the\r\n      living room window in her night-dress, playing with a toy. As\r\n      we watch her we hear stealthy footsteps approach. Then a MAN\r\n      steps into frame, his back to us, watching the girl through\r\n      the window. He taps on the glass with one hand. Jackie looks\r\n      up, surprised.\r\n\r\n      As we pull back a little we see the man has his other hand\r\n      behind his back.\r\n\r\n      And in it is a long, bone-handled KNIFE.\r\n\r\n      Behind Jackie we see a string bean of a man, OLIVER LACON,\r\n      tying his silk dressing gown as he cautiously approaches the\r\n      window. On the other side, the intruder stands, smoking.\r\n\r\n<b>                              LACON\r\n</b>                        (through glass)\r\n                   This is private property. Who are\r\n                   you?\r\n\r\n      He takes in the man before him - filthy and bearded, you\r\n      could mistake him for a tramp. But beneath the grime he's\r\n      tanned and his eyes have a dangerous, feral edge. This is\r\n<b>      RICKI TARR.\r\n</b>\r\n<b>                             RICKI TARR\r\n</b>                   Minister Lacon.\r\n\r\n      He smiles.\r\n\r\n<b>                             LACON\r\n</b>                   What do you want?\r\n\r\n<b>                             RICKI TARR\r\n</b>                   I want to talk to Control. And I\r\n                   want breakfast.\r\n\r\n\r\n<b>30B   OMITTED                                                     30B\r\n</b>\r\n\r\n<b>30C   OMITTED                                                     30C\r\n</b><b>                                                                        11.\r\n</b>\r\n\r\n\r\n<b>30D   OMITTED                                                     30D\r\n</b>\r\n\r\n<b>31    OMITTED                                                      31\r\n</b>\r\n\r\n<b>32    OMITTED                                                      32\r\n</b>\r\n\r\n<b>33    INT. CIRCUS - SCALPHUNTERS - DAY                             33\r\n</b>\r\n      PETER GUILLAM walks down a corridor. Handsome, boyish,\r\n      bored. He hears a TRING behind him. It's Haydon, one foot\r\n      up on his pedal, scootering along the corridor. Guillam\r\n      waits for him. He likes this man.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                    (of the bike)\r\n                Has that been cleared?\r\n\r\n<b>                          BILL HAYDON\r\n</b>                I'm not bloody chaining it\r\n                outside. Mind you, probably no\r\n                safer in here, with you bunch of\r\n                cut-throats.\r\n\r\n      They arrive at a half-paned office cubicle. Inside is a\r\n      very pretty GIRL, a new DEB, being shown the ropes by an\r\n      older woman.\r\n\r\n<b>                          HAYDON\r\n</b>                Thought I'd get a glimpse of the\r\n                new girl. Before Bland gets to\r\n                her. He seen her yet?\r\n\r\n<b>                          GUILLAM\r\n</b>                Oh yes. Down first thing.\r\n\r\n\r\n<b>      GIRL'S P.O.V. -\r\n</b>\r\n      ... as Haydon and Guillam pass, staring in at her, cropped\r\n      above the waist. Haydon appears to be gliding\r\n      supernaturally by. He gives a little wave.\r\n\r\n\r\n<b>      BACK ON HAYDON:\r\n</b>\r\n<b>                          HAYDON\r\n</b>                You may fuck me, Belinda, but you\r\n                still have to call me sir in the\r\n                morning.\r\n\r\n      Guillam grins. Haydon glides off, hand raised in farewell\r\n      as Guillam turns into the Scalphunters arena.\r\n<b>                                                                        12.\r\n</b>\r\n\r\n\r\n<b>34    INT. CIRCUS - SCALPHUNTERS - GUILLAM'S OFFICE - DAY          34\r\n</b>\r\n      Guillam sits at his desk over a pile of paper-work, slowly\r\n      falling asleep.\r\n\r\n      BANG! A pool ball thwacks the window, cracking it. At the\r\n      same moment the PHONE begins to ring. Guillam jerks\r\n      upright, looks over at the pool players, too bored to be\r\n      angry.\r\n\r\n<b>                          POOL PLAYER (O.S.)\r\n</b>                Sorry Peter.\r\n\r\n      Guillam answers the phone.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Peter Guillam...\r\n\r\n      He listens to the voice on the other end. After a moment he\r\n      turns away from his colleagues, his former drowsiness\r\n      abruptly gone.\r\n\r\n\r\n<b>35    EXT. LONDON STREET - EVENING                                 35\r\n</b>\r\n      Smiley in his NEW GLASSES, towel rolled under his arm,\r\n      walking down the street. He stops for a moment, feeling\r\n      himself watched.\r\n\r\n\r\n<b>36    EXT. SMILEY'S HOUSE - EVENING                                36\r\n</b>\r\n      Smiley on the steps to his home, stops, examines the door,\r\n      removing a WEDGE from the top of the door frame.\r\n\r\n\r\n<b>37    INT. SMILEY'S HOUSE - EVENING                                37\r\n</b>\r\n      Smiley walks into the hallway, stopping to pick up post.\r\n\r\n\r\n<b>38    INT. SMILEY'S HOUSE - EVENING                                38\r\n</b>\r\n      Smiley places the wedge and the letters on the mantelpiece,\r\n      where a BUNDLE of LETTERS already sits, addressed to ANN\r\n      SMILEY. Unopened.\r\n\r\n\r\n<b>38A   INT. SMILEY'S HOUSE - KITCHEN - EVENING                     38A\r\n</b>\r\n      Smiley frying an egg.\r\n\r\n      There's a knock at the door.\r\n\r\n\r\n<b>38B   INT./EXT. SMILEY'S HOUSE - EVENING                          38B\r\n</b>\r\n      Smiley opens the door to PETER GUILLAM.\r\n<b>                                                                        13.\r\n</b>\r\n\r\n\r\n<b>                          SMILEY\r\n</b>                    (Surprised)\r\n                Hello, Peter.\r\n\r\n      They stare at each other. Smiley takes in his expression -\r\n      this is not a social call.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                Have I time to change?\r\n\r\n      Guillam nods, following Smiley into the house. He glances at\r\n      a painting on the wall - a muddy ABSTRACT. He crosses to\r\n      examine it and then notices the bundle of Ann's unopened\r\n      letters.\r\n\r\n\r\n<b>39    INT. SMILEY'S HOUSE - EVENING                                39\r\n</b>\r\n      Guillam enters the kitchen, notes the single place set for\r\n      dinner. It dawns on him that he really has invaded Smiley's\r\n      privacy.\r\n\r\n      Smiley appears in a coat behind him, taking in Guillam's\r\n      awkwardness. He gives a thin smile.\r\n\r\n<b>                          SMILEY\r\n</b>                Are we going far?\r\n\r\n\r\n<b>39A   INT. GUILLAM'S CAR - EVENING                               39A\r\n</b>\r\n      Smiley and Guillam sit in silence, as Guillam drives through\r\n      London. It's a Citroen DS, all sleek leather and mahogany\r\n      interior.\r\n\r\n\r\n<b>40    OMITTED                                                      40\r\n</b>\r\n\r\n<b>40A   INT. LACON'S HOUSE - EVENING                               40A\r\n</b>\r\n\r\n<b>      CLOSE UP ON:\r\n</b>\r\n      A half eaten bacon SANDWICH, sitting on a table.\r\n\r\n      We pan up and through the open window see an anxious Lacon is\r\n      leading Guillam towards the house. Smiley follows, talking to\r\n      Lacon's daughter.\r\n\r\n<b>                          LACON\r\n</b>                How's your mother?\r\n\r\n<b>                           PETER GUILLAM\r\n</b>                Very well.\r\n                    (referring to the window)\r\n                Is this where he got out?\r\n<b>                                                                     14.\r\n</b>\r\n\r\n\r\n<b>                          LACON\r\n</b>               Mmm, I came back in and it was wide\r\n               open.\r\n                   (beat)\r\n               Do send her my love. Apologies for\r\n               singling you out, but... very\r\n               sensitive matter...\r\n\r\n     He gives an uncomfortable bark of laughter.\r\n\r\n<b>                         LACON (CONT'D)\r\n</b>               If one can't trust one's own\r\n               nephew... You know who he was?\r\n\r\n<b>                         PETER GUILLAM\r\n</b>               Ricki Tarr, sir. One of my scalp-\r\n               hunters. He's been on the wanted\r\n               list for a year. Last job was\r\n               Istanbul, bit of coat-trailing for\r\n               a Russian convention.\r\n\r\n<b>                         LACON\r\n</b>               Why is he on the wanted list?\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                   (beat)\r\n               He killed our man in Istanbul. Cut\r\n               his throat. Been on the run since\r\n               then.\r\n\r\n     If possible, Lacon looks even more shaken.\r\n\r\n<b>                         LACON\r\n</b>               My God. In my own home... my\r\n               family... The bloody animals you\r\n               people employ!\r\n\r\n\r\n<b>41   INT. LACON'S HOUSE - NIGHT                                 41\r\n</b>\r\n     PULLING OLIVER LACON as he leads Smiley and Guillam down\r\n     the hall, gesturing for his WIFE to take Jackie away. He\r\n     attempts some social niceties, but his tone is strained.\r\n\r\n<b>                         LACON\r\n</b>               And how are you George? Missing\r\n               one's work, one's buddies?\r\n\r\n<b>                          SMILEY\r\n</b>               Oh, I think I manage pretty well,\r\n               thank you.\r\n\r\n     They reach a large room, minimalist apart from a grand piano\r\n     framed by vast glass windows. A tall, well built young man -\r\n     FAWN - stands on guard. Lacon gestures to him and Fawn opens\r\n     the french windows and he and Guillam walk out onto the\r\n     terrace beyond.\r\n<b>                                                                       15.\r\n</b>\r\n\r\n\r\n     Behind them, unnoticed, young JACKIE creeps back into the\r\n     room and slips behind the sofa.\r\n\r\n<b>                         LACON\r\n</b>               Your wife, the lovely Ann? She's in\r\n               the pink, and so on.\r\n\r\n<b>                         SMILEY\r\n</b>               Very well. (Beat) Very bonny...\r\n\r\n     Fawn closes the french doors behind him and Lacon is suddenly\r\n     all business.\r\n\r\n<b>                         LACON\r\n</b>               Do you know this man Tarr?\r\n\r\n<b>                         SMILEY\r\n</b>                   (Mildly)\r\n               I recruited him actually. In\r\n               Penang. Good with women. Likes to\r\n               talk. What did he say to you?\r\n\r\n<b>                         LACON\r\n</b>               He said he had some intelligence\r\n               for Control. Had no idea he was\r\n               dead. The news obviously hadn't\r\n               reached Wonga Wonga land. Then he\r\n               said he would only tell it to\r\n               someone outside the Circus. If he\r\n               couldn't have a Minister, he would\r\n               settle for the Under-secretary.\r\n               Lucky me.\r\n\r\n     Lacon lights a cigarette, smokes a moment, building up to\r\n     something. Smiley waits him out. The room has become very\r\n     still.\r\n\r\n<b>                         LACON (CONT'D)\r\n</b>               He said there's a mole. Right at\r\n               the top of the Circus. And that\r\n               he's been there for years.\r\n\r\n     Smiley absorbs this. The moment is suddenly broken by a few\r\n     stray notes from the piano. The two jump slightly and turn to\r\n     where Jackie sits at the keyboard, smiling triumphantly.\r\n\r\n\r\n<b>42   OMITTED                                                      42\r\n</b>\r\n\r\n<b>43   EXT. LACON'S HOUSE - TERRACE - NIGHT                         43\r\n</b>\r\n     Smiley and Lacon stand on the terrace alone. Lacon glances\r\n     anxiously at Smiley, trying to read him.\r\n\r\n<b>                         LACON\r\n</b>               I was sad to see you go, George. I\r\n               thought it was shabby, very shabby.\r\n<b>                         (MORE)\r\n</b><b>                                                               16.\r\n</b>\r\n<b>                    LACON (CONT'D)\r\n</b>          But the Minister agreed with Sir\r\n          Percy. New broom, clean sweep,\r\n          wheat from the chaff and all that.\r\n          And to be fair, Percy has had some\r\n          marvellous results since you and\r\n          Control left...\r\n\r\nRealizing how this sounds, he glances at Smiley to see how\r\nmuch damage he's caused.\r\n\r\n<b>                    LACON (CONT'D)\r\n</b>          Anyway, it does mean you're rather\r\n          ideally placed to look into this\r\n          matter for us now, doesn't it?\r\n          Outside the family?\r\n\r\nSmiley looks blandly back at him.\r\n\r\n<b>                    SMILEY\r\n</b>          I am retired, Oliver.\r\n\r\nSilence. Lacon looks uncomfortable, something he hasn't yet\r\nsaid.\r\n\r\n<b>                    LACON\r\n</b>          Thing is, some time back, when\r\n          Control was still alive, he came to\r\n          me with a similar suggestion.\r\n\r\nSmiley looks at him, surprised.\r\n\r\n<b>                    LACON (CONT'D)\r\n</b>          He never mentioned his suspicions\r\n          to you?\r\n\r\n<b>                    SMILEY\r\n</b>          No.\r\n\r\n<b>                    LACON\r\n</b>          I just thought... with you being\r\n          \"his man\", so to speak.\r\n\r\n<b>                    SMILEY\r\n</b>          What did you say to him?\r\n\r\n<b>                     LACON\r\n</b>              (Beat)\r\n          I'm afraid I thought his paranoia\r\n          had got the better of him and he\r\n          was pulling his own house down.\r\n          That does happen in your business.\r\n          And that bloody mess in Budapest...\r\n\r\nSmiley stares out over the rolling countryside, inscrutable.\r\n\r\n<b>                    LACON (CONT'D)\r\n</b>          Damn it, George, this is your\r\n          generation, your legacy!\r\n<b>                    (MORE)\r\n</b><b>                                                                       17.\r\n</b>\r\n<b>                         LACON (CONT'D)\r\n</b>               If there's any truth in this you'd\r\n               think you'd want to...\r\n\r\n     He controls himself.\r\n\r\n<b>                          SMILEY\r\n</b>                   (Beat)\r\n               I'll keep Peter Guillam. And\r\n               there's a retired special branch\r\n               man. Mendel. I'd like to have him.\r\n\r\n     Lacon exhales, his relief palpable.\r\n\r\n<b>                         LACON\r\n</b>               Yes, yes. Do your own housekeeping.\r\n               Good man.\r\n\r\n     He glances back at Guillam and Lacon's daughter, picking out\r\n     a melody on the grand piano.\r\n\r\n<b>                         LACON (CONT'D)\r\n</b>               Damn thing cost a fortune. Three\r\n               years of lessons and all I hear is\r\n               Edelweiss. You and Ann never had\r\n               children, did you?\r\n\r\n<b>                         SMILEY\r\n</b>               No, we never did.\r\n\r\n     We hear the piano playing on as we...\r\n\r\n\r\n<b>44   EXT. LONDON - MENDEL STREET - MORNING                        44\r\n</b>\r\n     ... driving through suburban DAGENHAM. We pull up in front\r\n     of a neat Tudor semi.\r\n\r\n\r\n<b>45   EXT. MENDEL'S GARDEN - DAY                                   45\r\n</b>\r\n<b>     CLOSE ON A COLONY OF BEES\r\n</b>\r\n     GLOVED HANDS loading a COLONY OF BEES into a new HIVE.\r\n\r\n     An APIARIST, in protective hat and gloves, turns to examine\r\n     the MAN who has appeared in his back yard - GEORGE SMILEY.\r\n     Smiley raises a hand.\r\n\r\n     The Apiarist steps away from the hive and removes his hat\r\n     to reveal a long thin face, keen eyes - INSPECTOR MENDEL.\r\n\r\n\r\n<b>46   EXT. MENDEL'S HOUSE - DAY                                    46\r\n</b>\r\n     Mendel, now in an overcoat and carrying a battered\r\n     briefcase, climbs into the back of the car with a nod to\r\n     Smiley and Guillam in the front. He begins to roll a\r\n     cigarette as Guillam drives away.\r\n<b>                                                                       18.\r\n</b>\r\n\r\n\r\n     A stow-away BEE appears from somewhere and begins to buzz\r\n     around the car. Guillam and Mendel swat at it clumsily.\r\n     Smiley stares ahead in silence. He winds down the window\r\n     and the bee flies to safety.\r\n\r\n\r\n<b>47   EXT. HOTEL ISLAY - DAY                                       47\r\n</b>\r\n     A shabby rooming house, near Paddington station.\r\n\r\n\r\n<b>48   INT. HOTEL ISLAY - SMILEY'S ROOM - DAY                       48\r\n</b>\r\n     A large, faded floral monstrosity of a room. TWO single\r\n     beds, a large leather CHAIR, a WIRELESS.\r\n\r\n     Smiley's new landlady MRS POPE GRAHAM is supervising a\r\n     gormless teenager - NORMAN - who is struggling into the\r\n     room with a rickety card table. Mendel and Guillam take it\r\n     from him and set it into the room. From the next room comes\r\n     the unmistakable sounds of someone having sex.\r\n\r\n<b>                         MRS POPE GRAHAM\r\n</b>                   (re the table)\r\n               It's Georgian, I shouldn't lend\r\n               it to you but since Mister Mendel\r\n               recommends you...\r\n\r\n     She gives the table a sentimental tap, raising her voice a\r\n     little to drown out the excesses from the room next door.\r\n\r\n<b>                         MRS POPE GRAHAM (CONT'D)\r\n</b>               You will love it for me won't\r\n               you? It belonged to Mister Pope-\r\n               Graham.\r\n\r\n     She glances at Smiley who has his back to her looking out\r\n     into the London street.\r\n\r\n\r\n<b>     SMILEY'S P.O.V.\r\n</b>\r\n     ... looking out at rooftops opposite and a travel agents\r\n     sign which reads THE WIDE WORLD.\r\n\r\n<b>                         MENDEL (O.S.)\r\n</b>               My friend just wants peace and\r\n               quiet in order to work, Mrs Pope-\r\n               Graham, no disturbances.\r\n\r\n<b>                         MRS POPE GRAHAM\r\n</b>               And that's what he shall have.\r\n               You want anything you can ask\r\n               Norman, can't he, Norman?\r\n\r\n     And they leave. A small silence...\r\n<b>                                                              19.\r\n</b>\r\n\r\n\r\n<b>                    MENDEL\r\n</b>          Her real name is plain Graham.\r\n          Added the Pope for a touch of\r\n          class.\r\n\r\nGuillam gives a grunt of amusement.\r\n\r\n<b>                    MENDEL (CONT'D)\r\n</b>          Best informant I ever had.\r\n\r\n<b>LATER:\r\n</b>\r\nSmiley has turned his attention to the bed. He examines the\r\nstained sheets with distaste. As he speaks he strips off\r\nthe soiled sheet and replaces it with a clean one from his\r\nbag.\r\n\r\n<b>                     SMILEY\r\n</b>          Control lived with his sister\r\n          didn't he?\r\n\r\nHe straightens up from the bed, smooths the pristine sheet.\r\n\r\nMendel flips his notebook back. He's already there.\r\n\r\n<b>                    MENDEL\r\n</b>          Basingstoke. Not much of a paper-\r\n          trail as you can imagine. His\r\n          pension and she owns a block of\r\n          bedsits in her own name in West\r\n          London.\r\n\r\n<b>                    GUILLAM\r\n</b>          We should...\r\n\r\nMendel flicks another page.\r\n\r\n<b>                    MENDEL\r\n</b>          ... Webb and Bryson are the\r\n          letting agents. Properties in\r\n          half of the west end judging by\r\n          this list...\r\n\r\n<b>LATER:\r\n</b>\r\nGuillam is lying on the bed. Smiley stands at the window,\r\nMendel slumped in an armchair.\r\n\r\n<b>                    SMILEY\r\n</b>          We're only looking for short term\r\n          rentals. Within the last year.\r\n\r\n<b>                    MENDEL\r\n</b>              (Reading from the list)\r\n          A Miss Hilliard. L. Cavaleri?\r\n          D Weaver, M Crowley, M Cushing. F.\r\n          Farling. G. Hiaasen.\r\n<b>                    (MORE)\r\n</b><b>                                                                      20.\r\n</b>\r\n<b>                         MENDEL (CONT'D)\r\n</b>               A Mrs Hawcombe. R. Kee. M. Kass. H\r\n               Staunton...\r\n\r\n     CLOSE on Smiley as his eyes flickers at the name.\r\n\r\n<b>                         MENDEL (CONT'D)\r\n</b>               K. Menzies...\r\n\r\n<b>                         SMILEY\r\n</b>               How long was H. Staunton a tenant?\r\n\r\n<b>                         MENDEL\r\n</b>                   (Consulting the list)\r\n               Still is. Been renting for a few\r\n               years now. Something?\r\n\r\n<b>                         SMILEY\r\n</b>                   (Musing)\r\n               Howard Staunton. Control used to\r\n               say he was England's greatest chess\r\n               master. Died in eighteen seventy-\r\n               four.\r\n\r\n\r\n<b>49   EXT. CONTROL'S FLAT - DAY                                   49\r\n</b>\r\n     Guillam and Smiley approach outside a red-brick mansion\r\n     block of flats in West London.\r\n\r\n\r\n<b>50   INT. CONTROL'S FLAT - HALLWAY - DAY                         50\r\n</b>\r\n     Smiley and Guillam reach a flat near the shadowy top of the\r\n     building. Smiley studies the door. He runs his fingers over\r\n     the door-frame and there it is - a little WEDGE at the top.\r\n\r\n\r\n<b>51   INT. CONTROL'S FLAT - DAY                                   51\r\n</b>\r\n     Guillam, followed by Smiley, pushes in against a mound of\r\n     dead mail.\r\n\r\n     They advance cautiously into the dirty flat, the windows\r\n     fogged out with Windowlene.\r\n\r\n\r\n<b>     THEIR P.O.V. - TRACKING TOWARDS THE DOOR\r\n</b>\r\n     Guillam has reached the DOOR and disappears into the room\r\n     beyond...\r\n\r\n\r\n<b>52   INT. CONTROL'S FLAT - DAY                                   52\r\n</b>\r\n     A green velvet armchair sits at the centre of a room.\r\n     Beside it an ashtray over-loaded with stubs.\r\n<b>                                                                       21.\r\n</b>\r\n\r\n\r\n     The rest of the room is mounded with PILES AND PILES OF\r\n     PAPERS - files, document boxes, maps and charts, something\r\n     insane in the sprawl of it all.\r\n\r\n     Guillam stands with his back to us staring at a CHESS SET\r\n     laid out before the chair, as if in mid-game. Four of the\r\n     chess pieces have had PHOTOGRAPHS of FACES added to them -\r\n<b>     ROY BLAND. TOBY ESTERHASE. PERCY ALLELINE. BILL HAYDON -\r\n</b>     all wearing paper PARTY HATS. The effect is ridiculous and\r\n     a little disturbing, like some Surrealist objet d'art.\r\n\r\n     Guillam hears Smiley and turns, almost guiltily, and as he\r\n     moves we see there is a FIFTH PHOTOGRAPH on a piece - and\r\n     it is of Smiley himself.\r\n\r\n     Smiley stares at his image.\r\n\r\n\r\n<b>53   INT. CIRCUS - TOBY ESTERHASE'S OFFICE - DAY                  53\r\n</b>\r\n     Toby Esterhase is on the telephone, speaking softly in\r\n     Hungarian. A look crosses his face. He suddenly notices\r\n     Haydon in the doorway, cup of tea in hand. Esterhase asks the\r\n     caller to hold and places the handset on the desk.\r\n\r\n<b>                         TOBY ESTERHASE\r\n</b>               Help you with something Bill?\r\n\r\n<b>                         BILL HAYDON\r\n</b>               Looking for his Majesty.\r\n\r\n<b>                         TOBY ESTERHASE\r\n</b>                   (sullenly)\r\n               He's walking the battlements.\r\n\r\n     Toby's eyes flicker toward the handset.\r\n\r\n<b>                         BILL HAYDON\r\n</b>                   (in Hungarian, subtitled)\r\n               Much obliged.\r\n\r\n     Bill leaves, and Toby resumes the call.\r\n\r\n\r\n<b>54   EXT. ROOF OF THE CIRCUS - DAY                                54\r\n</b>\r\n     Alleline stands on the rooftop, staring out over the London\r\n     skyline, his expression ambiguous - perhaps obscurely\r\n     troubled to have found himself at the top. He becomes aware\r\n     of Roy Bland standing behind him.\r\n\r\n<b>                            ALLELINE\r\n</b>                      (Without turning)\r\n               Roy.\r\n\r\n<b>                         BLAND\r\n</b>               It's the Yanks. They want to come\r\n               in and talk.\r\n<b>                                                                       22.\r\n</b>\r\n\r\n\r\n     Alleline continues to stare out over the world, but allows\r\n     himself a small smile of triumph - and relief.\r\n\r\n<b>                         ALLELINE\r\n</b>               Of course they do. We have\r\n               Witchcraft. And they don't.\r\n\r\n\r\n<b>55   INT. HOTEL ISLAY - SMILEY'S ROOM - DAY                       55\r\n</b>\r\n     Mendel and Guillam carry in boxes, each overflowing with\r\n     files and bundles of yellowing papers.\r\n\r\n<b>                         SMILEY\r\n</b>               Thank you. Anywhere will do.\r\n\r\n     They dump the files and Smiley turns to survey his room. In\r\n     his hand he is toying with a black chess piece labelled\r\n<b>     \"KARLA\".\r\n</b>\r\n     The far wall is now stacked to the ceiling with the\r\n     contents of Control's room - thousands of files and\r\n     documents, piled in no logical order. The three survey the\r\n     mountain of information in silence.\r\n\r\n<b>                         MENDEL\r\n</b>                   (Wryly)\r\n               That enough for you to be getting\r\n               on with?\r\n\r\n<b>                          SMILEY\r\n</b>                   (Beat)\r\n               No. Peter, I need you to do\r\n               something for me...\r\n\r\n\r\n<b>56   INT. CIRCUS - SCALPHUNTERS - DAY                             56\r\n</b>\r\n     The \"Scalphunters\" floor. Guillam is in his office, painted\r\n     out panels below the waist, glass above. He sits, hands on\r\n     the desk, steeling himself for what he has to do.\r\n\r\n     Abruptly he stands and walks out.\r\n\r\n     We TRACK with him as he walks through the Scalphunters\r\n     \"quad\" area - a worn out sofa, the old pool table.\r\n\r\n     One of the Scalphunters - KASPAR - stands flirting with a\r\n     pretty SECRETARY - BELINDA - the \"Deb\" we saw earlier.\r\n     Guillam acknowledges them casually as he passes. The girl\r\n     gives a little wave. She LIKES him.\r\n\r\n     Kaspar stares after Guillam. He doesn't.\r\n\r\n     We continue tracking with Guillam as he leaves the\r\n     Scalphunters area, walks down the corridor, turns left\r\n     into...\r\n<b>                                                                       23.\r\n</b>\r\n\r\n\r\n<b>57   INT. CIRCUS - MEN'S ROOM - DAY                               57\r\n</b>\r\n     He stands at the basins, checking the room is clear.\r\n     Examines his watch, then crosses to the door and opens it a\r\n     crack, peering out.\r\n\r\n<b>     GUILLAM'S P.O.V.\r\n</b>\r\n     We're looking though a glass panelled door at the PERSONNEL\r\n     OFFICE. A dapper little man in a club tie - FAWLEY - sits\r\n     behind his desk, idly tapping a desk toy - a Newton's\r\n     Cradle. He too checks his watch. Lunch time. Gets up and\r\n     walks out of his office.\r\n\r\n     Guillam counts to ten under his breath and then abruptly,\r\n     walks out of the men's room, across the corridor and\r\n     into...\r\n\r\n\r\n<b>58   INT. CIRCUS - FAWLEY'S OFFICE - DAY                          58\r\n</b>\r\n     The Cradle is still swinging - steel balls clacking softly.\r\n     Guillam is opening a safe, pulling out documents,\r\n     photographing them with a SUBMINIATURE CAMERA.\r\n\r\n     Close on the documents as Guillam silently photographs\r\n     them.\r\n\r\n<b>                         SMILEY (V.O.)\r\n</b>               I want to see the records of\r\n               staff recently retired. While\r\n               you're there get the handbook on\r\n               staff duties... and the diagram\r\n               of the Circus's reorganization\r\n               under Alleline...\r\n\r\n     Guillam hears a voice outside. He draws a SMALL KNIFE from\r\n     his pocket.\r\n\r\n\r\n<b>59   INT. CIRCUS - FAWLEY'S OFFICE - DAY                          59\r\n</b>\r\n     Kaspar opens the door and walks in, finding... the office\r\n     empty.\r\n\r\n     Then a faint noise. He works his way around the desk, finds\r\n     Guillam crouched down, his back to him.\r\n\r\n<b>                         KASPAR\r\n</b>                   (Suspicious)\r\n               Sorry Peter, didn't know you were\r\n               doing... whatever you were\r\n               doing...?\r\n\r\n     Guillam straightens up to reveal his hand oozing blood from\r\n     a cut.\r\n<b>                                                                      24.\r\n</b>\r\n\r\n\r\n<b>                         PETER GUILLAM\r\n</b>               Trying not to bleed to death.\r\n               Fawley's got a first aid kit in\r\n               one of his drawers. Get me a\r\n               plaster will you?\r\n\r\n     Kaspar busies himself with the first-aid. Eyes hard.\r\n\r\n\r\n<b>60   INT. CIRCUS - LIFTS - DAY                                   60\r\n</b>\r\n     Guillam has just stepped into the lift. Roy Bland appears\r\n     suddenly and steps in beside him.\r\n\r\n     Silence for a moment as they descend...\r\n\r\n<b>                         ROY BLAND\r\n</b>                   (without looking at him)\r\n               Heard you had an accident.\r\n\r\n     Guillam makes a mental note against Kaspar.\r\n\r\n<b>                         PETER GUILLAM\r\n</b>               Cut it on a drawer handle.\r\n               (Beat) When are we going to get\r\n               some new furniture round here?\r\n\r\n<b>                         ROY BLAND\r\n</b>               I'll have a word with Esterhase,\r\n               Peter. We'll make it a priority\r\n               on the top floor.\r\n\r\n     They arrive on the ground floor. Bland walks out ahead.\r\n     Guillam exhales with relief. Then...\r\n\r\n<b>                         ROY BLAND (CONT'D)\r\n</b>                   (as he walks away)\r\n               Where are you off to?\r\n\r\n<b>                         PETER GUILLAM\r\n</b>               Lunch.\r\n\r\n<b>                         ROY BLAND\r\n</b>               Want some company?\r\n\r\n\r\n<b>61   INT. PUB - DAY                                              61\r\n</b>\r\n     The two men sit drinking at a table in a nearly deserted\r\n     local bar.\r\n\r\n<b>                         ROY BLAND\r\n</b>               Tell you the truth, I'm in no\r\n               hurry to get back up there...\r\n\r\n<b>                         PETER GUILLAM\r\n</b>               Smothered by the Mothers.\r\n<b>                                                              25.\r\n</b>\r\n\r\n\r\n<b>                    ROY BLAND\r\n</b>          Something like that. Those old\r\n          birds, all pining for Control.\r\n          Percy still can't get a decent\r\n          cup of tea out of them. Still, I\r\n          imagine it takes time.\r\n\r\n<b>                       PETER GUILLAM\r\n</b>          What does?\r\n\r\n<b>                       ROY BLAND\r\n</b>          Loyalty.\r\n\r\nHe takes a pull of his pint.\r\n\r\n<b>                    ROY BLAND (CONT'D)\r\n</b>          If it was up to me, I'd replace\r\n          them all with those `naice' girls\r\n          from registry. Like to hear a few\r\n          high heels about the place.\r\n\r\nHe reaches suddenly for Guillam's coat, lying on the seat -\r\nhis hand heading for the pocket that holds the SUBMINIATURE\r\n<b>CAMERA.\r\n</b>\r\n<b>                    ROY BLAND (CONT'D)\r\n</b>          Scrounge a fag?\r\n\r\n<b>                    PETER GUILLAM\r\n</b>              (Quickly)\r\n          Here.\r\n\r\nHe pushes his cigarettes into Bland's hand before he can\r\nfish in the coat. Bland smokes for a moment.\r\n\r\n<b>                    ROY BLAND\r\n</b>              (Suddenly)\r\n          What do you think of Datsuns?\r\n\r\n<b>                       PETER GUILLAM\r\n</b>          What?\r\n\r\n<b>                    ROY BLAND\r\n</b>          Datsuns. Just got one. Wife made\r\n          me. Hatchback. Caught sight of\r\n          myself in it, driving past a shop\r\n          window and I thought to myself\r\n          \"Who's that old fucker?\"\r\n\r\nHe stares at Guillam with faint smile, but his eyes are\r\ncold and watchful.\r\n\r\n<b>                    ROY BLAND (CONT'D)\r\n</b>          What are you driving?\r\n\r\n<b>                       PETER GUILLAM\r\n</b>          Citroen.\r\n<b>                                                                        26.\r\n</b>\r\n\r\n\r\n<b>                          ROY BLAND\r\n</b>                French? Ooh la la...\r\n\r\n      He continues to stare at Guillam with the faint smile, and\r\n      Guillam feels a sickening wave of paranoia.\r\n\r\n<b>                           ROY BLAND (CONT'D)\r\n</b>                Drink up and I'll drop you back.\r\n                You've probably got some girl\r\n                waiting...\r\n\r\n\r\n<b>62    INT. GUILLAM'S FLAT - NIGHT                                  62\r\n</b>\r\n      Guillam sits alone at the table reading a newspaper. After\r\n      a moment, a man, his lover - RICHARD - a decade or so\r\n      older - walks behind him, stroking his hair tenderly, and\r\n      joins him at the table. Guillam automatically checks the\r\n      window - the flat opposite, a lit window - could someone\r\n      see them? He gets up and closes the curtains, settles back\r\n      at the table, passing Richard a section of the paper. The\r\n      two sit in domestic contentment, reading.\r\n\r\n\r\n<b>62A   EXT. HOTEL ISLAY - NIGHT                                    62A\r\n</b>\r\n<b>      SMILEY'S P.O.V. - LOOKING DOWN FROM A WINDOW\r\n</b>\r\n      A ministerial car pulls up and Lacon climbs out.\r\n\r\n\r\n<b>63    INT. HOTEL ISLAY - SMILEY'S ROOM - NIGHT                     63\r\n</b>\r\n      The music - a CHARLIE RICH track - plays on a TRANSISTOR\r\n      RADIO. Smiley sits at the window listening to the MUSIC.\r\n\r\n      Guillam dictates from a photograph of the documents he took\r\n      at the circus.\r\n\r\n      Smiley becomes aware that the others are watching him. He\r\n      turns away, tunes the radio into a DIFFERENT STATION,\r\n      cutting the Charlie Rich tune.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Jerry Westerby, dismissed\r\n                December 4th. And... Connie\r\n                Sachs, retired November 28th.\r\n                That's just two weeks after you\r\n                and Control were forced out.\r\n\r\n      Smiley considers this, turns back to the CHESS SET. He\r\n      writes Connie's name on a slip of paper, pastes it to a\r\n      chess piece.\r\n\r\n      There is a knock at the door. Mendel lets LACON into the\r\n      room excluding a very excited MRS. POPE GRAHAM. Lacon's\r\n      wearing a tux, looking extremely uncomfortable, almost\r\n      offended at the role he finds himself playing.\r\n<b>                                                             27.\r\n</b>\r\n\r\n\r\n<b>                    SMILEY\r\n</b>          I know that car.\r\n\r\n<b>                    LACON\r\n</b>          On our way to La Bohème. The\r\n          Minister wondered if there was\r\n          anything to report?\r\n\r\n<b>                    SMILEY\r\n</b>          Not much, I'm afraid. We were\r\n          just discussing the departure of\r\n          Connie Sachs. I wonder how\r\n          Research manages without her.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          Probably relieved. She always\r\n          struck me as unhinged.\r\n\r\n<b>                    SMILEY\r\n</b>          That was one of her talents.\r\n\r\nLACON looks around him, dripping disdain.\r\n\r\n<b>                    LACON\r\n</b>              (Indicating the chess\r\n               set)\r\n          Looking a little unhinged\r\n          yourself, George.\r\n\r\n<b>                       SMILEY\r\n</b>                 (Distracted)\r\n          Hmm?\r\n\r\nHe turns to him.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          Yes, I suppose I am. Perhaps\r\n          that's what we have to become? A\r\n          little paranoid?\r\n\r\nHe turns back to the chess board.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>              (To Lacon)\r\n          Your \"clean sweep.\"\r\n          What if the Mole was actually\r\n          behind that sweep? What if each\r\n          of us, whether we knew it or not,\r\n          represented a threat to the Mole?\r\n\r\nLacon looks at a pile of files, distractedly picks one up.\r\nHe starts to leaf through one...\r\n\r\n<b>                    LACON\r\n</b>              (Unconvinced)\r\n          Control lost his position because\r\n          of that fiasco in Budapest...\r\n          that poor chap...?\r\n<b>                                                                        28.\r\n</b>\r\n\r\n\r\n      He looks to Guillam for the name.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Jim Prideaux.\r\n\r\n      Smiley nods thoughtfully.\r\n\r\n<b>                          SMILEY\r\n</b>                Yes. Yes, he did.\r\n\r\n      He writes PRIDEAUX on a slip of paper, pastes it to a chess\r\n      piece. Lacon picks up another file, Something catches his\r\n      eye: a letter head of FLAMES. He looks up shocked.\r\n\r\n<b>                          LACON\r\n</b>                How did you get this? This is\r\n                Witchcraft material.\r\n\r\n      He grabs the piece of paper, stuffing it in his pocket.\r\n\r\n      Smiley looks at him. Lacon reads something implacable in\r\n      Smiley's gaze...\r\n\r\n      Smiley turns back to the chess set.\r\n\r\n<b>                          SMILEY\r\n</b>                Control was out. And Alleline was\r\n                in. Thanks to...\r\n\r\n      He writes the name \"WITCHCRAFT\" and places it on a chess\r\n      piece.\r\n\r\n\r\n<b>63A   EXT. HOTEL ISLAY - NIGHT                                    63A\r\n</b>\r\n      Lacon stalks out of the hotel.\r\n\r\n<b>                          SMILEY (V.O.)\r\n</b>                ... Alleline's \"special source.\"\r\n\r\n<b>                          LACON (V.O.)\r\n</b>                There is no connection.\r\n\r\n      He climbs into the waiting car. We catch a glimpse of the\r\n      MINISTER in the back.\r\n\r\n<b>                          SMILEY (V.O.)\r\n</b>                Everything is connected.\r\n\r\n      The car drives away.\r\n\r\n\r\n<b>64    INT. THURSGOOD SCHOOL - CLASSROOM - DAY                      64\r\n</b>\r\n      A third-rate English preparatory school. The string\r\n      orchestra practice - rows of twelve-year old boys sawing\r\n      away at their instruments. A teacher winces as he hacks at\r\n      the air above their heads with a ruler.\r\n<b>                                                                       29.\r\n</b>\r\n\r\n\r\n     Near the back of the class we find BILL ROACH. He's plump,\r\n     asthmatic, the last to be chosen for everything. He looks\r\n     out of the window.\r\n\r\n\r\n<b>65   EXT. THURSGOOD SCHOOL - DAY                                  65\r\n</b>\r\n     Roach stares out at us as the rain lashes against the\r\n     window pane. As we watch an old blue Alvis, towing a\r\n     battered, second hand CARAVAN, appears - reflected in the\r\n     window - driving past.\r\n\r\n     Roach watches, thrilled to realise he is the sole witness\r\n     of this MYSTERIOUS NEW ARRIVAL.\r\n\r\n\r\n<b>66   EXT. THURSGOOD SCHOOL - PRIDEAUX'S CARAVAN - DAY             66\r\n</b>\r\n     We're looking down into the dip, at the DRIVER of the blue\r\n     Alvis, setting up his caravan on bricks, in the gloom and\r\n     rain. He's wearing a waterproof cape and hood, obscuring\r\n     his face, giving him something of an air of mystery and\r\n     menace. There's something odd about the way he moves,\r\n     something about his back, as if it's been knocked out of\r\n     true...\r\n\r\n     The Driver rocks the caravan from side to side, loading\r\n     bricks underneath, trying to get the thing level.\r\n\r\n     He senses something and turns to find Roach behind him.\r\n     Roach instinctively takes a step back from the hooded\r\n     figure. Then, gathering his courage, he holds out his hand.\r\n\r\n     In his palm, a MARBLE.\r\n\r\n<b>     LATER:\r\n</b>\r\n     Roach stands in the caravan, watching the MARBLE as it\r\n     rolls backwards and forwards on the windowsill - an\r\n     improvised spirit level. THE MARBLE comes to rest at the\r\n     centre of the sill, a temporary equilibrium.\r\n\r\n     Roach turns excitedly to the camera, about to call to the\r\n     Driver, but sees something that stops him in his tracks...\r\n\r\n     The Driver has stopped, his back to us, breathing hard,\r\n     perhaps from the exercise or perhaps fighting down some\r\n     pain. The wind catches at his cape and it flutters to one\r\n     side, revealing the sweat-soaked shirt beneath. As we watch\r\n     a DARK STAIN appears at his shoulder blade and begins to\r\n     spread. It's BLOOD.\r\n\r\n\r\n<b>67   EXT. LONDON - OFF LICENSE - DAY                              67\r\n</b>\r\n     Through the window we see Smiley buying a bottle.\r\n<b>                                                                      30.\r\n</b>\r\n\r\n\r\n<b>68   INT. LONDON - PADDINGTON TRAIN STATION - DAY                68\r\n</b>\r\n     Smiley stands at a ticket kiosk.\r\n\r\n<b>                         SMILEY\r\n</b>               Return to Oxford please.\r\n\r\n\r\n<b>69   EXT. CONNIE'S HOUSE - DAY                                   69\r\n</b>\r\n     A large dilapidated Victorian house. We hear the faint\r\n     sound of voices and pop music coming from the garden.\r\n\r\n     Smiley pushes open the gate, walks down the path, past over-\r\n     grown shrubbery until he reaches the door with a bell marked\r\n<b>     \"SACHS.\"\r\n</b>\r\n     Glancing sideways he is caught, entranced, by the sight of a\r\n     young couple kissing in the window. They turn, suddenly aware\r\n     of his presence and Smiley, embarrassed, continues walking\r\n     round the house.\r\n\r\n\r\n<b>     SMILEY'S P.O.V.\r\n</b>\r\n     A group of students in togas are rehearsing a musical version\r\n     of Lysistrata. A young woman, holding her script, is miming\r\n     to the song `Don't' by Doris.\r\n\r\n     An older woman wearing rather too much make-up is carrying a\r\n     prop. This is CONNIE SACHS - former Queen of Intelligence at\r\n     the Circus. She examines Smiley for a moment, and then breaks\r\n     into a charming smile.\r\n\r\n\r\n<b>     ON SMILEY'S EXPRESSION\r\n</b>\r\n     This is not a social call. Connie can't keep the\r\n     disappointment from her face.\r\n\r\n\r\n<b>70   INT. CONNIE'S HOUSE - DRAWING ROOM - DAY                    70\r\n</b>\r\n     Smiley sits in the cluttered drawing room, a plate of scones\r\n     in front of him. Connie appears carrying a tray of tea.\r\n\r\n<b>                         SMILEY\r\n</b>                   (Of the tea)\r\n               Oh, I brought...\r\n\r\n     He takes the bottle of Scotch from his briefcase.\r\n\r\n<b>                         CONNIE SACHS\r\n</b>                   (eyeing it hungrily)\r\n               Not supposed to. Doctor's orders.\r\n\r\n     Smiley feigns surprise. Connie gives a little girl laugh.\r\n<b>                                                                       31.\r\n</b>\r\n\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               Wicked, wicked George.\r\n\r\n     She takes the teacup he pours with crooked arthritic\r\n     fingers and drinks. They sit, both staring at the students\r\n     in the garden, caught up in memories of their youth.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               I miss it all so much. All my\r\n               lovely boys.\r\n\r\n     Smiley hesitates.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               I don't know about you, George\r\n               but I feel seriously under-\r\n               fucked.\r\n\r\n     They look at each other a moment. Connie's smile fades.\r\n     She looks at him almost sorrowfully.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               She doesn't deserve you, George.\r\n               Not one hair on your head, never\r\n               did...\r\n\r\n\r\n<b>71   INT. CONNIE'S HOUSE - DAY                                    71\r\n</b>\r\n     Smiley and Connie sit in a dirty, disordered room, Connie\r\n     on her way to being drunk. As she finishes her glass Smiley\r\n     fills it.\r\n\r\n<b>                         SMILEY\r\n</b>               You left the Circus shortly after\r\n               I retired...\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               I didn't leave. I was dismissed.\r\n               Chucked out on the rubbish heap.\r\n               (Beat) Like you.\r\n\r\n<b>                            SMILEY\r\n</b>                      (Ignoring this)\r\n               Why?\r\n\r\n     She shrugs, petulant, takes a drink.\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               \"Lost my sense of proportion.\"\r\n               That's what that personnel cow\r\n               said. Wouldn't let go of a bone.\r\n\r\n<b>                         SMILEY\r\n</b>               Which bone?\r\n\r\n<b>                            CONNIE SACHS\r\n</b>               Polyakov.\r\n<b>                                                                     32.\r\n</b>\r\n\r\n\r\n     Smiley nods, a look of boredom settling on his face - A\r\n<b>     SURE SIGN OF INTEREST.\r\n</b>\r\n<b>                            SMILEY\r\n</b>               Polyakov.\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               Cultural Attaché Polyakov.\r\n\r\n<b>                         SMILEY\r\n</b>               Stationed where?\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               Here. London. Turned up in sixty\r\n               five. And I had a feeling, as\r\n               soon as I laid eyes on him. But\r\n               that little swine Toby Esterhase\r\n               told me I was seeing Spies under\r\n               the bed.\r\n\r\n<b>                         SMILEY\r\n</b>               Esterhase said that?\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               He had him graded Persil. Whiter\r\n               than white. And that was that.\r\n\r\n<b>                         SMILEY\r\n</b>               But you disagreed?\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               Pretty Polly? Very military\r\n               bearing for someone who's never\r\n               supposed to have been in the\r\n               army. But, he was good. Went to\r\n               Embassy functions, lectures. I\r\n               love a man who lives his cover.\r\n               Never put a foot wrong.\r\n\r\n<b>                            SMILEY\r\n</b>                   (Beat)\r\n               Never?\r\n\r\n     She can't help but smile.\r\n\r\n<b>                         CONNIE SACHS\r\n</b>                   (As if summoning him)\r\n               Pretty Polly. Pretty Polly...\r\n\r\n\r\n<b>72   INT. CIRCUS - RESEARCH - EVENING - PAST                    72\r\n</b>\r\n     Connie is working late. She sits in front of a Steenbeck\r\n     flatbed editing table, she's chain-smoking, unkempt, but\r\n     completely focused on the moving images on the screen.\r\n<b>                                                                33.\r\n</b>\r\n\r\n\r\n<b>                    CONNIE SACHS (V.O.)\r\n</b>          ... the busiest culture vulture\r\n          that Embassy ever had.\r\n\r\nOn the walls around her are framed STILLS from the footage\r\nshe is watching: Russian Officials at ceremonies - each\r\npicture gridded, each official labelled as Connie manages to\r\nidentify them.\r\n\r\n<b>                    CONNIE SACHS (CONT'D)\r\n</b>          For years we'd been hearing rumours\r\n          that Karla was building a private\r\n          army of his own, outside Moscow\r\n          Centre. We knew he had agents\r\n          scattered round the globe. I\r\n          started spending time with the\r\n          Moscow gazers combing Soviet\r\n          bulletins and any material I could\r\n          get.\r\n\r\nON SCREEN - Ancient SOVIET VETERANS stand in rows displaying\r\nthe medals on their chests.\r\n\r\n<b>                    CONNIE SACHS (V.O.) (CONT'D)\r\n</b>          Late one night in Research, I was\r\n          trawling through some footage of\r\n          May Day in Berlin, 1969. I saw\r\n          something, George.\r\n\r\nConnie slows the images down, concentrating... OFFICIALS in\r\nsuits are walking into their designated places. We see\r\nPOLYAKOV amongst them.\r\n\r\nOne of the old SOVIET VETERANS, in dress uniform, a chest\r\nfull of medals, possibly a touch senile, LOOKS at him. Just\r\nbefore he is obscured by another official we see what the old\r\nveteran does.\r\n\r\nHe salutes Polyakov.\r\n\r\nConnie's smile of triumph is reflected on the screen. She\r\nlights a cigarette.\r\n\r\n<b>                    CONNIE SACHS (V.O.) (CONT'D)\r\n</b>          I saw it, George.\r\n\r\nConnie rewinds the tape and we see the salute - backwards.\r\nAnd again - forwards.\r\n\r\n<b>                    CONNIE SACHS (V.O.) (CONT'D)\r\n</b>          Why would a distinguished soldier,\r\n          four medals for gallantry, salute\r\n          our cultural attache Polly? Unless\r\n          Polly was a war veteran himself?\r\n          And if he was, why hide the fact?\r\n\r\nFROM DOORWAY - Connie sits smoking her celebratory cigarette,\r\nat the centre of her obsession.\r\n<b>                                                                        34.\r\n</b>\r\n\r\n\r\n<b>72A   INT. CIRCUS - RESEARCH - EVENING                            72A\r\n</b>\r\n      Connie is showing the footage to Alleline and Esterhase.\r\n\r\n<b>                          SMILEY (V.O.)\r\n</b>                What did you do?\r\n\r\n<b>                          CONNIE SACHS (V.O.)\r\n</b>                I went straight to Esterhase and\r\n                Alleline. I said - \"Polyakov is a\r\n                Karla-trained Hood if ever I saw\r\n                one. And if he's here it's because\r\n                he's running a mole.\"\r\n\r\n<b>                          SMILEY (V.O.)\r\n</b>                What did they say?\r\n\r\n      Alleline switches off the image.\r\n\r\n<b>                           PERCY ALLELINE\r\n</b>                    (Hard)\r\n                You're to leave Polyakov alone.\r\n                You're becoming obsessed with him.\r\n\r\n      He glances at Esterhase and then back to Connie, eyes cold.\r\n\r\n<b>                          PERCY ALLELINE (CONT'D)\r\n</b>                You're losing your sense of\r\n                proportion, Connie. Perhaps it's\r\n                time you went out into the real\r\n                world.\r\n\r\n\r\n<b>73    OMITTED                                                     73\r\n</b>\r\n\r\n<b>74    OMITTED                                                     74\r\n</b>\r\n\r\n<b>75    INT. CONNIE'S HOUSE - DAY - PRESENT                         75\r\n</b>\r\n      Connie sits on her bed, with Smiley, drunk now, eyes wet.\r\n\r\n<b>                          CONNIE SACHS\r\n</b>                Hate the real world. (Beat) What\r\n                does it matter? Old Circus is\r\n                gone anyway, apart from Bill\r\n                Haydon. Better off out of it.\r\n                (Beat)I know you never liked him.\r\n\r\n<b>                          SMILEY\r\n</b>                    (Sharply)\r\n                What nonsense. What on earth\r\n                makes you say that?\r\n\r\n<b>                          CONNIE SACHS\r\n</b>                    (Surprised)\r\n                I don't know.\r\n<b>                                                                       35.\r\n</b>\r\n\r\n\r\n     She turns to the shoe box beside her, takes out a\r\n<b>     PHOTOGRAPH.\r\n</b>\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               Here we are. The Nursery in our\r\n               day.\r\n\r\n     She shows him the photograph - a young Connie in Wren\r\n     uniform, young men in cricket whites on a mown lawn. More\r\n     senior figures stand behind.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               There's Control himself, you\r\n               behind him, as usual...\r\n\r\n     A younger bespectacled Smiley, lost amongst his more\r\n     glamorous colleagues. She traces other faces with a crooked\r\n     finger.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>                   (Fondly)\r\n               Jim Prideaux... and Bill Haydon.\r\n               Together of course. The\r\n               Inseparables. All my boys. That\r\n               was a good time, George.\r\n\r\n<b>                         SMILEY\r\n</b>                   (Chiding)\r\n               It was the war, Connie.\r\n\r\n<b>                         CONNIE SACHS\r\n</b>               A real war. Englishmen could be\r\n               proud then.\r\n\r\n     She stares at the photograph with a sad smile.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               I was right, then? About\r\n               Polyakov. There's a mole?\r\n\r\n     Smiley doesn't answer, stands up to go.\r\n\r\n<b>                         CONNIE SACHS (CONT'D)\r\n</b>               If it's bad, don't come back. I\r\n               want to remember you all as you\r\n               were.\r\n\r\n\r\n<b>76   EXT. SAFE HOUSE - NIGHT                                      76\r\n</b>\r\n     The house we saw in the title sequence. The air duct opens\r\n     on the front of the house, spilling out its star-shape of\r\n     light.\r\n\r\n     After a moment Polyakov walks up to the door and knocks. We\r\n     hear the dog barking...\r\n<b>                                                                       36.\r\n</b>\r\n\r\n\r\n<b>77   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                       77\r\n</b>\r\n     Mrs McCraig opens the door for him and he passes her with a\r\n     smile, heading upstairs.\r\n\r\n     We TRACK with Mrs McCraig as she walks back to her pantry,\r\n     opens a cupboard to reveal a huge reel to reel TAPE\r\n     RECORDER. With ancient fingers she presses down the clunky\r\n     record button and the spools begin to revolve.\r\n\r\n<b>                         POLYAKOV (O.S.)\r\n</b>                   (In Russian)\r\n               ... The Priest is surprised to\r\n               see General Secretary\r\n               Krushchev...\r\n\r\n\r\n<b>78   INT. SAFE HOUSE - MEETING ROOM - NIGHT                       78\r\n</b>\r\n     As we saw it in the titles. The Mystery Man sits at the\r\n     table holding up pages of a document for Polyakov who is\r\n     photographing them as he talks, the camera giving a\r\n     satisfying CLICK and WHIR with each shot.\r\n\r\n<b>                         POLYAKOV\r\n</b>               ... He says \"Father, father, I've\r\n               just had sex with two 17 year old\r\n               girls.\" The Priest says \"That's\r\n               quite a sin, but you're an\r\n               Atheist, General Secretary...\"\r\n\r\n     HIGH ANGLE - the dusty candelabra above their heads, and\r\n     the tint MICROPHONE, nestled beside one of the bulbs.\r\n\r\n<b>                         POLYAKOV (CONT'D)\r\n</b>               \"... why are you telling me?\"\r\n\r\n\r\n<b>79   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                       79\r\n</b>\r\n     ... spools churning silently.\r\n\r\n<b>                         POLYAKOV (O.S.)\r\n</b>               ... Krushchev says \"I'm seventy-\r\n               seven, I'm telling everyone.\"\r\n\r\n     We hear his chuckle and the continued CLICK WHIR of the\r\n     camera.\r\n\r\n\r\n<b>80   INT. HOTEL ISLAY - SMILEY'S ROOM - NIGHT                     80\r\n</b>\r\n     Smiley sits at his desk staring at the CHESS SET laid out\r\n     before him. One of the pieces has had the photograph of\r\n     POLYAKOV added to it.\r\n<b>                                                                      37.\r\n</b>\r\n\r\n\r\n     He begins to register the faint noises around him...\r\n     Pigeons on the ledge outside the window, the television\r\n     mast creaking on the roof above him...\r\n\r\n     He hears footsteps approaching down the corridor and stop\r\n     outside his room. He crosses to the door and opens it and\r\n     finds CONTROL waiting for him.\r\n\r\n<b>                         CONTROL\r\n</b>               Step into my lair.\r\n\r\n     And in an instant we are in...\r\n\r\n\r\n<b>81   INT. CIRCUS - CONFERENCE ROOM - DAY - PAST                  81\r\n</b>\r\n     Control is at the HEAD OF THE TABLE. Ranged against him are\r\n     PERCY ALLELINE, ROY BLAND and TOBY ESTERHASE- all a little\r\n     nervous. BILL HAYDON sits to the side, feet up. Smiley\r\n     joins them without his spectacles. Control throws him a\r\n<b>     FILE.\r\n</b>\r\n<b>                         CONTROL\r\n</b>                   (To Smiley)\r\n               Sit down and take a look at this\r\n               nonsense.\r\n\r\n     Smiley sits down and begins to read.\r\n\r\n<b>                         CONTROL (CONT'D)\r\n</b>               Report by Soviet High Command on\r\n               their recent naval exercises in\r\n               the Black Sea. Just what the\r\n               Admiralty have been begging us\r\n               for some information on.\r\n\r\n<b>                         SMILEY\r\n</b>                   (Engrossed)\r\n               Where did you get it?\r\n\r\n<b>                         CONTROL\r\n</b>               I didn't. Percy and his little\r\n               cabal walked in with it.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                   (Protesting \"cabal\")\r\n               Control...\r\n\r\n<b>                         CONTROL\r\n</b>               Shut up, Esterhase.\r\n\r\n     Control waves him down. Smiley considers the report\r\n     dispassionately.\r\n\r\n<b>                         SMILEY\r\n</b>               If it's genuine it's gold-dust.\r\n               (Beat) But its topicality makes\r\n               it suspect.\r\n<b>                                                             38.\r\n</b>\r\n\r\n\r\nControl turns to Alleline, with a mocking smile.\r\n\r\n<b>                    CONTROL\r\n</b>          Smiley is suspicious, Percy.\r\n          Smells a fake.\r\n\r\n<b>                    SMILEY\r\n</b>          Where does it come from? What's\r\n          the access?\r\n\r\n<b>                    CONTROL\r\n</b>          Percy doesn't feel like telling.\r\n\r\nPercy packs his pipe, enjoys the moment - the young lion\r\nchallenging the old.\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          A new secret source of mine.\r\n\r\n<b>                    SMILEY\r\n</b>          But how could he possibly have\r\n          access to...?\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          He has access to the most\r\n          sensitive levels of policy\r\n          making.\r\n\r\nSmiley stares at him, staggered. If it's true, this is the\r\njackpot. Alleline enjoys his amazement, he leans over -\r\npoints with bureaucratic pride to the FLAMES on the LETTER\r\n<b>HEAD.\r\n</b>\r\n<b>                    PERCY ALLELINE (CONT'D)\r\n</b>          We have named the operation\r\n          \"Witchcraft.\"\r\n\r\n<b>                      SMILEY\r\n</b>                (Faintly)\r\n          We?\r\n\r\n<b>                    CONTROL\r\n</b>          Percy and his pals have bypassed\r\n          us, Smiley. Gone straight to the\r\n          Minister. Everyone's very\r\n          excited. Percy's to be allowed to\r\n          keep the identity of his new\r\n          friend top secret.\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          The Minister agrees with me that\r\n          too many secrets are blown around\r\n          here. Too much failure, too many\r\n          scandals, too little solid\r\n          intelligence!\r\n\r\nControl is still smiling but only now do we realise he is\r\nalmost shaking with fury.\r\n<b>                                                             39.\r\n</b>\r\n\r\n\r\n<b>                    CONTROL\r\n</b>          Luckily Percy's cabal has come to\r\n          save us.\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>              (Bulldozing on)\r\n          It's all office politics here.\r\n\r\n<b>                    ROY BLAND\r\n</b>          Percy does have a point, Control.\r\n          We should be fighting communism,\r\n          not each other.\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          Meanwhile we're losing our\r\n          reputation, our partners...\r\n\r\n<b>                    CONTROL\r\n</b>          Your bloody Yanks!\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>              (Shouting)\r\n          And we've had enough! There's\r\n          going to be changes, Smiley!\r\n          Changes.\r\n\r\nToby Esterhase finds his moment.\r\n\r\n<b>                    TOBY ESTERHASE\r\n</b>          We need to decide if we're part\r\n          of the past, or part of the\r\n          future.\r\n\r\n<b>                     CONTROL\r\n</b>              (Contemptuous)\r\n          I should have left you where I\r\n          found you.\r\n\r\n<b>                    ROY BLAND\r\n</b>          Control, if we could all just...\r\n\r\n<b>                    CONTROL\r\n</b><b>          OUT! ALL OF YOU!\r\n</b>\r\nAlleline, Bland and Esterhase leave. For a moment it looks\r\nas if Haydon will stay, but then he stands up, shaking his\r\nhead and saunters out.\r\n\r\n<b>                    SMILEY\r\n</b>              (Cautiously)\r\n          If Witchcraft is genuine...\r\n\r\nNow the others have left, Control seems to sag under the\r\nweight of some unnamed fear. He turns a haggard face to\r\nSmiley.\r\n\r\n<b>                    CONTROL\r\n</b>          I don't trust miracles.\r\n<b>                                                                       40.\r\n</b>\r\n\r\n\r\n     We hear a KNOCKING and find ourselves back in...\r\n\r\n\r\n<b>82   INT. HOTEL ISLAY - SMILEY'S ROOM - DAY - PRESENT             82\r\n</b>\r\n     Mendel holds two mugs of tea in one hand, gives the agreed\r\n     knock at Smiley's door again. After a moment a bleary\r\n     Smiley opens the door and lets him in.\r\n\r\n\r\n<b>83   INT. HOTEL ISLAY - SMILEY'S ROOM - DAY                       83\r\n</b>\r\n     Mendel passes him the tea, takes in the desk piled high\r\n     with papers.\r\n\r\n<b>                          MENDEL\r\n</b>                   (Of the tea)\r\n               Courtesy of Mrs P. You been up\r\n               all night?\r\n\r\n     Smiley sits down wearily, sips his tea.\r\n\r\n<b>                           SMILEY\r\n</b>               Yes.\r\n\r\n     Mendel notices one SLIP OF PAPER, sitting alone on the\r\n     opposite side of the desk.\r\n\r\n<b>                         MENDEL\r\n</b>               What's that?\r\n\r\n<b>                         SMILEY\r\n</b>               Request for a thousand pound's in\r\n               cash from the reptile fund.\r\n\r\n<b>                           MENDEL\r\n</b>               What for?\r\n\r\n<b>                         SMILEY\r\n</b>               For a Mister Ellis.\r\n\r\n<b>                         MENDEL\r\n</b>               Who's Ellis?\r\n\r\n     Smiley leans back, rubs his tired eyes.\r\n\r\n<b>                         SMILEY\r\n</b>               It was one of Jim Prideaux's work\r\n               names.\r\n\r\n<b>                         MENDEL\r\n</b>               What's so strange about that\r\n               then?\r\n\r\n<b>                         SMILEY\r\n</b>               The date. Prideaux was killed in\r\n               Hungary a year ago. October\r\n               twenty first. So why was\r\n<b>                         (MORE)\r\n</b><b>                                                                       41.\r\n</b>\r\n<b>                         SMILEY (CONT'D)\r\n</b>               someone giving him a thousand\r\n               pounds two months later?\r\n\r\n     He takes another sip of tea, gazes at Mendel thoughtfully.\r\n\r\n\r\n<b>84   EXT. THURSGOOD SCHOOL - PLAYING FIELDS - DAY                 84\r\n</b>\r\n     Prideaux is running around the track, pounding along with his\r\n     odd, loping stride. A group of BOYS watch him pass. One -\r\n     SPIKELEY - mimics the run to the amusement of the others.\r\n\r\n\r\n<b>85   INT. THURSGOOD SCHOOL - CLASSROOM - DAY                      85\r\n</b>\r\n     A fire burns in the little grate.\r\n\r\n     ROACH sits near the back of the class. The BOY behind slaps\r\n     the back of his neck with a ruler. Roach flinches but\r\n     doesn't say anything. The Boy does it again.\r\n\r\n     Prideaux drops a pile of books onto the desk of a boy -\r\n<b>     SPIKELY.\r\n</b>\r\n<b>                         PRIDEAUX\r\n</b>               Hand those out.\r\n\r\n     He crosses to the board begins to write on it - JE\r\n<b>     M'APPELLE MONSIEUR ELL...\r\n</b>\r\n     Behind him Spikely hands out the books, continuing to walk\r\n     like a HUNCHBACK.\r\n\r\n     The class snigger. Prideaux hears but doesn't turn,\r\n     continues writing.\r\n\r\n     Then from the CHIMNEY comes an unnerving SCRABBLING sound.\r\n     A little soot falls...\r\n\r\n     The sniggering fades out as all eyes turn nervously to the\r\n     fire... what is that noise?\r\n\r\n     Then, with a terrifying SCREECH, an OWL drops down into the\r\n     grate, thrashes in the flames before flapping out into the\r\n     class, its wings now ON FIRE, shrieking hideously, headed\r\n     straight for Spikely who stands frozen in shock as the bird\r\n     swoops towards his face.\r\n\r\n     Then...\r\n\r\n     ... somehow, Prideaux is THERE and grabs the burning bird\r\n     from the air and in a second has it folded in on itself,\r\n     NECK SNAPPED, and strides out of the room with it.\r\n\r\n     The boys stare after their new teacher in SHOCKED SILENCE.\r\n<b>                                                                       42.\r\n</b>\r\n\r\n\r\n<b>86   EXT. THURSGOOD SCHOOL - PRIDEAUX'S CARAVAN - DAY             86\r\n</b>\r\n     Roach is hiding, spying down on the caravan below, where\r\n     Prideaux sits in the doorway, massaging his raised\r\n     shoulder, and drinking something from a green beaker.\r\n\r\n<b>                         PRIDEAUX\r\n</b>                   (After a moment)\r\n               Come down here.\r\n\r\n     Frightened, Roach obeys, sliding down the dip to him.\r\n     Prideaux examines him fiercely. Finally his face relaxes a\r\n     little.\r\n\r\n<b>                         PRIDEAUX (CONT'D)\r\n</b>                   (Identifying him)\r\n               Boy with the marble.\r\n\r\n<b>                          ROACH\r\n</b>               Yes sir.\r\n\r\n<b>                         PRIDEAUX\r\n</b>               Gave me a turn up there, parked\r\n               on the horizon. Thought you were\r\n               a Juju man. What's your name?\r\n\r\n<b>                         BILL ROACH\r\n</b>               Sir, Roach, sir. Bill. I'm a new\r\n               boy.\r\n\r\n<b>                         PRIDEAUX\r\n</b>               New arrival, eh? Middle of year?\r\n               What's the story?\r\n\r\n     Roach hesitates.\r\n\r\n<b>                         BILL ROACH\r\n</b>                   (Blushing)\r\n               My mother and father... my\r\n               father's left, so...\r\n\r\n     He doesn't know how to explain his misery any further.\r\n     Prideaux pretends not to notice.\r\n\r\n<b>                         PRIDEAUX\r\n</b>               Bill? The unpaid Bill. Anyone\r\n               ever call you that?\r\n\r\n<b>                          BILL ROACH\r\n</b>               No sir.\r\n\r\n<b>                         PRIDEAUX\r\n</b>               Known a lot of Bills. They've all\r\n               been good `uns. What you good at?\r\n\r\n     Roach tries desperately to think of something.\r\n<b>                                                                       43.\r\n</b>\r\n\r\n\r\n<b>                         BILL ROACH\r\n</b>               Nothing sir.\r\n\r\n     The boy's eyes start to MIST UP. Prideaux looks down,\r\n     busies himself with brushing at something on his shirt.\r\n\r\n<b>                         PRIDEAUX\r\n</b>               You're a good watcher though eh?\r\n               Us loners always are. No one else\r\n               spotted me when I turned up here.\r\n               Best watcher in the unit,\r\n               Bill Roach is, I'll bet. Long as\r\n               he's got his specs on. Right?\r\n\r\n<b>                         BILL ROACH\r\n</b>                   (Gratefully)\r\n               Yes sir.\r\n\r\n     Prideaux finishes his drink, nods to Roach.\r\n\r\n<b>                         PRIDEAUX\r\n</b>               Free period, isn't it? Don't\r\n               waste it down here.\r\n\r\n     Roach sets off up the dip. He looks back and sees Prideaux\r\n     has walked into the caravan and stands with his back to\r\n     him, rubbing his aching shoulder.\r\n\r\n\r\n<b>87   EXT. SMILEY'S HOUSE - DAY                                    87\r\n</b>\r\n     Smiley walks up to the steps of his home, stops, examining\r\n     the door, his absent-minded air hardening into something\r\n     more ALERT. He scans the step and stoops to pick something\r\n     up. A WEDGE.\r\n\r\n\r\n<b>88   INT. SMILEY'S HOUSE - DAY                                    88\r\n</b>\r\n     Smiley walks into the hallway senses alert. He pads towards\r\n     the drawing room, wipes sweat from his hands on his\r\n     trousers, steels himself. Is it finally Them, come for him?\r\n     He walks in and finds...\r\n\r\n\r\n<b>89   INT. SMILEY'S HOUSE - DAY                                    89\r\n</b>\r\n     RICKI TARR sits smoking in the darkness, the knife on his\r\n     lap.\r\n\r\n<b>                         RICKI TARR\r\n</b>               Hello Mister Smiley. You remember\r\n               me.\r\n\r\n<b>                         SMILEY\r\n</b>               Hello, Ricki.\r\n\r\n     He tosses the wedge onto the table.\r\n<b>                                                             44.\r\n</b>\r\n\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          You missed a wedge.\r\n\r\n<b>                    RICKI TARR\r\n</b>          Losing my touch.\r\n\r\nSmiley watches him closely, very aware of the knife. Tarr\r\nrubs his beard.\r\n\r\n<b>                    RICKI TARR (CONT'D)\r\n</b>          I know what I must look like. Rip\r\n          Van Winkle. Feel like him. I\r\n          could sleep for a year. Two\r\n          years.\r\n\r\n<b>                    SMILEY\r\n</b>          Where've you been, Ricki?\r\n\r\n<b>                    RICKI TARR\r\n</b>          Here, there. Run out of places\r\n          now. They're gonna kill me.\r\n\r\n<b>                    SMILEY\r\n</b>          Who is?\r\n\r\n<b>                    RICKI TARR\r\n</b>          Your lot. Or their lot. Whoever\r\n          gets me first. I'm innocent, by\r\n          the way. Within reason. (Beat)\r\n          You going to find him then? The\r\n          Mole?\r\n\r\nSmiley crosses to another chair. As he does so he's\r\nscanning the room - automatically noting the changes - the\r\nremains of a meal on a table...\r\n\r\n<b>                    SMILEY\r\n</b>          I'm going to try. How long have\r\n          you been here?\r\n\r\n<b>                    RICKI TARR\r\n</b>          Few days. Needed somewhere to\r\n          hide.\r\n\r\nSmiley notices the pile of letters for his wife Ann -\r\nthey've been disturbed.\r\n\r\n<b>                    RICKI TARR (CONT'D)\r\n</b>              (Following his gaze)\r\n          Old habits.\r\n\r\nSmiley fights down his anger.\r\n\r\n<b>                    SMILEY\r\n</b>          I wouldn't use my home as a safe\r\n          house. There's every chance\r\n          they're watching it.\r\n<b>                                                                        45.\r\n</b>\r\n\r\n\r\n<b>                          RICKI TARR\r\n</b>                Calculated risk Mister Smiley. I\r\n                wanted to see you, figured you'd\r\n                turn up here sooner or later.\r\n\r\n<b>                          SMILEY\r\n</b>                What do you want Ricki?\r\n\r\n<b>                          RICKI TARR\r\n</b>                There's a woman. I want you to\r\n                trade for her. Get her back from\r\n                Karla.\r\n\r\n<b>                          SMILEY\r\n</b>                What woman?\r\n\r\n      Tarr finishes his cigarette, lights another.\r\n\r\n<b>                          RICKI TARR\r\n</b>                Her name's Irina.\r\n\r\n\r\n<b>90    EXT. ISTANBUL - AIRPORT - DAY - PAST                         90\r\n</b>\r\n      Ricki Tarr emerges blinking into the white sunshine.\r\n      Groomed, smart, that same restless energy. A car pulls up\r\n      across the road TUFTY THESINGER - a boiled-looking British\r\n      spy, not over-bright, signals to him. Tarr pulls his shades\r\n      down and saunters over to his ride.\r\n\r\n<b>                          RICKI TARR (O.S.)\r\n</b>                I met her in Istanbul. They'd\r\n                found some Russian trade\r\n                delegate, name of Boris. He was\r\n                spending high and wide in the\r\n                nightclubs and some idiot thought\r\n                we could turn him.\r\n\r\n      Tarr opens the back seat and gets in. Tufty's slightly\r\n      foolish smile slips a little.\r\n\r\n\r\n<b>90A   INT. ISTANBUL - TARR'S APARTMENT - ENTRANCE LOBBY - DAY    90A\r\n</b>\r\n      Tarr enters, followed by Tufty carrying one of his bags.\r\n\r\n\r\n<b>91    INT. ISTANBUL - TARR'S APARTMENT - NIGHT                     91\r\n</b>\r\n      Nineteenth century European grandeur. But the apartment\r\n      we're in is deserted and in a state of disrepair. Tarr\r\n      stands at tripod mounted BINOCULARS set back from the\r\n      window, idly playing with a knife with a distinctive white\r\n      BONE handle.\r\n<b>                                                                       46.\r\n</b>\r\n\r\n\r\n<b>92   EXT. ISTANBUL - IRINA'S HOTEL - NIGHT                        92\r\n</b>\r\n     TARR'S P.O.V. - the HOTEL opposite - a Brutalist concrete\r\n     slab, the rooms have floor to ceiling windows. In the\r\n     bedroom a heavy set man - BORIS - is having sex with a\r\n<b>     MAID.\r\n</b>\r\n<b>                         RICKI TARR (V.O.)\r\n</b>               I took one look and saw that he\r\n               was a hood, Moscow trained.\r\n\r\n     We TRACK to one side, and see the \"drawing room\" of the\r\n     hotel suite, where Boris' two MINDERS, SERGEI and IVAN,\r\n     wait, smirking at the sounds coming from the bedroom.\r\n\r\n<b>                         RICKI TARR (V.O.) (CONT'D)\r\n</b>               Probably coat trailing, trying to\r\n               draw one of our men out into the\r\n               open.\r\n\r\n     We TRACK further along again and see the CORRIDOR outside\r\n     the hotel room, where a YOUNG WOMAN has just arrived. This\r\n     is IRINA.\r\n\r\n<b>                         RICKI TARR (V.O.) (CONT'D)\r\n</b>               He had a wife with him. Common-\r\n               law.\r\n\r\n     Irina opens the door and walks into the drawing room, where\r\n     the Minders stare fixedly at the floor, trying not to\r\n     laugh. She walks on past and into the bedroom. The Maid\r\n     jumps out of the bed, grabs her clothes and flees. Boris\r\n     lies, unconcerned, reaches for his cigarettes.\r\n\r\n     Irina walks past him and we track with her as she enters a\r\n     BATHROOM. The glass window here is two-thirds frosted and\r\n     we lose her as she bends over a basin.\r\n\r\n     Something about her has caught Tarr's attention and he\r\n     leaves the binoculars, walking closer to the window.\r\n\r\n     Suddenly IRINA straightens up, her head above the frosted\r\n     glass and stares straight at us...\r\n\r\n\r\n<b>93   EXT. ISTANBUL - TARR'S APARTMENT - NIGHT                     93\r\n</b>\r\n<b>     HER P.O.V. -\r\n</b>\r\n     RICKI TARR standing at the window opposite, knowing he\r\n     should turn away, but somehow snagged by that look.\r\n\r\n     A moment between the two. Then a car sweeps past on the\r\n     road below and there's a flash of light behind Ricki's head\r\n     - the headlights reflected in the lenses of the now visible\r\n     BINOCULARS. Irina absorbs this. Above everything else,\r\n     anger at her humiliation being observed.\r\n<b>                                                                        47.\r\n</b>\r\n\r\n\r\n<b>94    EXT. ISTANBUL - IRINA'S HOTEL - NIGHT                        94\r\n</b>\r\n<b>      RICKI TARR'S P.O.V.\r\n</b>\r\n      As Irina walks back out of the bathroom, picks up a vase\r\n      and hurls it at Boris, just missing him. He stubs out his\r\n      cigarette and calmly climbs out of the bed. As we watch he\r\n      draws the curtains along the length of the room, obscuring\r\n      our view. Seconds later the curtains billow as Irina is\r\n      thrown against them. We watch as her shape is rolled along\r\n      the window by the force of Boris' blows. Finally the\r\n      billowing fabric settles. Moments later Boris opens the\r\n      curtains again and starts to dress. Irina lies on the bed.\r\n\r\n\r\n<b>94A   EXT. ISTANBUL - IRINA'S HOTEL - NIGHT                      94A\r\n</b>\r\n<b>      RICKI'S P.O.V.\r\n</b>\r\n      Ricki watches the street below as Boris, Sergei and Ivan\r\n      exit the hotel, head for a night out.\r\n\r\n      Tarr pulls on his own jacket, grabs his knife.\r\n\r\n\r\n<b>95    OMITTED                                                      95\r\n</b>\r\n\r\n<b>96    EXT. ISTANBUL - NIGHT                                        96\r\n</b>\r\n      IRINA'S P.O.V. - Her husband and the Minders are heading\r\n      for a row of gaudy nightclubs. And someway behind him,\r\n      Ricki Tarr, trailing.\r\n\r\n      She exhales a breath on the glass.\r\n\r\n\r\n<b>96A   EXT. ISTANBUL - NIGHT CLUB - NIGHT                         96A\r\n</b>\r\n      Tarr approaches the night club, glancing around quickly\r\n      before slipping inside.\r\n\r\n\r\n<b>97    INT. ISTANBUL - NIGHT CLUB - NIGHT                           97\r\n</b>\r\n      Ricki Tarr enters. He scans the room for Boris, spotting\r\n      Tufty Thesinger at a table. He crosses towards him,\r\n      watching as Boris and the two minders are entertained by\r\n      the clubs hostesses.\r\n\r\n      Boris calls for more drinks, clutching a bundle of\r\n      currency.\r\n\r\n<b>                          TUFTY THESINGER\r\n</b>                    (grinning)\r\n                This is going to be a long night.\r\n<b>                                                                        48.\r\n</b>\r\n\r\n\r\n<b>                          RICKI TARR\r\n</b>                You baby-sit this one.\r\n\r\n      Ricki walks towards us.\r\n\r\n\r\n<b>98    INT. ISTANBUL - IRINA'S HOTEL - NIGHT                        98\r\n</b>\r\n      Irina answers the door and finds Ricki Tarr outside.\r\n\r\n<b>                          RICKI TARR\r\n</b>                Your bloke's a bit of a bastard.\r\n                (Beat) Just wanted to check you\r\n                were alright.\r\n\r\n      She stares at him.\r\n\r\n<b>                          RICKI TARR (V.O.) (CONT'D)\r\n</b>                There was something about her.\r\n\r\n\r\n<b>99    OMITTED                                                      99\r\n</b>\r\n\r\n<b>100   INT. SMILEY'S HOUSE - DAY - PRESENT                         100\r\n</b>\r\n      Tarr exhales smoke. Smiley studies him.\r\n\r\n<b>                          SMILEY\r\n</b>                You were due to fly home the next\r\n                day. What did you tell London?\r\n\r\n<b>                          RICKI TARR\r\n</b>                Nothing. Didn't have anything to\r\n                tell yet. But... I could sense it\r\n                in her.\r\n\r\n<b>                          SMILEY\r\n</b>                Sense what?\r\n\r\n<b>                            RICKI TARR\r\n</b>                A secret.\r\n\r\n\r\n<b>101   INT. ISTANBUL - GARAGE - DAY - PAST                         101\r\n</b>\r\n      Ricki Tarr is talking to a man. A sports car lies under a\r\n      sheet. The deal concluded, the man pulls back the sheet to\r\n      reveal the car.\r\n\r\n\r\n<b>102   EXT. ISTANBUL - DOCKS - DAY                                 102\r\n</b>\r\n      Irina is driving, exhilarated, free. Ricki Tarr is on the\r\n      back seat, sleeping.\r\n<b>                                                                         49.\r\n</b>\r\n\r\n\r\n<b>103    INT. ISTANBUL - WORKERS CANTEEN - DAY                       103\r\n</b>\r\n       A workers canteen on the Bosphorus. Tarr and Irina sit\r\n       drinking wine, talking.\r\n\r\n<b>                           RICKI TARR (V.O.)\r\n</b>                 I played the businessman, Michael\r\n                 Trench. A Holiday Romance. Thought\r\n                 I'd take my time with it...\r\n\r\n       Tarr gently traces a bruise on Irina's arm.\r\n\r\n<b>                           RICKI TARR (V.O.) (CONT'D)\r\n</b>                 But second date she made this open\r\n                 play...\r\n\r\n       We see a growing attraction between them.\r\n\r\n       Irina and Tarr laughing, flirting. They move closer to one\r\n       another.\r\n\r\n       Tarr feels he is the master of this situation.\r\n\r\n       Suddenly Irina withdraws. She stares at him.\r\n\r\n<b>                           IRINA\r\n</b>                 I know what you are.\r\n\r\n       A long beat. Tarr waits her out.\r\n\r\n<b>                           IRINA (CONT'D)\r\n</b>                 I would like to talk to your boss\r\n                 Control. I have something to trade.\r\n                 Something big. I want a new life in\r\n                 the West.\r\n\r\n       Tarr desperately tries to stay looking calm.\r\n\r\n<b>                           IRINA (CONT'D)\r\n</b>                 That is the deal. You tell them.\r\n\r\n\r\n<b>103A   INT. SMILEY'S HOUSE - EVENING - PRESENT                  103A\r\n</b>\r\n       Smiley sits with his hooded, bored look, examining everything\r\n       carefully.\r\n\r\n<b>                           SMILEY\r\n</b>                 What made you so sure she wasn't\r\n                 coat-trailing?\r\n\r\n<b>                           RICKI TARR\r\n</b>                 We've all got our strengths. And\r\n                 weaknesses.\r\n\r\n       He flicks a look at the pile of Ann's letter, an insolent\r\n       smile.\r\n<b>                                                                      50.\r\n</b>\r\n\r\n\r\n<b>                          RICKI TARR (CONT'D)\r\n</b>                Me, I know women. She said she had\r\n                a secret. The mother of all\r\n                secrets. Said she'd only tell\r\n                Control. She wanted to trade. New\r\n                life for her and her kids.\r\n\r\n<b>                          SMILEY\r\n</b>                She had children in Russia?\r\n\r\n<b>                          RICKI TARR\r\n</b>                That's why they let her and Boris\r\n                out. So, I said I'd tell the\r\n                Circus.\r\n\r\n<b>                           SMILEY\r\n</b>                    (Beat)\r\n                But you didn't?\r\n\r\n      Tarr's smile fades.\r\n\r\n\r\n<b>104   OMITTED                                                   104\r\n</b>\r\n\r\n<b>105   INT. ISTANBUL - TARR'S APARTMENT - DAY - PAST             105\r\n</b>\r\n      Irina prowls the room.\r\n\r\n<b>                          RICKI TARR (V.O.)\r\n</b>                Wanted to find out more first. So,\r\n                I waited her out.\r\n\r\n      Tarr lounges by a window, smoking.\r\n\r\n<b>                          RICKI TARR (CONT'D)\r\n</b>                    (Shrugging)\r\n                You can't expect them to jump at\r\n                every offer of service.(Beat.\r\n                Carefully) If they had more\r\n                information...\r\n\r\n      Irina doesn't answer, paces. Tarr lets his face harden.\r\n\r\n<b>                          RICKI TARR (CONT'D)\r\n</b>                Well, if you won't tell me more,\r\n                there's nothing I can do.\r\n\r\n      She stares at him.\r\n\r\n<b>                          IRINA\r\n</b>                If I tell you, I'm putting my\r\n                life in your hands. The lives of\r\n                my children? Do you understand?\r\n\r\n      She walks slowly towards him, bends over, begins to whisper\r\n      in his ear.\r\n<b>                                                                        51.\r\n</b>\r\n\r\n\r\n<b>106   INT. ISTANBUL - TARR'S APARTMENT - NIGHT                    106\r\n</b>\r\n      The two make love, passionate, Irina trying to bind him to\r\n      her. Tarr responds, excited by her, now that she needs him.\r\n      We intercut their intense love-making with...\r\n\r\n\r\n<b>107   INT. ISTANBUL - NIGHT CLUB - NIGHT                          107\r\n</b>\r\n      A drunk Boris groping a very young hostess on a dance\r\n      floor, his shirt undone. He starts to strip the girl of her\r\n      uniform, amused by her efforts to keep her clothes on. The\r\n      two minders clap in time to the music, encouraging him.\r\n      Boris grabs the girl by the hair, biting her neck,\r\n      laughing, eyes glazed with drink, barely able to stand...\r\n      The inane music blares on...\r\n\r\n\r\n<b>108   INT. ISTANBUL - TARR'S APARTMENT - NIGHT                    108\r\n</b>\r\n      Silence. Tarr and Irina stare at each other. A long beat.\r\n\r\n<b>                          IRINA\r\n</b>                    (tenderly)\r\n                Promise me you'll be careful. No\r\n                details to the Circus. Not until\r\n                we're safe.\r\n\r\n<b>                           RICKI TARR\r\n</b>                    (genuine)\r\n                I promise.\r\n\r\n\r\n<b>109   EXT. ISTANBUL - DAY                                         109\r\n</b>\r\n      Tarr threads his way through the crowds of evening shoppers\r\n      and tourists, holding in his head the BIGGEST SECRET of his\r\n      career. There's something new on his face - AMBITION.\r\n\r\n\r\n<b>110   EXT. ISTANBUL - IMPORT/EXPORT OFFICE - EVENING              110\r\n</b>\r\n      We're gliding above the respectable front of a Business\r\n      OFFICE, through the RECEPTION - which maintains the cover\r\n      story of an Import/Export outfit...\r\n\r\n      ...over a back-room and through a STEEL DOOR to the CYPHER\r\n      ROOM beyond where we find a drunk TUFTY THESINGER watching\r\n      Tarr send a CODED MESSAGE.\r\n\r\n<b>                          TUFTY THESINGER\r\n</b>                You were supposed to have gone.\r\n                London stations's been on to me.\r\n                They want to know what the hell\r\n                you're doing.\r\n<b>                                                                      52.\r\n</b>\r\n\r\n\r\n<b>                          RICKI TARR\r\n</b>                    (without turning)\r\n                Fuck off.\r\n\r\n\r\n<b>111   INT. SMILEY'S HOUSE - NIGHT - PRESENT                     111\r\n</b>\r\n      Smiley takes off his glasses and wipes them.\r\n\r\n<b>                          SMILEY\r\n</b>                And what did your message say,\r\n                Ricki?\r\n\r\n<b>                          RICKI TARR\r\n</b>                Just that I had a Moscow Centre\r\n                trained hood wanting to defect.\r\n\r\n<b>                             SMILEY\r\n</b>                What else?\r\n\r\n      Tarr looks at him. For the first time there's something\r\n      else behind his smile.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                I understand how you felt. You\r\n                wanted to do something.\r\n\r\n<b>                          RICKI TARR\r\n</b>                I know what I am to the Circus.\r\n                One of the scalp-hunters. Someone\r\n                to give the dirty jobs to. I\r\n                wanted to bring this one in\r\n                myself.\r\n\r\n<b>                          SMILEY\r\n</b>                Yes. I quite see that.\r\n\r\n<b>                          RICKI TARR\r\n</b>                I said that she claimed to have\r\n                information crucial to the well-\r\n                being of the Circus.\r\n\r\n<b>                          SMILEY (O.S)\r\n</b>                And what else?\r\n\r\n<b>                          RICKI TARR\r\n</b>                That she had information\r\n                concerning a Double Agent.\r\n\r\n      He colours.\r\n\r\n<b>                          RICKI TARR (CONT'D)\r\n</b>                I was just trying to... to get\r\n                the proper attention. (Beat) And\r\n                I told them to tell Mister\r\n                Guillam that this was the reason\r\n                I hadn't come home, not because\r\n                I'd defected or anything.\r\n<b>                                                                        53.\r\n</b>\r\n\r\n\r\n<b>                          SMILEY\r\n</b>                What happened next Ricki?\r\n\r\n<b>                          RICKI TARR\r\n</b>                I waited for a reply.\r\n\r\n\r\n<b>112   INT. ISTANBUL - IMPORT/EXPORT OFFICE - NIGHT - PAST         112\r\n</b>\r\n      A tense Tarr sits waiting for a reply. It's dark outside.\r\n      Thesinger is asleep at his desk. The TICKER MACHINE begins\r\n      to rattle into life. Tarr jumps to it.\r\n\r\n      Tarr begins to decode the in-coming message on a one-time\r\n      pad.\r\n\r\n      INSERT - \"We read you\"\r\n\r\n<b>                          RICKI TARR (V.O.)\r\n</b>                I waited hours but that was all\r\n                they sent. It didn't make sense.\r\n                Like they were stalling.\r\n\r\n\r\n<b>113   EXT. ISTANBUL - TARR'S APARTMENT - NIGHT                    113\r\n</b>\r\n      Tarr stands staring across at Irina's hotel balcony with\r\n      binoculars.\r\n\r\n\r\n<b>114   EXT. ISTANBUL - IRINA'S HOTEL - NIGHT                       114\r\n</b>\r\n      BORIS stands looking straight at him. The hint of a mocking\r\n      smile. Behind him we can just see SERGEI and IVAN sitting\r\n      in the room.\r\n\r\n\r\n<b>115   INT. ISTANBUL - IRINA'S HOTEL - NIGHT                       115\r\n</b>\r\n      Boris turns from the balcony, exhaling smoke from a\r\n      cigarette, the faint smile still on his lips. He looks up,\r\n      his expression CHANGING.\r\n\r\n\r\n<b>116   EXT. ISTANBUL - ALLEYWAY - DAWN                             116\r\n</b>\r\n      Tarr bolts down an alleyway.\r\n\r\n\r\n<b>117   INT. ISTANBUL - IMPORT/EXPORT OFFICE - DAY                  117\r\n</b>\r\n      The door is ajar... a radio is playing LOUD POP MUSIC. Tarr\r\n      pauses on the threshold, senses alert. He takes out his\r\n<b>      KNIFE.\r\n</b><b>                                                                        54.\r\n</b>\r\n\r\n\r\n<b>118   INT. ISTANBUL - IMPORT/EXPORT OFFICE - DAY                  118\r\n</b>\r\n      A fan stirs the dusty air. Tarr walks in and stops. Tufty\r\n      lies on the floor, in a pool of blood. He's been tortured,\r\n      one eye gouged out. The other manages to convey a rather\r\n      touching amazement at the violence worked on him. His throat\r\n      has been slit wide open. Tarr absorbs this, looks at the\r\n      knife in his own hand, turns and runs.\r\n\r\n\r\n<b>119   INT. ISTANBUL - WORKERS CANTEEN - DAY                       119\r\n</b>\r\n      A desperate Tarr hurries towards a phone.\r\n\r\n\r\n<b>120   INT. ISTANBUL - IRINA'S HOTEL - DAY                         120\r\n</b>\r\n\r\n<b>      P.O.V. - BATHROOM THROUGH THE HALF-OPEN DOOR -\r\n</b>\r\n      Irina enters the hotel room. She stops a moment, afraid.\r\n      Then she looks towards us.\r\n\r\n<b>      BATHROOM\r\n</b>\r\n      Irina is backing out of the room. We catch a glimpse of the\r\n      BUTCHERED REMAINS of BORIS hanging from the shower rail, a\r\n      garroting wire around his neck. He's been tortured, the\r\n      shower curtain used to catch the pooling blood.\r\n\r\n      She BACKS AWAY across the room to the door, leaving a trail\r\n      of bloody footprints on the pale carpet.\r\n\r\n      She turns to the door, looks out of the SPY HOLE.\r\n\r\n      Her P.O.V. - two men, TINY DISTORTED FIGURES walking down\r\n      the corridor towards her.\r\n\r\n      The phone starts to RING. Irina glances at it, knowing it's\r\n      too late for her.\r\n\r\n      SPY-HOLE - The TWO FIGURES loom closer.\r\n\r\n\r\n<b>121   INT. ISTANBUL - PORT AUTHORITY - DAY                        121\r\n</b>\r\n      P.O.V. - Crowds of people throng the busy port.\r\n\r\n      A paranoid Ricki watches from the back of the hall. He\r\n      notices a child react to something - follows his gaze...\r\n\r\n      TARR'S P.O.V. - behind glass panels - a glimpse of three men\r\n      wheeling a gurney - a bandaged figure upon it. Just before\r\n      the figure disappears, a hand moves a little...\r\n\r\n      Tarr watches Irina's departure, sick with guilt.\r\n<b>                                                                        55.\r\n</b>\r\n\r\n\r\n<b>122   OMITTED                                                     122\r\n</b>\r\n\r\n<b>123   INT. SMILEY'S HOUSE - NIGHT - PRESENT                       123\r\n</b>\r\n      Tarr picks at a loose thread on his cuff, mind still back\r\n      there.\r\n\r\n<b>                          RICKI TARR\r\n</b>                They put her on a ship. That's\r\n                all I know. I've done a lot of\r\n                things Mister Smiley, but... I\r\n                don't know why... I keep thinking\r\n                about her. (Beat)\r\n\r\n      He smiles, almost bewildered by his own feelings.\r\n\r\n<b>                          RICKI TARR (CONT'D)\r\n</b>                She wasn't even my type. (Beat)\r\n                I want to get her out. I owe her\r\n                that.\r\n\r\n      He stands up abruptly, heading for the door.\r\n\r\n<b>                          SMILEY\r\n</b>                Where are you going Ricki? You\r\n                said yourself, Karla will be\r\n                looking for you. I can take you\r\n                somewhere. Keep you safe.\r\n\r\n      Tarr's face twists with mirth.\r\n\r\n<b>                          RICKI TARR\r\n</b>                Who's going to keep you safe?\r\n\r\n\r\n<b>124   INT. CIRCUS - LIFT SHAFT - DAY                              124\r\n</b>\r\n      We are peering down the lift shaft as new secrets are\r\n      winched towards us.\r\n\r\n\r\n<b>125   INT. CIRCUS - CONFERENCE ROOM - DAY                         125\r\n</b>\r\n      Alleline sits in his baronial chair, alone in the room. He\r\n      looks what he is. A man who knows he's OUT OF HIS DEPTH.\r\n\r\n      Across from him the SAFE stands, an almost malignant\r\n      presence.\r\n\r\n      Alleline stares at it, a light film of sweat on his\r\n      forehead.\r\n\r\n\r\n<b>126   INT. SQUASH CLUB - EVENING                                  126\r\n</b>\r\n      A dark warren of corridors and glassed SQUASH COURTS\r\n      somewhere under-ground.\r\n<b>                                                                        56.\r\n</b>\r\n\r\n\r\n      Alleline walks along the courts, new racquet in hand,\r\n      uncomfortable in his too- tight white shorts. He reaches a\r\n      court. Inside LACON and the MINISTER are playing a furious\r\n      game of squash.\r\n\r\n\r\n<b>127   INT. SQUASH CLUB - EVENING                                  127\r\n</b>\r\n      The three men stand talking within the transparent cube of\r\n      the court. Lacon and the Minister are still sweating from\r\n      their game. The Minister is smoking.\r\n\r\n<b>                          OLIVER LACON\r\n</b>                Percy has always resisted\r\n                suggestions of wider exploitation\r\n                of Witchcraft's intelligence.\r\n\r\n<b>                          MINISTER\r\n</b>                Drop the bloody jargon, Lacon.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                I've refused to share Witchcraft\r\n                with our allies, so far,\r\n                Minister.\r\n\r\n<b>                          MINISTER\r\n</b>                Greedy boy.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                My goal has been to establish his\r\n                track record beyond all doubt. I\r\n                think the time has come to\r\n                approach our American brothers-in-\r\n                arms.\r\n\r\n      The Minister considers this with some excitement, takes a\r\n      drag on his cigarette.\r\n\r\n<b>                          MINISTER\r\n</b>                You think they'll take us back\r\n                into bed?\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                I'm not interested in a one-off\r\n                trade. I want on-going access to\r\n                American intelligence.\r\n\r\n      This stops the Minister. He turns to face Alleline.\r\n\r\n<b>                          MINISTER\r\n</b>                Do you think we can get it?\r\n\r\n      Alleline senses he has just risen several rungs. He slashes\r\n      inexpertly with his racquet.\r\n<b>                                                                       57.\r\n</b>\r\n\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                With Witchcraft on our side, I\r\n                think we can get anything we\r\n                bloody-well want.\r\n\r\n\r\n<b>128   EXT. HAMPSTEAD PONDS - DAY                                 128\r\n</b>\r\n      Smiley swims in the placid water. We hear music. The tinkle\r\n      of glasses from a happy Christmas party...\r\n\r\n<b>                          CONTROL (O.S.)\r\n</b>                    (mock out-rage)\r\n                Percy?\r\n\r\n\r\n<b>129   INT. CIRCUS - FIFTH FLOOR PARTY - NIGHT - PAST             129\r\n</b>\r\n      - And we are back in the Circus.\r\n\r\n      We find Control - arm outstretched, finger pointing.\r\n\r\n<b>                          CONTROL\r\n</b>                Percy. Did you do this?\r\n\r\n      A Christmas Party of the past. Control, at the height of\r\n      his powers, a punch glass in hand. Noise and music: the\r\n      normally earnest atmosphere of the Circus released in an\r\n      unexpectedly boisterous gathering.\r\n\r\n<b>                          CONTROL (CONT'D)\r\n</b>                You penny pinching Scot. Can you\r\n                not take a bloody order. No one\r\n                is to tamper with the recipe.\r\n                It's going to take us five hours\r\n                to get drunk on this piss water.\r\n\r\n      Alleline tries to smile.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                I followed the recipe.\r\n\r\n      He glances nervously at his wife, a vivacious alcoholic,\r\n      just beginning to make a show of herself. She puts a CROWN-\r\n      SHAPED party hat from the cracker onto Alleline's head. He\r\n      brushes it off, anxious not to appear the fool.\r\n\r\n<b>                          PERCY ALLELINE (CONT'D)\r\n</b>                    (Muttering)\r\n                For God's sake Mary...\r\n\r\n      BILL HAYDON, wearing a crown from the cracker at a rakish\r\n      angle, appears in the nick of time, leads Alleline's wife out\r\n      for a dance, teasing the sullenness from her. They're good\r\n      dancers. Alleline relieved, crisis averted.\r\n<b>                                                                         58.\r\n</b>\r\n\r\n\r\n<b>129A   INT. CIRCUS - FIFTH FLOOR PARTY - NIGHT                    129A\r\n</b>\r\n       We find Smiley trapped in a conversation with an earnestly\r\n       drunk deb. Control raises his arm above the melee. He's\r\n       still at the punch bowl.\r\n\r\n<b>                           CONTROL\r\n</b>                 Smiley? Where's Ann? Get me a\r\n                 lady of taste? Ann will sort it\r\n                 out.\r\n\r\n<b>                           SMILEY\r\n</b>                     (grateful to get away\r\n                      from the deb)\r\n                 I'll go find her.\r\n\r\n       Smiley threads his way through the party, walking amongst\r\n       his colleagues, enjoying himself... Jerry Westerby and\r\n       Connie Sachs are arm in arm, singing along to a song - \"The\r\n       Second Worst Spy in the World.\" They link Smiley to them\r\n       for a verse, others joining in around them. The song segues\r\n       into the Russian National Anthem. The crowd sing lustily,\r\n       many of them Russian-speaking, enjoying the chance to sing\r\n       with vigour.\r\n\r\n       Smiley walks on. Behind him the song ends to be replaced by\r\n       the CHARLIE RICH song we heard earlier.\r\n\r\n       His P.O.V. -\r\n\r\n       - One of the larger Mothers doubled up with laughter,\r\n       pulling a cracker with a flushed TOBY ESTERHASE, hopelessly\r\n       outweighed, but competitive to the finish.\r\n\r\n        - ROY BLAND with his plain wife, eyeing one of the pretty\r\n       debs as she dances by. A mother takes Smiley by the hand\r\n       and leads him briefly into the dance. Smiley takes a turn\r\n       with her, and extricates himself. Still smiling...\r\n\r\n\r\n<b>130    INT. CIRCUS - FIFTH FLOOR PARTY - CORRIDOR - NIGHT          130\r\n</b>\r\n       ... he walks down a dark corridor, the noise of the party\r\n       fading away behind him.\r\n\r\n       He stops seeing something in the shadows of an office. For\r\n       a moment he doesn't understand what he's seen.\r\n\r\n<b>       REVERSE\r\n</b>\r\n       Two shapes locked in an embrace.\r\n\r\n       Smiley stands, nakedly absorbing the body blow. Then he\r\n       turns and walks back to the heat and noise of the party.\r\n<b>                                                                        59.\r\n</b>\r\n\r\n\r\n<b>131   EXT. HAMPSTEAD PONDS - DAY - PRESENT                        131\r\n</b>\r\n      Smiley and Guillam sit on a bench. Smiley has his towel,\r\n      hair wet from his swim.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                You look tired.\r\n\r\n      Smiley considers telling Guillam about Tarr's visit, but an\r\n      instinct for secrecy wins out.\r\n\r\n<b>                          SMILEY\r\n</b>                Yes. I didn't sleep well. (Beat)\r\n                I want you to get something for\r\n                me, Peter. I need the duty\r\n                officer's log book for last\r\n                November. I'm sorry, but I'm\r\n                going to have to send you up a\r\n                floor, into the Lion's den.\r\n                (Beat) If you have the slightest\r\n                reservation...\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Is feeling sick to your stomach a\r\n                slight reservation?\r\n\r\n<b>                          SMILEY\r\n</b>                If you're caught, Peter, you\r\n                can't mention me. I'm sorry, but\r\n                you're alone.\r\n\r\n      Guillam nods. He gets up and walks quickly away. After a\r\n      moment a MAN rises from a nearby bench and saunters over.\r\n      It's Mendel.\r\n\r\n<b>                          MENDEL\r\n</b>                You're clean. Nothing on your\r\n                back. Nothing on your conscience.\r\n\r\n\r\n<b>132   EXT. CIRCUS - MORNING                                       132\r\n</b>\r\n      A LORRY roars past, wiping frame and revealing Guillam\r\n      arriving at the circus, carrying his briefcase. He springs\r\n      up the four steps.\r\n\r\n\r\n<b>133   INT. CIRCUS - GROUND-FLOOR LOBBY - DAY                      133\r\n</b>\r\n      Guillam is at the security gate at the dingy lobby. The\r\n      security guard, Bryant, steps from his box. Beyond him is\r\n      the row of lifts.\r\n\r\n<b>                          BRYANT\r\n</b>                Mister Guillam? How's the family?\r\n<b>                                                              60.\r\n</b>\r\n\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          Fine, Bryant. Up to Registry\r\n          today.\r\n\r\n<b>                    BRYANT\r\n</b>          Okay sir. Yellow one for the bag\r\n          sir.\r\n\r\nBryant stamps a PINK chit and hands it to Guillam, pulling\r\nopen the lift cage. He gives him a yellow slip for the bag.\r\n\r\nGuillam climbs inside and begins to ascend, rattlingly\r\nslowly. As Bryant's head disappears...\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          Time you oiled this thing, isn't\r\n          it?\r\n\r\n<b>                    BRYANT (O.S.)\r\n</b>          We keep asking...\r\n\r\nGuillam examines the chit. He wipes his hands. For the\r\nfirst time we realize how NERVOUS he is.\r\n\r\nPolished shoes appear as they reach the floor, then the\r\nuniform trousers of a short man. A self-important JANITOR.\r\n\r\nGuillam steps out and the Janitor checks Guillam's pink and\r\nyellow chit and motions him through a turnstile. Then he\r\nstops him short. He gestures for Guillam to raise his arms.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          You're kidding?\r\n\r\n<b>                       JANITOR PETE\r\n</b>          New rules.\r\n\r\nGuillam is briskly frisked.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          Mind the jewels.\r\n\r\n<b>                    JANITOR PETE\r\n</b>          Pen and watch sir.\r\n\r\nHe holds up a box and Guillam hands him his fountain pen\r\nand watch.\r\n\r\nThe search over Guillam sets off down the corridor,\r\nunnerved by the task ahead - betraying his own kind.\r\n\r\n<b>                    BILL HAYDON (O.S.)\r\n</b>          What the hell are you doing up\r\n          here?\r\n\r\nGuillam freezes. Then he turns. It's Bill Haydon standing\r\nin a doorway, frowning at him over his spectacles. A\r\nmoment.\r\n<b>                                                                       61.\r\n</b>\r\n\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                You don't look pleased to see me,\r\n                Bill?\r\n\r\n<b>                          BILL HAYDON\r\n</b>                Why would I be? You bloody\r\n                pariah.\r\n\r\n      Then Bill grins, the grin transforming his face. Guillam\r\n      smiles back, relief mixing with real warmth.\r\n\r\n<b>                          BILL HAYDON (CONT'D)\r\n</b>                We like the Scalp-hunters to know\r\n                their place. On the second floor.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Doing some research. Makes a\r\n                change from sitting on my arse.\r\n\r\n<b>                          BILL HAYDON\r\n</b>                Heard it was quiet down there.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                As the grave. When're you going\r\n                to give us something to do?\r\n\r\n<b>                          BILL HAYDON\r\n</b>                Haven't you heard? Technology's\r\n                the future. No need for you apes\r\n                anymore. I can get you a posting\r\n                to Northern Ireland if that helps\r\n                get the blood racing.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Thanks anyway. Stick to sitting\r\n                on my arse.\r\n\r\n      They've reached the end of the corridor. Haydon peels away,\r\n      a hand raised in farewell.\r\n\r\n\r\n<b>134   INT. CIRCUS - READING ROOM - DAY                           134\r\n</b>\r\n      Guillam arrives at a counter which serves to block entry to\r\n      the vast archive of files beyond. A Janitor appears in the\r\n      entrance. He pushes a book towards Guillam to sign.\r\n\r\n<b>                          JANITOR ALWYN\r\n</b>                    (re: Guillam's bag)\r\n                Want me to look after that for\r\n                you, Mister Guillam?\r\n\r\n<b>                            PETER GUILLAM\r\n</b>                Thanks...\r\n<b>                                                                        62.\r\n</b>\r\n\r\n\r\n<b>                           JANITOR ALWYN\r\n</b>                Gotta give you a chit. The\r\n                Dolphin'll kill me if I don't.\r\n                New Rules.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                So, chit me.\r\n\r\n      The Janitor grins, slaps a chit on the bag, raises the\r\n      counter and Guillam enters.\r\n\r\n\r\n<b>135   INT. CIRCUS - READING ROOM - DAY                            135\r\n</b>\r\n      A few researchers sit amongst stacks of files. Guillam is\r\n      filling out requisition slips. Behind the desk, a woman -\r\n      SAL - watches him.\r\n\r\n<b>                          SAL\r\n</b>                What you up to this weekend?\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                    (rakish)\r\n                Visiting aunts.\r\n\r\n<b>                            SAL\r\n</b>                I'll bet.\r\n\r\n      She takes the flimsy's from the back of the slips and posts\r\n      them into her desk.\r\n\r\n<b>                          SAL (CONT'D)\r\n</b>                Corridor D.\r\n\r\n      She hands him back the top copies.\r\n\r\n<b>                          SAL (CONT'D)\r\n</b>                The two-eights are halfway on\r\n                your right, the three-ones are\r\n                next alcove down.\r\n\r\n\r\n<b>136   EXT. GARAGE - DAY                                           136\r\n</b>\r\n      Mendel sits in his car, watching the garage fore-court. He\r\n      looks at his watch.\r\n\r\n\r\n<b>137   INT. CIRCUS - ARCHIVE - DAY                                 137\r\n</b>\r\n      The LIFT CAGE we saw earlier is being raised from the floor\r\n      by a Janitor at the winch. Another janitor is removing\r\n      files from it.\r\n\r\n      Radiating out from the lift cage are the shelves of files\r\n      that make up the reading room.\r\n<b>                                                                        63.\r\n</b>\r\n\r\n\r\n      We find Guillam moving along the shelves reading the\r\n      fluorescent number cards. He takes a file out, leaving his\r\n      green slip in the brackets provided by each file. Guillam\r\n      looks across at his real objective...\r\n\r\n      A row of anonymous looking files on the next aisle - the\r\n      archived DUTY OFFICER'S LOG-BOOKS, spines bearing the year\r\n      and month they cover.\r\n\r\n      And in his way - a GIRL perched on a ladder, a MAN mending\r\n      a radiator. The Man turns round and stares straight at\r\n      Guillam. Suddenly he POINTS STRAIGHT AT HIM. For a moment\r\n      Guillam freezes, unnerved. Then he glances over his\r\n      shoulder and realises the Man is communicating with another\r\n      WORKMAN behind him.\r\n\r\n      Abruptly, Guillam walks over to the file and swaps it,\r\n      keeping the title close to his chest. He goes back to his\r\n      desk, a light film of sweat on his forehead.\r\n\r\n      He sits, a pencil clamped between his teeth, waiting...\r\n      From somewhere nearby comes the sound of a PHONE RINGING,\r\n      then being answered. Moments later...\r\n\r\n<b>                          JANITOR ALWYN\r\n</b>                    (To Guillam)\r\n                Telephone sir.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                    (as though distracted)\r\n                Oh to hell, who is it?\r\n\r\n<b>                          JANITOR ALWYN\r\n</b>                Outside line, sir. Someone rough.\r\n                The garage, I think, regarding\r\n                your car.\r\n\r\n      Guillam walks over to the counter, the stolen file hugged\r\n      to his chest.\r\n\r\n      A LOCKED BOX on a trolley is wheeled towards him and is\r\n      opened to reveal the OUTSIDE LINE TELEPHONE.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                    (into the phone)\r\n                Hello? (Beat) Well, damn. Can't\r\n                you do the bloody repair?\r\n\r\n\r\n<b>138   EXT. GARAGE - DAY                                           138\r\n</b>\r\n      Mendel is using the office phone, an ELDERLY GERMAN\r\n      MECHANIC, stands outside guarding the office door. In the\r\n      background a POP TUNE is playing on the radio.\r\n\r\n<b>                          MENDEL\r\n</b>                Can't be done sir, you're going\r\n                to need a new gear box.\r\n<b>                                                                      64.\r\n</b>\r\n\r\n\r\n<b>139   INT. CIRCUS - READING ROOM - DAY                          139\r\n</b>\r\n      On Guillam...\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                At least get on to the main\r\n                dealers first...\r\n\r\n\r\n<b>140   INT. CIRCUS - MONITOR ROOM - DAY                          140\r\n</b>\r\n      One of the Mothers is listening routinely in on the call,\r\n      TAPE SPOOLS revolving, recording the conversation. The POP\r\n      TUNE plays, insidiously working its way into her head. She\r\n      idly taps her pen along to the tune.\r\n\r\n<b>                          PETER GUILLAM (O.S.)\r\n</b>                Have you got the number?\r\n\r\n\r\n<b>141   INT. CIRCUS - READING ROOM - DAY                          141\r\n</b>\r\n<b>                          PETER GUILLAM\r\n</b>                Well, hold on...\r\n\r\n      He cups his hand over the mouthpiece...\r\n\r\n<b>                          PETER GUILLAM (CONT'D)\r\n</b>                ... Alwyn? Chuck me the bag a\r\n                minute, will you?\r\n\r\n      Alwyn gets Guillam's bag and brings it over to him.\r\n\r\n<b>                          PETER GUILLAM (CONT'D)\r\n</b>                Thanks.\r\n\r\n      Alwyn goes back to his post. Guillam, still hugging the\r\n      phone, takes out a BEIGE file from his bag and switches it\r\n      with the one against his chest. He takes an address book\r\n      from the bag and finds a number.\r\n\r\n<b>                          PETER GUILLAM (CONT'D)\r\n</b>                    (Into phone)\r\n                946-0335. OK? Thanks.\r\n\r\n      He hangs up, hands the bag back to Alwyn and steps back\r\n      into...\r\n\r\n\r\n<b>142   INT. CIRCUS - READING ROOM - DAY                          142\r\n</b>\r\n      Guillam retraces his steps, placing his dummy file in the\r\n      pink stack, replacing the one he placed there in its\r\n      original shelf, remembering to take the green slip from the\r\n      bracket. It's done.\r\n\r\n      Guillam takes the green slip and hands it to Sal, who signs\r\n      it and puts it on its spike. Guillam turns.\r\n<b>                                                                     65.\r\n</b>\r\n\r\n\r\n      TOBY ESTERHASE is standing in front of him. Unfriendly\r\n      eyes.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                Could we see you Peter?\r\n\r\n      For a second Guillam can't speak.\r\n\r\n<b>                          TOBY ESTERHASE (CONT'D)\r\n</b>                Percy would like quite an urgent\r\n                word with you. Can you come now\r\n                to the fifth floor? That would be\r\n                so kind.\r\n\r\n<b>                             PETER GUILLAM\r\n</b>                Of course.\r\n\r\n      Esterhase turns and Guillam, mind whirring, follows him\r\n      back out through the counter.\r\n\r\n<b>                          PETER GUILLAM (CONT'D)\r\n</b>                    (to Alwyn, inspired)\r\n                You might just throw that into\r\n                the lift for me, mark it for the\r\n                second floor, save me filling out\r\n                more bloody chits?\r\n\r\n<b>                          JANITOR ALWYN\r\n</b>                Will do sir.\r\n\r\n\r\n<b>143   INT. CIRCUS - FIFTH FLOOR - OUTSIDE ALLELINE'S OFFICE - DAY\r\n</b><b>                                                               143\r\n</b>\r\n      The Mothers sit over their typewriters as Guillam and\r\n      Esterhase walk through into the anteroom.\r\n\r\n<b>                           PERCY ALLELINE (O.S.)\r\n</b>                    (shouting from the other\r\n                     room)\r\n                Esterhase, I'll have no phone\r\n                calls, tell them...\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                The Chief will take no calls,\r\n                please, ladies...\r\n\r\n<b>                          MOTHER\r\n</b>                    (Muttering)\r\n                We can hear.\r\n\r\n      Toby holds the door open for Guillam.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                We are having a conference.\r\n<b>                                                                        66.\r\n</b>\r\n\r\n\r\n<b>144   INT. CIRCUS - CONFERENCE ROOM - DAY                         144\r\n</b>\r\n      Alleline sits in the baronial chair, Bland at his left.\r\n      Haydon on his right. Esterhase trots over to his seat.\r\n      Guillam takes in the REPORT they all seem to have spread\r\n      out in front of them.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                    (Reading)\r\n                Well now young Peter Guillam, are\r\n                you ready for me finally?\r\n\r\n      Guillam, affecting ease, leans against the wall.\r\n\r\n<b>                          PERCY ALLELINE (CONT'D)\r\n</b>                What are you getting up to down\r\n                there these days, apart from\r\n                chasing our virgins...\r\n\r\n      Guillam catches a smirk from Esterhase - mocking him?\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Couple of Arab ploys look quite\r\n                promising. Other than that,\r\n                getting quite good at ping-pong.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                Arabs... You can rent one but you\r\n                can't buy one. Right Bill?\r\n\r\n      He looks up from the report. Here it comes...\r\n\r\n<b>                          PERCY ALLELINE (CONT'D)\r\n</b>                How's Ricki Tarr these days?\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                    (Not missing a beat)\r\n                Fine. We have tea at Fortnum's\r\n                every afternoon.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                I require the matter of your\r\n                discussion with Tarr.\r\n\r\n      Guillam shrugs.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                I'll tell him. He'll be thrilled.\r\n\r\n      Alleline lets the silence build, rather like a bad actor.\r\n      Everyone is staring at Guillam.\r\n\r\n<b>                          PERCY ALLELINE\r\n</b>                    (Quietly)\r\n                What's that shrug for?\r\n\r\n      He SLAMS a hand on the desk, tea-cups rattling, a sudden\r\n      roar.\r\n<b>                                                             67.\r\n</b>\r\n\r\n\r\n<b>                    PERCY ALLELINE (CONT'D)\r\n</b>          I'm talking to you about a\r\n          murderer. I'm talking to you\r\n          about a defector from your own\r\n          damn section! I'm accusing you of\r\n          consorting with an enemy agent\r\n          behind my back! Don't damn well\r\n          shrug at me! How'd you like a\r\n          term in prison?\r\n\r\nGuillam's own temper comes to his rescue.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          But I haven't been seeing him! So\r\n          get your facts straight and get\r\n<b>          OFF MY BACK!\r\n</b>\r\nA moment, while the room digests this. A relaxation of the\r\ntension, as if he's passed some kind of test.\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          So if I told you that Tarr had\r\n          recently arrived in Paris would\r\n          you be surprised?\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          Nothing would surprise me about\r\n          Tarr.\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          And if I told you we happen to\r\n          know that thirty thousand pounds\r\n          mysteriously appeared in his bank\r\n          account last month, would that\r\n          surprise you?\r\n\r\nThis DOES shock Guillam, but he manages to hold on to his\r\nsullen expression.\r\n\r\n<b>                    PERCY ALLELINE (CONT'D)\r\n</b>          Your man's a defector, Guillam.\r\n          Got turned by the opposition\r\n          months ago and now they've sent\r\n          him back to us!\r\n\r\n<b>                      PETER GUILLAM\r\n</b>          What for?\r\n\r\n<b>                    PERCY ALLELINE\r\n</b>          Never mind what for! To muddy the\r\n          water, that's what for! Spread a\r\n          whole lot of damn nonsense to get\r\n          us chasing our tails! The point\r\n          is this - he's heading for home.\r\n          The first peep from him you come\r\n          to the grown-ups, understood?\r\n          Anyone you see at this table. But\r\n          not another damn soul!\r\n<b>                                                                        68.\r\n</b>\r\n\r\n\r\n<b>145   INT. CIRCUS - CORRIDOR - DAY                                145\r\n</b>\r\n      Guillam is walking to the lifts, we note he is now carrying\r\n      his BAG. Behind him ROY BLAND is walking down the corridor.\r\n      He peels off, turning left, humming a tune to himself - the\r\n      same POP SONG that was playing at the garage in the\r\n      background of Guillam's call. Guillam reacts as he keeps on\r\n      walking, trying to work out if this MEANS SOMETHING. We\r\n      track with him as his anger and PARANOIA grow.\r\n\r\n\r\n<b>146   EXT. GARAGE - DAY                                           146\r\n</b>\r\n      Guillam drives down an alleyway full speed, screeches to a\r\n      halt as he reaches a group of children playing, edges past\r\n      them and on into the car body repair shop. He gets and\r\n      strides past the elderly GERMAN MECHANIC we saw earlier.\r\n\r\n<b>                          MECHANIC\r\n</b>                    (German, subtitled)\r\n                He's waiting for you.\r\n\r\n      Guillam strides on, nerves at snapping point, to the other\r\n      end of the workshop where a Vauxhall waits.\r\n\r\n      Behind him the Mechanic and his SON are already beginning\r\n      to strip the plates off Guillam's car.\r\n\r\n\r\n<b>147   EXT. GARAGE - DAY                                           147\r\n</b>\r\n      Mendel appears by Guillam's side as they walk towards\r\n      another waiting car, Guillam simmering with rage.\r\n\r\n<b>                          MENDEL\r\n</b>                    (A faint smile)\r\n                All go smoothly did it? (Beat)\r\n                Where we off to?\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                The hotel. I have to see George.\r\n\r\n<b>                          MENDEL\r\n</b>                Mister Smiley isn't at the hotel,\r\n                sir. Change of venue.\r\n\r\n\r\n<b>148   INT. CONTROL'S FLAT - DAY                                   148\r\n</b>\r\n      Tarr sits in Control's green velvet armchair watching TV.\r\n      There's a large tape recorder on the table behind him. We\r\n      hear the door to the flat opening.\r\n\r\n<b>                          PETER GUILLAM (O.S.)\r\n</b>                George?\r\n<b>                                                              69.\r\n</b>\r\n\r\n\r\nGuillam hurries into the room, stops, seeing Tarr. Tarr\r\ngives his sunny grin but he's sweating, his eyes full of\r\ntension.\r\n\r\n<b>                    TARR\r\n</b>          Hello, Mister Guillam, sorry I\r\n          took so long to come back.\r\n\r\nGuillam punches him in the face, drags him from the chair,\r\nthe two struggling.\r\n\r\nBehind them Smiley and Fawn appear. Smiley watches coolly\r\nfor a moment then signals Fawn, who drags Guillam off Tarr,\r\nexpertly pinning his arm.\r\n\r\n<b>                    FAWN\r\n</b>          Excuse me, sir.\r\n\r\nGuillam pulls free angrily.\r\n\r\n<b>                    SMILEY\r\n</b>          Ricki's been helping us Peter.\r\n          (Indicating TAPE DECK) He's been\r\n          telling us all about his\r\n          adventures.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>              (To Smiley)\r\n          He's a double, George! There is\r\n          no Mole! The whole thing's a pack\r\n          of lies thought up by Moscow.\r\n          Karla's bought him for thirty\r\n          thousand pounds!\r\n\r\nHe pulls the LOG BOOK out of his file.\r\n\r\n<b>                    PETER GUILLAM (CONT'D)\r\n</b>              (To Tarr)\r\n          I stole that, because of you! I\r\n          spied on my own. Do you know how\r\n          that makes me feel?\r\n\r\nSmiley holds out his hand for the log book.\r\n\r\n<b>                    SMILEY\r\n</b>          As you did take the trouble to\r\n          steal it...\r\n\r\nGuillam hands him the book and Smiley leafs through the\r\npages.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          Ricki, you said you sent the\r\n          Circus a telegram concerning\r\n          Irina's information?\r\n\r\nTarr sits up, wiping blood from his mouth.\r\n<b>                                                            70.\r\n</b>\r\n\r\n\r\n<b>                    RICKI TARR\r\n</b>              (Sullenly)\r\n          S'right.\r\n\r\n<b>                    SMILEY\r\n</b>          What was the date?\r\n\r\nTarr hesitates, considering.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          He doesn't know because there was\r\n          no telegram! The whole thing...\r\n\r\n<b>                    RICKI TARR\r\n</b>          November 20th. It would have been\r\n          November 20th. Evening.\r\n\r\nSmiley has found the right month. He flicks through the\r\ndated pages - 18th November, 19th November...\r\n\r\nHe holds up the book - the next page has been cut out.\r\n\r\n<b>                    SMILEY\r\n</b>          November 20th is missing. (Beat)\r\n          Someone is covering their tracks\r\n          Peter. Unless you think that's\r\n          just a coincidence?\r\n\r\nGuillam looks thrown.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>          What about the money?\r\n\r\n<b>                    SMILEY\r\n</b>          Thirty thousand isn't so much for\r\n          Karla to pay if it protects his\r\n          Mole. I'm afraid someone in the\r\n          Circus knows all about Mister\r\n          Tarr and is doing everything they\r\n          can to discredit him.\r\n\r\nGuillam takes the log book from Smiley, runs a thumb down\r\nthe razored edge of the missing page. He notices some\r\nwriting on the next page.\r\n\r\n<b>                    PETER GUILLAM\r\n</b>              (Reading)\r\n          \"Enquiries to the fifth floor.\"\r\n\r\nSmiley takes the book again, examines the note.\r\n\r\n<b>                    SMILEY\r\n</b>          You recognize that handwriting?\r\n          (Beat) That's Toby Esterhase.\r\n<b>                                                                        71.\r\n</b>\r\n\r\n\r\n<b>149   EXT. HOTEL ISLAY - EVENING                                  149\r\n</b>\r\n      Smiley and Guillam pull up in front of the hotel. They sit,\r\n      in weary silence, staring up at the unprepossessing\r\n      building.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Why didn't you tell me? That you\r\n                had Tarr?\r\n\r\n      Smiley looks at him. Guillam reads the look correctly.\r\n\r\n<b>                          PETER GUILLAM (CONT'D)\r\n</b>                In case I didn't make it out of\r\n                the Circus...\r\n\r\n<b>                          SMILEY\r\n</b>                Secrecy is a habit.\r\n\r\n      Guillam rubs his eyes.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                I should get some rest. And I\r\n                suppose you should get your\r\n                reading done.\r\n\r\n      Smiley nods. Doesn't move.\r\n\r\n\r\n<b>150   INT. HOTEL ISLAY - SMILEY'S ROOM - NIGHT                    150\r\n</b>\r\n      The two men are finishing off a bottle of Scotch.\r\n      Unusually, Smiley is drunk - a result of the alcohol and\r\n      the lack of sleep.\r\n\r\n      Guillam lies on one of the single beds, staring at the\r\n      PHOTOGRAPHS of the four suspects Smiley has pinned on his\r\n      chessmen.\r\n\r\n<b>                             PETER GUILLAM\r\n</b>                I'm sorry.\r\n\r\n<b>                             SMILEY\r\n</b>                What for?\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                I wanted to believe Tarr was\r\n                lying. (Beat) All this time,\r\n                thinking I'm fighting a war. It's\r\n                a sham. Karla won years ago and\r\n                we didn't even know it.\r\n\r\n      Smiley watches Guillam, estimating how badly all of this is\r\n      affecting him.\r\n\r\n<b>                           SMILEY\r\n</b>                    (Beat)\r\n                I met him once. Karla.\r\n<b>                           (MORE)\r\n</b><b>                                                             72.\r\n</b>\r\n<b>                    SMILEY (CONT'D)\r\n</b>          In fifty-five. Moscow Centre was\r\n          in pieces. Purge after purge.\r\n          Half their Agents were jumping\r\n          ship and I travelled around\r\n          signing them up. Hundreds of\r\n          them.\r\n\r\nGuillam raises himself up on an elbow, listening.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          One of them was calling himself\r\n          Gerstmann. He was on his way back\r\n          to Russia, and we were pretty\r\n          sure he was going to be executed.\r\n          Plane had a twenty-four lay over\r\n          at Delhi, and that's how long I\r\n          had to convince him to come over\r\n          to us instead of going home to\r\n          die.\r\n\r\nSmiley stares at the room around, projecting his memory of\r\nthe Delhi cell onto their present surroundings.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          Little room...I'm sitting\r\n          here...he's sitting there...\r\n\r\nHe points to an EMPTY CHAIR in front of him.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          The Americans have had him\r\n          tortured.\r\n\r\nHe holds up his right hand.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          No fingernails. It's incredibly\r\n          hot. I'm very tired and all I\r\n          want to do is get this over with\r\n          and get back home. Things weren't\r\n          going well with Ann.\r\n\r\nGuillam flinches a little, but Smiley doesn't notice, lost\r\nnow in the past.\r\n\r\n<b>                     SMILEY (CONT'D)\r\n</b>          I give him the usual pitch...\r\n          Come to the West and we can give\r\n          you a comfortable life. After\r\n          questioning. Or you can catch\r\n          your plane and fly home and be\r\n          shot, like Bykov, Shur,\r\n          Muranov...\r\n\r\nHe stares at the CHAIR as if expecting an answer, and\r\nslightly drunkenly Guillam finds himself turning to the\r\nCHAIR for a response.\r\n<b>                                                             73.\r\n</b>\r\n\r\n\r\n<b>                     PETER GUILLAM\r\n</b>              (Beat)\r\n          What did he say?\r\n\r\nSmiley doesn't answer - STARES AT THE CHAIR - the silence\r\nstretching - it's all becoming a little surreal.\r\n\r\n<b>                    SMILEY\r\n</b>              (To the chair)\r\n          Think of your wife. You have a\r\n          wife, don't you? I brought you\r\n          some cigarettes, by the way.\r\n\r\nHe mimes placing cigarettes on an invisible table, between\r\nhim and the chair.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          Use my lighter.\r\n\r\nHe mimes placing the lighter beside the cigarettes.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          \"We could arrange for her to join\r\n          you, we have a lot of stock to\r\n          trade. If you go back, she'll be\r\n          ostracised. Think of her. Think\r\n          about how much she...\"\r\n\r\nHe breaks off in sudden impatience with himself.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          Kept harping on about the damn\r\n          wife! Telling him more about me,\r\n          than... Should have walked out,\r\n          of course, but for some reason...\r\n          it seemed important to save this\r\n          one. (Beat) So I go on. \"Know\r\n          you're a chain-smoker, help\r\n          yourself,\" \"We're not so very\r\n          different you and I..\"\r\n\r\nHe makes a vague \"Etcetera\" gesture, stares at...\r\n\r\n\r\n<b>THE EMPTY CHAIR\r\n</b>\r\n... something unsettling about it, as if somehow it is\r\nacquiring the GHOSTLY PRESENCE OF KARLA.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>              (To the chair)\r\n          Look, we've both spent our lives\r\n          looking for the weaknesses in one\r\n          another's systems. Don't you\r\n          think it's time to recognise\r\n          there is as little worth on your\r\n          side as there is on mine?\r\n<b>                                                                        74.\r\n</b>\r\n\r\n\r\n      Silence. Smiley sits back, dropping the game.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                Never said a word. Not one word.\r\n                Next morning he got back on his\r\n                plane, gave the pack of\r\n                cigarettes back to me, untouched -\r\n                this was a chain-smoker, mind -\r\n                and flew off to what he presumed\r\n                would be his death. He kept my\r\n                lighter. It was a gift - \"To\r\n                George, from Ann. All my love.\"\r\n\r\n      Guillam is still staring at the chair, a little awe-struck.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                That was Karla? And he flew back\r\n                to die rather than give in?\r\n\r\n<b>                          SMILEY\r\n</b>                Yes. (Beat) And that's how I know\r\n                he can be beaten. Because he's a\r\n                fanatic. And the fanatic is\r\n                always concealing a secret doubt.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                What did he look like?\r\n\r\n<b>                          SMILEY\r\n</b>                That's the thing. (Beat) I can't\r\n                remember.\r\n\r\n      He stands up, crosses to the window, embarrassed by what he\r\n      has to say next.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                After today, Peter you have to\r\n                assume they're watching you. If\r\n                there's anything you need tidied\r\n                up... now's the time.\r\n\r\n      Guillam stares at him, realising what he's talking about.\r\n\r\n\r\n<b>151   INT. GUILLAM'S FLAT - NIGHT                                 151\r\n</b>\r\n      Guillam and his boyfriend RICHARD sit at the table, Richard\r\n      working his way through a stack of essays. Guillam stares\r\n      at him.\r\n\r\n<b>                          RICHARD\r\n</b>                    (without looking up)\r\n                Nearly done.\r\n\r\n      He scores a red line down a piece of work.\r\n<b>                                                                        75.\r\n</b>\r\n\r\n\r\n<b>                          RICHARD (CONT'D)\r\n</b>                    (to himself)\r\n                For Godsakes... I think they're\r\n                all sharing the same moronic\r\n                brain.\r\n\r\n      He notices the way Guillam is staring at him and his smile\r\n      fades.\r\n\r\n<b>      LATER:\r\n</b>\r\n      RICHARD, bewildered and upset, is packing his belongings.\r\n      He walks past Guillam, stops.\r\n\r\n<b>                          RICHARD (CONT'D)\r\n</b>                    (With dignity)\r\n                If there's someone else, you can\r\n                tell me. I'm a grown-up.\r\n\r\n      Guillam doesn't say anything. Richard puts the flat keys on\r\n      the side table and leaves.\r\n\r\n      Guillam, stares after his one time lover, heart-broken.\r\n\r\n\r\n<b>152   EXT. THURSGOOD SCHOOL - DAY                                 152\r\n</b>\r\n      Prideaux's BLUE ALVIS bumps and jolts towards us across the\r\n      playing fields, an exhilarated ROACH at the wheel.\r\n\r\n<b>                          ROACH\r\n</b>                    (Braking)\r\n                Time sir?\r\n\r\n      Prideaux and the rest of the class stand at the \"finishing\r\n      line,\" but Prideaux is staring down to a line of beech-\r\n      trees, where a MAN is walking. It's MENDEL.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                    (Quietly)\r\n                Got your specs on Jumbo?\r\n\r\n<b>                            ROACH\r\n</b>                Yes, sir.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                Who's the fellow down there?\r\n\r\n      Roach stares at the stranger eagerly.\r\n\r\n<b>                          ROACH\r\n</b>                    (Disappointed)\r\n                Don't know sir.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                Who is he? Beggarman? Thief? Why\r\n                doesn't he look this way?\r\n<b>                          (MORE)\r\n</b><b>                                                                        76.\r\n</b>\r\n<b>                          PRIDEAUX (CONT'D)\r\n</b>                Wouldn't you look if you saw a\r\n                bunch of boys flogging a car\r\n                around a field? Doesn't he like\r\n                boys? Anyone sees him again, let\r\n                me know. Don't hold with odd bods\r\n                hanging about. Might steal the\r\n                Alvis, which is...?\r\n\r\n<b>                          CLASS\r\n</b>                    (By rote)\r\n                Best car in England!\r\n\r\n      They dissolve into laughter, but Roach is still anxiously\r\n      watching Prideaux, noting how his expression has darkened.\r\n\r\n\r\n<b>153   OMITTED                                                     153\r\n</b>\r\n\r\n<b>154   INT. CIRCUS - SCALPHUNTERS - POOL TABLE - DAY               154\r\n</b>\r\n      Belinda, the deb we met earlier, is doing up her blouse.\r\n      She's teary and also a little excited that men are fighting\r\n      over her.\r\n\r\n<b>                          BELINDA\r\n</b>                Stop it! Stop it!\r\n\r\n      KASPAR has Guillam pinned against the wall and is punching\r\n      him. Guillam accepts the blows with a bloody grin. Something\r\n      of the school yard fight about it, as the other Scalphunters\r\n      gather around, ostensibly to break it, up but clearly\r\n      enjoying the distraction. One of them is trying to pull\r\n      Kaspar off and, caught by a blow, joins in - the fight\r\n      escalating as others join in the struggle.\r\n\r\n<b>                          KASPAR\r\n</b>                Keep your bloody hands off her!\r\n\r\n      He kicks at Guillam, who falls. Belinda gives a shriek of\r\n      alarm.\r\n\r\n<b>                          SCALPHUNTER\r\n</b>                Christ's sake, don't fight over a\r\n                bit of skirt!\r\n\r\n      Guillam lies on the floor taking another kick, but his face,\r\n      turned to us, registers only relief. Job done.\r\n\r\n\r\n<b>155   EXT. CASINO - DAY                                           155\r\n</b>\r\n      Bright morning sunshine. Smiley and Guillam walk up\r\n      concrete steps of a casino building - very modern,\r\n      imposing.\r\n<b>                                                                       77.\r\n</b>\r\n\r\n\r\n<b>                          MAN'S VOICE (O.S.)\r\n</b>                Haven't seen many of the boys and\r\n                girls for a while, matter of\r\n                fact.\r\n\r\n\r\n<b>156   INT. CASINO - CASINO FLOOR - DAY                           156\r\n</b>\r\n      Smiley, Guillam and the genial JERRY WESTERBY are sat at a\r\n      blackjack table. The casino is empty, a cleaner vacuums in\r\n      the background.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                But that's the way it is, George,\r\n                isn't it? When you're out, you're\r\n                out. Too much of this stuff.\r\n\r\n      He points to a drink on the table before him.\r\n\r\n<b>                          JERRY WESTERBY (CONT'D)\r\n</b>                    (An old joke between them)\r\n                Too much wampum not good for\r\n                braves. How.\r\n\r\n<b>                          SMILEY\r\n</b>                    (Obliging)\r\n                How. (Beat) I need to talk to you\r\n                about the night Jim Prideaux was\r\n                killed, Jerry. You were duty\r\n                officer, weren't you?\r\n\r\n      Westerby looks at them both.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                Yes. Control asked me to man the\r\n                phones that night. Said someone was\r\n                doing a special job for the\r\n                service. He wanted someone from\r\n                outside he could trust. If anything\r\n                came in, I was to tell him and only\r\n                him.\r\n\r\n\r\n<b>157   INT. CIRCUS - EVENING - PAST                               157\r\n</b>\r\n      Westerby walks down the corridor. We pass OFFICES - drawers\r\n      pulled open, waste paper bins standing on desks - the end\r\n      of day ritual.\r\n\r\n\r\n<b>158   INT. CIRCUS - DUTY OFFICERS ROOM - NIGHT                   158\r\n</b>\r\n      Westerby is following a horse race on the radio. A dirty\r\n      plate in front of him. He drinks from a can of beer.\r\n<b>                                                                        78.\r\n</b>\r\n\r\n\r\n<b>159   INT. CIRCUS - DUTY OFFICERS ROOM - NIGHT                    159\r\n</b>\r\n      Westerby is asleep. The Circus is deathly quiet, nothing\r\n      stirring. Then...\r\n\r\n<b>      A PHONE BEGINS TO RING.\r\n</b>\r\n\r\n<b>160   INT. CIRCUS - CONTROL'S OFFICE - NIGHT                      160\r\n</b>\r\n      Control sits surrounded by files. A dim green lamp on his\r\n      desk the only illumination. He looks ill, tense with\r\n      waiting. Cigarette stubs piled in the ashtray.\r\n\r\n      He listens to the solitary PHONE below him in the building.\r\n      Then it is joined by a SECOND. Then a THIRD...\r\n\r\n      Control listens, nerves stretched to their limit. From just\r\n      outside - the sound of someone running up the wooden\r\n      staircase. A knock.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                    (Entering)\r\n                Been a bit of a panic, sir.\r\n\r\n      Control raises his head.\r\n\r\n<b>                          JERRY WESTERBY (CONT'D)\r\n</b>                From the FO resident clerk... A\r\n                Hungarian news bulletin, sir.\r\n                (Reading) British spy, work-name\r\n                Ellis, travelling with false\r\n                Hungarian papers, has attempted\r\n                to kidnap an unnamed Hungarian\r\n                general in Budapest. He's been\r\n                shot, other arrests imminent...\r\n\r\n      Control stares at him, stands unsteadily, begins to put on\r\n      his coat.\r\n\r\n<b>                          JERRY WESTERBY (CONT'D)\r\n</b>                Can I have a brief, please? Sir?\r\n                Do you want me to deny it?\r\n\r\n      Controls stares at him, lost.\r\n\r\n<b>                          JERRY WESTERBY (CONT'D)\r\n</b>                I have to have a brief sir?\r\n\r\n\r\n<b>161   INT. CIRCUS - DUTY OFFICERS ROOM - NIGHT                    161\r\n</b>\r\n      Westerby is on the phone.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                Ann? I'm sorry to bother you. Is\r\n                George back yet?\r\n<b>                                                                     79.\r\n</b>\r\n\r\n\r\n<b>162   INT. CASINO - CASINO FLOOR - NIGHT - PRESENT             162\r\n</b>\r\n      Westerby and Smiley sit opposite each other.\r\n\r\n<b>                          SMILEY\r\n</b>                You rang my house?\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                Just on the off chance you were\r\n                back from Berlin.\r\n\r\n<b>                          SMILEY\r\n</b>                What did you say?\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                Just that there'd been a bit of a\r\n                crisis. She said you weren't back\r\n                yet. That was it.\r\n\r\n<b>                           SMILEY\r\n</b>                Go on.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                All hell broke loose - military\r\n                yelling about Hungarian tank\r\n                movements on the border, Lacon\r\n                and the Minister baying at the\r\n                door. Thank Christ Bill Haydon\r\n                turned up when he did.\r\n\r\n\r\n<b>163   INT. CIRCUS - NIGHT - PAST                               163\r\n</b>\r\n      PUSHING BILL HAYDON as he walks up the corridor towards the\r\n      duty room, cutting a swathe through the people gathered\r\n      outside.\r\n\r\n<b>                           BILL HAYDON\r\n</b>                Get out.\r\n\r\n      The room clears.\r\n\r\n      Bill sits down. He pulls out all the phone lines, decisive,\r\n      taking charge. Kicks the door shut.\r\n\r\n<b>                           BILL HAYDON (CONT'D)\r\n</b>                Tell me.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                I tried to get hold of you...\r\n\r\n<b>                          BILL HAYDON\r\n</b>                I just picked up half a story on\r\n                the ticker-tape at my club...\r\n                Tell me.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                Jim Prideaux's been shot.\r\n<b>                                                                     80.\r\n</b>\r\n\r\n\r\n      Haydon goes white.\r\n\r\n<b>                          HAYDON\r\n</b>                Get me the Hungarian Embassy.\r\n\r\n<b>                           JERRY WESTERBY\r\n</b>                    (With relief)\r\n                Yes sir...\r\n\r\n<b>      LATER:\r\n</b>\r\n      Haydon is on the phones.\r\n\r\n<b>                          BILL HAYDON\r\n</b>                You go and tell your Masters what\r\n                will happen if one hair on Jim\r\n                Prideaux's head is damaged...\r\n\r\n      He covers the receiver, turns to Westerby.\r\n\r\n<b>                          BILL HAYDON (CONT'D)\r\n</b>                Get Esterhase on the phone. Tell\r\n                him to pull in the Hungarian\r\n                agents, anyone we're onto. Tell him\r\n                to get down to the London School of\r\n                Economics, sandbag some bloody\r\n                students and put them on ice at\r\n                Sarratt.\r\n\r\n<b>      LATER:\r\n</b>\r\n      Westerby watches Haydon on the phone from the door. Haydon\r\n      listens to a voice for a moment, then hangs up. He stands,\r\n      his back to Westerby.\r\n\r\n<b>                          JERRY WESTERBY\r\n</b>                Any more news on him?\r\n\r\n      Haydon doesn't turn around, head bowed.\r\n\r\n<b>                          JERRY WESTERBY (CONT'D)\r\n</b>                Bill? (Beat) Oh God, is he...?\r\n\r\n      For a moment it looks like Haydon won't answer but then he\r\n      seems to master his emotions.\r\n\r\n<b>                          BILL HAYDON\r\n</b>                We need to go to his flat. Clear\r\n                out anything linked.\r\n\r\n\r\n<b>164   INT. PRIDEAUX'S FLAT - NIGHT                             164\r\n</b>\r\n      Haydon walks around the neat rooms. A bike up on the wall,\r\n      a pair of muddy climbing boots on a newspaper, waiting to\r\n      be cleaned. Haydon walks past a shelf - photographs and\r\n      books. He stops, picks up an unframed black and white snap\r\n      from the shelf. It's a picture of HIMSELF.\r\n<b>                                                                        81.\r\n</b>\r\n\r\n\r\n      Haydon stands with his back to us, possibly crying. Westerby\r\n      turns thoughtfully away.\r\n\r\n\r\n<b>165   OMITTED                                                     165\r\n</b>\r\n\r\n<b>166   OMITTED                                                     166\r\n</b>\r\n\r\n<b>167   INT. LONDON - WIMPY - NIGHT                                 167\r\n</b>\r\n      Smiley and Guillam sit eating side by side at a bar, Smiley\r\n      examining the hamburger - his first - doubtfully. Guillam\r\n      is thinking about what he's just been told.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Haydon heard the news at his\r\n                club?\r\n\r\n      Smiley is distant...\r\n\r\n<b>                          SMILEY\r\n</b>                The Saville.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                At one-thirty? The ticker-tape\r\n                wouldn't be running.\r\n\r\n      Guillam sits, mind racing.\r\n\r\n<b>                          PETER GUILLAM (CONT'D)\r\n</b>                So how did he know? Oh Jesus,\r\n                George...\r\n\r\n<b>                             SMILEY\r\n</b>                Peter...\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Jesus Christ. Haydon? How could\r\n                he have known?\r\n\r\n<b>                          SMILEY\r\n</b>                It's not him, Peter.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Then how did he know?\r\n\r\n<b>                          SMILEY\r\n</b>                    (gently)\r\n                Because he was at my house that\r\n                night. With Ann.\r\n\r\n      Guillam doesn't know what to say. They sit in a hideously\r\n      awkward silence.\r\n<b>                                                                         82.\r\n</b>\r\n\r\n\r\n<b>                           SMILEY (CONT'D)\r\n</b>                     (of the Hamburger)\r\n                 I quite like this.\r\n\r\n\r\n<b>167A   INT. SMILEY'S HOUSE - BEDROOM - NIGHT - PAST            167A\r\n</b>\r\n       The phone on the nightstand starts to ring. A woman's hand\r\n       reaches into frame and picks it up.\r\n\r\n<b>                            WOMAN'S VOICE (O.S.)\r\n</b>                 Hello?\r\n                     (beat)\r\n                 Oh hello Jerry. No I'm afraid\r\n                 George isn't back yet.\r\n\r\n       In the bed beside her we see Bill Haydon.\r\n\r\n\r\n<b>168    EXT. LONDON STREETS - NIGHT                                 168\r\n</b>\r\n       A black Cab pulls up at the lights. Another black cab pulls\r\n       alongside it. The two drivers acknowledge each other,\r\n       chatting as the lights change to RED, but in no hurry to\r\n       move.\r\n\r\n       An impatient woman passenger flicks a look at the passenger\r\n       in the opposite cab, wanting to share this moment of\r\n       passenger outrage.\r\n\r\n       We see ALLELINE'S profile staring stonily ahead.\r\n\r\n       We follow his cab as it peels off into a FAMILIAR street,\r\n       driving towards the house where we met Polyakov.\r\n\r\n\r\n<b>169    EXT. HAMPSTEAD PONDS - DAY                                  169\r\n</b>\r\n       Smiley slips into the water. It's late afternoon. Very\r\n       still and calm. Very few swimmers. Smiley's head breaks the\r\n       surface, dips in, breaks the surface...\r\n\r\n\r\n<b>170    EXT. HAMPSTEAD PONDS - DAY                                  170\r\n</b>\r\n       Smiley sits on a platform with his back to us, drying off\r\n       from his swim, looking out over the water. A MAN'S HEAD\r\n       appears, swimming up to the platform through the reeds. An\r\n       old QUEEN, his face almost purple with the cold. He clings\r\n       to the edge of the platform for a moment.\r\n\r\n<b>                           OLD MAN\r\n</b>                 Just in case it's of interest,\r\n                 dear. We are observed. Old Filth\r\n                 in the bushes. Not very subtle\r\n                 but there you are...\r\n<b>                                                                        83.\r\n</b>\r\n\r\n\r\n      He swims away. The wind lifts up a little, rustling the\r\n      trees and bushes around the pond. We stay on Smiley,\r\n      watched and alone.\r\n\r\n\r\n<b>171   OMITTED                                                     171\r\n</b>\r\n\r\n<b>172   OMITTED                                                     172\r\n</b>\r\n\r\n<b>173   OMITTED                                                     173\r\n</b>\r\n\r\n<b>174   INT. SMILEY'S HOUSE - DAY                                   174\r\n</b>\r\n      Smiley walks into his hallway, picks up the MAIL piled on\r\n      the floor. He crosses to the drawing room, still looking at\r\n      the mail.\r\n\r\n      The door is a little ajar and through the opening we catch\r\n      a FLASH of movement in the room beyond - a COUPLE in a\r\n      passionate embrace, glimpsed for a moment before they\r\n      disappear out of sight. We can hear what may be their love-\r\n      making. And a RECORD IS PLAYING. The same CHARLIE RICH\r\n      track Smiley reacted to in the Islay Hotel.\r\n\r\n      Smiley stares at the mail in his hand as if unwilling to\r\n      look up.\r\n\r\n      He pushes open the door and moves into...\r\n\r\n\r\n<b>175   INT. SMILEY'S HOUSE - DAY                                   175\r\n</b>\r\n      ... which is EMPTY. He sits in an armchair, starts opening\r\n      some letters.\r\n\r\n      A FIGURE walks past Smiley abruptly. Smiley doesn't look\r\n      up.\r\n\r\n<b>                          BILL HAYDON (O.S.)\r\n</b>                Good flight?\r\n\r\n      Smiley looks up.\r\n\r\n      BILL HAYDON sits in the armchair opposite in shirt and\r\n      trousers, SOCKS, NO SHOES. He sips a cup of tea. No sense\r\n      of having been caught in an act of adultery.\r\n\r\n\r\n<b>176   INT. SMILEY'S HOUSE - DAY - PAST                            176\r\n</b>\r\n<b>      BACK ON SMILEY\r\n</b>\r\n      ... who is now wearing a raincoat and we realise we are in\r\n      fractured memories of...\r\n<b>                                                                         84.\r\n</b>\r\n\r\n\r\n<b>       THE PAST\r\n</b>\r\n<b>                            SMILEY\r\n</b>                  Yes. Pleasant enough.\r\n\r\n<b>                            BILL HAYDON\r\n</b>                  I was just passing, thought I'd\r\n                  call in. Ann was in bed but she\r\n                  insisted on getting up. She said\r\n                  she'll be down in a minute.\r\n\r\n       Smiley glances at a half-wrapped oil painting lying against\r\n       a chair.\r\n\r\n<b>                            BILL HAYDON (CONT'D)\r\n</b>                  That's what I'm dropping off.\r\n\r\n\r\n<b>177    INT. SMILEY'S HOUSE - DAY                                  177\r\n</b>\r\n       Smiley stands in front of the muddy-looking abstract\r\n       painting we saw earlier. It's now on the wall.\r\n\r\n<b>                            BILL HAYDON (O.S.)\r\n</b>                  Awful daub really but Ann\r\n                  expressed a liking... What's\r\n                  keeping her?\r\n\r\n       We hold on Smiley but hear Haydon leave the room, a\r\n       WHISPERED CONFERENCE in the hall between Haydon and Ann.\r\n\r\n       P.O.V. - FROM THE DOOR - George with his back to us, staring\r\n       fixedly at the picture, listening to the whispers behind his\r\n       back.\r\n\r\n\r\n<b>178    OMITTED                                                    178\r\n</b>\r\n\r\n<b>178A   INT. PRIDEAUX'S CARAVAN - EVENING                          178A\r\n</b>\r\n       Prideaux lies on his bed. There is a tap at the door.\r\n\r\n<b>                            ROACH (O.S.)\r\n</b>                  Sir?\r\n\r\n<b>                            JIM PRIDEAUX\r\n</b>                  Come in, Roach.\r\n\r\n       Roach walks in.\r\n\r\n<b>                             JIM PRIDEAUX (CONT'D)\r\n</b>                  Thought you were in sick bay? What\r\n                  are you...\r\n\r\n       He stops, seeing the anxiety on the boy's face.\r\n<b>                                                                        85.\r\n</b>\r\n\r\n\r\n<b>                          JIM PRIDEAUX (CONT'D)\r\n</b>                What is it, Jumbo?\r\n\r\n<b>                          ROACH\r\n</b>                Sir there's a stranger parked down\r\n                on the road. He's just sitting\r\n                there.\r\n\r\n      He dissolves into tears. Prideaux crouches beside him.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                    (Gently)\r\n                It's alright, old fella. Don't cry.\r\n                Nobody ever watched like you, did\r\n                they? Off you go, now.\r\n\r\n<b>                          ROACH\r\n</b>                Are you going to have to leave?\r\n\r\n      Prideaux stares at him.\r\n\r\n<b>                          JIM PRIDEAUX\r\n</b>                I'll be fine. You get back to bed.\r\n\r\n      Roach wipes his eyes and leaves. As soon as the door is\r\n      closed Prideaux crawls under the little chest of drawers,\r\n      grimacing with pain, working an arm further in...\r\n\r\n      There is a FAINT SOUND - SOMEONE ON THE STEPS OUTSIDE.\r\n\r\n      With a final effort Prideaux rips his RIFLE free from its\r\n      hiding place, still trailing tape, and rolls to face the\r\n      door, gun in hand. Silence. Then...\r\n\r\n      A KNOCK AT THE DOOR. Prideaux aims the gun...\r\n\r\n      The door opens...\r\n\r\n\r\n<b>179   OMITTED                                                     179\r\n</b>\r\n\r\n<b>180   INT. CONTROL'S FLAT - NIGHT - PAST                          180\r\n</b>\r\n      ... to reveal Control peering out at us. He steps aside and\r\n      allows a PRE-INJURY Prideaux to enter.\r\n\r\n\r\n<b>181   INT. CONTROL'S FLAT - NIGHT                                 181\r\n</b>\r\n      The flat Smiley visited. Control leads Prideaux into the\r\n      same room - the green armchair, surrounded by mounds of\r\n      files and papers, over-flowing ashtrays, the detritus of an\r\n      obsession. The FIVE PHOTOGRAPHS of FACES fixed to the CHESS\r\n      PIECES before him.\r\n\r\n      Control, a walking corpse, lowers himself into the\r\n      armchair, motions Prideaux to take another seat.\r\n<b>                                                            86.\r\n</b>\r\n\r\n\r\n<b>                    CONTROL\r\n</b>          You weren't followed?\r\n\r\nPrideaux sits, presuming the question is rhetorical.\r\n\r\n<b>                    CONTROL (CONT'D)\r\n</b>          Trust no-one, Jim. Especially not\r\n          in the main stream. What\r\n          Hungarian identities do you still\r\n          have running?\r\n\r\n<b>                    PRIDEAUX\r\n</b>          Andras Benedek, Hungarian\r\n          journalist based in Paris.\r\n\r\nControl nods thoughtfully. Then...\r\n\r\n<b>                    CONTROL\r\n</b>          If you're caught, you keep me out\r\n          of it. You were acting alone, bit\r\n          of Private Enterprise.\r\n          Understood?\r\n\r\nPrideaux watches him, very still.\r\n\r\n<b>                    CONTROL (CONT'D)\r\n</b>          I've had an offer of service. A\r\n          Hungarian General. Wants to come\r\n          over. I want you to meet him. He\r\n          has information I need, Jim.\r\n\r\n<b>                    PRIDEAUX\r\n</b>          What information?\r\n\r\n<b>                    CONTROL\r\n</b>          Rocketry. Ballistics. Bit of\r\n          politics.\r\n\r\nSomething in his manner alerts Prideaux.\r\n\r\n<b>                       PRIDEAUX\r\n</b>          What else?\r\n\r\n<b>                     CONTROL\r\n</b>              (Beat)\r\n          Treasure. He has treasure. The\r\n          name of the Mole Moscow Centre\r\n          has planted at the top of the\r\n          Circus.\r\n\r\nPrideaux's face doesn't change, but he's wondering if the\r\nrumours could be true and Control really has gone mad.\r\n\r\n<b>                    CONTROL (CONT'D)\r\n</b>          There's a rotten apple Jim and we\r\n          have to find it.\r\n\r\nLaboriously he leans forward to the CHESS SET.\r\n<b>                                                                           87.\r\n</b>\r\n\r\n\r\n<b>                            CONTROL (CONT'D)\r\n</b>                I'm   so close I can almost feel\r\n                his   heart beating. I know it's\r\n                one   of five men. All I want from\r\n                you   is one word.\r\n\r\n      He points to the PHOTOGRAPH of PERCY ALLELINE.\r\n\r\n<b>                          CONTROL (CONT'D)\r\n</b>                Alleline - Tinker. (Points at the\r\n                next photo) Haydon - Tailor.\r\n                Bland - Soldier. We drop Sailor,\r\n                it's too close to Tailor.\r\n                (Pointing at next photo)\r\n                Esterhase - Poorman.\r\n\r\n\r\n<b>182   INT. PRIDEAUX'S CARAVAN - NIGHT - PRESENT                      182\r\n</b>\r\n      Prideaux sits with his visitor - Smiley -      recalling the\r\n      meeting. He's drinking vodka.\r\n\r\n<b>                          SMILEY\r\n</b>                Which means I was...?\r\n\r\n<b>                          PRIDEAUX\r\n</b>                You were Beggarman.\r\n\r\n      Smiley nods. Just a flicker of the eyes shows us that this\r\n      is painful for him to hear.\r\n\r\n<b>                          SMILEY\r\n</b>                What did you make of it, Jim?\r\n                Control's theory?\r\n\r\n<b>                          PRIDEAUX\r\n</b>                    (Stiff)\r\n                I thought it was madness. To\r\n                think any one of you could have\r\n                been a traitor... madness.\r\n\r\n      Smiley is watching him intently - sure he's hiding\r\n      something.\r\n\r\n<b>                          SMILEY\r\n</b>                But still you went? Risking your\r\n                life for a mission you thought\r\n                was absurd? Why?\r\n\r\n      Prideaux doesn't answer.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                Perhaps some part of you wanted to\r\n                know if Control was right? Wanted\r\n                to know if there was a Mole, who it\r\n                might be?\r\n\r\n      Prideaux shoots him a dangerous look.\r\n<b>                                                                        88.\r\n</b>\r\n\r\n\r\n<b>                              PRIDEAUX\r\n</b>                       (Hard)\r\n                   I went because Control asked me to\r\n                   go. It's called doing one's duty.\r\n\r\n\r\n<b>183   INT. BUDAPEST - TRAIN STATION - DAY - PAST                  183\r\n</b>\r\n      Prideaux climbs off his train and walks down the platform\r\n      towards us. He pauses for a moment, drawing a Hungarian\r\n      newspaper from his pocket. As he does so he glances at the\r\n      other passengers walking past him. TWO WOMEN and a MAN, all\r\n      apparently travelling alone, the SHOES they're wearing -\r\n      BROWN SUEDE BOOTS, FUR LINED BLACK PLASTIC BOOTS and the\r\n      man - a pair of BLACK GALOSHES.\r\n\r\n      Prideaux walks on, tapping the paper against his leg.\r\n\r\n\r\n<b>184   INT. BUDAPEST - GALERIA - DAY                               184\r\n</b>\r\n      The scene from the opening of the film. The Waiter puts\r\n      down Prideaux's plate, a drop of sweat from his forehead\r\n      hitting the table. He looks at the droplet, fakes a smile\r\n      for the Magyar, looks after the Waiter, scans the floor\r\n      around him...\r\n\r\n      HIS P.O.V. - There it is - one of the women is wearing the\r\n      BLACK PLASTIC BOOTS. Her coat is different and she's\r\n      wearing a fur hat now - but the shoes are the one thing the\r\n      surveillance agents don't have time to change.\r\n\r\n      Prideaux glances up at the apartment windows above, sees\r\n      the old woman, starts to rise... as we CUT TO:\r\n\r\n      The SHOT -\r\n\r\n      ... punching into his back, Prideaux falling forward... as\r\n      we CUT TO:\r\n\r\n\r\n<b>      PRIDEAUX'S P.O.V.\r\n</b>\r\n      Those shoes again, stepping in the water and blood on the\r\n      floor, passing us at eye-level. Grouping and regrouping as\r\n      the operation comes to an end. The noise in the background\r\n      comes to us muted and very faint. Faintly, a baby is\r\n      crying, an ambulance siren is wailing.\r\n\r\n      Hands appear and we are rolled onto a stretcher and lifted\r\n      up to chest level where we seem to FLOAT past the faces of\r\n      the MAGYAR and the other Officers, smoking cigarettes by\r\n      the doors, and out towards the open doors of a waiting\r\n      ambulance.\r\n<b>                                                                        89.\r\n</b>\r\n\r\n\r\n<b>185   INT. BUDAPEST - GALERIA - DAY                               185\r\n</b>\r\n      We are slid into the back of the ambulance as though into\r\n      the drawers of a morgue. And snap to BLACK.\r\n\r\n\r\n<b>186   INT. LUBYANKA PRISON - CELL - DAY                           186\r\n</b>\r\n      We are looking at the back of Prideaux's head, hair damp\r\n      with sweat, shoulders trembling.\r\n\r\n      We PULL OUT and find Prideaux, a filthy dressing covering\r\n      the wound on his back. The cell he is in has filthy,\r\n      heavily padded walls, like a straitjacket. From a speaker\r\n      in the ceiling comes a maddening jagged drone. Lights blaze\r\n      down...\r\n\r\n<b>                          SMILEY (V.O.)\r\n</b>                What did you tell them?\r\n\r\n\r\n<b>187   INT. LUBYANKA PRISON - CORRIDOR - DAY                       187\r\n</b>\r\n      Prideaux, in too much pain to walk, is being dragged down a\r\n      brightly lit corridor towards an INTERROGATION ROOM at the\r\n      far end.\r\n\r\n      He is taken inside, the door closed behind him.\r\n\r\n<b>                          PRIDEAUX (V.O.)\r\n</b>                Everything.\r\n\r\n\r\n<b>188   INT. THURSGOOD SCHOOL - CLASSROOM - NIGHT - PRESENT         188\r\n</b>\r\n      Smiley stands staring at the OWL Prideaux killed, which is\r\n      now stuffed, keeping guard from the top of a bookshelf.\r\n      Prideaux sits at a desk drinking the vodka.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                I held on as long as I could, to\r\n                give everyone else time to get\r\n                the hell out of there. (Beat) Did\r\n                they?\r\n\r\n      Smiley seems to have been thinking about something else,\r\n      looks at him, puzzled.\r\n\r\n<b>                          PRIDEAUX (CONT'D)\r\n</b>                My networks in Hungary. Did they\r\n                get out?\r\n\r\n<b>                           SMILEY\r\n</b>                    (Beat)\r\n                No. They were blown. The story is\r\n                you blew them to save your own\r\n                skin.\r\n<b>                                                             90.\r\n</b>\r\n\r\n\r\nPrideaux nods, makes an odd gesture as if he's about to\r\nrise, but doesn't move. His expression hasn't changed, but\r\ninside him something has just been decided.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          What was your last line of\r\n          defence?\r\n\r\n<b>                    PRIDEAUX\r\n</b>          The Mole. Control's crazy theory.\r\n          I was going to bury that so deep,\r\n          they'd never get it out of me.\r\n          Which was a joke.\r\n\r\n<b>                       SMILEY\r\n</b>          Why?\r\n\r\n<b>                    PRIDEAUX\r\n</b>          Because they already knew. They\r\n          wanted to know how far Control\r\n          had got in his investigation.\r\n\r\n<b>                       SMILEY\r\n</b>          What else?\r\n\r\n<b>                    PRIDEAUX\r\n</b>          Circus gossip. Was Percy's wife\r\n          still drinking, who was Bland\r\n          screwing in the office. That sort\r\n          of thing.\r\n\r\n<b>                    SMILEY\r\n</b>          Did they ask about me at all?\r\n\r\n<b>                    PRIDEAUX\r\n</b>          One of them did.\r\n\r\nSmiley becomes very still.\r\n\r\n<b>                    SMILEY\r\n</b>          What did he say about me?\r\n\r\n<b>                    PRIDEAUX\r\n</b>          He had a cigarette lighter. Kept\r\n          flashing it round for me to see.\r\n          Showed me the inscription.\r\n          \"To George, from Ann. All my\r\n          love.\" He reckoned after Bill's\r\n          fling with her, she might want to\r\n          change the inscription.\r\n\r\nSmiley doesn't flicker.\r\n\r\n<b>                     PRIDEAUX (CONT'D)\r\n</b>              (Still looking to the\r\n               side)\r\n          I told him to go to hell.\r\n<b>                     (MORE)\r\n</b><b>                                                                        91.\r\n</b>\r\n<b>                          PRIDEAUX (CONT'D)\r\n</b>                If they had one man like Bill\r\n                Haydon they could call it set and\r\n                match!\r\n\r\n<b>                          SMILEY\r\n</b>                    (Beat, quietly)\r\n                That was well said.\r\n\r\n      They sit in silence for a moment. Smiley buttons his coat,\r\n      finished here.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                Try and put it all behind you, Jim.\r\n\r\n      He makes to leave.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                He gave me a cigarette.\r\n\r\n      Prideaux looks down at his hands.\r\n\r\n<b>                           SMILEY\r\n</b>                Jim?\r\n\r\n      Prideaux still doesn't look up.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                I thought it was my last one.\r\n\r\n\r\n<b>189   OMITTED                                                     189\r\n</b>\r\n\r\n<b>190   OMITTED                                                     190\r\n</b>\r\n\r\n<b>191   OMITTED                                                     191\r\n</b>\r\n\r\n<b>192   INT. LUBYANKA PRISON - CELL - DAY - PAST                    192\r\n</b>\r\n      A concrete bunker of a room. Prideaux is standing in a slab\r\n      of watery sunshine that falls from a sky-light above. He's\r\n      smoking, trying to control the tremble in his hand.\r\n\r\n      PRIDEAUX P.O.V. - The patch of sunshine only extends a few\r\n      yards in front of him. The rest of the room is in granite\r\n      shadow. The sense of other people watching from the\r\n      shadows. The sound of a door opening and someone being led\r\n      in.\r\n\r\n      A woman walks across the dark room and into the slab of\r\n      light, blinking as she does so.\r\n\r\n      It's IRINA.\r\n\r\n      Her hair is loose and dishevelled about her face. A man's\r\n      voice comes from further back in the darkness...\r\n<b>                                                                        92.\r\n</b>\r\n\r\n\r\n<b>                          MAN'S VOICE\r\n</b>                    (Russian accent)\r\n                Do you know this woman?\r\n\r\n      Prideaux looks at her. Frowns. Another voice murmurs in\r\n      Russian. Irina pins her hair up in the way we saw before.\r\n\r\n<b>                          PRIDEAUX\r\n</b>                I don't know her.\r\n\r\n      She looks at Prideaux and gives a small polite smile, as\r\n      though good manners are going to save her.\r\n\r\n<b>                          IRINA\r\n</b><b>                I...\r\n</b>\r\n      A GUARD steps out of the shadows and SHOOTS her in the\r\n      head, the shot THUNDEROUS in the room. It's horribly\r\n      unexpected, and Prideaux jerks backward, bewildered and\r\n      appalled.\r\n\r\n<b>                          MAN'S VOICE (O.S.)\r\n</b>                Tell Percy Alleline what we did.\r\n\r\n\r\n<b>193   EXT. HOTEL ISLAY - GUILLAM'S CAR - NIGHT - PRESENT          193\r\n</b>\r\n\r\n<b>      P.O.V. - THROUGH WINDSCREEN\r\n</b>\r\n      ... rain lashes down, obscuring our view.\r\n\r\n<b>                          PRIDEAUX (V.O.)\r\n</b>                Do you know who she was?\r\n\r\n<b>                           SMILEY (V.O.)\r\n</b>                    (Cold)\r\n                Nobody you need concern yourself\r\n                with. An unfortunate...\r\n\r\n      REVERSE - we see Guillam and Smiley are sitting in the\r\n      parked car in the rain.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                He said when he got out, when he\r\n                was being debriefed at the\r\n                Nursery, he had a visitor.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Who?\r\n\r\n<b>                          SMILEY\r\n</b>                Toby Esterhase.\r\n<b>                                                                       93.\r\n</b>\r\n\r\n\r\n<b>194   EXT. SARRATT - DAY - PAST                                  194\r\n</b>\r\n      ... Prideaux stands watching a small, dapper figure\r\n      crossing the grounds towards him - TOBY ESTERHASE. A man\r\n      who's come up in the world.\r\n\r\n\r\n<b>195   EXT. HOTEL ISLAY - GUILLAM'S CAR - NIGHT - PRESENT         195\r\n</b>\r\n<b>                          SMILEY\r\n</b>                He gave him a thousand pounds.\r\n                Told him he was dead now and\r\n                couldn't come back. Had to become\r\n                a Lotus Eater - forget everything\r\n                that happened - Control's theory,\r\n                Tinker, Tailor... all of it.\r\n\r\n      Guillam stares at him, ALERT.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                Yes, that's what I thought. How\r\n                on earth did Esterhase hear about\r\n                \"Tinker, Tailor?\"\r\n\r\n\r\n<b>196   EXT. HOTEL ISLAY - NIGHT                                   196\r\n</b>\r\n      Smiley gets out of the car, into the rain. Looks around\r\n      him, uneasy.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                You alright?\r\n\r\n<b>                          SMILEY\r\n</b>                Will you watch my back, Peter?\r\n                Look out for a solo. Just a\r\n                feeling I've had.\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                Yes, George. I'll watch.\r\n\r\n      Guillam watches as Smiley heads off into the gloom.\r\n\r\n\r\n<b>197   INT. HOTEL ISLAY - SMILEY'S ROOM - NIGHT                   197\r\n</b>\r\n      Smiley stares at the CHESS BOARD - a complex pattern of\r\n      related figures.\r\n\r\n      He turns back to the tape-deck, puts the headphones on,\r\n      presses play:\r\n\r\n<b>                          SMILEY (O.S.)\r\n</b>                    (Over headphones)\r\n                What exactly did Irina say?\r\n<b>                                                                     94.\r\n</b>\r\n\r\n\r\n<b>                           RICKI TARR\r\n</b>                    (Over headphones)\r\n                She said there was a General,\r\n                work-name Polyakov who was\r\n                stationed in London. And that\r\n                Polyakov's real job was to\r\n                service the mole. He meets him\r\n                regularly and takes back\r\n                information the Mole gives him\r\n                for Karla.\r\n\r\n      Smiley presses STOP. He presses RE-WIND, watches the tape\r\n      spool BACKWARDS. He goes too far, presses FAST-FORWARD,\r\n      watches the tape REVERSE DIRECTION. And, at this moment, we\r\n      can tell from his expression, a piece of the jig-saw falls\r\n      into place.\r\n\r\n\r\n<b>198   OMITTED                                                  198\r\n</b>\r\n\r\n<b>199   INT. MINISTERIAL MEETING ROOM - DAY                      199\r\n</b>\r\n      Lacon and Smiley are meeting with the MINISTER.\r\n\r\n<b>                          MINISTER\r\n</b>                This meeting is not taking place.\r\n                Is that clear?\r\n\r\n<b>                          SMILEY\r\n</b>                Perfectly, Minister. (Beat) There\r\n                is a house, somewhere in this\r\n                city, where Alleline and the\r\n                others meet Witchcraft's London\r\n                representative. I need the\r\n                address of that house.\r\n\r\n<b>                          MINISTER\r\n</b>                I don't know what you're talking\r\n                about.\r\n\r\n      Smiley stares at him.\r\n\r\n<b>                          MINISTER (CONT'D (CONT'D)\r\n</b>                I don't know the address. And I\r\n                fail to see the... I thought\r\n                Lacon had made it clear to you,\r\n                keep your nose bloody-well out of\r\n                Witchcraft's business!\r\n\r\n<b>                          SMILEY\r\n</b>                    (Calmly)\r\n                It's Lacon's advice I'm\r\n                following. (To Lacon) You told me\r\n                to follow in Control's footsteps.\r\n<b>                                                            95.\r\n</b>\r\n\r\n\r\n<b>                    MINISTER\r\n</b>              (Snapping)\r\n          Well, I wouldn't consider that\r\n          sound advice, after the bloody\r\n          mess Control left us with. It's\r\n          taken Alleline - and, if I may\r\n          say so, myself - this long to get\r\n          us back into the race.\r\n\r\n<b>                    SMILEY\r\n</b>          I'm glad you take some of the\r\n          credit.\r\n\r\nLacon glances sharply at Smiley - there's something\r\ndifferent about him, his tone...\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          The man Alleline and the others\r\n          meet is called Polyakov. You\r\n          believe his role is to bring\r\n          information from Witchcraft to\r\n          you. His real role is to receive\r\n          information from the Mole to take\r\n          back to Karla.\r\n\r\nHe has the Minister's full attention now. A long silence.\r\n\r\n<b>                    MINISTER\r\n</b>          That's... that's not possible.\r\n\r\n<b>                    SMILEY\r\n</b>          Made possible. By you. When he\r\n          steals our secrets he does it\r\n          under the very nose of the\r\n          Circus, in the house which you\r\n          persuaded the treasury to pay\r\n          for. I'm sure you'll be able to\r\n          take full credit for that.\r\n\r\n<b>                    MINISTER\r\n</b>              (Appalled)\r\n          Witchcraft's intelligence is\r\n          genuine! It's been gold!\r\n\r\n<b>                    SMILEY\r\n</b>          Just enough glitter, amongst the\r\n          chicken-feed. Control didn't\r\n          believe in miracles and he didn't\r\n          believe in Witchcraft. But you\r\n          were lazy and you were greedy and\r\n          so you hounded him out of the\r\n          Circus and you let Karla in.\r\n\r\nHis voice is still calm, but it's clear what's different\r\nnow. There's a quiet fury in him. The Minister is ashen.\r\n<b>                                                                  96.\r\n</b>\r\n\r\n\r\n<b>                          MINISTER\r\n</b>                Oh God... We can't be made to\r\n                look like fucking fools again!\r\n                Forget Europe, if we have the\r\n                black men getting to hear about\r\n                this on Walla-Wallah News! What\r\n                if we find the Mole and we move\r\n                him sideways, some department\r\n                where he can't do any harm? Is\r\n                the Kremlin likely to boast about\r\n                this?\r\n\r\n<b>                          LACON\r\n</b>                Not in their interests sir. They\r\n                need the Enemy to look like a\r\n                threat...\r\n\r\n<b>                          MINISTER\r\n</b>                Well, tell them to play the game.\r\n                We don't go crowing about their\r\n                fuck-ups!\r\n\r\n      In their panic, both men are addressing each other,\r\n      momentarily forgetting Smiley.\r\n\r\n<b>                          SMILEY\r\n</b>                    (Suddenly)\r\n                We are not the prize. We're the\r\n                bait.\r\n\r\n      They turn to him.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                You've opened negotiations to\r\n                exchange intelligence with the\r\n                Americans. What they tell the\r\n                Circus, they'll be telling the\r\n                Kremlin. Witchcraft's\r\n                information, the \"gold\" Karla let\r\n                you have? It wasn't to lure you.\r\n                It was to lure the Americans.\r\n                Now, do you want to take credit\r\n                for that?\r\n\r\n      Lacon and the Minister stare at Smiley.\r\n\r\n<b>                          MINISTER\r\n</b>                What can we do?\r\n\r\n<b>                          SMILEY\r\n</b>                We have one thing the Mole wants.\r\n\r\n\r\n<b>200   OMITTED                                               200\r\n</b><b>                                                                        97.\r\n</b>\r\n\r\n\r\n<b>201   INT. CONTROL'S FLAT - DAY                                   201\r\n</b>\r\n      CLOSE on a belligerent Tarr, confidence regained.\r\n\r\n<b>                             RICKI TARR\r\n</b>                If I go...\r\n\r\n<b>                          PETER GUILLAM\r\n</b>                You'll go...\r\n\r\n<b>                          RICKI TARR\r\n</b>                ... I want your word you'll get\r\n                Irina back. Don't care who you\r\n                have to trade. I want a family.\r\n                Don't wanna end up like you\r\n                lot...\r\n\r\n      He looks at Smiley, then he gives Guillam a knowing look,\r\n      as though deliberately provoking him.\r\n\r\n      Guillam absorbs the slur but his eyes are hard.\r\n\r\n<b>                          RICKI TARR (CONT'D)\r\n</b>                We're gonna live in Paris out of\r\n                your hair. You'll get her back?\r\n\r\n      Again a flash of the coldness in Smiley.\r\n\r\n<b>                           SMILEY\r\n</b>                    (Beat)\r\n                I'll do my utmost, Ricki.\r\n\r\n\r\n<b>202   INT./EXT. CIRCUS - DAY                                      202\r\n</b>\r\n\r\n<b>      ON LIFT DOORS:\r\n</b>\r\n      The doors open to reveal TOBY ESTERHASE, chatting to a\r\n<b>      JANITOR.\r\n</b>\r\n\r\n<b>      ESTERHASE'S P.O.V.\r\n</b>\r\n      Guillam, standing by his car - holding the door open.\r\n\r\n\r\n<b>203   EXT. LONDON STREETS - GUILLAM'S CAR - DAY                   203\r\n</b>\r\n      Guillam is driving. The radio is on. The car pulls up on\r\n      the roadside and two people climb in the back. It's Smiley\r\n      and Fawn. Guillam speeds off.\r\n\r\n      Nobody speaks. Esterhase sits stiff, mind-whirring,\r\n      uncomfortably aware of Fawn's unsettling presence behind\r\n      him.\r\n<b>                                                                        98.\r\n</b>\r\n\r\n\r\n<b>204   EXT. ABANDONED AIRFIELD - DAY                               204\r\n</b>\r\n\r\n<b>      TRACKING SHOT - PUSHING ESTERHASE\r\n</b>\r\n      ... as he stumbles through the muddy airfield. A vast,\r\n      empty space all around. Toby starts to turn, but...\r\n\r\n<b>                          SMILEY (O.S.)\r\n</b>                Keep walking please.\r\n\r\n      Toby stumbles on.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                I want to talk about loyalty\r\n                Toby. Control recruited you when\r\n                you were trying to escape from\r\n                Hungary didn't he? A wanted man.\r\n                Saved you from a KGB bullet,\r\n                didn't he? And yet, when the time\r\n                came, when it came to picking\r\n                sides between him and Alleline,\r\n                you didn't hesitate?\r\n                Understandable perhaps, with your\r\n                war experience. You've survived\r\n                this long, I suppose, because of\r\n                your ability to change sides,\r\n                serve any Master?\r\n\r\n      Faintly we hear the low drone of an approaching engine.\r\n      Esterhase scans the horizon, locks on the black speck in the\r\n      sky - an aircraft flying towards them. Esterhase watches the\r\n      approach with mounting anxiety.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                What... what's this about George?\r\n\r\n<b>                          SMILEY\r\n</b>                It's about which Master you've\r\n                been serving, Toby.\r\n\r\n\r\n<b>205   INT. CIRCUS - DAY - PAST                                    205\r\n</b>\r\n      A FILE is placed in a briefcase - we can see now that the\r\n      hands in the frame belong to Esterhase. He checks the\r\n      corridor is clear...\r\n\r\n\r\n<b>206   EXT. ABANDONED AIRFIELD - DAY - PRESENT                     206\r\n</b>\r\n      ... as he and Guillam drive Esterhase on.\r\n\r\n<b>                          SMILEY\r\n</b>                Intelligence has been leaked,\r\n                Toby. Someone's been taking files\r\n                from the Circus...\r\n<b>                                                                         99.\r\n</b>\r\n\r\n\r\n<b>207    INT. CIRCUS - GROUND-FLOOR LOBBY - DAY - PAST               207\r\n</b>\r\n       Esterhase leaving the Circus, Bryant politely wishing him\r\n       good night.\r\n\r\n\r\n<b>208    EXT. ABANDONED AIRFIELD - DAY - PRESENT                     208\r\n</b>\r\n       ... eyes fixed on the plane as it roars down towards them.\r\n\r\n<b>                           TOBY ESTERHASE\r\n</b>                 This is a mistake George, this is\r\n                 all...\r\n\r\n<b>                           SMILEY\r\n</b>                 The files were delivered to a\r\n                 Russian attache, weren't they?\r\n\r\n\r\n<b>209    INT. SAFE HOUSE - MEETING ROOM - EVENING - PAST             209\r\n</b>\r\n       ... Esterhase holding up the documents for Polyakov to\r\n       photograph. Whir... Click....\r\n\r\n\r\n<b>210    EXT. ABANDONED AIRFIELD - DAY - PRESENT                     210\r\n</b>\r\n<b>                           TOBY ESTERHASE\r\n</b>                 Yes. And yes, I delivered them.\r\n\r\n\r\n<b>211    EXT. SAFE HOUSE - DAY - PAST                                211\r\n</b>\r\n       Alleline getting out of the cab by the railings... the dog\r\n       barking from inside the house...\r\n\r\n<b>                           TOBY ESTERHASE (V.O.)\r\n</b>                 ... but so did Percy...\r\n\r\n\r\n<b>211A   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                     211A\r\n</b>\r\n       Haydon walking past Mrs McCraig and heading up the stairs\r\n       to the empty room...\r\n\r\n<b>                           TOBY ESTERHASE\r\n</b>                 ... and Bill...\r\n\r\n\r\n<b>211B   INT. SAFE HOUSE - MEETING ROOM - DAY                       211B\r\n</b>\r\n       Roy Bland sits in front of Polyakov, holding up the\r\n       documents for Polyakov to photograph - Whir... Click....\r\n\r\n<b>                              TOBY ESTERHASE\r\n</b>                 And Roy...\r\n<b>                                                                     100.\r\n</b>\r\n\r\n\r\n<b>212   EXT. ABANDONED AIRFIELD - DAY - PRESENT                  212\r\n</b>\r\n      Esterhase can't tear his eyes away from the propeller plane\r\n      descending onto the runway ahead of them.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                Things aren't always what they\r\n                seem. You know that George.\r\n                Moscow thinks Polyakov's working\r\n                for them, so, every now and then\r\n                we give him the odd file to take\r\n                back to them, just chicken-feed,\r\n                keep his bosses happy. But\r\n                Polyakov's our Joe, part of a big\r\n                operation...\r\n\r\n<b>                          SMILEY\r\n</b>                Operation Witchcraft? Yes, I\r\n                know.\r\n\r\n      Esterhase stops, turns to look at Smiley.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                Why are we here? Why are we...?\r\n\r\n      Guillam gives him a sudden VIOLENT SHOVE in the back.\r\n      Esterhase straightens himself, runs a palm through his\r\n      hair, real fear on his face now.\r\n\r\n<b>                          TOBY ESTERHASE (CONT'D)\r\n</b>                I don't... I don't deserve this.\r\n                I don't deserve this George!\r\n\r\n<b>                          SMILEY\r\n</b>                Who gave you the message for Jim\r\n                to forget about Tinker Tailor?\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                Bland!\r\n\r\n<b>                          SMILEY\r\n</b>                To get rid of Connie Sachs?\r\n                Westerby?\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                Bland or Haydon. I don't\r\n                remember. One of them. Maybe\r\n                Percy. I don't know who.\r\n\r\n<b>                          SMILEY\r\n</b>                You're just the messenger?\r\n                Running between them all.\r\n                Anything to serve Witchcraft?\r\n\r\n      Esterhase flinches again.\r\n<b>                                                                        101.\r\n</b>\r\n\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                I know all about your secret\r\n                source. And I know something you\r\n                don't. I know who he is.(Beat)\r\n                He's Karla.\r\n\r\n      Esterhase turns to look at them in horror. Guillam pushes\r\n      him again. The plane has taxied to a halt ahead of them.\r\n      Unmarked. Something sinister about it.\r\n\r\n\r\n<b>213   OMITTED                                                     213\r\n</b>\r\n\r\n<b>214   INT. SAFE HOUSE - GROUND FLOOR - DAY - PAST                 214\r\n</b>\r\n      ... in the London House, spools turning. We hear the\r\n      familiar Click... Whir of Polyakov's camera...\r\n\r\n\r\n<b>215   INT. SAFE HOUSE - MEETING ROOM - DAY                        215\r\n</b>\r\n      Polyakov is photographing... nothing. The table in front of\r\n      him is empty, the shooting just a pantomime for the\r\n      microphone above. As he continues to shoot we see the\r\n      Mystery man sitting across the table from him. He takes out\r\n      a canister of developed film and passes it to Polyakov.\r\n\r\n<b>                          SMILEY (V.O.)\r\n</b>                One of you has been giving\r\n                Polyakov the Crown Jewels.\r\n\r\n\r\n<b>216   EXT. ABANDONED AIRFIELD - DAY - PRESENT                     216\r\n</b>\r\n      ... standing on the airfield.\r\n\r\n<b>                          TOBY ESTERHASE\r\n</b>                I didn't know. I swear I...\r\n\r\n<b>                          SMILEY\r\n</b>                Are you still a wanted man, Toby?\r\n\r\n      Toby looks back at the plane, almost hysterical.\r\n\r\n<b>                             TOBY ESTERHASE\r\n</b>                George...!\r\n\r\n<b>                          SMILEY\r\n</b>                You picked the wrong side, Toby.\r\n\r\n<b>                           TOBY ESTERHASE\r\n</b>                    (crying)\r\n                George, you've got to believe me. I\r\n                would never... I'm loyal, George.\r\n                I'm loyal!\r\n\r\n      Smiley watches him cry for a moment, his face impassive.\r\n<b>                                                                       102.\r\n</b>\r\n\r\n\r\n<b>                          SMILEY\r\n</b>                Give me the address. Where do you\r\n                meet Polyakov?\r\n\r\n\r\n<b>217   EXT. SAFE HOUSE - DAY                                      217\r\n</b>\r\n      A terrace of flat-fronted nineteenth century houses one of\r\n      them the house we have already visited.\r\n\r\n      A CAR draws up before one of them and Smiley, Fawn and\r\n      Guillam get out and head for the front door.\r\n\r\n\r\n<b>218   INT. SAFE HOUSE - GROUND FLOOR                             218\r\n</b>\r\n      The men are fanning out, Fawn and Guillam heading into the\r\n      kitchen. Smiley walks upstairs, dogged by the HOUSEKEEPER -\r\n      MRS McCRAIG - not at all happy with the invasion.\r\n\r\n<b>                          SMILEY\r\n</b>                What are the safety signals?\r\n\r\n<b>                          MRS MCCRAIG\r\n</b>                There's an air duct. Open and\r\n                all's well. Closed and you're not\r\n                to enter.\r\n\r\n\r\n<b>219   INT. SAFE HOUSE - MEETING ROOM - DAY                       219\r\n</b>\r\n      They enter the EMPTY ROOM.\r\n\r\n<b>                          SMILEY\r\n</b>                Where is the mike, Mrs McCraig?\r\n\r\n      She points at the candelabra.\r\n\r\n<b>                          SMILEY (CONT'D)\r\n</b>                And what's the procedure?\r\n\r\n<b>                          MRS MCCRAIG\r\n</b>                Whenever the gentlemen are\r\n                meeting I record the session. The\r\n                tapes are sent back to the\r\n                Circus.\r\n\r\n      From downstairs come the crash of furniture being moved,\r\n      rooms searched.\r\n\r\n<b>                          MRS MCCRAIG (CONT'D)\r\n</b>                What are they doing? They\r\n                shouldn't be moving things!\r\n\r\n      The authority in Smiley's voice stops her.\r\n<b>                                                                        103.\r\n</b>\r\n\r\n\r\n<b>                          SMILEY\r\n</b>                If you're at all worried you can\r\n                call Lacon from the basement\r\n                phone. Let's try the tape\r\n                recorder shall we?\r\n\r\n\r\n<b>220   INT. SAFE HOUSE - GROUND FLOOR - DAY                        220\r\n</b>\r\n\r\n<b>      CLOSE ON TAPE RECORDER   - SPOOLS SLOWLY REVOLVING\r\n</b>\r\n      Over the RECORDER we can hear GUILLAM'S VOICE reciting\r\n      something from childhood, from the room above.\r\n\r\n<b>                          PETER GUILLAM (O.S.)\r\n</b>                The boy stood on the burning deck\r\n                whence all but he had fled. The\r\n                flame that lit the battles wreck,\r\n                shone round him o'er the dead...\r\n\r\n      Smiley is listening.\r\n\r\n<b>                          PETER GUILLAM'S VOICE\r\n</b>                ... Yet beautiful and bright he\r\n                stood...\r\n\r\n\r\n<b>221   EXT. PARIS - STREET - EVENING                               221\r\n</b>\r\n      Establishing shot of a street in Paris.\r\n\r\n      A squat Yorkshireman - MACKELVORE - walks out of a nearby\r\n      restaurant and gets into a car.\r\n\r\n      Out of nowhere Tarr suddenly appears, climbing into the\r\n      passenger side, ramming a gun into his side.\r\n\r\n\r\n<b>222   INT. PARIS - APARTMENT - PARIS RESIDENCY - NIGHT            222\r\n</b>\r\n      Mackelvore leads Tarr into a grand but dilapidated\r\n      apartment. An elderly FRENCHMAN - ex-Resistance - looks up\r\n      from his evening meal as the two pass.\r\n\r\n<b>                          MACKLEVORE\r\n</b>                    (In French)\r\n                Guest from London Station, Monsieur\r\n                Fourcade.\r\n\r\n      The Frenchman grunts a greeting, turns back to his supper.\r\n\r\n<b>                          MACKELVORE\r\n</b>                    (as they walk on)\r\n                The whole service is looking for\r\n                you, Ricki. They'll skin you\r\n                alive if they find you.\r\n<b>                                                                       104.\r\n</b>\r\n\r\n\r\n<b>                          RICKI TARR\r\n</b>                    (mildly)\r\n                Maybe I want them to find me.\r\n\r\n      Mackelvore frowns. They reach a door which he opens to\r\n      reveal a STEEL DOOR beyond. He presses a bell and a hatch\r\n      in the door slides open and a young man's face appears.\r\n      This is BEN. He slides open a bolt, a double lock, and lets\r\n      them into a ...\r\n\r\n\r\n<b>223   INT. PARIS - CYPHER ROOM - NIGHT                           223\r\n</b>\r\n<b>                          MACKELVORE\r\n</b>                You can go home now, Ben. Leave\r\n                the books where they are and put\r\n                the keys into the machines. I'll\r\n                be talking to London presently\r\n                under my own steam.\r\n\r\n<b>                             BEN\r\n</b>                Okay boss.\r\n\r\n      Tarr takes out his gun.\r\n\r\n<b>                           RICKI TARR\r\n</b>                    (Flat)\r\n                Ben stays here.\r\n\r\n\r\n<b>224   INT. PARIS - CYPHER ROOM - NIGHT                           224\r\n</b>\r\n      Tarr stands over Mackelvore, who is sending a message to\r\n      the Circus.\r\n\r\n<b>                          RICKI TARR\r\n</b>                    (dictating)\r\n                Ricki Tarr claims to have further\r\n                information vital to the\r\n                safeguarding of the Circus.\r\n\r\n\r\n<b>225   INT. LONDON - TAILOR'S SHOP NEAR CIRCUS - NIGHT            225\r\n</b>\r\n      A dark workroom. WE TRACK through a crowd of TAILORS\r\n<b>      DUMMIES.\r\n</b>\r\n      Some of the dummies are draped in clothes, some just shapes\r\n      in the darkness. As though we are moving through A ROOM\r\n<b>      FULL OF SPIES.\r\n</b>\r\n      By a great domed window, occasionally washed with yellow\r\n      from the traffic outside, we find MENDEL, his back to us\r\n      staring out.\r\n<b>                                                                        105.\r\n</b>\r\n\r\n\r\n<b>      MENDEL'S P.O.V. - THE CIRCUS ACROSS THE ROAD.\r\n</b>\r\n      A taxi pulls up a few yards away from the circus doors. We\r\n      see a man clamber out. It's Percy Alleline.\r\n\r\n<b>                          MENDEL\r\n</b>                    (into phone)\r\n                Tinker...\r\n\r\n\r\n<b>226   INT. SAFE HOUSE - LISTENING ROOM - NIGHT                    226\r\n</b>\r\n      Smiley sits on an armchair, lit by a harsh over-head light.\r\n\r\n<b>                          SMILEY\r\n</b>                    (into phone)\r\n                How's he look?\r\n\r\n<b>                            MENDEL (O.S.)\r\n</b>                Busy.\r\n\r\n      Smiley puts the receiver on the arm of the chair, takes off\r\n      his shoes and in his stocking feet crosses the room. As he\r\n      does so he spools out a WASHING LINE, tying it to the far\r\n      door knob.\r\n\r\n\r\n<b>227   EXT. SAFE HOUSE - TOW PATH - NIGHT                          227\r\n</b>\r\n      Guillam, waits on the tow-path looking back at the house.\r\n\r\n      Someone, presumably Smiley, is moving through the house,\r\n      turning the lights off until it is in complete darkness.\r\n\r\n<b>                            MENDEL (O.S.)\r\n</b>                Tailor...\r\n\r\n      A torch light flashes once from a downstairs window.\r\n\r\n<b>                          MENDEL (O.S.) (CONT'D)\r\n</b>                Here comes Soldier...\r\n\r\n\r\n<b>228   INT. SAFE HOUSE - LISTENING ROOM - NIGHT                    228\r\n</b>\r\n      Smiley sits in the darkness holding the phone to his ear.\r\n\r\n<b>                          MENDEL (O.S.)\r\n</b>                Full house.\r\n\r\n\r\n<b>229   INT. PARIS - CYPHER ROOM - NIGHT                            229\r\n</b>\r\n      The three men stand over the silent cypher machine. Tarr's\r\n      gun rammed into his belt. Tarr is almost glittering with\r\n      nerves. Then the machine clatters into life.\r\n<b>                                                                       106.\r\n</b>\r\n\r\n\r\n<b>                          RICKI TARR\r\n</b>                Read it aloud.\r\n\r\n      Ben starts to read, his high, rather imperious schoolboy\r\n      voice carries over the next few shots...\r\n\r\n<b>                          BEN\r\n</b>                Personal for Tarr from\r\n                Alleline...\r\n\r\n\r\n<b>230   INT. CIRCUS - ARCHIVE LIFT - NIGHT                         230\r\n</b>\r\n      A shot of the archive room, of the lift full of secrets\r\n      slowly being lowered into the ground.\r\n\r\n<b>                          BEN (V.O.)\r\n</b>                ... require clarification before\r\n                meeting your request...\r\n\r\n      ON THE DOOR OF THE WAR-ROOM resolutely closed, a slither of\r\n      light burning beneath it.\r\n\r\n\r\n<b>231   INT. TAILORS SHOP - NIGHT                                  231\r\n</b>\r\n      The tailors dummies standing to attention, as alert as\r\n      Mendel watching from the window, phone to mouth.\r\n\r\n<b>                          BEN (O.S.)\r\n</b>                ... Quote information vital to\r\n                safeguarding of the Circus\r\n                unquote does not qualify...\r\n\r\n\r\n<b>232   INT. PARIS - CYPHER ROOM - NIGHT                           232\r\n</b>\r\n      Tarr has begun to laugh, gripped by a weird hilarity.    Ben\r\n      reads even faster.\r\n\r\n<b>                          BEN\r\n</b>                ... send further information.\r\n\r\n<b>                          RICKI TARR\r\n</b>                That's the way Percy boy! You\r\n                keep stalling. I better warn you\r\n                Ben, there's some lousy people in\r\n                this outfit. Don't trust a\r\n                fucking one of them.\r\n\r\n\r\n<b>233   INT. SAFE HOUSE - LISTENING ROOM - NIGHT                   233\r\n</b>\r\n      Smiley sits in the BLACKNESS.\r\n<b>                                                                        107.\r\n</b>\r\n\r\n\r\n<b>      SMILEY'S P.O.V.\r\n</b>\r\n      The washing line extends ahead of him, glowing faintly\r\n      white in the darkness.\r\n\r\n      The tinny sound of Mendel's voice comes from the receiver\r\n      beside him...\r\n\r\n<b>                          MENDEL (O.S.)\r\n</b>                Mister Smiley...\r\n\r\n      Smiley picks up the receiver.\r\n\r\n<b>                          SMILEY\r\n</b>                I'm here, Mendel.\r\n\r\n<b>                          MENDEL (O.S.)\r\n</b>                One's gone.\r\n\r\n      Smiley puts the receiver back on the armchair. He goes to\r\n      the window in his stockinged feet.\r\n\r\n\r\n<b>234   EXT. SAFE HOUSE - TOW PATH - NIGHT                          234\r\n</b>\r\n      Guillam, nerves taut, sees three long flashes. The mole is\r\n      coming.\r\n\r\n\r\n<b>235   EXT. SAFE HOUSE - NIGHT                                     235\r\n</b>\r\n      A long silent look at the dark house. Then the star of\r\n      light spilling into the darkness from the air vent.\r\n\r\n\r\n<b>236   INT. SAFE HOUSE - LISTENING ROOM - NIGHT                    236\r\n</b>\r\n      Smiley, calm and contained, hears the sound of a CAB\r\n      drawing up outside.\r\n\r\n      A pair of footsteps on the path.\r\n\r\n      Scrape of a key in the door.\r\n\r\n      A pale rim of light appears around the kitchen door.\r\n\r\n      And outside the sound of a second cab drawing up.\r\n\r\n      Someone else enters the house. Movement in the kitchen. Two\r\n      men's voices start to speak in Russian.\r\n\r\n      Smiley gets up, GUN in one hand, and guided by the line,\r\n      makes his way through the darkness to the door of the\r\n      kitchen, groping, rather like a blind man walking towards\r\n      the light.\r\n<b>                                                                      108.\r\n</b>\r\n\r\n\r\n<b>                          POLYAKOV (O.S.)\r\n</b>                    (In Russian)\r\n                What is your cover story in case\r\n                we are disturbed?\r\n\r\n      The sound of ANOTHER voice answering in Russian from\r\n      further back in the room.\r\n\r\n      ON Smiley inching across the room.\r\n\r\n\r\n<b>237   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                    237\r\n</b>\r\n      The tape recorder working...\r\n\r\n<b>                          POLYAKOV (O.S.)\r\n</b>                    (on tape, in Russian)\r\n                This can be salvaged. Tarr can be\r\n                found and liquidated.\r\n\r\n\r\n<b>238   EXT. SAFE HOUSE - TOW PATH - NIGHT                        238\r\n</b>\r\n      Guillam waits. He turns, his nerves taut, searching the\r\n      shadows for movement. For a moment he's certain he's being\r\n<b>      WATCHED.\r\n</b>\r\n      Then, from the house, the signal he's been waiting for.\r\n      Three long flashes. Guillam starts to run.\r\n\r\n\r\n<b>239   EXT. SAFE HOUSE - TOW PATH - NIGHT                        239\r\n</b>\r\n      A nervous Lacon is waiting on a corner, Guillam runs past.\r\n\r\n<b>                             PETER GUILLAM\r\n</b>                He's here.\r\n\r\n<b>                          OLIVER LACON\r\n</b>                I won't have bloodshed. I want\r\n                absolute calm!\r\n\r\n      A cab appears and Mendel jumps out. Mendel and Lacon hurry\r\n      towards the house, Guillam sprinting ahead.\r\n\r\n\r\n<b>240   INT. SAFE HOUSE - GROUND FLOOR - NIGHT                    240\r\n</b>\r\n\r\n<b>      CLOSE ON THE TAPE SPOOL - REVOLVING\r\n</b>\r\n      ... churning the SILENCE. The sounds of the house\r\n      amplified. No one talking. Perhaps the faintest of coughs.\r\n\r\n\r\n<b>241   EXT. SAFE HOUSE - NIGHT                                   241\r\n</b><b>                                                                       109.\r\n</b>\r\n\r\n\r\n<b>      GUILLAM'S P.O.V.\r\n</b>\r\n      Racing towards the FRONT DOOR and bursting through, into\r\n      the hallway and on up the stairs, taking them three at a\r\n      time, bursting through into...\r\n\r\n\r\n<b>242   INT. SAFE HOUSE - MEETING ROOM - NIGHT                     242\r\n</b>\r\n      An oddly formal scene. POLYAKOV stands pipe in hand.\r\n\r\n      Smiley sits in a chair, GUN in hand. Absurdly, still in his\r\n<b>      STOCKING FEET.\r\n</b>\r\n      And opposite him sits BILL HAYDON.\r\n\r\n      They all turn to look at Guillam who stands panting in the\r\n      doorway.\r\n\r\n\r\n<b>      ON GUILLAM\r\n</b>\r\n      ... as his nerves and excitement and any hope he might have\r\n      had of a sense of victory DRAINS AWAY, leaving him with\r\n      just an odd sense of embarrassment and shame.\r\n\r\n\r\n<b>243   EXT. SARRATT - DAY                                         243\r\n</b>\r\n      Nissan huts surround a cricket field. Two cadets run laps.\r\n\r\n      Smiley walks towards one of the huts, stops as Alleline\r\n      walks out. Alleline, a broken man, can barely look at him.\r\n      With a nod he walks on.\r\n\r\n\r\n<b>244   EXT. SARRATT - NISSAN HUT - DAY                            244\r\n</b>\r\n      An unshaven, exhausted Haydon stands outside the Sarratt\r\n      building in a small fenced enclosure. We see Smiley walking\r\n      towards him. He's brought a box of cigarettes.\r\n\r\n\r\n\r\n<b>245   INT. SARRATT - DAY                                         245\r\n</b>\r\n      Haydon is weeping quietly but without emotion. Smiley\r\n      offers Haydon the box of Cigarettes.\r\n\r\n<b>                             SMILEY\r\n</b>                   I was assured there would be no\r\n                   coercion.\r\n\r\n      Haydon waves it away. Smiley hands him a clean handkerchief.\r\n<b>                                                           110.\r\n</b>\r\n\r\n\r\n<b>                    BILL HAYDON\r\n</b>          It's almost funny George. I know\r\n          the Inquisitors little bag of\r\n          tricks. I taught most of them.\r\n          Don't mind the tears. Just a\r\n          reaction. An over-reaction, if you\r\n          like. Craddox says I'll be off in a\r\n          few days. I keep thinking how I'm\r\n          going to miss the cricket in\r\n          Moscow.\r\n\r\nHe weeps again.\r\n\r\n<b>                    BILL HAYDON (CONT'D)\r\n</b>          I rather hoped you would do a\r\n          little light house-keeping for me.\r\n\r\n<b>                       SMILEY\r\n</b>          If I can.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          There's a girl...Would you give her\r\n          some money for me? Give her a good\r\n          cover story. If it helps tell her I\r\n          love her. It's all here.\r\n\r\n<b>                       SMILEY\r\n</b>          Of course.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          There's a boy too. Bung him a few\r\n          quid to shut him up. Take it out of\r\n          the reptile fund.\r\n\r\n<b>                    SMILEY\r\n</b>          I did have one or two questions.\r\n          About Prideaux.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          Damn it! I got him back, didn't\r\n<b>          I?\r\n</b>\r\n<b>                    SMILEY\r\n</b>          Yes, yes you did. That was good\r\n          of you. (Beat) I'm surprised\r\n          Karla didn't shoot him. Or do you\r\n          think he held back out of\r\n          delicacy towards you?\r\n\r\nNo response. Smiley looks carefully at Haydon's profile.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>          Did Prideaux come and see you\r\n          before he left on his Hungarian\r\n          mission?\r\n\r\n<b>                    BILL HAYDON\r\n</b>          Yes, as a matter of fact he did.\r\n<b>                                                               111.\r\n</b>\r\n\r\n\r\n<b>                    SMILEY\r\n</b>          To say what?\r\n\r\nHaydon stares at him. For the first time the tears seem\r\nreal. Guilt and grief. He looks down. A long pause.\r\n\r\n<b>                    SMILEY (CONT'D)\r\n</b>              (almost to himself)\r\n          To warn you. Because he knew,\r\n          deep down, it was you all along.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          So did you.\r\n\r\nHaydon stares out, lost in thought.\r\n\r\n<b>                    BILL HAYDON (CONT'D)\r\n</b>          I had to pick a side George. It was\r\n          an aesthetic choice as much as a\r\n          moral one. The West has grown so\r\n          very ugly, don't you think?\r\n\r\nSmiley doesn't answer. A moment of silence.\r\n\r\n<b>                    SMILEY\r\n</b>          Did Karla ever consider having you\r\n          take over the Circus?\r\n\r\nFor a moment Haydon looks rattled.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          I'm not his bloody office boy.\r\n\r\n<b>                    SMILEY\r\n</b>          What are you then?\r\n\r\nHaydon turns to Smiley, a flash of hauteur.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          I'm someone who made his mark.\r\n\r\nSmiley watches him, feeling him shrink in stature before his\r\neyes. Haydon lights a cigarette.\r\n\r\n<b>                    SMILEY\r\n</b>              (Quietly)\r\n          Is there anything you want me to\r\n          pass on to Ann?\r\n\r\nFor a moment Haydon looks genuinely puzzled.\r\n\r\n<b>                    BILL HAYDON\r\n</b>          Oh, that was nothing personal,\r\n          George, I hope you understand that?\r\n          Karla said you were good, the one\r\n          we had to worry about. But you do\r\n          have a blind spot.\r\n<b>                    (MORE)\r\n</b><b>                                                                        112.\r\n</b>\r\n<b>                          BILL HAYDON (CONT'D)\r\n</b>                He reckoned if I was known to be\r\n                Ann's lover you wouldn't be able\r\n                to see me straight. And he was\r\n                right, up to a point.\r\n\r\n<b>                          SMILEY\r\n</b>                Up to a point.\r\n\r\n\r\n<b>246   INT. CONTROL'S FLAT - DAY                                   246\r\n</b>\r\n      The flat is now empty, cleared of Control's possessions.\r\n      Smiley looks around, places a CHESS PIECE on the piano. We\r\n      see the piece bears the name HAYDON.\r\n\r\n<b>                          SMILEY\r\n</b>                    (Quietly)\r\n                \"Tailor.\"\r\n\r\n      He walks away.\r\n\r\n\r\n<b>247   EXT. SMILEY'S HOUSE - DAY                                   247\r\n</b>\r\n      George comes up his path, looking old and tired.\r\n\r\n\r\n<b>248   INT. SMILEY'S HOUSE - DAY                                   248\r\n</b>\r\n      He stops still inside his doorway. The little figure on the\r\n      console table is in the wrong position. Smiley puts his\r\n      hand on it, but doesn't right it, listening to something\r\n      from somewhere inside the house. A faint movement.\r\n\r\n      Through the HALF OPEN KITCHEN DOOR we catch a glimpse of a\r\n      WOMAN beyond. ANN is back.\r\n\r\n      Smiley stands with his back to us, still in his coat,\r\n      staring through the door at his wife beyond. Something of a\r\n      Vermeer in the image.\r\n\r\n      He's absorbing the different atmosphere - home. Deciding\r\n      whether to go in. Or not.\r\n\r\n      Suddenly we hear MUSIC - JULIO IGLESIAS, singing a disco\r\n      version of LA MER - very seventies.\r\n\r\n<b>      CUT TO:\r\n</b>\r\n\r\n<b>249   INT. CIRCUS - FIFTH FLOOR PARTY - NIGHT - PAST              249\r\n</b>\r\n      The same lively Christmas PARTY at the Circus we saw\r\n      earlier. BILL HAYDON, a little drunk and happy, works his\r\n      way through the packed room, dancing to the Iglesias'\r\n      track, a drink in each hand, a little tongue-in-cheek,\r\n      singing along.\r\n<b>                                                                      113.\r\n</b>\r\n\r\n\r\n<b>      HAYDON'S P.O.V.\r\n</b>\r\n      ... other members of the Circus glimpsed as we pass them -\r\n      CONNIE SACHS, WESTERBY, BLAND, drunk, grinning at us. TOBY\r\n      ESTERHASE talking to one of the SECRETARIES...\r\n\r\n      The MUSIC continues as we find...\r\n\r\n      CONTROL and SMILEY\r\n\r\n      ...sitting a little apart, talking. Haydon is still working\r\n      his way through the party...\r\n\r\n      We PASS PERCY ALLELINE and his DRUNK WIFE. Alleline looking\r\n      fretful and hoping no-one is noticing the scene she is\r\n      making...\r\n\r\n      Haydon grins at all his comrades, feeling fond of everyone,\r\n      but heads on to his destination...\r\n\r\n      PRIDEAUX sits watching him come with a drink towards him,\r\n      shakes his head, but can't help but smile fondly at the idiot\r\n      Haydon is prepared to make of himself...\r\n\r\n\r\n<b>250   OMITTED                                                  250\r\n</b>\r\n\r\n<b>251   OMITTED                                                  251\r\n</b>\r\n\r\n<b>252   OMITTED                                                  252\r\n</b>\r\n\r\n<b>253   OMITTED                                                  253\r\n</b>\r\n\r\n<b>254   EXT. SARRATT - EVENING - PRESENT                         254\r\n</b>\r\n      The music continues as we see two cadets are running on the\r\n      circuit, their white t-shirts only just visible in the\r\n      dark.\r\n\r\n      Haydon sits on his bench, smoking, watching them flit by.\r\n      He smiles to himself, remembering. He senses something,\r\n      turns and looks back. Prideaux stands in the shadows behind\r\n      him, some fifteen foot away. The two men stare at each\r\n      other, then Haydon turns back to watch the runners.\r\n\r\n      We HOLD CLOSE on his face as Prideaux approaches, the only\r\n      sound the soft wind and his hushed footsteps growing loser.\r\n\r\n      Finally...\r\n\r\n<b>                             BILL HAYDON\r\n</b>                       (Of the runners)\r\n                   Just like us Jim. (Beat) Best\r\n                   days.\r\n<b>                                                                          114.\r\n</b>\r\n\r\n\r\n        A rifle is placed on the side of his head - the same\r\n        execution shot that we saw used on Irina - the force\r\n        blowing him sideways out of the frame.\r\n\r\n        As the music continues we...\r\n\r\n<b>                                                        CUT TO:\r\n</b>\r\n\r\n<b>255     EXT. SARRATT - DAWN                                         255\r\n</b>\r\n        Frost on the grass. We find a CADET staring down at the\r\n        corpse of Haydon leaning against the back of the bench,\r\n        outlined in silver frost.\r\n\r\n        The music ends.\r\n\r\n\r\n<b>256     INT. PRIDEAUX'S CARAVAN - DAY                               256\r\n</b>\r\n        Prideaux sits on his bed. From outside - the sound of a\r\n        football game. Someone taps on the door. Low. Taps again.\r\n        Prideaux, coiled with grief and anger, suddenly gets up.\r\n\r\n\r\n<b>257     EXT. PRIDEAUX'S CARAVAN - DAY                               257\r\n</b>\r\n        Roach stands in the doorway, carrying a gift - a boot-\r\n        scrape made in woodwork.\r\n\r\n<b>                            ROACH\r\n</b>                  I made you something.\r\n\r\n        Prideaux stares at the boot scrape.\r\n\r\n<b>                            PRIDEAUX\r\n</b>                  I don't want you hanging around\r\n                  here. Keep away from me from now\r\n                  on. Go and join the others.\r\n\r\n        Roach stands frozen.\r\n\r\n<b>                            PRIDEAUX (CONT'D)\r\n</b>                  Just bloody join in. Go and play\r\n                  damn you.\r\n\r\n        He watches Roach walk to the edge of the field and stand\r\n        mutely at the side. A ball rolls towards him. Roach goes to\r\n        kick it. Misses. He tries again, RUNNING OUT OF SHOT.\r\n\r\n\r\n257aA   EXT. PARIS DEPARTMENT STORE - EVENING                     257aA\r\n\r\n        Tarr is walking through a busy street. He stops to light a\r\n        cigarette. A woman in a YELLOW dress appears, reflected in\r\n        the glass. She's holding the hands of two children. For a\r\n        moment it looks like Irina.\r\n<b>                                                                         115.\r\n</b>\r\n\r\n\r\n       Tarr spins round, but the woman has disappeared. He stares\r\n       after her, hoping to catch a glimpse of her again.\r\n\r\n\r\n<b>257A   EXT./INT. CIRCUS - GROUND-FLOOR LOBBY - DAY                257A\r\n</b>\r\n       Smiley walks back into the lobby, hesitates for a moment,\r\n       then pushes on through the turnstile.\r\n\r\n\r\n<b>258    INT. CIRCUS - CONFERENCE ROOM - DAY                         258\r\n</b>\r\n       George takes his place at the baronial chair. He examines\r\n       the CHESS PIECE in his hand. We see it is labelled KARLA.\r\n       He toys with it for a moment, then places it on the table\r\n       in front of him, clears his throat.\r\n\r\n<b>                           SMILEY\r\n</b>                 Shall we begin?\r\n\r\n       Through the open door Smiley's new inner circle begin to\r\n       enter and take their place at the table around him.\r\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Tinker-Tailor-Soldier-Spy.jpg\"/>\n</td><td><h1>Tinker Tailor Soldier Spy</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Bridget O'Connor\" title=\"Scripts by Bridget O'Connor\">Bridget O'Connor</a>  <a href=\"/writer.php?w=Peter Straughan\" title=\"Scripts by Peter Straughan\">Peter Straughan</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Tinker Tailor Soldier Spy Script.html#comments\" title=\"Tinker Tailor Soldier Spy comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:18:25.770003"}