{"title": "TMNT", "film_link": "/Movie Scripts/TMNT Script.html", "script_link": "/scripts/TMNT.html", "info_raw": "\n\nTMNT Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (3.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Kevin Munroe\nGenres  Animation  Action  Adventure  Comedy  Drama  Fantasy\nScript Date : August 2005\nMovie Release Date : March 2007\n\nRead \"TMNT\" Script\n\n\n", "script": "\n\n\n\n \n                                     TMNT\n\n\n\n\n                                  Written by\n          \n                                 Kevin Munroe\n\n\n\n                                  Created by\n\n                         Kevin Eastman & Peter Laird\n\n\n\n\n\n          \n                                                  First Draft Polish\n                                                      August 5, 2005\n\n          \n\n              FADE IN:\n\n          \n\n          \n\n              EXT. STAR-FILLED SKY - NIGHT                                  1\n\n              Studio logo transitions into a CONSTELLATION in space. Cam\n              pulls BACK, as more stars enter frame, forming a starfield.\n\n                                   SPLINTER (V.O.)\n                         A sensei once counseled a grief-\n                         stricken boy, as his older brother\n\n          3\n                         prepared to leave for battle.\n               N STARS - Begin to see a DOZEN or so stars, almost forming a\n              zig-zagged line. Cam continues to adjust.\n\n                                   SPLINTER (V.O.)\n\n                         .\n                         He said, \"Child, why do you cry?\n                         You are both part of a family. And\n                         a family is a bond that cannot be\n                         broken by war. By strife. By force\n                         or neglect.\n               N STARS - Cam slows its truck-out to a gradual stop as we\n              see the pattern beginning to form. As if following the stars'\n              pattern, the CAM LOWERS as we find ourselves going into-\n\n                                   S\n\n          \n\n          2                                                                 2\n\n              EXT. SOUTH AMERICAN JUNGLE - CONTINUOUS\n\n\n                                    PLINTER (V.O.)\n                         And more importantly, you are\n                         brothers. And brothers you shall\n                         remain, despite time... argument...\n\n              O\n              LOWER - framing the tops of JUNGLE, moonlit and surrounded by\n              mist. A mountain range peaks over the horizon.\n\n                                   SPLINTER\n                          ..and even... distance.\n\n              SUPER TITLE: SOME STINKING JUNGLE IN SOUTH AMERICA\n              CAM RESTS atop an old CHURCH ROOF. The peaceful scene is\n              suddenly stopped by a MACHINE GUN BURST! CAM CRANES over the\n\n              O\n              roof revealing -\n\n          \n\n          \n\n                                                                            3\n\n              EXT. JUNGLE VILLAGE - CONTINUOUS\n\n              A relatively modern village... for a remote jungle. Dawn is\n              JUST barely beginning to break. The morning mist persists as\n              we see FOUR FEDERALES with machine guns surrounding a group\n              of VILLAGERS.\n\n              O\n               N GROUND - A WOMAN VILLAGER is thrown down. Her SON, 8, runs\n\n          1\n              to her side. She's mad. Her son cries.\n\n          \n\n                                                                          2.\n\n          \n\n          \n\n          \n\n                                  WOMAN VILLAGER\n                        You monsters!\n              UP ANGLE - As we see the THREE FEDERALES, greasy men, holding\n              AK-47's, and looking down with hardened indifference. OS, we\n              hear an EVIL CHUCKLE. The men part as we see-\n              - COL. PANTERA. A bottom-heavy disgusting pig of a man walks\n              up between them. Pantera leans down, face to face with her.\n\n                                  PANTERA\n                        We appreciate the generous donation\n                        for the continued protection of\n                        your village.\n              ANGLE ON - Their jeep, overflowing with the Village's\n              precious crops.\n              WIDER - A tiny group (10) of other villagers stand at a safe\n              distance. The Woman's HUSBAND runs forward. He immediately\n              LUNGES at Pantera, just as-\n              -SHIKA-SHIKA - Pantera is flanked by 3 MACHINE GUNS pointed\n              at the Husband's chest. Pantera slothfully grins. He leans\n              forward and yanks an HEIRLOOM NECKLACE from her neck.\n\n                                  PANTERA\n                        After all, the jungle can be a very\n                        dangerous place. BAH-HAHAHAHA.\n              They jump into the Jeep and tear into the jungle LAUGHING.\n\n          \n\n          \n\n              EXT. JUNGLE ROAD - MOMENTS LATER\n\n\n          4                                                                    4\n              The jeep clamors down the bumpy makeshift path. Pantera sits\n              in the passenger seat as the others are crammed in around the\n              food. The Jungle looms ominous around them.\n\n              H\n               IGH ANGLE - As we watch the jeep from the jungle ceiling\n              high above... as if from someone's POV.\n              ON DRIVER - He suddenly reacts to a fallen tree on the road\n              ahead. Slams on the brakes. Pantera is thrown around.\n\n                                  PANTERA\n                        Idiota! Watch where you're going!\n\n                                  DRIVER SOLIDER\n                        There's a log on the road, senor.\n                            (quietly to himself)\n                        ...that wasn't there an hour ago.\n\n                                   PANTERA\n                        Well, what are you waiting for?!\n\n                        REMOVE IT!\n                            (to soldiers behind)\n                        Cortez! Andelay!\n\n          \n\n                               B\n\n          \n\n          \n\n          \n\n          \n\n          J\n\n          \n\n          \n\n          \n\n          \n\n                                                                     3.\n\n          \n\n          \n\n          \n          CORTEZ leaps out. Grabs the winch from the front of the jeep\n          and pulls it to the log, roughly 15 feet away.\n           EEP POV - Pantera and Driver barely notice the out-of-focus\n          bg Cortez get suddenly YANKED out of scene!\n\n                               CORTEZ (O.S.)\n                    ...yirk!\n          ON DRIVER - His eyes go wide. Trying to see in the dark.\n\n                              DRIVER SOLIDER\n                        (softly, nervous)\n                    D-d-dios mio.\n          ON LOG - Cortez is gone. Pantera wakes up.\n\n                              PANTERA\n                    What?! WHAT IS IT?!\n          OS - Hear the sound of a CHAIN clinking. Then WHOOSHING as\n          the chain winch suddenly FLIES IN, and CRACKS the BURLY\n          SOLDIER across the jaw! It wraps itself around his neck.\n          Before he can react...\n          - YOINK! He gets pulled over the hood of the jeep, landing on\n          the ground HARD.\n\n                                URLY SOLDIER\n\n                    OOF!\n          Burly gets pulled backward... away from the Jeep and into...\n          the darkness. He SCREAMS the entire way, clawing the ground.\n          ON JEEP - Driver is freaking out now. Last Soldier is in the\n          back. Pantera stands up in the jeep. \"Last\" jumps out and\n          readies his machine gun.\n\n                              PANTERA\n                        (to Jungle)\n\n                    WHO ARE YOU?! SHOW YOURSELF!!\n\n                              DRIVER SOLIDER\n\n                        (WHISPER)\n                    ...The Ghost of the Jungle.\n\n                               PANTERA\n                    What?!\n\n                              DRIVER SOLDIER\n\n                           (\n                         shaking/nervous)\n                    The jungle god that punishes those\n                    who prey upon the weak.\n                        (looks scared to Pantera)\n                    He's coming... for us.\n\n          \n\n              O\n\n          \n\n          \n\n          \n\n          \n\n                                  P\n\n          \n\n          \n\n          \n\n          \n\n              I\n\n          \n\n          \n\n          \n\n          \n\n                                                                          4.\n\n          \n\n          \n\n          \n              OS NOISE - Suddenly hear the whooshing of 4 quick punches,\n              kicks, a short machine gun burst and a WHUMP. Pantera and\n              Driver look to the ground.\n              ON GROUND - Last Soldier lays beaten on the jungle floor.\n\n                                  DRIVER SOLIDER\n                        I'm sorry, senor.\n              Driver bounds out of the Jeep and runs SCREAMING into the\n              jungle. CAM PULLS BACK with him as Pantera shrinks in bg.\n\n                                  PANTERA\n\n                        COWARD!! GET BACK HERE!!\n              Something suddenly skitters behind Pantera! He turns to look.\n              Nothing. He reaches down and pulls up... a MACHETE.\n\n                                  PANTERA\n\n                        SHOW YOURSELF! DO YOU REALIZE WHO\n\n                        YOU'RE DEALING WITH?!\n              ON PANTERA - He circles backs against the Jungle wall, trying\n              to find him. Tense. Suddenly-\n              -a PAIR OF WHITE EYES open in the blackness behind him!\n               n a quick series of shots we see Pantera getting the raw end\n              of a flurry of fist and foot attacks. His attacker is moving\n              way too fast for the camera to keep up.\n              Pantera falls back, panting heavily. Panicked. He tears off\n              into the dense Jungle!\n              ON PANTERA RUNNING THROUGH JUNGLE - Thick foliage. Panicked.\n\n          \n\n          \n\n              EXT. JUNGLE CLEARING - CONTINUOUS\n\n\n          5                                                                    5\n              An oasis of calm, violated by this sweating, machete-\n              clutching brute. He stumbles, then stands in the middle.\n\n                                    ANTERA\n                        I am not afraid of a myth!\n                            (eyes darting)\n\n                                  A\n\n                        I'M NOT AFRAID OF A GHOST!\n\n                                   TTACKER (O.S.)\n                        Actually... it's \"Turtle\", pal.\n              Pantera swings around. Eyes wide.\n               N ATTACKER - We pan up the thick green legs. Muscular and\n              strong. Further up. Arms to match. Rough skin. It wears a\n              shorn HOODED PONCHO. Inside are two white eyes and gritted\n              smiling teeth.\n              The poncho falls to the ground.\n\n          \n\n                                                                       5.\n\n          \n\n          \n\n          \n              ON ATTACKER - It's LEONARDO! Beaten blue bandana blowing in\n              the breeze. Total hero shot. He pulls out a SINGLE KATANA\n              SWORD, poised for battle. Pantera's backed into a corner.\n\n                                  PANTERA\n                        Let's see if a ghost can die, then.\n              Pantera SCREAMS and runs to Leo and starts swinging! At the\n              CLASH of sword and machete, we-\n\n                                                          SMASH CUT TO:\n\n          \n\n          \n\n          6                                                                 6\n\n              EXT. JUNGLE VILLAGE - MOMENTS LATER\n\n              The Boy is still at the Village Clearing. Suddenly -\n              - the sound of the JEEP begins to rumble in the distance! The\n              villagers panic and scatter. VROOM! The Jeep flies out of the\n              jungle and bounce-slows into the FG!\n              Only there is no one driving it... and it still has the\n              stolen food in it. And the stolen medallion dangles from the\n              rear view mirror.\n\n                                  WOMAN VILLAGER\n                        It's a miracle!\n              The village rejoices. The Boy steps aside for a beat, looks\n              back at the Jungle. Something catches his eye.\n              ...a small crouched figure on a tree branch. Barely\n              silhouetted. His white eyes lit in the darkness. One of them\n              WINKS as the boy smiles.\n\n                                   B\n\n                                   OY VILLAGER\n                            (beaming... softly)\n                        The Ghost of the Jungle.\n\n          \n\n          \n\n              INT. UNDERGROUND CAVERN - LATER\n\n\n          7                                                                 7\n              Leo leaps into frame. He takes out his katanas and lays them\n              carefully on the ground. He KNEELS, head bowed, eyes closed.\n\n                                  LEONARDO\n                        My training is now complete.\n              The camera lifts away from Leo... and then PLUNGES into the\n              nearby CAVERN. MUSIC begins to swell. Cam travels a few feet\n              until it DIPS TO BLACK, and comes up beginning our-\n\n                             OPENING CREDIT SEQUENCE\n\n          \n\n              E\n\n          \n\n          \n\n          \n\n          \n\n              T\n\n          \n\n          \n\n          \n\n          \n\n                                                                       6.\n\n          \n\n          \n\n          \n\n          \n\n          8                                                                 8\n\n              INT. MISCELLANEOUS SEWER, OIL AND IRRIGATION PIPES\n\n              The music is in full tilt as the camera travels through\n              seemingly miles of underground pipes of all types and design.\n               he camera comes to the end of line. It rises up through\n          9   STEAM... then through a metal grate, as we find ourselves in-\n\n          \n\n          \n\n              EXT. NEW YORK CITY STREET - NIGHT                             9\n\n              A mouse-level shot of the spectacular city that never sleeps.\n              It's oddly hypnotic. Still. Until...\n              - BAM! A pair of sneakers land barely in front of the camera,\n              tearing off into the distance.\n\n                                  NYPD #1 (O.S.)\n\n                        FREEEZE! STOP OR WE'LL SHOOT!\n              Shoes belong to a panicked MUGGER, early 20's, as THREE NYPD\n              OFFICERS clamor after him. The Mugger is a jackrabbit -\n              hopping newspaper machines, rolling under passing trucks and\n              doing anything he can to avoid arrest.\n               ventually the NYPD peter out. The mugger looks back. Smiles.\n\n                                  MUGGER\n                        Heh, heh... suckers.\n              ON MUGGER - His eyes suddenly go wide as - VROOOOOM! - we see\n              a jet-black tweaked out motorcycle fly over the cops' heads,\n              aiming directly for Mugger!\n\n                                   MUGGER\n                        Whaaa!!!\n              The Mugger runs, but can't escape. The Driver is dressed in\n              all-black motorcycle leathers and black-visored helmet. Scary\n              and faceless. He quickly gains on the Mugger and GRABS him by\n              the collar in mid-stride!\n\n                                  MUGGER\n                        You crazy?! Put me down, man!\n              But Driver doesn't. Instead, he holds him lower without\n              stopping the bike... and proceeds to plow Mugger's head into\n              every trash can and garbage bin along 9th Avenue!\n\n                                  MUGGER\n\n                        OW! HEY! WHAT'RE YOU-OW!! OOF!\n              Just as it looks like he'll hit a telephone pole... Driver\n              veers left! He drags the Mugger into...\n\n          \n\n               O\n\n          \n\n          \n\n          \n\n          \n\n               A\n\n          \n\n          \n\n          \n\n          \n\n                                                                           7.\n\n          \n\n          \n\n          \n\n          \n\n          10                                                                10\n\n               EXT. DEAD END ALLEYWAY - CONTINUOUS\n\n               Driver tosses him onto the ground at full speed. Mugger\n               SLIDES down the alley and collides with a pile of garbage\n               like he's a human bowling ball.\n               ON HEAD OF ALLEY - The Driver guns the bike and kicks up a\n               ton of dust and racket, peeling donuts at mouth of the alley.\n               And then he stops. Dust slowly settles and smoke dissipates.\n\n                                   MUGGER\n                         Wh-wh-what kinda freak are you?!\n               The Driver gets off the bike. Silence. Backlit by headlight.\n               He walks directly to the Mugger with purpose. Mugger starts\n               to really freak out. Driver picks him up by the collar and\n               SLAMS him to the back WOODEN FENCE WALL.\n\n                                   MUGGER\n                         P-p-please. Don't kill me, man.\n               Driver just cocks his head. Mugger can see his own terrified\n               reflection his Driver's black visor. Driver reaches behind\n               his back and pulls out a COMBAT KNIFE! He reels back and...\n\n                                   MUGGER\n                         Wh-wha-wha-WHAT ARE YOU DOI- AAAGH!\n\n               W\n                HAM! - Driver nails the dagger through the Mugger's JACKET,\n               PINNING HIM TO THE WALL. Driver turns around to gather the\n               purse's belongings at the mouth of the alley.\n                fter he stops cringing, the Mugger wriggles the blade out of\n               the wall. Driver doesn't notice as - THWIP-IP-IP! - he hurls\n               the knife at the Driver!\n               THUNK! It sticks in the DRIVER'S BACK!\n                N MUGGER - His grinning eyes suddenly GO WIDE as Driver\n               slowly turns around, UNHURT! The Mugger is trapped as Driver\n               moves toward him... and a BOLO CHAIN drops to his side.\n               ON WALL SHADOW - as we see a flurry of punches, kicks and\n               throws as Driver lays a beating on the criminal who needs to\n               be taught a lesson. An OS Police Siren chirps.\n               MOUTH OF ALLEY - The police suddenly show up, cherries\n               flashing. They run to FG, mouths drop.\n\n                                    NYPD #1\n                         ...whoa.\n\n                                   NYPD #2\n                         The Nightwatcher.\n\n          \n\n                                                                           8.\n\n          \n\n          \n\n          \n               ON MUGGER - Hung upside down by a chain. Purse hangs from his\n               neck. He'll live, but never commit another crime again...\n\n          \n\n          \n\n          11                                                                11\n\n               EXT. NEW YORK CITY STREET - CONTINUOUS\n\n               CLOSE ON A NEWSSTAND - Headlines read \"WOMAN MYSTERIOUSLY\n\n               RESCUED FROM BURNING BUILDING\". \"POLICE SEEK MAN KNOWN AS\n\n               `THE NIGHTWATCHER' FOR QUESTIONING\". \"WHO IS THE\n\n               NIGHTWATCHER?\"\n               WIDER - A quieter area of the city. Broken by the squealing\n               of the bike as Driver (Nightwatcher) roars in to a stop.\n               Nightwatcher drives underneath a TRAIN BRIDGE. He takes off\n               his helmet. Red cloth spills out. He turns around as we see-\n\n               - RAPHAEL, THE RED-MASKED NINJA TURTLE!\n               He reaches back and pulls out the KNIFE from his SHELL. Looks\n               at it, shaking his head and grinning. He sheathes it.\n\n                                    R\n\n                                    APHAEL\n                         Heh, heh. Nice try, chump.\n               QUICK SHOTS - Ignites and revs engine. Straps helmet back on.\n               Headlight comes to life. Lets the clutch out.\n               VROOOOM! - CAM STARTS TIGHT ON bike as Raphael tears away.\n\n                                   MICHAELANGELO (O.S.)\n                         Dude... I'm scared!\n\n                                                                 CUT TO:\n               CLOSE ON - A PAIR OF TURTLE EYES... MICHAELANGELO'S! They're\n               wide with FEAR. Nervously darting around, unable to keep up\n               with the surrounding danger.\n\n                                   MICHAELANGELO\n                         Dude! They're all around me! What\n                         do I do? WHAT DO I DO?!\n               Mikey's eyes continue to panic. DONATELLO's voice comes in\n               over a RADIO. Calming.\n\n                                   DONATELLO (O.S.)\n                         Just relax, Mikey. Remember your\n                         training. You'll be fine.\n\n                                   MICHAELANGELO\n                         But I need back up this time, man!\n\n                         BACK UP!\n\n                                   DONATELLO (O.S.)\n\n                             (SIGHS)\n                         ...you're such a prima donna.\n\n          \n\n                                                                          9.\n\n          \n\n          \n\n          \n\n               CAM PULLS BACK TO REVEAL WE'RE IN-\n\n          \n\n          \n\n          12                                                                  12\n\n               INT. UPTOWN APARTMENT - AFTERNOON\n\n               The cam pulls out of a LARGE MASCOT HEAD - looks like a big\n               goofy Turtle head with googly eyes and dumb smile. WIDER we\n               see a fake ZIPPER spirit-glued onto Mikey's plastron. In his\n               hands, he holds two nerf-styled NUNCHUCKS.\n\n                                   MICHAELANGELO\n                             (from inside mascot head)\n                         Okay - waita-WHOA-WHOA-WHOA-WHOA!!\n               Suddenly TEN KIDS WITH BIRTHDAY HATS AND FOAM NUNCHUCKS run\n               in SCREAMING and start beating on Mikey... a little too hard.\n\n                                   SCREAMING KIDS\n                         Get him! Yeah! You suck! Hey!\n                         Awright! Take that, Turtle-dork!\n\n                                   MICHAELANGELO\n\n                         OH-WHOA! OW! YEOW-OW-OW! WATCH IT!!\n\n                         HEY! NOT BELOW THE-OOOFF!! OW!!\n               End WIDER with the kids all walking away from Mikey, now on\n               the floor doubled over from the \"playing\". A beat, then-\n               -one more kid runs back and kicks Mikey.\n\n                                   LITTLE GIRL\n\n                         KEEEEYA!\n                             (turns and walks back)\n                         This was the best birthday ever,\n                         Mommy!\n               Mikey GROANS as we-\n\n                                                               DISSOLVE TO:\n\n          \n\n          \n\n          13                                                                  13\n\n               EXT. UPTOWN APARTMENT - SUNSET/LATER\n\n               Beautiful downtown autumnal street. Parked in front, we see\n               the \"COWABUNGA CARL\" PARTY VAN loudly decorated in kid-\n               friendly colors with an embarrassing and low-tech looking\n               TURTLE HEAD ON TOP. PUSH IN on upstairs apartment window.\n\n                                    S\n\n                                    OCCER MOM (O.S.)\n                         Thanks so much. You're worth every\n                         penny. I have to tell all my\n                         friends about you. You'll love\n                         their kids too.\n\n          \n\n                                                                        10.\n\n          \n\n          \n\n          \n\n          \n\n          14                                                                14\n\n               INT. UPTOWN APARTMENT - CONTINUOUS\n\n               Mascot Mikey is standing at the door, holding a fistful of\n               cash, still in full costume.\n\n                                   MICHAELANGELO\n                         I can only hope they're as lovely\n                         as the rugrats you got here.\n               ON KIDS - They look tough, brandishing their nerf weapons - a\n               toddler street gang. One of the kids does a finger-point-then-\n               throat-slit gesture. The mom looks and beams. The kids\n               quickly smile to cover.\n\n                                   MICHAELANGELO\n                             (through gritted teeth)\n                         Such... angels.\n               Mikey looks to the side, and sees the still piled-high stack\n               of PIZZA BOXES through the fake head POV.\n\n                                   SOCCER MOM\n                         Okay! Everyone say good-bye to\n                         Cowabunga Carl! BYE!\n\n                                   MICHAELANGELO\n                             (put-on voice)\n                         Hyuk! Cowabunga dudes! Bye!\n\n                                     KIDS\n\n                         BYE!!!!!!\n               ON DOOR - As the door closes and Mom turns back, a green hand\n               reaches in quickly a grabs a box of pizza. The door closes.\n\n                                   MICHAELANGELO (O.S.)\n                         Heheh... score.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. UPTOWN APARTMENT - MOMENTS LATER\n\n\n          15                                                                15\n               Mikey opens the van's rear doors. He PULLS OFF the fake\n               zipper on his chest and then pulls off his fake turtle head.\n               His trademark orange bandana spills out.\n               He turns, breathing in the fresh surface air. A quiet beat\n               until - A POLICE SIREN approaches, faint, in the distance.\n               Mikey jumps in the van, slams the door shut as the car\n               whizzes by.\n               WIDER - the van takes off down the street.\n\n          \n\n                                                                       11.\n\n          \n\n          \n\n          \n\n                                   DONATELLO (O.S.)\n                         Hey, hey, hey... don't forget the\n                         face thing.\n\n          \n\n          \n\n          16                                                               16\n\n               EXT. NEW YORK CITY STREETS - LATER\n\n               CLOSE ON - a regular motorist sitting in his car at a traffic\n               light. Don monitors from a small dashboard cam. Man looks OS\n               Left. Reacts.\n               OFF HIS LOOK - We see Mikey beside him in the van. He's\n               behind the wheel - face FROZEN in a goofy SMILE like a\n               ventriloquist to \"hide\" his identity. Don follows on a small\n               surveillance cam under the rearview mirror.\n\n                                   MICHAELANGELO\n                         Yes... sir.\n\n                                   DONATELLO (O.S.)\n                         That's a good boy.\n\n                                   MICHAELANGELO\n                         All's I'm saying Donnie is that no\n                         one would notice if YOU did one of\n                         these gigs every now and again.\n\n                                    DONATELLO (O.S.)\n                         But you add such... panache to the\n                         character.\n               Mikey, emotional, pops into \"fully animated\" facial mode. He\n               rubs his sore neck.\n\n                                   MICHAELANGELO\n                         Well, if panache is French for\n                         \"punching bag\", I'd have to agree\n                         with ya.\n\n          \n\n          \n\n               INT. TURTLES LAIR - MONITOR ROOM - CONTINUOUS\n\n\n          17                                                               17\n               A darkened room lit only by the lights of dozens of tv's,\n               monitors and TV tubes. Cables run everywhere. In front of\n               them is DONATELLO - our resident tech-head turtle.\n\n                                   DONATELLO\n                         Close enough. I - uh-oh-\n               ON MONITOR - Don watches Mikey through a TRAFFIC CAM in front\n               of the van. Don is jacked into every major security and\n               surveillance camera in the city.\n\n          \n\n          \n\n               EXT. NEW YORK CITY STREETS - CONTINUOUS\n\n\n          18                                                               18\n\n                                   DONATELLO (O.S.)\n                         -you got a peeping tom.\n\n          \n\n                                    M\n\n          \n\n          \n\n          \n\n          \n\n                                                                          12.\n\n          \n\n          \n\n          \n               ON CAR - The Man is still looking - only now really freaked\n               out - at the fully animated Mikey head.\n\n                                    MICHAELANGELO\n                         Aw nuts.\n               Mikey suddenly grips his face back into a tight SMILE,\n               frozen. He looks over and waves at the man who confusingly\n               waves back.\n\n                                   MICHAELANGELO\n                             (ventriloquist style)\n                         Just get me outta here, dude.\n               ON DON - He hits some switches. Monitors change.\n\n                                   DONATELLO\n                         Traffic's clear eastbound for two\n                         blocks. Then hook up with route J.\n               BACK WITH MIKEY - He's still waving with a frozen smile.\n\n                                    ICHAELANGELO\n                             (ventriloquist style)\n                         Righteous.\n               Mikey immediately \"unfreezes\" and sticks his tongue out and\n               antics at the Man! Before the man can react, Mikey TEARS OUT\n               and zips across traffic down a deserted side-street.\n               ...as we notice the annoying ice cream style music tinkering\n\n                                    M\n               along with his gaining speed.\n\n                                    ICHAELANGELO (O.S.)\n                         You HAD to install the music too...\n\n                                   DONATELLO (O.S.)\n                         All part of the cover, my friend.\n\n                                                                  CUT TO:\n\n          \n\n          \n\n               EXT. HIDDEN ALLEYWAY - EVENING\n\n\n          19                                                                19\n               The van parks in a long-forgotten alleyway. A dummy gate\n               closes behind it, obscuring it from view.\n               UNDER THE VAN - We see it's parked over a manhole cover. It\n               slowly slides shut.\n\n          \n\n          \n\n               INT. SEWERS - CONTINUOUS\n\n\n          20                                                                20\n               The dripping concrete and metal maze explodes with the\n               cacophony of Mikey riding his skateboard, backpack in tow.\n\n                                   MICHAELANGELO\n\n                         YEEEEEHAAAAAAWWWW!!\n\n          \n\n                                                                       13.\n\n          \n\n          \n\n          \n               But this isn't just any half-pipe - it tests all of Mikey's\n               skills in ninjitsu, extreme sports and cross-training. He\n               jumps on and off the board to occasionally tackle obstacles\n               with all four limbs. A fun rock n' roll sequence.\n               Feels like Mikey is miles away from the surface world when he\n               arrives at a seemingly DEAD END. He smiles as he reveals a\n               BRICK DUMMY WALL that brings him to...\n\n          \n\n          \n\n               INT. TURTLES LAIR - CONTINUOUS\n\n\n          21                                                                21\n               Mikey lands in the \"foyer\" of sorts. Atop entrance stairs. He\n               kicks the double doors open.\n\n                                   MICHAELANGELO\n                         Honeeeeey! I'm hooome!\n               As Mikey slides down the banister, the cam dollies around\n\n               I\n               behind him revealing the LAIR. Breathtaking to fresh eyes.\n                t has a wonderful lived-in feel - they're not squatters...\n               they've made this their HOME. Furniture is jury-rigged and\n               the place is custom lit to provide the right kind of\n               atmosphere. If we looked behind the surface detail, we'd see\n               a mesh of wires and circuitry powering the entire lair.\n               Donatello runs up to Mikey. Mikey robotically hands him the\n               wad of money from the party.\n\n                                   DONATELLO\n                         Moneymoneymoneymoney.\n               As Donnie walks away, Mikey LOUDLY CLEARS HIS THROAT. Don\n               stops as Mikey holds out his hand. Don's busted - he peels\n               off a few bills and hands Mikey his share.\n\n                                   MICHAELANGELO\n                         Domo arigato, dude.\n               Mikey walks into the room and plops down on a sofa. Hits a\n               remote as a BIG SCREEN lights up in front of him. Suddenly-\n\n                                   SPLINTER (O.S.)\n\n                         MICHAELANGELO!\n               Mikey springs from the couch. Snaps to obedience.\n\n                                   MICHAELANGELO\n                         Yes, sensei.\n               ANGLE ON - SPLINTER the Japanese rodent master and father of\n               the TMNT. He is well-kempt, still walks with a cane, and has\n               the same sparkle in his eye. He approaches Mikey. Silent.\n\n                                   SPLINTER\n                             (a beat)\n                         Well?\n\n          \n\n               P\n\n          \n\n          \n\n          \n\n          \n\n                                                                        14.\n\n          \n\n          \n\n          \n\n                                   MICHAELANGELO\n                         Sensei?\n                             (thinks, then realizes)\n                         Oh! Here ya go, Master Splinter.\n               Mikey reaches into his bag and removes a foil-wrapped piece\n               of BIRTHDAY CAKE. Splinter lights up.\n\n                                   SPLINTER\n                         Ahh! Butter creme frosting!\n               Donatello walks to Splinter. Holds his hand out, judgmental.\n\n                                   DONATELLO\n                         Master. No cake. You remember your\n                         last cholesterol tests.\n\n                                   SPLINTER\n                         But I-\n                             (changes attitude)\n                         -Donatello! I am your Master!\n\n                                   DONATELLO\n                         Nice try, sensei. But you can still\n                         be my Master... with low\n                         cholesterol.\n               Splinter surrenders the cake. As Don walks away,\n               Michaelangelo reaches into his bag and secretly passes\n               Splinter a smaller wrapped piece.\n\n                                   SPLINTER\n                         He-heh. You have done well, my son.\n               Donatello walks to the fridge and opens it - FILLED with\n               dozens of other pieces of Birthday Cake leftovers. He tosses\n               it with the rest.                                  C\n\n                                                                  UT TO:\n\n          \n\n          \n\n               EXT. ROOFTOPS - SUNSET\n\n\n          22                                                                22\n               The street noise below is barely audible. Camera creeps along\n               the edge of the building, reaching a row of GARGOYLES.\n                AN ALONG GARGOYLES - Still. Concrete. Creepy. Just as we\n               pass the fourth, we barely notice it's WHITE EYES OPENING.\n               QUICK SNAP BACK TO GARGOYLE - Only now it's gone. Something\n               strange is coming to town...\n\n                                                                 CUT TO:\n\n          \n\n                                                                       15.\n\n          \n\n          \n\n          \n\n          \n\n          23                                                               23\n\n               EXT. NEW JERSEY HARBOR - SUNSET\n\n               Large freighters. Lots of activity. PUSH IN on a steamer as a\n               crane lowers a LARGE VERTICAL CRATE to the dock - it THUMPS\n               down hard.\n\n                                   APRIL (O.S.)\n                         Careful! That isn't some box full\n                         of fish!\n               CAM LOWERS - as APRIL O'NEIL leaps down into frame. Dressed\n               in jungle expedition gear with her head wrapped in a bandana.\n               She takes off her sunglasses and admires the crate.\n               ON BOX - Labelled \"O'Neil Cargo\". Something ominous about the\n               crate. PUSH IN on it as April steps in front. Admires it with\n               pride. Turns, takes out a cell phone, and hits speed dial.\n               ON PHONE DISPLAY - \"Calling HOME\". It rings.\n\n                                   APRIL\n                             (impatient mutter)\n                         Where are you?\n\n          \n\n          \n\n               INT. APRIL AND CASEY'S LOFT APARTMENT - CONTINUOUS\n\n\n          24                                                               24\n               A spacious NYC loft - tons of bookcases work as room\n               dividers. Piled with artifacts, unopened crates of all sizes,\n               boxes of maps, and a general organized mess. A hockey game\n               BLARES from a TV set.\n               CAM PANS ACROSS ROOM - The telephone continues to ring just\n               as we reach the KITCHEN - with piles of dirty dishes and fast\n               food. And then a path of strewn clothes that gets messier and\n               messier until we reach -\n               - CASEY JONES, snoring on a sofa. He finally wakes up,\n               clamors for the phone, tripping over mess in the process.\n\n                                    C\n\n                                     ASEY\n\n                             (GROGGY)\n                         Talk to me.\n\n                                   APRIL\n                         Hey. It's me. I'm back.\n               Casey rubs his face, tries to orient himself. Looks at watch.\n\n                                   CASEY\n                         Was that today, babe?\n               April's disappointed. Same old Casey.\n\n          \n\n               O\n\n          \n\n          \n\n          \n\n          \n\n                                                                       16.\n\n          \n\n          \n\n          \n\n                                    APRIL\n                         Yes. It was today that I returned\n                         to you after being in a deadly\n                         jungle for almost a month.\n\n                             (BEAT)\n                         I thought you were going to meet me\n                         down here?\n\n                                   CASEY\n                         I'm sorry, babe. I must've-\n\n                                   APRIL\n                         Forget it. I'll take a cab.\n               A long pause on the phone. Casey knows he's busted.\n\n                                   CASEY\n                         I missed you?\n               April doesn't answer. She closes the phone. Casey slumps in\n               his chair, shaking his head.\n\n                                   CASEY\n                         Good goin', Case.\n               Back at the dock, April is back to business.\n\n                                   APRIL\n                         Howie! Get this on the truck for\n                         delivery! Let's go!\n               P.O.V. INSIDE BOX - See April through the wood slats. We'd\n               swear we almost hear... LOW GROWLING.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               INT. MIKEY'S BEDROOM - LATER\n\n\n          25                                                                25\n               Mikey is on his bed. His thumbs pound away at a video game on\n               TV - bored. He puts down the controller and yells to the\n               ceiling.\n\n                                   MICHAELANGELO\n\n                         I'M! BORED!!!!!\n               He stands up and walks to DON'S ROOM. He opens it. It takes\n               only one foot until the door is pushed up against piles of\n               TECH JUNK. Mikey uses his shoulder and pushes it open.\n                N DON - He's hunched over a work table, back to Mikey.\n               Tinkering as always. Wild inventions line the walls, some\n               finished, some not. Some pay tribute to past TMNT adventures.\n\n                                   MICHAELANGELO\n                         Don, y'ever feel like you were\n                         meant for more? To DO more? Like, I\n                         mean, sometimes I feel like...\n\n                                   (MORE)\n\n          \n\n                              D\n\n          \n\n          \n\n          \n\n          \n\n                                                                  17.\n                              MICHAELANGELO(cont'd)\n                    like we never really left that\n                    glass turtle bowl when we were\n                    little dudes.\n          REVERSE ANGLE - Don lifts his head up, eyes MAGNIFIED in some\n          bizarre head contraption. He flips up side panels,\n          ELECTRONICA MUSIC blares out.\n\n                               ONATELLO\n                    Oh, hi Mikey. You say something?\n\n                              MICHAELANGELO\n                        (sighs - to himself)\n                    Every day it's the same thing. Wake\n                    up. Birthday party gig. Drive home.\n                    Watch TV. Train... Rinse. Repeat.\n\n                              DONATELLO\n                    I know. Isn't it great?\n          A beat. Mikey sighs, then walks back downstairs to the LIVING\n          ROOM SOFA. He and the camera think he's alone, but before he\n          knows it, Splinter is sitting next to him, cross legged,\n          still, and sipping tea.\n\n                              MICHAELANGELO\n\n                    WAH!!\n\n                              SPLINTER\n                    Michaelangelo. Boredom is never an\n                    indicator of your surroundings. It\n                    is a reflection of your inner\n                    heart. Fill yourself with\n                    excitement on the inside... and\n                    you'll live the most rewarding life\n                    of all.\n          Mikey stares at Splinter, dead pan. A beat. Then returns to\n          flipping channels. He stops on a NEWS program - \"NYC DIRT\".\n\n                              NYC DIRT REPORTER (O.S.)\n                    And so yet again, police officials\n                    are baffled at a crime of\n                    retribution that can only be\n                    attributed to the mysterious figure\n          M         known as \"The Nightwatcher\".\n           ikey lights up. On TV is a flashy well-coifed, know-nothing\n          REPORTER. Beside him is a news photo of the tied up MUGGER\n          from our second scene.\n\n                              NYC DIRT REPORTER\n                    This is the latest in a string of\n                    vigilante acts that have been\n                    plaguing the city for the past\n                    year.\n\n                              (MORE)\n\n          \n\n                              S\n\n          \n\n          \n\n          \n\n          \n\n                                                                  18.\n                              NYC DIRT REPORTER(cont'd)\n                    Although the victims have been\n                    criminals themselves, the\n                    Nightwatcher's actions have been\n                    identified as destructive and\n                    overly-violent... verging on the\n                    edge of lethal.\n          ON MIKEY - Can't smile wide enough. He runs to his room,\n          returns with a POLAROID CAMERA. He snaps a picture of the TV.\n          He pulls it out, placing it in his NIGHTWATCHER SCRAPBOOK,\n          overflowing with paper clippings and articles on the\n          vigilante.\n\n                              MICHAELANGELO\n                    Now THAT'S what I'm talking about!\n                    Cruising the streets, busting those\n                    who hold themselves above the law.\n                        (movie announcer voice)\n                    But they aren't above HIS.\n          Don walks in, holding an in-process invention. He looks up.\n\n                              DONATELLO\n                    Mikey, the man's practically a\n                    criminal himself. Anyone who\n                    operates without boundary or rule\n                    of law cannot be legislated and\n                    needs to be reigned in.\n\n                              RAPHAEL (O.S.)\n                    Sounds like four turtles I used ta\n                    know.\n          ON DOOR - Raphael walks in, his Nightwatcher costume no where\n          in sight.\n\n                               RAPHAEL\n                    Whatta we talkin' about, boys?\n                    Soundin' a little too egghead fer\n                    my tastes.\n\n                               PLINTER\n                    Ah, Raphael. Your brothers and I\n                    were just discussing the vigilante\n                    Nightwatcher once again.\n                        (beat - concerned)\n                    Where have you been? You've been\n                    spending so much time away from\n                    home lately...\n          Raphael's on edge from the mention of Nightwatcher already.\n          His attention doesn't break from Donatello.\n\n                              RAPHAEL\n                    I joined a book a' the month club.\n                        (to Donnie)\n                    So just what's your beef with\n                    puttin' dirtbags behind bars,\n                    Donnie? Go ahead... enlighten me.\n\n          \n\n                              R\n\n          \n\n          \n\n          \n\n          \n\n                              R\n\n          \n\n          \n\n          \n\n          \n\n                                                                  19.\n\n          \n\n          \n\n          \n          Splinter watches the growing tension with concern.\n\n                              DONATELLO\n                    I have no problem with the\n                    incarceration of those who deserve\n                    it, but if someone like\n                    Nightwatcher has ultimate power...\n                    then who makes sure he doesn't\n                    cross the line?\n          Mikey picks up two NINJA BLADE RINGS, twirling them around\n          aggressively in mock battle.\n\n                              MICHAELANGELO\n                    I think he's COOL.\n\n                              DONATELLO\n                    Of course you would.\n\n                              MICHAELANGELO\n                        (in bg, oblivious)\n                    Keeya! HATCHAAAAAA!!\n\n                              RAPHAEL\n                    Sometimes there are lines that even\n                    the police can't cross. Someone has\n                    to be willing to do what needs to\n                    be done. And to do that, fear\n                    becomes a weapon.\n\n                              DONATELLO\n                    You are such a Neanderthal.\n          Raphael does the bully FAKE LUNGE at Don. Don reacts quick\n          and startled, eyes wide.\n\n                                APHAEL\n                    I rest my case.\n\n                              S\n\n                               PLINTER\n\n                        (SCOLDING)\n                    Raphael! If bullying is the only\n                    way to argue your point, then\n                    perhaps you do not have much of a\n                    point to begin with.\n\n                               APHAEL\n                        (gritted teeth)\n                    Yes, sensei.\n                        (to Mikey)\n                    And quit touchin' my stuff.\n          Raph yanks the Ring Blades out of Mikey's hands and storms\n          out of the room by flipping up a series of cables to the\n          second floor.\n\n          \n\n                                                                          20.\n\n          \n\n          \n\n          \n\n                                   DONATELLO\n                             (too-late-retort to Raph)\n                         That was just a startle response\n                         and isn't really an indication of\n                         fear!\n               Raph does the \"blah blah\" hand gesture from above. Enters his\n               room, slams the door and immediately BLASTS MUSIC...\n               ...and it's some annoying pop HIP-HOP song.\n\n                                   RAPHAEL (O.S.)\n\n                         AAAARGH! AND STOP TOUCHING MY\n\n                         STEREO TOO, MIKEY!!!\n               Then HEAVY ROCK starts playing to drown out his family. A\n               silence sits in the room as a CD flies out of Raph's room.\n               Tense in the room for a bit. Don looks at the other two.\n\n                                   DONATELLO\n                         It's an involuntary thing your body\n                         does when stimulated like that.\n                             (no response)\n                         What? It's true.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. HARBOR - NIGHT\n\n\n          26                                                                26\n               A large JET LINER flies into the city. Lowering. The wheels\n               fold out under the carriages.\n               CLOSER - LEO is on the landing gear, his face lit up by the\n               city glow in front of him. He jumps off as - FOOMP! - a HANG-\n               GLIDER opens up from his backpack. He lowers the glider to\n               the water and RELEASES!\n\n          \n\n          \n\n               INT. SEWER PIPE - MOMENTS LATER\n\n\n          27                                                                27\n               Disgusting. Dripping. Out of the slime, Leo rises. A beat...\n               inhales, then SMILES WIDE.\n\n                                   LEONARDO\n                         Mmm... home sweet home.\n\n          \n\n          \n\n               INT. TURTLES LAIR - NIGHT\n\n\n          28                                                                28\n               All is peaceful in the lair. The big screen TV is the only\n               light source. Mikey snores and drools on the couch, covered\n               in junk food wrappers. Donnie sleeps with an \"TECH HEAD\"\n               magazine over his face... gadget-in-process in his lap.\n               ON ENTRANCE - Leo walks in and places his bag on the floor.\n               The place feels different... but still feels like home.\n\n          \n\n               S\n\n          \n\n          \n\n          \n\n          \n\n                                                                       21.\n\n          \n\n          \n               He tiptoes with ninjitsu precision across the floor, avoiding\n               the potential noise-making mess below him. He sneaks to-\n\n          \n\n          \n\n               INT. SPLINTER'S ROOM - CONTINUOUS\n\n\n          29                                                               29\n               Leo peers in cautiously. Splinter is still awake. Expecting\n               him. Kneeling on the floor. Very serious.\n\n                                    SPLINTER\n                         Enter.\n               Leo walks in and kneels in front of Splinter.\n\n                                   LEONARDO\n                         I have completed my training,\n                         master. I am prepared for the next\n                         stage.\n\n                                   SPLINTER\n                         That you are, my son. You must now\n                         apply all that you have learned on\n                         your lengthy journey to your\n                         everyday life. THAT will be the\n                         most challenging training of all...\n                plinter reaches out and hands Leonardo an ANCIENT MEDALLION.\n               Leo is touched.\n               CLOSE ON SHADOWS OUTSIDE OF ROOM - We see a pair of EYES,\n               watching the entire scene... jealous.\n\n                                   SPLINTER\n                         I've missed you, Leonardo.\n\n               L\n                eo hugs Splinter.\n\n                                   LEONARDO\n                         I've missed you too, father.\n\n                                   SPLINTER\n                         I'm afraid much has changed in your\n                         brothers' spirits since you have\n                         left. But now that you are home,\n                         they will finally have the ethical\n                         and warrior leadership they have\n                         been lacking. The family needs you.\n               ON LEO - He swallows that big pill very hard.\n\n                                   LEONARDO\n                         Heh. Yeah... I mean, yes sensei.\n\n                                   SPLINTER\n                             (to doorway)\n                         Raphael, your brother is home.\n\n          \n\n                              (\n\n          \n\n          \n\n          \n\n          \n\n                                                                  22.\n\n          \n\n          \n\n          \n          ON OUTSIDE OF ROOM - Raphael walks out of the shadows. He's\n          good... but not too good for Splinter. Splinter and Leo break\n          and face the doorway. An awkward silence.\n\n                                  LEONARDO\n                       Hey.\n\n                                  RAPHAEL\n                       Hey.\n          Raphael eyes Leo... and then the medallion.\n\n                                 RAPHAEL\n                       So... congratulations.\n\n                                  LEONARDO\n                       Thanks.\n\n                                 RAPHAEL\n                           (awkward beat/fake yawn)\n                       Well, I'm goin' to bed.\n          He leaves.\n          TV ROOM - Raph walks through the room, cuffs Don on the back\n          of the head, and keeps on walking.\n\n                                 RAPHAEL\n                       Leo's home.\n          Donatello wakes up, looks around. LIGHTS UP when he sees Leo.\n\n                                  DONATELLO\n                       Leo!!\n          ON MIKEY - He wakes up. A Cheese Doodle stuck to his upper\n          snout. Really groggy.\n\n                                  MICHAELANGELO\n                       But I don't WANNA pop out of the\n                       birthday cake, Mrs. Ro-\n                           (snaps out of it)\n\n                       LEOOOOO!!!\n          Mikey flips past Donnie and slams Leo with a gripping HUG...\n          and doesn't let go.\n\n                                 LEONARDO\n                       Hey little bro!\n                            a beat)\n                       Mikey? You can let go now... um,\n                       Mikey?\n\n                                 MICHAELANGELO\n\n                           (MUTTERING)\n                       So bored... so bored...\n\n          \n\n               W\n\n          \n\n          \n\n          \n\n          \n\n               O\n\n          \n\n          \n\n          \n\n          \n\n                                                                          23.\n\n          \n\n          \n\n          \n\n               CAM LOWERS INTO FLOOR AS WE...\n\n                                                          FADE TO BLACK\n                VER BLACK - Quick bursts of AUDIO VIOLENCE. Steel,\n               screaming, trampling, and rumbling. Then-\n               -with each audio burst, we now see a VISUAL BURST. Strong,\n               rim-lit, iconic images of an IMMENSE BATTLE - a slicing blade\n               weapon, screaming mouth, angry eyes. Then-\n               -a monster claw! Gnashing teeth! Scared eyes! Horns and\n               tusks! The edit gets intense, until -\n\n                                   WINTERS\n\n                         AAAAAAAAAAAAGGGH!!!\n\n          \n\n          \n\n               INT. WINTERS BEDROOM - DAWN\n\n\n          30                                                                30\n               It was all a nightmare. We go WIDER as we take in the\n               ostentatious bedroom of MAXIMILIAN WINTERS, a young mid-40's.\n               Famous NYC entrepreneur.\n                inters is large, handsome, built and powerful in every\n               sense. His bedroom reflects it as well - large simple shapes,\n               decorated with a modern-day tribal/tech appeal. This guy is\n               filled with adrenaline, power and machismo.\n\n                                    W\n\n                                    INTERS ASSISTANT (O.S.)\n                         Mr. Winters, sir.\n               ON DOORWAY - Standing there is a beautiful black-haired\n               assistant dressed in full suit and tie with a clipboard.\n\n                                   WINTERS ASSISTANT\n                         It's time for your morning workout.\n\n          \n\n          \n\n               INT. WINTERS WORKOUT ROOM\n\n\n          31                                                                31\n               Rock/hip-hop music crashes in as we see Winters' morning\n               workout - a combination of weaponry work (martial arts and\n               others), floor routines and bag work. He takes it all very\n               seriously.\n               Sequence ends with him smashing the top off of a Mook Jung\n               training block with his bare fist. He walks out of the room,\n               grabbing a towel from a blonde assistant.\n\n          \n\n          \n\n               INT. WINTERS OFFICE - LATER\n\n\n          32                                                                32\n               Winters walks in his crisp suit. His office is large and\n               austere. Two levels of history in books, artifacts, warrior\n               themed curios and power.\n\n          \n\n                                      W\n\n          \n\n          \n\n          \n\n          \n\n               -\n\n          \n\n          \n\n          \n\n          \n\n                                                                       24.\n\n          \n\n          \n\n          \n\n                                   WINTERS ASSISTANT (O.S.)\n                         Mr. Winters, sir?\n               ON DOOR - His Assistant stands at the large doors.\n\n                                   WINTERS ASSISTANT\n                         The board is waiting.\n\n                                      WINTERS\n                         Excellent.\n               He walks to the large bay windows that overlooks the city.\n\n          \n\n          \n\n               EXT. WINTERS OFFICE\n\n\n          33                                                                33\n               Now outside the window, he smiles at the view.\n\n                                   WINTERS\n                         Tell them I'm on my way down.\n               He slowly LOWERS OUT OF FRAME. CAM PULLS OUT WIDER REVEALING -\n                 Winters Office is an \"elevator\" of sorts that can ride up\n               and down the front of the building, allowing him access to\n               any floor of his Tower without leaving his desk.\n               WIDER - see the Tower is a monolith in the middle of\n               Manhattan - complete with it's own front Central Park-ish\n               gated entry. A true work of modern architecture.\n\n                                                                WIPE TO:\n\n          \n\n          \n\n               INT. WINTERS LOBBY - DAY\n\n\n          34                                                                34\n               We see the wonder of everything Winters - mixing of old\n               artifacts with modern day aesthetic and implementation. The\n               ceilings are vast and there is no mistaking the worth of the\n               man and his company.\n\n               W\n                inters' Elevator Office lowers into a balcony level building\n               overseeing the main lobby. He walks down a stairwell and\n               through the lobby, five Assistants following him.\n\n          \n\n          \n\n               INT. BOARDROOM - CONTINUOUS\n\n\n          35                                                                35\n               Winters walks in the room. CLOSE ON him as he stops at the\n               head of the boardroom table.\n\n                                    INTERS\n                         Gentlemen! Let's begin.\n\n          \n\n               T\n\n          \n\n          \n\n          \n\n          \n\n                                                                       25.\n\n          \n\n          \n\n          \n               CAM PULLS BACK along the impossibly long table as DOZENS OF\n               BOARD MEMBERS stand up. When it reaches the end, it looks as\n               though Winters stands at the head of an ARMY AT ATTENTION.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n          36                                                               36\n\n               INT. TURTLES LAIR - AFTERNOON\n\n               Leo walks along the upper floor of their lair. As he passes\n               Mikey's room, his brother pops out with his skateboard. We\n               follow them as they walk down to the TV area.\n\n                                   MICHAELANGELO\n                         Leo... what's up, bro?\n\n                                   LEONARDO\n                         Just enjoying being home.\n                hey walk past Donnie's Chop Shop room as - BOOM! - something\n               explodes and smoke pours out under his door.\n\n                                   DONATELLO (O.S.)\n\n                         NOBODY PANIC! I HAVE IT ALL UNDER\n\n                         CONTROL!\n               Mikey and Leo COUGH, leave the smokey area.\n\n                                   LEONARDO\n                         Say, what's up with April and\n                         Casey? I expected them to drop by\n                         after I got back.\n\n                                   MICHAELANGELO\n                         We don't see much of `em anymore.\n                         April seems to be working a lot -\n                         eww - and Casey seems to be, I\n                         dunno, \"different\" lately. Maybe he\n                         doesn't like having to put the\n                         toilet seat down now that they've\n                         moved in together.\n\n                                   LEONARDO\n                         They're living together now?\n               They get to the living room area. Mikey walks to the edge of\n               a jury-rigged HALF-PIPE he built in an old water slough.\n               Mikey continues as he skates back and forth.\n\n                                   MICHAELANGELO\n                         To be honest with ya, they're kinda\n                         buzzkills to be around.\n\n                                   LEONARDO\n                         Is Casey at least still doing his\n                         hockey mask thing?\n\n          \n\n                                   K\n\n          \n\n          \n\n          \n\n          \n\n                                                                          26.\n\n          \n\n          \n\n          \n\n                                   MICHAELANGELO\n                         Dunno. Haven't noticed since The\n                         Nightwatcher has come home to\n                         roost. WOOOOHOOOOOOOO!\n\n                                   LEONARDO\n                         \"Nightwatcher\"? That some new comic\n                         book you're hooked on, Mikey?\n               RAPHAEL walks in. Picks up Mikey's scrapbook as he passes the\n               sofa and slugs it in Leo's chest.\n\n                                   RAPHAEL\n                         This should explain most of it. The\n                         legacy of the city's newest hero.\n                         Compliments of the fanboy over\n                         there.    M\n\n                                    ICHAELANGELO\n                         Joke all you want, Raphy. But train\n                         hard and eat your veggies and one\n                         day, you too can be as cool as The\n                         Nightwatcher, dude.\n\n                                   RAPHAEL\n                         I can only hope, Mikey. I can only\n                         hope...\n               Leo disapprovingly flips through the book.\n\n                                   LEONARDO\n                         This guy could bring heat on all of\n                         us if he keeps this up. Showboating\n                         isn't a replacement for justice...\n                         it's just self-indulgence.\n                             (looks back at book)\n                         Someone needs to talk to this thug.\n               ON RAPH - He looks... dying to say something. But can't.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. APRIL AND CASEY'S LOFT - AFTERNOON\n\n\n          37                                                                37\n               CLOSE ON - A familiar-looking white HOCKEY MASK. Eyes blink\n               behind it.\n\n                                    ID 1\n                         Yo, Case? Wanna be goalie?\n               The mask is pushed aside by Casey - Kid 1 was holding it.\n\n                                   CASEY\n                         Nah, you know I work for a livin'.\n                         It's Star Center or nothin' else.\n\n          \n\n                              C\n\n          \n\n          \n\n          \n\n          \n\n                                                                   27.\n\n          \n\n          \n\n          \n          WIDER - Casey is with 5 other KIDS prepping for a game of\n          STREET HOCKEY, using tennis balls and trash cans. Chubbier\n          KID 2 walks by and grabs the mask himself.\n\n                              KID 2\n                    Whatever! Let's get it on!\n          They begin a boisterous round of hockey. Trash talk, gentle\n          checking and all the requisite boy things. We see that the\n          kids love Casey. And vice versa. Suddenly-\n\n                              BROOKLYN MOM (O.S.)\n\n                    TOMMY!! IT'S TIME FOR DINNER!\n\n                              TOMMY (KID 1)\n\n                    BUT MA! WE JUST STARTED!\n\n                              BROOKLYN MOM\n                        (snapping back)\n\n                    THOMAS!\n          Tommy's defeated. Looks at the disappointed boys.\n\n                              TOMMY\n                    Sorry dudes.\n\n                              CASEY\n                    Busted! Have fun with your mommy...\n                        (face falls, disappointed)\n                    ...oh no.\n          OFF HIS LOOK - We see APRIL, dressed stunning in a dark\n          business suit at the other side of the street. She's dangling\n          a WHITE SHIRT and a TIE from her other hand.\n\n                               ASEY\n                    Aw, c'mon April! We just started!\n          April just gives him \"the look\" with an eyebrow cock. Casey\n          knows he can't win.\n\n                              KID 2\n                    Can't Casey stay and play for just\n                    five more minutes, Miss O'Neil?\n                    Pleeeeeeease?\n\n                              APRIL\n                    Not today, Nate. Mister Jones has\n                    to pretend to be an adult for a few\n                    hours.\n\n                              KIDS\n                    Awwwww! Man! Baaah!\n          Casey hands his stick, then quickly turns with a grin.\n\n                              CASEY\n                    Later boys!\n\n          \n\n                                                                       28.\n\n          \n\n          \n\n          \n               CAM FOLLOWS April and Casey as they walk down the street.\n               April's not really a hard-ass - she's just forced to be the\n               \"responsible one\" in A\n                                    the relationship.\n\n                                    PRIL\n                         I need your help with a delivery.\n\n                                   CASEY\n                             (Arnold voice)\n                         Do you need my funtahstick muscles?\n\n                                   APRIL\n\n                             (UNENTHUSED)\n                         Heh-heh... yeah.\n               Casey awkwardly places his arm over her shoulder as the cam\n               rests and they walk into the distance. He pulls it back down.\n               CAM ANGLES ON WALL - As we notice CLAW MARKS sliced into the\n               concrete exterior of a building.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               INT. WINTERS LOBBY - SUNSET\n\n\n          38                                                                38\n               The doors open in Winters Lobby. April struts in, owning the\n               place. Casey struggles pulling the pallet holding the LARGE\n               CRATE behind them. As she passes reception-\n\n                                   RECEPTIONIST\n                         Mr. Winters. April O'Neil is here.\n\n          \n\n          \n\n          39                                                                39\n\n               INT. WINTERS OFFICE\n\n               His darkened office is especially alpha-male - BIG GAME HUNT\n               trophies adorn the walls, as do SUITS OF ARMOR from all time\n               periods and random strange ARTIFACTS spanning history in\n               glass cases.\n               Winters sits at his large desk as the large doors open and\n               April and Casey spill in.\n\n                                   WINTERS\n                         Miss O'Neil. You are a vision.\n                         Thirty days in a jungle, and\n                         beautiful as ever.\n               He shakes her hand and double-cheek kisses her. Casey's eyes\n               widen - is THIS what his girlfriend does?\n\n                                    APRIL\n                         Hello Max.\n\n                             (BEAT)\n                         This is my... friend, Casey Jones.\n\n          \n\n                          (\n\n          \n\n          \n\n          \n\n          \n\n                                                                  29.\n\n          \n\n          \n\n          \n\n                              WINTERS\n                    Chris! How's it going?\n          Winters nearly crushes Casey's hand in his grip.\n\n                              CASEY\n                    Actually, It's Ca-\n\n                              WINTERS\n                        (ignoring, back to April)\n                    So how was your trip?\n\n                              APRIL\n                    You know, the typical - corrupt\n                    government officials, double\n                    crossed by a jungle guide, all\n                    ending in a heart-pounding chase.\n          Winters and April chuckle. Cam adjusts to show Casey between\n          them in the bg, looking uncomfortable and out of place.\n\n                              APRIL\n                    But it was all worth it.\n                         beat - excited)\n                    I found it. The fourth General.\n          Winters BEAMS, way too excited as well. April holds out her\n          hand to Casey, who doesn't know what she wants. He awkwardly\n          HIGH FIVES her.\n\n                              CASEY\n                    Yeah-ha! The fourth General.\n\n                              APRIL\n                        (hushed gritted teeth)\n                    The crow-bar.\n\n                              CASEY\n                    Oh.\n          He hands it to April as she twirls up a CROW-BAR and cracks\n          open the front panel.\n          INSIDE BOX POV - The light gradually breaks in, until - CREAK\n          - the front panel falls to the floor.\n          CLOSE ON - Winters' look. Pure wonder and admiration. He\n          walks up to it slowly. April and Casey cautiously stay back.\n\n                               WINTERS\n\n                        (SOFT)\n                    ...the gods be praised.\n          ON BOX - We finally see the statue - GENERAL AGUILA - a seven-\n          foot towering wall of granite and obsidian. Eagle warrior\n          armor reflecting a South American design... though not from a\n          specific time period. Winters rubs his hand over the stone.\n\n          \n\n                                   W\n\n          \n\n          \n\n          \n\n          \n\n                                                                         30.\n\n          \n\n          \n\n          \n\n                                   APRIL\n                         Can I ask you a question?\n\n                                   WINTERS\n                             (not looking away)\n\n                         Y\n                          es. Of course.\n\n                                    APRIL\n                         I've been so grateful for the\n                         opportunities you've given me\n                         lately. I'd probably be still\n                         selling antique curios if you\n                         hadn't visited my shop that day.\n                              (off of box)\n                         But I have to ask... why the\n                         fascination with these particular\n                         works of art? I'd never even heard\n                         of the Legend of Yaotl until we\n                         met.\n               He looks up. The cam PANS RIGHT. It travels past an SUIT OF\n               ARMOR in the FG. Goes to BLACK. Continue PAN until we're in-\n\n          \n\n          \n\n          40                                                               40\n\n               EXT. FLASHBACK BATTLEFIELD - 3000 YEARS AGO\n\n               -the armor becomes the back of a HELMET. Camera dollies\n               around the helmet until we're looking at a dark and imposing\n               figure. YAOTL. His helmet is impenetrable, with eye slits.\n               Note - the flashback is dark, shadowed and monochromed.\n               Detail is hinted at instead of shown. Very stylized.\n\n                                   WINTERS (V.O.)\n                         It was a time long before the\n                         Mayans, April. Long before the\n                         Aztecs and even the Olmecs. It was\n                         a time of legends. A time of\n                         greatness. The true mother culture\n                         of Central America.\n               Cool shots of Yaotl. His armor, his stance, etc.\n\n                                    INTERS (V.O.)\n                         There was a man named Yaotl. More a\n                         force of nature than man. And\n                         together with his Four Warrior-\n                         Priest Generals, they pillaged\n                         every culture in their path.\n               QUICK SHOTS OF EACH GENERAL. The walk along side Yoatl.\n               Possibly slo-mo. We will come to recognize them through their\n               distinct armor as the Four Stone Generals - in human form.\n\n                                   WINTERS (V.O.)\n                         And for every culture they\n                         destroyed, they drank in all the\n                         magic and knowledge known to them.\n\n                                   (MORE)\n\n          \n\n          O\n\n          \n\n          \n\n          \n\n          \n\n                                                                    31.\n                              WINTERS(cont'd)\n                    They became a warring hurricane,\n                    gathering more power and knowledge\n                    with each conquest.\n          GROUP SHOT - Of five Warriors. High atop a hillside, finally\n          stopped. Ready for battle. Their character-specific weapons\n          are drawn. Around them is a small army of MINIONS.\n\n                                WINTERS (V.O.)\n                    Then they came across a culture\n                    rich with science, magic and their\n                    own technology. A South American\n                    version of \"Atlantis\".\n\n                        (\n\n                          BEAT)\n                    It was like blood in the water for\n                    a predator like Yaotl.\n          CLOSE ON - Yaotl. As he raises his sword in the air. CAM\n          DOLLIES AROUND HIS HEAD REVEALING their opposing forces. An\n          army of THOUSANDS. Waving their weapons in the air.\n          The opposing army CHARGES. Yaotl's men pull out   a large\n          ORNAMENTAL STAND - a \"stargate\" of sorts. Yaotl   and his men\n          are unmoving... as they begin a ceremony. Yaotl   looks to the\n          heavens above - as we see a CLUSTER OF SPECIFIC   STARS move\n          into place.\n\n                              WINTERS (V.O.)\n                    As the army approached, Yaotl used\n                    the knowledge they'd gained in\n                    black magic and sorcery. Timing\n                    their attack with the alignment of\n                    the Stars of Kikin, they opened a\n                    portal to another world.\n          ON CHARGING ARMY - they stop dead in their tracks. Front-lit\n          by the OS portal. Don't know what to expect -\n          ON PORTAL - A crackling electric circle opens to another\n          dimension. Suddenly - DOZENS OF MONSTERS EXPLODE OUT!\n          Creatures of all varieties. Gnashing Fangs. Swiping claws.\n\n                              WINTERS (V.O.)\n                    They unleashed an army of monsters.\n           N BATTLEFIELD - men getting slaughtered (in a nice PG sort\n          of way). Quick shots. Intense.\n\n                              WINTERS (V.O.)\n                    The monsters knew no side   - they\n                    destroyed the enemy... as   well as\n                    Yaotl's own army. Men who   swore to\n                    spill their blood for his   cause.\n                    Yaotl had to do something   to stop\n                    more from coming through.\n\n          W\n           inters SMASHES the portal, stopping the slew of monsters\n          from pouring out. End on a scream. Dissolve to LATER in the\n          battle...\n\n          \n\n                                   A\n\n          \n\n          \n\n          \n\n          \n\n               W\n\n                             (\n\n          \n\n          \n\n          \n\n                             (\n\n          \n\n          \n\n          \n\n          \n\n                                                                         32.\n\n          \n\n          \n\n          \n               Desolate, destroyed battlefield. Smoldering. Bodies\n               everywhere. No monsters. End pan on Yaotl on his knees.\n\n                                   WINTERS (V.O.)\n                         In the end, there were no victors.\n                         And they were responsible for the\n                         eradication of the greatest culture\n                         that will never be known. The\n                         knowledge that was lost would never\n                         be found again...\n\n               DISSOLVE BACK TO PRESENT DAY IN WINTERS' OFFICE\n               Casey has fallen asleep, sitting to the side, head in his\n               hand. A line of DROOL hangs from his mouth. April is\n               fascinated by the story. She nudges Casey who does the\n               slurp/half-snore wake up.\n\n                                    C\n\n                                    ASEY\n                             (\"wake up\" fast speak)\n                         I was just resting my eyes...\n\n                                   APRIL\n                         Quite the story, Max.\n                              concerned re: Statue)\n                         You don't think that this could be-\n\n                                   WINTERS\n                         Oh no, Miss O'Neil.\n                              looks back to statue)\n                         Like you said... just a story.\n                inters doesn't break his stare.\n\n                                   WINTERS\n                         One of the girls will pay your fee\n                         on the way out.\n\n                                    PRIL\n                         Thanks. Um... goodbye... Max.\n               April and Casey leave Winters, consumed with his new\n               treasure. He doesn't reply.\n\n          \n\n          \n\n               INT. WINTERS LOBBY - MOMENTS LATER\n\n\n          41                                                                41\n               April and Casey walk the lobby. She shoots him \"the look\".\n\n                                   CASEY\n                         What!? It was a boring story!\n\n                                   APRIL\n                         That is so perfectly CASEY JONES. I\n                         give you opportunity. I give you\n                         the chance to become a better man.\n                         And what do you do with it?\n\n                                   (MORE)\n\n          \n\n               W\n\n          \n\n          \n\n          \n\n          \n\n                                                                          33.\n                                     APRIL(cont'd)\n\n                             (BEAT)\n\n                         YOU FALL ASLEEP!\n               Casey stops next to a PODIUM holding a priceless-looking\n               VASE. As he speaks, he gestures very animatedly and\n               dangerously close to the vase.\n\n                                   CASEY\n                         Well, maybe if you were home for\n                         more than four days at a time,\n                         you'd see that I DON'T WANT ANY OF\n\n                         THIS!\n\n                                   APRIL\n                             (sees danger of vase)\n                         Casey, you better be careful-\n\n                                   CASEY\n                         Here I am nice enough to help you\n                         out, dress in this get-up and all I\n                         get is grief?!\n               ...as he knocks and SMASHES the vase to the floor.\n\n                                     CASEY\n                         Oh boy.\n               Klaxons sound as SHINK-SHINK-SHINK - METAL PLATES SLAM DOWN\n\n               OVER THE GLASS ENTRY. COMPLETELY ENCLOSES THE FRONT LOBBY.\n               Room is now emergency light RED. April rubs her temples.\n\n                                   APRIL\n                         Give me strength.\n\n                                                                    CUT TO:\n\n          \n\n          \n\n               INT. WINTERS OFFICE\n\n\n          42                                                                  42\n               Winters is still alone in his office. Still studying the\n               statue. A beat. He turns his head to the side.\n\n                                   WINTERS\n                         You can come out now.\n                 IDER - As we see FOUR FIGURES appear out of the smallest and\n               darkest of shadows! The LEADER slinks forward - clearly a\n\n               S\n               woman - dressed in cloak and Japanese Noh mask over her face.\n                he takes it off, revealing KARAI - the beautiful leader of\n               the Japanese Foot Clan, flanked by three, FOOT NINJAS.\n\n                                   WINTERS\n                         Your talents are commendable.\n\n                                   KARAI\n                         As are yours. Most don't notice us\n                         until we decide they will.\n\n          \n\n                                                                          34.\n\n          \n\n          \n\n          \n\n                                   WINTERS\n                         Well, I guess I'm just special that\n                         way.\n               Winters walks over to his desk. The Statue looms behind them.\n\n                                   WINTERS\n                         So down to business - aside from\n                         the other reasons for your visit to\n                         America, are you interested in my\n                         offer we discussed?\n\n                                   KARAI\n                         I must confess... I still don't\n                         know exactly what we are to do for\n                         you.\n\n                                   WINTERS\n                         I need the finely-tuned eyes and\n                         stealth of your Foot Ninja to...\n                         monitor the city for me over the\n                         next few days.\n               Winters walks to his window. It's night. Overlooks the city.\n\n                                   WINTERS\n                         Just keep your eyes peeled for\n                         anything... strange.\n\n                                   KARAI\n                             (long beat)\n                         What kind of strange things?\n               The question hangs as we PUSH IN ON Statue's face... his\n               eerie eyes. We think his eye GLOWS, only we-\n\n                                                              MATCH CUT TO:\n\n          \n\n          \n\n               EXT. STAR-FILLED SKY - NIGHT\n\n\n          43                                                                  43\n               The glowing eye is really a STAR. The same line pattern we\n               saw at movie's open. The stars ADJUST... lining up in a more\n               straight-lined manner.\n               CAM LOWERS, placing us back in-\n\n          \n\n          \n\n               EXT. NEW YORK CITY STREETS - NIGHT\n\n\n          44                                                                  44\n               A MAN walks down the sidewalk. As he passes a DARKENED\n               ALLEYWAY, he hears a low GROWL come from it. He stops.\n               ALLEY POV - As the man looks in. Can't see a thing. Hand-held\n               cam. He moves to leave... and the growl comes again.\n               STREET - Man stares in. No one on the street. Looks closer...\n               closer... grows more tense as...\n\n          \n\n                                                                          35.\n\n          \n\n          \n\n          \n               ...WHAM! The requisite CAT jumps out of the shadows. Scares\n               Man half to death.\n\n                                   MAN\n\n                         WAAAAAAAAAAHHH!!!!\n                             (calms down)\n                         Gave me a scare kitty.\n               He pets the kitty a bit, then walks off. CAM LOWERS behind\n               cat, as Man walks off into the distance. Until...\n               ...WHAM! A large burly CLAWED ARM slams out of the shadows\n               onto the cat, yanking it back into the alley! Quick\n               caterwaul. Silence. And then we hear a BURP.\n\n               C\n                AM LOWERS further through the asphalt, then quickly hooks up\n               with an air duct pipe. Zips faster and faster until we're in-\n\n          \n\n          \n\n          45                                                                45\n\n               INT. TURTLES LAIR - TRAINING DOJO\n\n               Leo feverishly works out. He stops, looking up, panting.\n\n                                   LEONARDO (O.S.)\n                         Does ANYBODY train anymore?!\n\n                                   MICHAELANGELO (O.S.)\n                         Just a sec, dude! I'm almost at\n                         level eighteen.\n                             (OS video game explosion)\n                         Scratch that... seventeen.\n\n                                   LEONARDO\n\n                         DONNAY!\n\n                                   DONATELLO (O.S.)\n                         In... uh... a few minutes, Leo. I'm\n                         in the middle of-\n               KZZZT-BOOOM! - An OS invention blows up.\n\n                                   DONATELLO (O.S.)\n                         Um... make that another hour.\n               Leo sighs. Splinter walks by, not stopping.\n\n                                   SPLINTER\n                         A true leader knows how to motivate\n                         his troops regardless of their own\n                         motivations.\n               Splinter walks past a large FUSE BOX. Leo thinks a beat. Then\n               smiles.\n               WIDE SHOT OF LAIR MAIN ROOM as - KACHUNK! - the entire room\n               goes BLACK.\n\n          \n\n                                                                          36.\n\n          \n\n          \n\n          \n\n                                   TURTLES (O.S.)\n                         Aw man! What's goin' on?! WHO\n\n                         TURNED OUT THE LIGHTS!?\n\n                                   LEONARDO (O.S.)\n                         Ninja tag, topside!\n\n                                                                 CUT TO:\n\n          \n\n          \n\n          46                                                                46\n\n               INT. DARK CHAMBER - NIGHT\n\n               Another place that isn't the TMNT lair. Dark and mysterious.\n               Don't know where we are. Feels ceremonial. We see close up\n               detail of statue GRANITE.\n               A DEEP VOICE chants OS in a South American tongue as HIGH-\n               TECH GEAR is placed on the rock. It becomes powered,\n               triggering a reaction in the stone itself.\n               Music builds as we see quick shots of the granite cracks\n               GLOWING RED. Camera travels with the rising glow.\n               End on a pair of DEAD EYES - suddenly come to life. Red glow.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. NYC ROOFTOPS - NIGHT\n\n\n          47                                                                47\n               The boys stand high atop the city below. Readying to run a\n               gauntlet of rooftop hazards. They spy a BILLBOARD off in the\n               distance.            M\n\n                                     ICHAELANGELO\n                         First one to touch old faithful\n                         over there-\n\n                                   DONATELLO\n                         -does the other team's chores for a\n                         week.\n               Leo and Raph glare at each other.\n\n                                   LEONARDO/RAPHAEL\n                         Deal.\n\n                                   MICHAELANGELO\n                         I'm with Leo!\n\n                                   DONATELLO\n                         Actually, I think you and I should\n                         pair up, Mikey.\n\n                                   MICHAELANGELO\n                         You kiddin' me?! I mean, no offense\n                         Donnie, but you ain't exactly the\n                         biggest hitter on the bench.\n\n          \n\n          T\n\n          \n\n          \n\n          \n\n          \n\n                                                                  37.\n\n          \n\n          \n\n          \n          Don is grinning. Observing the subtle tension.\n\n                              DONATELLO\n                    Just trust me on this one.\n          Music builds to a fun number as the two teams run parallel on\n          buildings. The course requires them to work as a TEAM,\n          throwing, catching and propelling one another from obstacle\n          to obstacle.\n          Leo accidentally slips, PLOWING Raph face-first into a brick\n          wall. Raph, convinced Leo did it on purpose, uses his next\n          opportunity to hurl Leo dangerously high and far over a\n          billboard. The situation escalates at each juncture.\n\n                              LEONARDO\n                    Have you been avoiding me? Barely\n                    seen you since I got home.\n\n                              RAPHAEL\n                    I been busy.\n\n                              LEONARDO\n\n                        (SARCASTIC)\n                    I see. So... you're definitely not\n                    upset at me or anything, right?\n\n                              RAPHAEL\n                    Why'd you think that?\n\n                              LEONARDO\n                    I don't know... your brother gets\n                    to go on a world-wide training\n                    mission and you have to stay home.\n                    Might upset me too.\n\n                              RAPHAEL\n                    Are you trying to make me mad?\n\n                              LEONARDO\n                    I'm just saying, I'd understand if\n                    you were upset.\n          Their intensity ESCALATES.\n\n                              RAPHAEL\n                    You wouldn't understand the first\n                    thing about me, daddy's boy - OOF!.\n           hey both trip over a duct, tumbling in a ball. They stop\n          rolling, continue fighting.\n\n                              LEONARDO\n                    Is that what this is about? You\n                    think Splinter likes me best?\n\n                              RAPHAEL\n                    You'd love that, wouldn't you?\n\n          \n\n                                   M\n\n          \n\n          \n\n          \n\n          \n\n                                                                       38.\n\n          \n\n          \n\n          \n               WIDER - Don and Mikey are already sitting there.\n\n                                   MICHAELANGELO\n                         So nice of you to join us,\n                         gentledudes.\n\n                                    DONATELLO\n                         And by the way, I prefer the\n                         classic military corner tuck for my\n                         bedsheets.\n\n               M\n                ikey and Don high five. Leo and Raph aren't amused. They\n               stare down. Raph does his BULLY FLINCH fake-lunge... only Leo\n               doesn't twitch. Suddenly-\n\n                                   MICHAELANGELO (O.S.)\n                         Whoa! Whawazzat?!\n               The others rush over to the edge with Mikey.\n\n                                    ICHAELANGELO\n                         You dudes see that up there?\n               OFF HIS LOOK - We see LARGE SHADOWS moving with in a large I-\n               BEAM CONSTRUCTION SITE. The movement is coming from one of\n               the higher floors.\n\n                                   MICHAELANGELO\n                         So what now, captain?\n\n                                   LEONARDO\n                         We need to come up with a plan.\n\n                                   RAPHAEL\n                         Later!\n               Raph RUNS OFF toward the action.\n\n                                   LEONARDO\n\n                         RAPH!!!\n               But Raph doesn't stop. All three look at each other. Then-\n\n                                   MICHAELANGELO\n                         Welcome home.\n\n          \n\n          \n\n               EXT. I-BEAM HIGHRISE CONSTRUCTION\n\n\n          48                                                                48\n               The boys cross over on a large CONSTRUCTION CRANE and scale\n               up the few more stories to the top. They stand on a scaffold\n               underneath the floor of the activity.\n               ON WALL - Deep CLAW MARKS are carved into the steel, much\n               like by April and Casey's loft. Don notices.\n\n                                   DONATELLO\n                         Guys, I've got a bad feeling...\n\n          \n\n                              L\n\n          \n\n          \n\n          \n\n          \n\n                              M\n\n          \n\n          \n\n          \n\n          \n\n                                                                     39.\n\n          \n\n          \n\n          \n\n                              RAPHAEL\n                    Ahh, let's take a tiny peek.\n          They scale to the top floor. Peering over the edge.\n\n                              MICHAELANGELO\n                    Well, there's a good/bad news\n                    scenario for ya.\n          CAM BEGINS TO CRANE UP from Turtles to activity on the floor.\n\n                              MICHAELANGELO\n                    Good news is that there are a\n                    buncha Foot Ninja gettin' the snot\n                    kicked out of `em.\n          CAM FINISHES ON FLOOR - Showing SIX FOOT NINJAS and KARAI\n          squaring off against a LARGE BIGFOOT-LIKE MONSTER! It tosses\n          them around like stuffed animals.\n\n                               ICHAELANGELO (O.S.)\n                    Bad news is WHAT's kickin' the snot\n                    out of `em...\n          ON TURTLES - As they've all now crept up to the dark corner\n          of the floor. A FOOT NINJA gets clobbered and sails past\n          them, and off the building. (safely to a scaffold below)\n\n                               D\n\n                               ONATELLO\n                    An interesting conundrum. Do we\n                    hold dear the value of life and\n                    help the Foot regardless of our\n                    tumultuous past?\n\n                              MICHAELANGELO\n                    I vote for sitting back and\n                    enjoying the show.\n                        (to Leo)\n                    Whaddaya say, leader boy?\n          ON LEO - He's troubled. The burden of \"leader\" shouldered.\n\n                              RAPHAEL\n                    Nah. We kick butt.\n          Raph jumps forward! Leo rolls his eyes, as all the Turtles\n          jump into the fray. The Foot are surprised at first, and the\n          Bigfoot Monster is confused as well.\n          ON LEO - He stops when he comes face to face with Karai.\n\n                               EONARDO\n                    Who are YOU?!\n          ON KARAI - She pauses a moment. They exchange expert katana\n          attacks. Stalemate. She gestures to the Foot as they use this\n          opportunity for their escape. As they leap away, Karai looks\n          back at the Turtles...\n\n          \n\n          R\n\n          \n\n          \n\n          \n\n          \n\n                                                                     40.\n\n          \n\n          \n\n          \n          The Creature immediately CHASES the boys throughout the\n          structure, as they use all their ninja skills to avoid it,\n          not to mention impalement on the bed of rebar below!\n           aph tries to turn the tables and attacks the Creature! The\n          boys have no choice but to help him... putting them in deeper\n          trouble.\n          The I-Beam is getting dented and twisted with each impact.\n          The tussle begins to fall - whoomp, whoomp - down many\n          flights of floors.\n          Raph gets separated at one point, jumping off the side of the\n          building to catch up, and swings himself back onto the bottom\n          floor to await the others.\n          SMASH! They fall into Raph's floor.\n\n                              RAPHAEL\n                    Nice of ya's ta join me.\n          But the Turtles eventually get cornered. And just as the\n          Creature closes in-\n\n                              MICHAELANGELO\n\n                    YEEEAAAAARGGHHH!!!!!\n          The creature stops. Confused. So are the other three turtles.\n\n                              MICHAELANGELO\n                    What? I saw it on a nature show\n                    once.\n          The creature SCREAMS BACK! Boys freak out.\n\n                              TURTLES\n\n                    AAAAAAGGHHHHH!!!!!\n\n          A\n           NGLE ABOVE TURTLES - As a large teetering pallet filled with\n          dried cement and blocks to come CRASHING DOWN ON THEM! The\n          Turtles are buried under the rubble.\n          RUH? - The Creature is confused... until it's hit with a\n          blinding light, and then an EXPLOSION - FWOOM! We hear heavy\n          footsteps thumping through the light. Shapes start to form\n          until we see...\n          ...LIVING VERSIONS OF THE FOUR STONE GENERALS! Sporting HIGH\n          TECH GEAR - a mix of tech with ancient magic scrawlings.\n          Their bodies \"glow\" with a red inner life, seeping through\n          their stone cracks and piercing eyes.\n          The Generals are all ANIMAL-THEMED - Mute and powerful Ape-\n          themed costume (\"MONO\"), Eagle Leader (\"AGUILA\"), agile\n          Jaguar (\"GATO\") and the deadly snake-like female\n          (\"SERPIENTE\"). Large. Imposing. Completely bad-ass.\n          The Creature ROARS and FIGHTS to no avail...\n\n          \n\n                                                                         41.\n\n          \n\n          \n\n          \n               BURIED POV - Silent. The Turtles start to GROAN, regaining\n               consciousness. Moonlight shoots in as they move the rock and\n               stand up, groggy.\n               ON MOUTH OF ALLEY - Through the smoke we can see silhouettes -\n               a large hairy shape, along with FOUR VERY LARGE SHAPES. The\n               sounds of freighter doors CLOSING, engines revving and then a\n               caravan of sorts pulling away.\n               WHOOOOOP! - A POLICE SIREN chirps. Approaching the now-\n               destroyed site.\n\n                                   DONATELLO\n                         Better hit the tunnels, guys.\n               Donnie uses a small prod to prop open a MANHOLE COVER. Don,\n               Mike and Leo jump in. Leo looks back, Raph is still stewing.\n\n                                    LEONARDO\n                         Raph. Save it for another day.\n\n                             (BEAT)\n\n                         RAPH!\n               Raph knows he has to go. Reluctantly he enters the sewer. The\n               lid closes as the alley is illuminated by POLICE CHERRIES.\n\n               A\n                 beat, then Mikey barely pops the lid open for another peek.\n\n                                   MICHAELANGELO (O.S.)\n                         Y'know, it's not that bad, dudes.\n               ON BUILDING - Actually, the place is destroyed. Dented, torn\n               and looking like a post-night raid in WWII.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. WINTERS TOWER - NIGHT\n\n\n          49                                                               49\n               UP ANGLE on the Tower. Dead of night. No one around.\n\n          \n\n          \n\n               INT. WINTERS TOWER SECRET CELL BASEMENT - CONTINUOUS\n\n\n          50                                                               50\n               A cavernous structure. Dimly lit. High ceiling. A few odd\n               silhouettes here and there.\n               We hear the clicking of Winters' shoes echo as he enters.\n\n                                   WINTERS\n                         What seems to be the problem?\n               Karai and six Ninja are already there.\n\n                                   KARAI\n                         The \"problem\" is that we were hired\n                         to merely patrol the city and\n                         report anything \"strange\" to you.\n\n                                   (MORE)\n\n          \n\n                              W\n\n          \n\n          \n\n          \n\n          \n\n                                                                    42.\n                              KARAI(cont'd)\n                        (grabs sword hilt)\n                    You never said anything about\n\n                    MONSTERS.\n          Winters smirks, looking at the mouse who thinks he can take\n          the lion. He reaches to a satchel on the floor. The Foot\n          TENSE in anticipation. Instead... Winters comes up with a\n\n          MONEY BRICK.\n\n                               INTERS\n                        (tosses money brick)\n                    So, your job duties were just\n                    redefined. Congratulations on your\n                    promotion.\n          SHINK! - Karai pulls out her To and slices the brick in mid-\n          air. Winters STOPS and looks back over his shoulder.\n\n                              KARAI\n                    We may be hired help to you, but\n                    you should never forget... we are\n                    the Foot Clan.\n          ON WINTERS - Condescendingly finds this particularly `cute'.\n\n                              WINTERS\n                    Oooooooh...\n          It sets the Foot off. They all grab their weapons, moving\n          toward Winters. Karai flips forward, sword drawn and at\n          Winters throat!\n          ...as Winters stands still... and begins to LAUGH.\n          Slowly, the thumping of FOUR SETS OF FEET lumber out of the\n          shadows. Reveal themselves to be THE FOUR STONE GENERALS.\n          They flank Winters, who is just loving the theatricality of\n          it all.\n          The Foot Ninja leap back. Winters remains confident and\n          unmoving. Generals SMIRK at Karai and the Foot.\n\n                               WINTERS\n                    I believe we made a deal, Karai. I\n                    expect you to honor it.\n                         (beat, stares her down)\n                    You do understand \"honor\", don't\n                    you?\n          Karai stews... unblinking stare. Of course she does.\n\n                              WINTERS\n                    So I don't care what part of\n                    \"muscle for hire\" you don't\n                    understand. I hired your muscle.\n                    Now exercise the ones attached to\n                    your feet and...\n                        (closer - terse)\n                    ...get back to work.\n\n          \n\n                                                                    43.\n\n          \n\n          \n\n          \n          Karai slowly steps back. Winters smiles wide, reaches into\n          the drawer and takes another brick of bills and tosses it to\n\n                               W\n          a Foot Ninja. Then another to a second Ninja.\n\n                               INTERS\n                    So I will double... no, no...\n                    TRIPLE your pay for your troubles.\n                        (stare down)\n                    Are we cool?\n          ON FOOT - They just stare back, blank goggles. Probably\n          seething inside. Winters is flanked by Generals.\n\n                              WINTERS\n                    Are we... cool?\n          The Foot don't move. Tense. Karai finally nods. Terse.\n\n                              WINTERS\n                    Ninjas. No sense of humor.\n                        (to Generals)\n                    So how did we fare?\n          CORRIDOR ENTRANCE - a hunched SHAPE undulating in chains is\n          wheeled into the light.\n          Winters approaches it - chained to a high-tech and uplit\n          pallet on the floor. We can barely make it out as being the\n          HAIRY CREATURE from the I-beam fight.\n\n                              WINTERS\n                        (close, quiet)\n                    So it begins...\n          It SCREAMS. Fights it's restraints. Tires. Breathing heavily.\n          Winters approaches, safely inches away from his fanged maw.\n          Creature suddenly lunges forward! Winters doesn't flinch. He\n          merely grins at the creature.\n\n                              WINTERS\n                        (to General Aguila)\n                    Were there any problems?\n          AGUILA speaks in a gravelly, hardened voice. He towers over\n          Winters by a foot. Clearly the leader of the four.\n\n                              GENERAL AGUILA\n                    None, my lord.\n\n                              WINTERS\n                        (to Karai)\n                    You see, now THAT'S a good soldier.\n                    You two should compare notes.\n          Karai and Aguila stare at each other. Karai obviously not\n          used to being handled like this.\n\n          \n\n                              K\n\n          \n\n          \n\n          \n\n          \n\n                                                                  44.\n\n          \n\n          \n\n          \n\n                              KARAI\n                    Just what is this all about?\n\n                              WINTERS\n                    Oh, let's call it a scavenger hunt.\n                        (re: Generals)\n                    I now have the power and know-how,\n                    but I need the speed and stealth of\n                    an organization such as your own.\n                    Not to mention an organization that\n                    values discretion.\n\n                              KARAI\n                    But of course.\n\n                              WINTERS\n                    You see, I have nine more beasts\n                    like this that should be coming to\n                    town very soon. Thirteen in all, to\n                    be exact.\n          The Four Generals move the monster into a position on the\n          floor ahead - into a DISK on the floor. ON CEILING - We see\n          the top of a CAGE inserted over top, creating a cell.\n\n                               ARAI\n                    But... why? Why here? Why now?\n\n                               WINTERS\n                    Instinct, mostly. They're animals\n                    at their core.\n                        (looks off, distant)\n                    And they recognize something\n                    familiar in the air... in the\n                    stars.\n\n                        (BEAT)\n                    What can I say? I'm a lover of\n                    animals.\n          The disk ROTATES. WIDER we see that there are already some\n          cells inserted on the large stone disk in the floor. Filled\n          by darkened silhouettes of creatures that we're probably glad\n\n                               W\n          we don't fully see. Glowing eyes pierce out of the darkness.\n\n                               INTERS\n                    So you go and get to know each\n                    other. And don't forget... play\n                    nice.\n          The Generals turn and walk-push the Foot out of the door.\n          They move to fight back, but Karai waves her hand.\n\n                              KARAI\n                    Not now. Our business will be\n                    handled at a later time...\n\n          \n\n                                   D\n\n          \n\n          \n\n          \n\n          \n\n                                   R\n\n          \n\n          \n\n          \n\n          \n\n                                                                 C\n\n          \n\n          \n\n          \n\n          \n\n                                                                          45.\n\n          \n\n          \n\n          \n               After they leave, we pause for A BEAT on Winters. Quiet.\n               Tired. Contemplative.\n\n                                                                  UT TO:\n\n          \n\n          \n\n          51                                                                51\n\n               INT. TURTLES LAIR - KITCHEN - AFTERNOON\n\n               Three brothers sit around their breakfast table, looking hung\n               over from the previous night's brawl. Mikey comes in, looking\n               the worst of all, and plops into his seat. Cam circles table.\n\n                                   MICHAELANGELO\n                         Dudes, did anyone get the license\n                         plate of the thing that hit us last\n                         night? Oi, my head...\n               Don pours over a thick book on MONSTERS AND MYTHOLOGY.\n\n                                   DONATELLO\n                         Was it just me, or did that\n                         creature look familiar?\n\n                                   RAPHAEL\n                         We coulda taken it if you slackers\n                         woulda pitched in sooner.\n\n                                   LEONARDO\n                         Fact remains, Raph, that we should\n                         have never been there in the first\n                         place.\n\n                                    APHAEL\n                         Well, I suppose that we shoulda let\n                         Mr. Cuddly-kins continue to spread\n                         happiness throughout the city... oh\n                         wait... HE WAS A FREAKING MONSTER\n                         TRYIN' TA KILL US!!! Good call,\n                         fearless leader.\n\n                                    ONATELLO\n                         Come to think of it, it WAS pretty\n                         strange to see the Foot too. And\n                         who was that woman?\n\n                                   MICHAELANGELO\n                         I dunno, but she sure gave Leo a\n                         run for his money.\n\n                                   LEONARDO\n                             (still fighting with Raph)\n                         This is my fault now, Raph? I'm the\n                         only one who has to be responsible!\n\n                                   RAPHAEL\n                         Hey, you're the \"trained master\",\n                         not me.\n\n          \n\n                                                                  46.\n\n          \n\n          \n\n          \n\n                              MICHAELANGELO\n                        (quickly interjected)\n                    Dudes-can-it-here-comes-Splinter.\n          ON DOOR - Splinter walks in, HUMMING to himself.\n\n                              SPLINTER\n                    Good morning, my sons.\n\n                              TURTLES\n                    Morning, sensei.\n          Splinter makes himself a TEA. Room is SILENT.\n          ON TURTLES - Raph and Leo GLARE at one another while they\n          eat. Don is pouring over a THICK BOOK while Mikey sits with\n          his forehead on the table.\n\n                              SPLINTER\n                    If anyone needs me, I'll be\n                    watching my stories.\n\n          S\n           plinter walks out. OS sound of the TV being turned on. At\n          the table, the glare continues.\n\n                               LEONARDO\n                    Hothead.\n\n                              RAPHAEL\n                    Splinter-junior.\n\n                              NYC DIRT REPORTER (O.S.)\n                    And in the latest of a string of\n                    strange criminal activity, a\n                    construction site was nearly\n                    destroyed last night. Authorities\n                    believe a violent battle had taken\n                    place earlier that evening.\n          The boys react and rush into the MAIN LIVING AREA.\n          ON TV - a well-coifed News Reporter stands outside of the I-\n          BEAM TOWER. In the daylight, we can see the building is\n          twisted and dented from the night's fighting.\n          The boys immediately JUMP FORWARD. Mikey grabs the remote and\n          ups the volume.\n\n                              SPLINTER\n                    My sons, what-\n          Splinter's eyes go wide. He looks at his boys listening to\n          the TV intently. Mikey nurses his sore head.\n\n                              SPLINTER\n                    I believe you boys have some\n                    explaining to do...\n\n          \n\n                                   M\n\n          \n\n          \n\n          \n\n          \n\n                                                                         47.\n\n          \n\n          \n\n          \n               Splinter looks at the Turtles. Busted, as we-\n\n                                                             X-DISSOLVE TO:\n\n          \n\n          \n\n          52                                                                  52\n\n               INT. SPLINTER'S ROOM - LATER\n\n               The Turtles are kneeling before their sensei.\n\n                                   SPLINTER\n                         Leonardo, I am most disappointed in\n                         you. You are the leader of your\n                         brothers. I was counting on you to\n                         bring order to the chaos of this\n                         family.\n\n                                   LEONARDO\n                         But Master Splinter, how can I be\n                         expected to do so when Ra-\n\n                                   SPLINTER\n                         There are no excuses when you are\n                         the Leader, my student.\n               ON LEO - Biting his tongue. Hard.\n\n                                   SPLINTER\n                         But the involvement of the Foot and\n                         their mysterious leader worries me.\n\n                                    ICHAELANGELO\n                         I'm personally worried about a\n                         monster running around the streets\n                         of New York. But hey, that's just\n                         me.\n               Don elbows Mikey back in line.\n\n                                   RAPHAEL\n                         We hafta go out and find who's\n                         responsible for this. There ain't\n                         no other solution.\n\n                                   SPLINTER\n                         Raphael, there are better ways to\n                         use your skills in ninjitsu. Fact-\n                         gathering. Analysis. Observation.\n                         Direct contact should only be your\n                         last resort.\n\n                                   RAPHAEL\n                         Wow, sounds... exciting.\n\n                                   LEONARDO\n                         Save the brute vigilante junk for\n                         that Nightwing guy.\n\n          \n\n               N\n\n          \n\n          \n\n          \n\n          \n\n                                                                          48.\n\n          \n\n          \n\n          \n\n                                   MIKEY/RAPH\n                         \"Nightwatcher\".\n\n                                     LEONARDO\n                         Whatever.\n               Raph stands and exits the room. The others stay silent as we-\n\n                                                                WIPE TO:\n\n          \n\n          \n\n               INT. SECRET NIGHTWATCHER AREA IN SEWER - LATER\n\n\n          53                                                                53\n               QUICK SHOTS - Nightwatcher gearing up.\n                 ightwatcher emerges from a MAN HOLE. Walks to a long-\n               forgotten and shadowed underside of a BRIDGE. He points up\n               with a REMOTE - chirp! Slowly, his MOTORBIKE begins to lower\n               on retractable grappling hooks.\n\n               O\n                N BIKE - Explodes out of a BACK ALLEY and into the night.\n\n          \n\n          \n\n               EXT. NEW YORK CITY BACK ALLEYS/STREETS - NIGHT\n\n\n          54                                                                54\n               Various shots of Nightwatcher tearing all over the city. On\n               bike and on foot. Angry. Trying to work it out of his system.\n               He's swallowed it all up to this point... getting harder.\n\n          \n\n               BEGIN MONSTER HUNTING MONTAGE\n\n          55                                                                55\n               Aggressive and driving music. Various shots of the Stone\n               Generals capturing a laundry list of CREATURES that are\n               coming into the city. See the tech, detail and precision that\n               the Winters' operation works. Foot Ninja act as living\n               \"tracking devices\" around the city.\n               - The Generals capture a Sloth-like creature, jumping in\n               throughout rafters above. The Foot try to help by blocking\n               exits.\n               - The Generals capture a werewolf-like creature in the high-\n               speed subway tunnels. The Foot maneuver the subway car.\n               - General Mono takes on a large scale YETI-like monster. A\n               WWE-sized match set in a large abandoned warehouse.\n               - Close calls, as humans come close to seeing the monsters...\n               but rarely do. We see small house pets swiped away. Fleeting\n               glimpses of limbs, claws and teeth in the shadows all over\n               NYC. Meat trucks torn open and their contents \"stolen\".\n               - Intermix quick shots of Generals and collars clamping,\n               cells locking, etc.\n\n          \n\n                                                                         49.\n\n          \n\n          \n\n          \n               - See more cells being filled in Winters Basement. ONLY 3\n\n               EMPTY CELLS REMAIN.\n\n                                                                    CUT TO:\n\n          \n\n          \n\n          56                                                                  56\n\n               EXT. APRIL AND CASEY'S LOFT APARTMENT - NIGHT\n\n               Quiet part of the neighborhood. Their lights are fully on.\n\n                                   APRIL (O.S.)\n                         You sure you don't want to spar a\n                         bit?\n\n          \n\n          \n\n               INT. APRIL AND CASEY'S LOFT APARTMENT - CONTINUOUS\n\n\n          57                                                                  57\n               April is dressed in work-out gear on a grouping of floor\n               mats. She twirls a wooden KATANA as part of a floor routine.\n               Wow - she's actually pretty good! Casey eats a bag of chips\n               with one hand, does curls with a dumbbell with the other.\n\n                                   CASEY\n                         Nah. Ever since you started with\n                         the blade weapons you, um... you\n                         kinda scare me.\n\n                                   APRIL\n                         Suit yourself.\n                             (she stops - a beat)\n                         Case?\n\n                                   CASEY\n                         Yeah?\n\n                                   APRIL\n\n                             (AWKWARD)\n                         Are you happy? I mean, with your\n                         life. With me.\n               Casey pauses a beat. Tries to be upbeat.\n\n                                    CASEY\n                         Yeah. Sure.\n                              (beat - serious)\n                         You?\n               April thinks just as much.\n\n                                   APRIL\n                         Yeah.\n               They sit on that for a moment. Casey leans in for a kiss.\n               April doesn't notice. Awkward. Casey changes his mind.\n\n                                   CASEY\n                             (walks to the window)\n                         I'm going outside for some air.\n\n          \n\n               N\n\n          \n\n          \n\n          \n\n          \n\n                                   N\n\n          \n\n          \n\n          \n\n          \n\n                                                                       50.\n\n          \n\n          \n\n          \n               Casey slips out onto the fire escape. April knows better.\n\n                                   APRIL\n                             (to herself)\n                         Be safe.\n\n          5\n\n          \n\n           8                                                                58\n\n               EXT. LOFT ROOFTOP - CONTINUOUS\n\n               Casey climbs up from the fire escape. Checks to make sure\n               he's alone. He reaches inside a chimney flue and pulls out -\n               A BASEBALL BAT and his CLASSIC WHITE HOCKEY MASK!\n               He slips it on. Does a few warm up swings. Cricks his neck.\n\n          \n\n          \n\n          59                                                                59\n\n               EXT. NYC ROOFTOPS - CONTINUOUS\n\n               All is still, until the panicked face of a BURGLAR enters\n               frame. Being held by his collar.\n\n                                   BURGLAR\n\n                         I'M SORRY MAN! I-I-I WON'T EVER DO\n\n                         IT AGAIN! I'M SORR-OOOF!\n               BAM! - the leather fist of Nightwatcher slams Burglar back,\n               tripping over an A/C duct. He tries to shield himself-\n               REVERSE ANGLE - BOOM! - Nightwatcher lands in the FG.\n\n                                    IGHTWATCHER\n                         Funny how you jerks don't care\n                         about crossing the line `til\n                         someone else does it... all over\n                         yer HEAD!\n               Night hurls him back into a roof access door, denting it.\n               Raph's loving this. Walks to the Burglar and picks him up.\n\n                                   BURGLAR\n                             (almost in tears)\n\n                         I'M SORRY! I'M SORRY!!!\n\n                                   NIGHTWATCHER\n                         Boy, oh boy, did YOU pick the wrong\n                         night to be a criminal...\n               Night cocks his fist just as-\n\n                                   CASEY (O.S.)\n                         Hey champ. You think you're being a\n                         little rough on the guy?\n                ight slowly turns around. Menacing. Casey's taken aback.\n\n          \n\n                           (\n\n          \n\n          \n\n          \n\n          \n\n                                                                     51.\n\n          \n\n          \n\n          \n\n                              CASEY\n                    Are you that Nightwatcher fella?\n                        (beat - unimpressed)\n                    A little smaller than I expected.\n\n                              RAPHAEL\n                        (inside helmet)\n                    Case? No way!\n\n                              CASEY\n                        (poking Raph with bat)\n                    I'm talkin' to you, pal. You think\n                    you own these rooftops? Well, lemme\n                    teach you a thing'r two.\n                        (takes out bat)\n                    Class is Pain 101. Meet your\n                    instructor... Casey Jones.\n          It's getting serious. Casey's bat is suddenly wrapped by\n          Night's CHAIN, and pulled down. Raph's visor flips up.\n\n                              RAPHAEL\n\n                        (GRINNING)\n                    You keep on playing with fire,\n                    little man, you might just get\n                    burnt.\n\n                              CASEY\n                    Raph?! Is that you?!\n                        (scans costume)\n                    What-what are you doing?!\n\n                         THINKS)\n                    Are you pretending to be...\n          ON RAPH - His eyes look around for an answer. Nothing.\n\n                               CASEY\n                    Why would you-\n                         (finally gets it)\n                    -oh.\n                         (a beat)\n                    So that would mean...\n                         (then REALLY gets it)\n\n                    -OOOHHHHHH!\n          Raph smiles... the first genuine one he's had in a long time.\n\n                               RAPHAEL\n                    Yep.\n          IN BG - The Burglar tries to get away. Casey and Raph both\n          spy him. Look at each other. Mischievously grin as we-\n\n                                                          DISSOLVE TO:\n\n          \n\n                               (\n\n          \n\n          \n\n          \n\n          \n\n                               (\n\n          \n\n          \n\n          \n\n          \n\n                                                                       52.\n\n          \n\n          \n\n          \n\n          \n\n          60                                                                60\n\n               EXT. ROOFTOPS - LATER\n\n               CLOSE ON - The panicked face of the Burglar. CAM ROTATES to\n               show him hanging upside-down. CAM WIDENS TO REVEAL he's bound\n               by chains and dangling from a street lamp!\n               CAM PANS UP THE BG BUILDING TO REACH - the two old friends\n               sit perched on a high tower, surrounded by gargoyles. They\n               blend right in. Both masks are off.\n\n                                   RAPHAEL\n                         I dunno, I just got tired of the\n                         \"nothing\". Sitting around waiting\n                         for some disaster to cross our\n                         paths. Of us battling Utroms and\n                         Triceratons or any other friggin'\n                         creature... when there was still\n                         some guy gettin' mugged 100 feet\n                         above the lair. Just didn't seem\n                         right. `Specially if we had the\n                         means to do somethin' about it.\n               Raph twirls a billy bat between his fingers. Stops.\n\n                                    RAPHAEL\n                         And we did... but turns out I was\n                         the only one who was willing to do\n                         it, tho. So I just saved up, bought\n                         and tweaked a sweet bike, fitted\n                         the costume and began moonlighting.\n\n                              BEAT)\n                         Papers called me \"The\n                         Nightwatcher\", so I went with it.\n\n                                    C\n\n                                    ASEY\n                         \"And a legend was born\". So what\n                         was your handle before that?\n\n                                   RAPHAEL\n                         I kinda liked \"The Midnight\n                         Marauder\"...\n\n                                    CASEY\n                             (makes an \"eww\" face)\n                         Stick with Nightwatcher, ninja boy.\n\n                             (THEN)\n                         The guys ever catch on?\n\n                                    RAPHAEL\n                         Pfft. You kiddin' me? Leo's been\n                         away for, like, forever. And the\n                         other two are so wrapped up in that\n                         party business they'd never notice.\n\n                              BEAT)\n                         So what about you? How's things\n                         with April? Haven't seen ya's since\n                         you two moved in together...\n\n          \n\n                                                                       53.\n\n          \n\n          \n\n          \n\n                                   CASEY\n                         They're good... I guess. I dunno,\n                         seems like all I do lately is just\n                         make her upset. She used to laugh\n                         so much... now it's mostly just\n                         working all day, and coming home to\n                         point out how I'm a screw up.\n                             (points to hockey mask)\n                         She doesn't like me doing this. And\n                         I know she's pretending to not know\n                         I'm out tonight. But she knows. And\n                         she knows I know she knows.\n                             (looks out at city)\n                         Life just kinda got complicated\n                         suddenly... y'know?\n\n                                   RAPHAEL\n                         Yer tellin' me...\n               Casey looks at his old bud.\n\n                                   CASEY\n                         Raph?\n\n                                   RAPHAEL\n                         Yeah?\n\n                                   CASEY\n                         Nice to see ya, man.\n               Raph acknowledges. The moment is broken by a HORRIBLE SHRIEK!\n\n                                   CASEY/RAPHAEL\n                         What was that?!\n               They both spring to their feet and run to the back of the\n               roof. They hear the scream AGAIN off in the distance.\n\n                                   RAPHAEL\n                         For old time's sake?\n\n                                   CASEY\n                         What the shell.\n               ON RAPH - He stops, mid-replacement of his helmet.\n\n                                   RAPHAEL\n\n                             (DISAPPROVING)\n                         Bro. Seriously.\n\n          \n\n          \n\n               EXT. ROOFTOPS\n\n\n          61                                                               61\n               The two run and leap across the rooftops. Two vigilantes\n               searching for the source of the scream. They finally reach a\n               point where they don't hear it anymore.\n               EDGE OF ROOFTOP - They look out. Silent.\n\n          \n\n                                                                  54.\n\n          \n\n          \n\n          \n\n                              CASEY\n                    I think we lost it.\n\n                               RAPHAEL\n                    It's gotta be around here\n                    somewhere.\n          SCREEEEECH!!! - A large VAMPIRE-LIKE CREATURE flies up from\n          the alley below and spreads its 30-foot wings!\n\n                              CASEY/RAPHAEL\n\n                    WAAAAAAAAAAAGGGHHHH!!!!!!!!\n          It's about to attack when - THUNKA-THUNKA-THUNKA - it's\n          drilled with TRANQUILIZER DARTS from below! CHOOOM! - A\n          grappling hook winds around its feet. The Creature struggles\n          but is pulled down hard!\n\n                              CASEY\n\n                    WHAT'S GOIN' ON, RAPH?!\n\n                               RAPHAEL\n                    Did I mention we ran into a monster\n                    last week?\n\n                              CASEY\n\n                    NO. NO, YOU KINDA FAILED TO TELL ME\n\n                    ABOUT THAT ONE, BUDDY!\n          They inch closer to the edge. Peek over.\n          ON ALLEY - See the Four Generals putting a pounding on the\n          Creature. They subdue it with all their hardware. The Foot\n          stand guard, helping in the BG.\n\n                              CASEY\n                    The freakin' FOOT?!\n                        (looks to Generals)\n                    What about the walking statues?\n                    Were you going to mention THOSE?!\n\n                              RAPHAEL\n                    Nope. Those are a first for me too.\n                        (gets cocky)\n                    We can take `em.\n          One of the generals effortlessly picks up a TRASH DUMPSTER\n          and wallops the Creature with one blow.\n\n                              CASEY\n                    On second thought...\n          The Generals put the Creature in a cell. Wheel it to a\n          TRANSPORTER VEHICLE as it drives away. They're just about to\n          leave when-\n\n          S\n           HINK! - Casey accidentally knocks a tiny piece of rock from\n          the ledge. It falls down - CLANG! - on a garbage can lid.\n\n          \n\n          6\n\n          \n\n          \n\n          \n\n          \n\n                                      R\n\n          \n\n          \n\n          \n\n                                      G\n\n          \n\n          \n\n          \n\n          \n\n                                                                       55.\n\n          \n\n          \n\n          \n               ON GENERALS - they turn around. Look up.\n               GENERAL GATO POV - He scans the two. Organic Earth-based.\n\n                                       ENERAL GATO\n                         Witnesses.\n               Aguila snarls and fires the tranq gun! Raph dives in front of\n               Casey, taking the hit himself!\n\n                                    APHAEL\n\n                         AAAARRGGH!!!!!\n\n                                   GENERAL AGUILA\n                             (to Gato)\n                         Fetch.\n               Gato SMILES as the other three board a Transport Vehicle.\n\n                                      CASEY\n                         Not good.\n               Raph takes out NINJA SMOKE PELLETS and throws them on the\n               roof - FWOOM! When the smoke clears, Casey is standing there\n               alone! Raph is 10 feet away as Casey flinches and takes off\n               too.\n\n                                   NIGHTWATCHER\n                         You ever heard of smoke pellets?\n\n                                   CASEY\n                         Hey - you're the ninja, not me!\n               BOOM! - Gato lands up on the roof and quickly gives chase!\n               They can't lose him, even when they drop to street level.\n\n          \n\n          \n\n               EXT. NEW YORK CITY STREETS - MOMENTS LATER\n\n\n           2                                                                62\n               Raph and Casey are tearing ass through the alleyways, trying\n               to escape the thing that's close on their tail.\n\n                                   CASEY\n\n                         WHAT WERE THOSE THINGS, RAPH?!\n               Raph ignores him, looking for a street sign. Then he sees it -\n               56th Street.\n\n                                      RAPHAEL\n                         Bingo.\n               Raphael quickly dashes left through TRAFFIC!\n               DOWN ALLEY BEHIND THEM - BOOM BOOM BOOM - We see Gato\n               bounding down the wall, almost in a four-legged run,\n               occasionally jumping off walls at incredible speeds! A true\n               jaguar. It leaps through the traffic as well.\n\n          \n\n                                C\n\n          \n\n          \n\n          \n\n          \n\n                                                                  56.\n\n          \n\n          \n\n          \n          UNDER A BRIDGE - Raph points up and - CHOOP! - hits a remote\n          that lowers his MOTORCYCLE.\n\n                              CASEY\n                    What are we gonna do, Raph? WHAT\n\n                    ARE WE GONNA-\n                        (sees bike)\n                    -hey, cool ride.\n\n                                RAPHAEL\n                    Hop on.\n          Raph leaves Gato in a cloud of dust... but not for long. Gato\n          clamors along... keeping up with the weaving bike! In the\n          fray, Casey looses his mask... as it gets trampled by Gato.\n          It's an insane chase, with Raph trying to lose him as Casey\n          swings his bat, trying to stave off the Stone General.\n          Suddenly - THUNK!\n          A circular OBSIDIAN BLADE lands in his wooden bat. He looks\n          at it.\n\n                                CASEY\n                    Um, Raph?\n          Raph sees the blade! They manage to switch positions in mid-\n          ride, with Casey driving and Raph in back. Raph throws kicks\n          and punches at their pursuer when he closes in.\n          The chase takes them to a PARKING GARAGE as they circle\n          upwards, Gato jumping from car to car, still on their tails!\n          ROOFTOP - They're trapped. He doesn't have a hope... aside\n          from jumping the bike to the next roof!\n\n                               ASEY\n\n                    T\n                     hisiscrazythisiscrazythisiscrazy.\n          He lets out the clutch as they make the jump! WHAM! - Sparks\n          and crucial pieces fly off the undercarriage. They both look\n          back at Gato up and away at the top of the structure.\n\n                              CASEY\n\n                    SUCK ON THAT, ROCK FACE!\n                        (Gato leaves edge)\n\n                    THAT'S WHAT I THOUGHT, PUNK!\n          ...and then -thumpthumpthump- Gato JUMPS DOWN TOWARD THEM!\n\n                                CASEY\n                    Oh crap.\n          Casey guns it - BUT THE BIKE DOESN'T WORK ANYMORE - as Gato\n          is in mid-air, taking off. Casey grabs the weakening Raph and\n          drags him off.\n\n          \n\n                                   C\n\n          \n\n          \n\n          \n\n          \n\n                                                                         57.\n\n          \n\n          \n\n          \n\n          \n\n          63                                                                  63\n\n               EXT. ROOFTOP BEHIND LARGE LETTER SIGN - CONTINUOUS\n\n               Gato lands and patrols the roof... almost SNIFFING them out.\n               Casey and Raph are barely hidden inside a rooftop shack.\n               Suddenly - BOOM! - Gato finds them. He tries to smash through\n               the steel door with his bare hands!\n               Raph leans his body into the door as a last ditch effort.\n               He's taking a pounding as the door is denting with each slam\n               by Gato. Casey tries to help as well.\n               Gato comes close to breaking in. Very tense. Then-\n               -the LIGHT on his exo-suit begins to STROBE. A signal. A\n               signal to return home. He surveys quickly... then runs off.\n               Casey and Raph fall out. Both shell-shocked.\n\n                                    ASEY\n                         Okay, so it was great seein' ya\n                         again, Raph.\n\n                             (BEAT)\n                         Raph?\n               ON RAPHAEL - He's got a dart in his shoulder, obsidian disks\n               stuck in his shell, and has collapsed unconscious.\n\n                                   CASEY\n                         Gotta get you someplace safe, pal.\n                         And then, then I need to go buy\n                         some new undies.\n\n                                                                    CUT TO:\n\n          \n\n          \n\n               INT. APRIL AND CASEY'S LOFT APARTMENT - LATER\n\n\n          64                                                                  64\n               April is finishing up with her workout. She hears the fire\n               escape outside of the building and the window slide open.\n\n                                   APRIL\n                         Casey, I think we need to talk.\n                             (turns around)\n                         I don't want- whoa.\n               OFF HER LOOK - Casey is standing there, bracing the near-\n               unconscious Raph, now without his Nightwatcher garb.\n\n                                   CASEY\n                         Could use a little... help here...\n\n                                    RAPHAEL\n\n                             (WEAK)\n                         Hey April... how ya been?\n\n          \n\n                                      M\n\n          \n\n          \n\n          \n\n          \n\n                                                                        58.\n\n          \n\n          \n\n          \n               Raph passes out as we-\n\n                                                                 WIPE TO:\n\n          \n\n          \n\n          65                                                                 65\n\n               INT. TURTLES LAIR - KITCHEN\n\n               Splinter and the other three are finishing up dinner. They\n               close the pizza box.\n\n                                    ICHAELANGELO\n                         My compliments to zee chef.\n\n                             (BEAT)\n                         Le brrrraaaaaaapp!\n               Mikey walks to the fridge of leftover birthday cake.\n\n                                   MICHAELANGELO\n                         Anyone for dessert?\n\n                                      EVERYONE\n                                (sick of cake)\n\n                         NO!!\n               The phone suddenly rings. Don rushes over to the jury-rigged\n               payphone on the wall.\n\n                                    DONATELLO\n\n                         COWABUNGA-CARL-PARTY-SERVICES-\n                         Cowabunga-dude.\n                             (face falls)\n                         Waita-slow down April.\n                         What happened to Raph?\n\n                             (BEAT)\n                         We'll be right there.\n\n                                                             SMASH CUT TO:\n\n          \n\n          \n\n               INT. APRIL AND CASEY'S LOFT APARTMENT - LATER\n\n\n          66                                                                 66\n               ON WINDOW - One by one, Leo, Don and Mikey slip into the\n               window. They spot Raph on the futon, being tended to by April\n\n                                    M\n               and Casey. Mikey looks around.\n\n                                    ICHAELANGELO\n                         Whoa... I am in the wrong line of\n                         work. Nice pad, kids.\n               Don immediately starts checking Raph out.\n\n                                   DONATELLO\n                         His vital signs seem to be okay.\n                             (opens his eye)\n                         Pupil dilation is normal.\n               Raph weakly pushes Donnie's head away.\n\n          \n\n          C\n\n          \n\n          \n\n          \n\n          \n\n                                                                  59.\n\n          \n\n          \n\n          \n\n                              RAPHAEL\n\n                        (WEAKLY)\n                    Get the... frig offa me.\n\n                               DONATELLO\n                    Temper is normal too.\n                        (to others)\n                    He's going to be fine. Health-wise,\n                    I mean. Otherwise, he's still the\n                    same old Raph.\n\n                        (BEAT)\n                    Whoa.\n          ON RAPH'S SHELL - Two Obsidian Disks are wedged in his back\n          with a Tranquilizer Dart. Donnie wedges out the Obsidian Disk\n          with pliers.\n           LOSE ON - Disk. It's beautiful and deadly. Don examines.\n\n                              DONATELLO\n                    Some sort of stone... probably\n                    obsidian, I think.\n\n                        (CLOSER)\n                    There's an engraving on it.\n                    Looks... South American. Aztec? No.\n                    It's definitely not Mayan.\n          April swallows hard.\n\n                              APRIL\n                    It can't be.\n\n                              DONATELLO\n                    What can't be, April?\n          April sits down on the floor with the disk. Trying to figure\n          things out. Casey leans down to her.\n\n                              CASEY\n                    Would it help things if I said that\n                    we were being chased by a one of\n                    those statues you collected for\n                    that Winters guy?\n          ON APRIL - Her mouth is agape.\n\n                              MICHAELANGELO\n                    I'd say that's a big ten-four.\n\n                              APRIL\n\n                        (MUTTERING)\n                    It's just a myth... a legend.\n\n                        (CLOSER)\n                    It can't be.\n\n          \n\n                        (\n\n          \n\n          \n\n          \n\n          \n\n                                                                    60.\n\n          \n\n          \n\n          \n\n                               CASEY\n                    And I suppose that bringing up the\n                    thirty-foot flying monster would\n                    probably just push this over the\n                    edge, huh?\n          ON APRIL - She slowly turns to Casey. Floored.\n\n                              LEONARDO\n                    What are you talking about Casey?\n\n                              CASEY\n                    Just some story this Winters guy\n                    told us. It all started down in\n                    South America. Long before the\n                    Ashmecks and the Macaroons.\n\n                              APRIL\n                    Azteks and Mayans.\n\n                              CASEY\n                    That's what i said.\n\n                              APRIL\n                    Sit down, Jones.\n                        (to group)\n                    So there was this guy call Yaotl...\n          CAM PANS TO THE RIGHT - As it passes a FG element, the screen\n          dips to black. We hear sounds of a violent BATTLE. Monsters\n          shrieking. Blades clashing. April's retelling Winters' story.\n\n                                                         DIP TO BLACK:\n          Everyone is gathered around as April finishes. Mikey, in\n          particular, is hunched over, intent. Casey, like before, has\n          fallen asleep. Silence for a beat. Then-\n\n                              MICHAELANGELO\n                    Well?! WHAT NEXT?!!!\n\n                              APRIL\n                    No one knows. The legend stops\n                    there.\n\n                         THINKS)\n                    But it's just a legend.\n          Donnie studies the tranq dart under a magnifying glass of\n          April's.\n\n                              DONATELLO\n                    The micro-tech of this dart is\n                    astounding. The molybdenum is of a\n                    grade only found in a few select\n                    markets... not to mention it's\n                    current stock is going for a little\n                    more than two-grand an ounce right\n                    now.\n\n                              (MORE)\n\n          \n\n                              L\n\n          \n\n          \n\n          \n\n          \n\n                              D\n\n          \n\n          \n\n                              L\n\n          \n\n          \n\n          \n\n          \n\n                                                                  61.\n                              DONATELLO(cont'd)\n                        (looks up)\n                    What? I dabble in the market.\n\n                               EONARDO\n                    So what do we have? We have someone\n                    with a lot of money.\n\n                               ONATELLO\n                    Access to technology... and the\n                    means to produce it to exact specs.\n\n                              RAPHAEL\n                    Not to mention having a keen\n                    interest in these monsters... and\n                    them four stone jokers.\n\n                              DONATELLO\n                    If you ask me, it all somehow\n                    points to Winters Corp.\n\n                              LEONARDO\n                    How do you figure that, Donnie?\n          Donatello looks up with MAGNIFYING GOGGLES on. Sarcastic.\n\n                              DONATELLO\n                    Hello? \"Genius\"?\n                        (a beat)\n                    Well, that, and the fact that this\n                    part has a Winters Corporation logo\n                    on it.\n\n                               EONARDO\n                    Do you think he's trying to\n                    recreate the events from back then?\n\n                              RAPHAEL\n                    Well, what would you do with an\n                    army of monsters?\n\n                              MICHAELANGELO\n                    Well, aside from having your own\n                    wrestling league, I dunno... MAYBE\n\n                    TAKE OVER THE WORLD?\n\n                              LEONARDO\n                    Do bad guys still try to do that?\n\n                               DONATELLO\n                    Yes, however they're usually\n                    mortgage re-fi companies.\n\n                        (THEN)\n                    What about it, April? You just\n                    finished working with the guy,\n                    right? Does it make sense?\n\n                              APRIL\n                    Guys! It's a legend!\n\n          \n\n                              R\n\n          \n\n          \n\n          \n\n          \n\n                                                                     62.\n\n          \n\n          \n\n          \n\n                              MICHAELANGELO\n                    Is that \"legend\" like the ginormous\n                    freakin' hairball that attacked us?\n\n                               APHAEL\n                    Or \"legend\" like the moving statues\n                    and flying creature that attacked\n                    me n' Casey?\n\n                              APRIL\n                    Okay. Fine. I'll help for now...\n                    until we prove you're all insane.\n\n                              LEONARDO\n                    Or until we prove Winters is up to\n                    something more than collecting art.\n\n                              DONATELLO\n                    I'll work with April and see if\n                    these Stars of Kikin she told us\n                    about can give us any clues.\n\n                              RAPHAEL\n                    I say we just storm the castle and\n                    face this jerk in person!\n\n                              LEONARDO\n                    Raph, that would be the worst idea\n                    yet. We hang back. Analyze.\n                    Formulate a plan, THEN storm your\n                    castle. Are we clear?\n          Tense stare off between Raph and Leo. Raph moves anyway.\n          Casey stops him. Quieter moment.\n\n                               CASEY\n                    Raph. Don't do it, man.\n\n                        (BEAT)\n                    I spent my whole life running out\n                    of rooms ticked off at the world. I\n                    wish I could take most of `em back.\n                    Sometimes, just takin' a breather\n                    is the best thing to do.\n          ON APRIL - She's listening to Casey... maybe her man-boy is\n          growing up. Raph knows he can't win.\n\n                              RAPHAEL\n                    Yeah... whatever.\n           - and bolts out the door.\n\n                                                            CUT TO:\n\n          \n\n                                   A\n\n          \n\n          \n\n          \n\n          \n\n                                                                          63.\n\n          \n\n          \n\n          \n\n          \n\n          67                                                                67\n\n               INT. SEWERS - MOMENTS LATER\n\n               Cam is moving fast... really fast down the pipes. Raph\n               EXPLODES into frame, running faster than us. He lifts up a\n               BACK PACK... He pulls it open, revealing his Night gear.\n               - as he grabs an overhead PIPE and flips up and outta sight.\n\n          \n\n          \n\n               EXT. STAR-FILLED SKY - NIGHT\n\n\n          68                                                                68\n               We see the same stars we've been tracking move closer into\n               alignment... only now it means so much more to us. CAM\n               LOWERS, as we find ourselves-\n\n          6\n\n          \n\n           9                                                                69\n\n               INT. TURTLES LAIR - EVENING\n\n               Donnie looks through a thick book on ASTRONOMY.\n\n                                    PRIL (O.S.)\n                         Think this is all of them, Donnie.\n               ON DOOR - April walks in, holding a 3-foot-high stack of\n               yellowed documents.\n\n                                   APRIL\n                         I cleaned out my archives on\n                         ancient South America. Might have\n                         found something useful.\n               She takes out a hand-drawn map.\n\n                                   APRIL\n                         A map of the stars, as recorded by\n                         an Aztec Shaman. They pinpoint the\n                         location of the Stars of Kikin...\n                         even though the names changed.\n\n                                   DONATELLO\n                         For use in an Aztec calendar.\n                             (picks up map)\n                         So, if we can cross-reference our\n                         current star field, positioning of\n                         the Stars of Kikin and backtrack\n                         positioning based off of the Aztec\n\n                         CALENDAR-\n\n                                   APRIL\n                         -along with taking into account the\n                         point of origin of the first\n                         occurrence, we should know where\n                         another portal could take place.\n                             (to herself)\n                         Max, what are you up to?\n\n          \n\n                                                                          64.\n\n          \n\n          \n\n          \n               Leo paces back and forth in the main area. Splinter walks in.\n               Mikey plays video games on the main TV.\n\n                                   SPLINTER\n                         Leonardo, time cannot be moved\n                         faster by wearing a groove in our\n                         floor.\n\n                                   MICHAELANGELO\n                         Seriously, dude. We're all\n                         stressed. Try to chill.\n\n                                   LEONARDO\n                         You're playing video games on the\n                         possible eve of Armageddon, Mikey.\n\n                                   MICHAELANGELO\n\n                             (INSULTED)\n                         But I never said I was having fun.\n               Leo looks at the clock.\n\n                                   LEONARDO\n                         Where's Raph?\n\n                                   SPLINTER\n                         Leonardo, a true leader knows the\n                         virtue of patience... and when to\n                         stop exercising it.\n\n                                   DONATELLO\n                         We're almost done, Leo. You might\n                         want to go get him... If you can\n                         find him, that is.\n               Leo looks at Splinter, clearly feeling leadership pressure\n               and Raph's absence makes it worse. He leaves the lair.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. NYC SHORELINE - NIGHT\n\n\n          70                                                                70\n               Relatively peaceful. A few freighters off in the distance.\n               Tall dry grass rustles in the wind, as we see a-\n               - TREASURE HUNTER - A stocky middle-aged FAT MAN with a\n               clicking metal detector. Big goofy earphones cover his ears.\n\n                                   TREASURE HUNTER\n\n                             (SINGING)\n                         Monay, monay, monay, MONAYYYY\n                             (really high-pitched, bad)\n                         ...monay!\n               POV FROM WATER - Steadicam shot, watching the man patrol\n               under the light of the moon.\n\n          \n\n                                   W\n\n          \n\n          \n\n          \n\n          \n\n               P\n\n          \n\n          \n\n          \n\n          \n\n                                                                          65.\n\n          \n\n          \n\n          \n               The clicking intensifies. He follows the signal for twenty\n               feet. Drops to the ground and digs the sand...\n\n               .\n                ..and comes up with a old unopened CAN OF SARDINES.\n\n                                   TREASURE HUNTER\n                         Pfft. Figgers.\n               He turns to leave the beach.\n\n                                   TREASURE HUNTER\n                         Lousy metal detector. \"Happy\n                         Anniversary\" present, my big fat\n                         keister.\n               He HURLS the can of sardines over his shoulder. Only, instead\n               of hearing a tiny SPLASH from it hitting the water... we hear\n               a snarling CRUNCH and TINNY-CHEWING.\n               The man stops in his tracks. He turns his head around.\n               CLOSE ON - Man's face, eyes wide in shock. Cam pulls back,\n               slowing just as the crown of a GNARLY SKULL crests the bottom\n               of the screen.\n               PTOOEY! - The tin \"key\" is spit back onto the sand. He bolts.\n\n                                   TREASURE HUNTER\n\n                         AAAAAAAAGGGHHHHH!!!!!!\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               INT. WINTERS PENTHOUSE - NIGHT\n\n\n          71                                                                71\n               It's dark. Barely lit in the hallways of the top private\n               floors of Winters Tower.\n               The camera travels the long and ornate hallways. Decorated in\n               a different sense than the main building... in a sense of\n               family, tradition and legacy.\n                ictures spanning centuries in age. Some photos. Some\n               portraits. Families. Loved ones.\n\n          \n\n          \n\n          72                                                                72\n\n               INT. WINTERS STUDY - CONTINUOUS\n\n               Cam continues until we find a high-backed chair parked in\n               front of an oversized blazing FIREPLACE.\n               ON CHAIR - Winters sits. Tired. Sullen. Sipping brandy. Looks\n               above the fireplace and lifts his snifter in a toast.\n\n                                    INTERS\n                         To picking up the pieces.\n\n          \n\n                                                                          66.\n\n          \n\n          \n\n          \n               ABOVE FIREPLACE - is a suit of armor... THE suit of armor of\n               none other than Yaotl the Conqueror. He looks at it with\n               heavy thought. Then-\n\n                                   WINTERS\n                         What is it?\n               Winters doesn't turn around. Stays in E-FG. Cam adjusts to\n               show the shape of GENERAL AGUILA in the doorway.\n\n                                   GENERAL AGUILA\n                         Two creatures remain, my lord.\n               A long beat. Winters closes his eyes.\n\n                                    WINTERS\n                         Well, by all means then. Let's\n                         finish it.\n               ON AGUILA - He squints. Deep in thought and not sharing.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. ROOFTOPS - NIGHT\n\n\n          73                                                                73\n               Nightwatcher runs along the rooftops. He pauses. He lifts his\n               visor to feel the night air on his face. He sees WINTERS\n               TOWER in the distance... practically egging him on.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. PETE'S DINER - CONTINUOUS\n\n\n          74                                                                74\n               Classic Diner design, Pete's Diner is closed for the evening.\n               The last light goes out.\n\n          \n\n          \n\n               INT. PETE'S DINER - CONTINUOUS\n\n\n          75                                                                75\n               A greasy DINER COOK finishes cleaning up the tables. He\n               suddenly hears a noise in the back. Big CLANK.\n               KITCHEN - He walks to the back. He hears the noise... now\n               from inside the WALK-IN FREEZER. He slowly approaches it.\n               ANOTHER NOISE. He moves to open\n               INSIDE OF FREEZER - the door slowly opens. The man's face\n               peers in. His eyes go WIDE. He SCREAMS!!!\n\n          \n\n          \n\n               EXT. ROOFTOPS - CONTINUOUS\n\n\n          76                                                                76\n               Nightwatcher hears the scream. Runs to the source and looks\n               down at Pete's Diner. Sees the commotion inside. Uses his\n               bolo chain and a power cable to form a ZIP LINE down the\n               street as-\n\n          \n\n                                                                       67.\n\n          \n\n          \n\n          \n\n          \n\n          77                                                               77\n\n               INT. PETE'S DINER - MOMENTS LATER\n\n               -KERSMASH! He goes through the front window! He stands, cat-\n               like. Ready for anything. The room is only lit by the neon\n               signage behind the counter. Suddenly -\n               Night creeps to the freezer. He can hear the CHEWING and the\n               SNARLING behind the thick door. He takes out a spiked brass-\n               knuckle. Ready. Places a hand on the door... and opens it.\n               ON DOORWAY - The creature is huddled over a pile of frozen\n               meat. Chewing with pieces flying everywhere. Disgusting. It\n               turns around - monkey-like and ferocious looking DEMON... but\n               \"cute\" in a bizarre kinda way. Music builds as go-\n               WIDER ON SIDE VIEW - Night stands there. The horrible demon\n               creature suddenly jumps out of the freezer too! Face off with\n               Raph as we realize-\n               -it's only THREE FEET TALL!\n\n                                   NIGHTWATCHER\n                         Hey there little fella. All that\n                         commotion for just little ole y-\n               The Demon SCREAMS! It jumps Night, slamming him to the floor\n               behind a row of tables!\n\n                                   NIGHTWATCHER (O.S.)\n\n                         WAHH! OOOF! AAAGGH! OW!! WHOAAA!!!\n               Plates, glasses and utensils fly everywhere, smashing all\n               over the diner as the Demon pummels him.\n               CLOSE ON NIGHT - The Demon is jumping up and down, slamming\n               his helmeted head repeatedly to the floor! It lunges forward,\n               mouth open as Night backhands it with a PLATE. The Demon\n               jumps back and up, landing on a rotating CEILING FAN.\n\n               T\n                he creature lunges down again, but this time, Night is\n               ready. He fights back. Like fighting with a Chihuahua hopped\n               up on cocaine.\n               A break in the fight. The creature has disappeared. Night\n               knows he's there. He preps. Grabs his SMOKE PELLETS from his\n               pocket. And waits... until...\n               ...the Demon swoops in for another attack! Mouth open, fangs\n               bared as Night tosses the smoke pellets inside!\n               WIDE - POOOMPH! POOOMPH! POOOMPH! The pellets explode in its\n               mouth, sending smoke shooting out of it's nostrils, ears and\n               eyes! It shrieks, flying out of the Diner!\n\n          \n\n          A\n\n          \n\n          \n\n          \n\n          \n\n                                                                  68.\n\n          \n\n          \n\n          \n\n                              NIGHTWATCHER\n                        (victory taunting)\n                    Yeah! That's what I thought! Don't\n                    mess with the Nightwatcher!\n          Night turns. His helmet is still on. He hits his LIGHTS on\n          the side of his head to see through the thick smoke. He finds\n          the DINER COOK huddled behind the counter. Night looks scary.\n\n                              DINER COOK\n                    Pl-pl-please don't hurt me!\n\n                               NIGHTWATCHER\n                    Whattaya talkin' about? I JUST\n\n                    SAVED YOU!\n\n                              DINER COOK\n                    Please, sir. I have kids.\n          Night looks around. He sees the CASH REGISTER on the floor.\n          He picks it up, puts it on the counter.\n\n                              NIGHTWATCHER\n                    There ya go, pal. Make sure this is\n                    safe. HEY - YOU HEARIN' ME?\n\n                              DINER COOK\n\n                    TAKE IT! JUST TAKE IT! DON'T HURT\n\n                    ME, PLEASE!\n\n                              NIGHTWATCHER\n\n                    LISTEN! I DON'T WANT YER FRIGGIN'\n\n                    CASH! WHY DOES EVERYONE HAVE SUCH A\n\n                    HARD TIME BELIEVIN' I'M A GOOD GUY?\n                        (points threatening)\n\n                    I JUST SAVED YOUR STINKIN' LIFE!\n          Sudddenly - SHINK! - a THROWING STAR is lodged in the cash\n          register till! Night jumps. Looks out the window.\n          CAM PULLS WAY WAY BACK, REALLY FAST - Out the Diner and to\n          the rooftop across the street... and over the green shoulders\n          of LEO.\n           ll he sees is a panicked man and the large shape of\n          Nightwatcher standing over him, holding the register.\n          CLOSE ON LEO - He's fuming. Staring down at Nightwatcher. The\n          frustration of the last few days pent up inside of him.\n\n          B\n           ACK IN DINER - Night slowly lays down the register. Trying\n          to figure out his next move.\n\n                              NIGHTWATCHER\n                    This night just keeps gettin'\n                    better n' better...\n\n          \n\n               H\n\n          \n\n          \n\n          \n\n          \n\n                                                                         69.\n\n          \n\n          \n\n          \n               Tense stand-off as... Night suddenly bolts out the back as\n               Leo bolts the roof in hot pursuit!\n\n          \n\n          \n\n          78                                                                78\n\n               EXT. NEW YORK CITY STREETS - CONTINUOUS\n\n               Night tears down the streets and through back alleys. Leo\n               keeps up with him effortlessly, hurling an assortment of\n               THROWING STARS his way.\n               Night suddenly DASHES OUT into traffic! Jumping over passing\n               cars from roof to roof!\n\n                                   LEONARDO\n                         Nice try, amateur.\n               Leo crosses the busy street while still maintaining his\n               secrecy. Zip lines through power lines, avoids an oncoming\n               bus, and flips back onto a cable.\n                e swings and manages to snag Nightwatcher in mid-leap!\n\n                                   LEONARDO\n                         Oof! You're a heavy boy, aren't\n                         you?\n               They both land on a fire escape, as Night clamors to the top.\n               Leo wastes no time in catching up.\n\n          \n\n          \n\n          79                                                                79\n\n               EXT. ROOFTOPS - CONTINUOUS\n\n               The chase continues. Night giving it his all, and Leo keeping\n               up pretty easily. He throws Leo a pretty strong curveball,\n               and Leo barely recovers.\n\n                                   LEONARDO\n                         Okay, someone's been training\n                         pretty hard.\n               It begins to spit rain - and becomes a FRANK MILLER DOWNPOUR.\n\n          \n\n          \n\n               EXT. ROOFTOP DEAD END - CONTINUOUS\n\n\n          80                                                                80\n               Night reaches an area that's a DEAD END. One side of the\n               buildings has a LARGE LETTERED SIGN facing away. Fills the\n               rooftop with silhouettes. No choice but to turn around...\n               ...as Leo slows to a stop at the other end of the building.\n\n                                   LEONARDO\n                         I want you to know that I\n                         appreciate your intentions. But you\n                         can't change the world like this.\n               INSIDE HELMET - All we hear is rain pouring. Raph can't hear\n               Leo - just sees him wagging his finger at him.\n\n          \n\n                                                                     70.\n\n          \n\n          \n\n          \n\n                              NIGHTWATCHER\n                        (to himself in helmet)\n\n                              L\n                    Oh god. He's lecturing.\n\n                               EONARDO\n                        (now audible)\n                    ...so I'm going to give you one\n                    chance to just walk away and stop\n                    this vigilante nonsense.\n          Leo unsheathes his two katanas. Raph can't hear him.\n\n                              NIGHTWATCHER\n                        (to himself in helmet)\n                    Okay, Leo. Wanna play?\n          Nightwatcher drops TWIN BOLOS. He twirls them with\n          expertise... then motions for Leo to fight. Charge at each\n          other, running through the rain, weapons drawn.\n          They fight. Hard. And with expertise. Two masters duking it\n          out. It surprises Leo. It fills Night with more adrenaline.\n          There's a break. They circle like tigers. Renewing attacks.\n          Night knows every one of Leo's moves, and counters in turn.\n\n                              LEONARDO\n                    What? How did you-\n          ...then he starts goading him on. Pushing Leo. Prodding.\n          Making him MAD. ...and then Leo fights back. HARD.\n          Night can't keep up. Leo uses every bit of his control,\n          restraint and expertise. He surgically slices the bind under\n          Night's helmet. He jumps on top of the vigilante.\n\n                              LEONARDO\n                    Goodnight, dark prince.\n          Leo UPPERCUTS Night, knocking his helmet off! His face\n          falls... IT'S RAPHAEL! Leo pales.\n\n                              LEONARDO\n                    R-raph?\n\n                        (THINKS)\n                    What?\n          But Raph doesn't feel like explaining. Refuses defeat.\n\n                              RAPHAEL\n\n                    AAAAAAAAGHH!!\n          He mule kicks Leo back. Leo tumbles back, still in shock.\n          They yell at each other through the pouring rain.\n\n          \n\n                                                                          71.\n\n          \n\n          \n\n          \n\n                                   RAPHAEL\n                         You're so friggin' smug! You think\n                         the world revolves around YOU,\n                         dontcha? That we couldn't POSSIBLY\n                         survive without the mighty and\n                         powerful Leonardo to guide us\n                         through our problems, HUH?!\n\n                             (PACES)\n                         Well, I gotta newsflash for ya - we\n                         got along just fine without you.\n\n                                   LEONARDO\n                         I was training! Training to be a\n                         better leader! For you! Why do you\n                         hate me for that?!\n\n                                   RAPHAEL\n                         ...and whoever said I wanted to be\n                         led? I shoulda gone on that\n                         training!\n\n                                   LEONARDO\n\n                         Y\n                          OU WEREN'T READY! You're impatient\n                         and hot-tempered! And more\n                         importantly... I'm better than you.\n               Raph stops in his tracks. Reaches behind his back... and\n               pulls out his TWIN SAIS. He flips them to the front.\n\n                                   RAPHAEL\n                         Well, big brother, I'd have to\n                         disagree with you on that one.\n               Raph takes a ready stance. Leo does too. And they fight.\n               Brother vs. brother. Katana vs. Sai. Technique vs. Heart.\n\n          \n\n          \n\n               EXT. ALLEYWAY - CONTINUOUS\n\n\n          81                                                                81\n               In another part of the city, the Generals have caught the\n               Demon from Pete's Diner. As they carry him to the caravan,\n               their RADIO COMM goes off.\n\n                                   KARAI (O.S.)\n                         The Foot report of strange activity\n                         five blocks north of your location.\n\n                                   GENERAL SERPIENTE\n                         The final creature.\n\n          \n\n          \n\n               EXT. ROOFTOP DEAD END - CONTINUOUS\n\n\n          82                                                                82\n               Camera RISES UP until we reach the rooftop where Leo and Raph\n               continue to duke it out in the rain.\n               They battle. In the end, Raph becomes an uncontrollable ball\n               of anger, unleashing everything on Leo.\n\n          \n\n                                   R\n\n          \n\n          \n\n          \n\n          \n\n                                                                          72.\n\n          \n\n          \n               It ends with Raph pinning Leo to the ground... holding a sai\n\n               MILLIMETERS FROM HIS EYEBALL!\n               Tense. Raph shakes. He looks like he's going to do it... then\n               stops. He collapses back. Almost ashamed of what he's done.\n               Leo just can't believe that Raph bested him. They pant\n               heavily. The rain dies down.\n               Raph RUNS AWAY, across a few rooftops. Away from his brother.\n               He suddenly STOPS and looks back at Leo, small in the\n               distance.\n               CLOSE ON LEO - A SHADOW suddenly falls over him. He looks up\n               to see the FOUR GENERALS surrounding him. He tries to fight\n               back... but is too wiped from Raph.\n               GATO POV - \"reading\" Leo on the ground. He frowns.\n\n                                   GENERAL GATO\n                         It is neither monster nor human.\n               CLOSE ON AGUILA - He manages a small smile.\n\n                                   GENERAL AGUILA\n                         Then he shall perfectly serve our\n                         purposes... let us inform our\n                         commander that the final creature\n                         has been captured.\n               ON RAPH - He sees the commotion from afar... as Leo gets\n               TRANQUILIZED with the Generals' dart cannon.\n\n                                   RAPHAEL\n\n                         LEO!!!\n               Raph runs closer as the Generals lower to the ground and\n               drive off. Raph jumps from rooftop to rooftop to try and\n               catch his brother.\n\n                                   RAPHAEL\n\n                         L\n                          eo!!! Hang on!!\n               But the Caravan is too fast, and eventually loses Raph.\n\n                                    APHAEL\n\n                         NOOOOOOOO!!!!\n               Raph gets weak and collapses to his knees on the roof. The\n               sun begins to rise. He has to return to the sewer.\n\n                                                                    CUT TO:\n\n          \n\n          \n\n               INT. TURTLES LAIR - MORNING\n\n\n          83                                                                  83\n               April and Don are poring over books at the kitchen. Mikey\n               paces behind them. Raph storms in, barrels past them all.\n\n          \n\n               S\n\n          \n\n          \n\n          \n\n          \n\n                                                                       73.\n\n          \n\n          \n\n          \n\n          \n\n          84                                                                84\n\n               INT. TURTLES LAIR - TRAINING DOJO\n\n               Raphael walks to Splinter, practicing himself in the dojo.\n               Raph holds his Sais in one hand, his bolo chain in the other.\n               Clenches both tight.\n\n                                   SPLINTER\n                         Raphael? What is the matter?\n\n                                   RAPHAEL\n\n                             (RANTING)\n                         I was out, and did... something...\n                         something happened and I- ARRRGH!!!\n               Raphael picks up a HEAVY WEIGHT and hurls is across the dojo.\n               Splinter is unfazed, but he won't take any more.\n\n                                   SPLINTER\n                         Raphael! Kneel.\n               Raph stops. Breathing heavy. Falls in line - walking to\n               Splinter and dropping to his knees in front of his father.\n\n                                   RAPHAEL\n                         I did something... I did something\n                         really stupid, Master Splinter.\n\n                                    SPLINTER\n                         Go on...\n\n                                   RAPHAEL\n\n                             (SEMI-RAMBLING)\n                         I know why you chose him now. I\n                         know that there's a reason why he's\n                         the better son and I'm not.\n\n                             (THINKS)\n                         And I think I made things worse\n                         tonight.\n                             (beat - calming down)\n                         A WHOLE lot worse... I know you\n                         must be ashamed of me, father.\n               Raphael is lost in his guilt. Splinter kneels in front of\n               Raph.\n\n                                   SPLINTER\n                         Raphael. You always bear the\n                         world's problems on your shoulders.\n                         It is an admirable quality when you\n                         are a protector of others...\n                plinter gently lays a hand on Raph's shoulder.\n\n          \n\n                                                                       74.\n\n          \n\n          \n\n          \n\n                                   SPLINTER\n                         But you must realize that while, at\n                         times, you may not be my favorite\n                         student, it does not mean that you\n                         are my least favorite son.\n               Raphael looks up. Having not thought of it that way.\n\n                                   SPLINTER\n                         You are strong, passionate and\n                         loyal to a fault. These are the\n                         merits of a great leader as well...\n                         but only when tempered with\n                         compassion and humility.\n\n                                   RAPHAEL\n                         But Master Splinter, I messed up\n                         big tonight... I mean BIG.\n               Splinter chews on this.\n\n                                   SPLINTER\n                         Leonardo? R\n\n                                       APHAEL\n                                (beat, ashamed)\n                         Yes.\n               Splinter is grim. Nods. But he moves on.\n\n                                   SPLINTER\n                         Well then, I believe your brothers\n                         may be in need of a leader.\n               Raphael looks up. Finally, his shot. He holds his SAIS in one\n               hand, and his BOLO CHAIN in the other. Ninja Turtle vs.\n               Nightwatcher. He grips them both hard. He drops the chain.\n\n                                   RAPHAEL\n                         Thank you... father.\n               Mikey bursts in the door, frantic.\n\n                                    MICHAELANGELO\n                         Dudes. I think you're gonna want to\n                         check this out.\n\n                             (BEAT)\n                         Where's Leo?\n               Raph and Splinter share a look. Raph has to tell the others.\n\n          \n\n          \n\n               INT. TURTLES LAIR - MOMENTS LATER\n\n\n          85                                                             85\n               April and Donnie sift through their charts and calculations.\n\n          \n\n                                                                   75.\n\n          \n\n          \n\n          \n\n                               DONATELLO\n                    So, the first time that this portal\n                    was opened, the Stars of Kikin\n                    aligned...\n                        (sketches on high tech\n\n                         SCREEN)\n                    ...and that's why it occurred in\n                    that specific South American\n                    region.\n                        (more doodles)\n                    Now if we take into account the\n                    continual rotation of the Earth\n                    since then, as well as the gradual\n                    celestial shift that's happened and\n                    been recorded over... well, over\n                    the course of that mountain of\n                    books over there... we now know our\n                    new location.\n          Donnie's drawn a NEW LINE from the alignment of the stars.\n          April elbows Casey to wake him up.\n\n                               APRIL\n                    Precisely at 40.748 degrees\n                    latitude and -073.985 Degrees\n                    longitude.\n          ON OTHERS - HUH?! Mikey air - calculates math in bg.\n\n                              DONATELLO\n                    New York City.\n\n                              APRIL\n                    Winters Tower.\n\n                              DONATELLO\n                    And the alignment is due to occur\n                    in precisely-\n                        (checks watch)\n                    - well... tonight.\n          It sits in the room. Heavy.\n\n                              MICHAELANGELO\n                    But without Leo... what do we do?\n          No one answers. Splinter looks to Raph. Raph steps up.\n\n                              RAPHAEL\n                    We rescue our brother... and save\n                    New York City.\n          Splinter stands to his side.\n\n                                SPLINTER\n                    Together.\n\n                                                            CUT TO:\n\n          \n\n               -\n\n          \n\n          \n\n          \n\n          \n\n          8\n\n          \n\n          \n\n          \n\n          \n\n                                                                         76.\n\n          \n\n          \n\n          \n\n          \n\n          86                                                                 86\n\n               EXT. WINTERS TOWER - SUNSET\n\n               DARK STORM CLOUDS gather over Winters Tower. A horrible\n               electrical storm is brewing.\n\n          \n\n          \n\n               INT. WINTERS LOBBY - CONTINUOUS\n\n\n           7                                                                 87\n               The lobby has changed. Shots establishing the jury-rigged\n               nature of Winters Tower.\n               - The large Aztec-like calendar on the lobby floor suddenly\n               SPLITS and slides open, creating a 100 foot circle in the\n               middle. Underneath is the TOWERS CELL BASEMENT.\n\n               -\n                 The   disk in the basement is suddenly RAISED up to the lobby\n               area,   replacing the slick marble design with an antiquated\n               stone   version. Only now, THIRTEEN CREATURE CELLS surround the\n               disk.   Very ceremonial.\n               - Finally, Winters' office elevator LOWERS from high above.\n               He's in the actual ceremonial gear worn by Yaotl years ago.\n               He holds the helmet to his side. Very serious. He looks over\n               his now-ceremonial lobby... satisfied.\n                 PUSH IN on one cell, as Leo sits hunched over, unconscious\n               and helpless...\n\n                                                             SMASH CUT TO:\n\n          \n\n          \n\n               INT. APRIL AND CASEY'S LOFT APARTMENT\n\n\n          88                                                                 88\n               Quick shots of April and Casey gearing up. Casey with his off-\n               the-shelf sporting gear. April with sleek-looking Japanese\n               combat gear and weaponry.\n               They both emerge from their rooms, dressed to kill. Casey's\n               jaw drops as we scope out April.\n\n                                     CASEY\n                           Wow.\n\n                                     APRIL\n                               (models it)\n                           Picked it up on my last trip to\n                           Japan. You... like it?\n\n                                     CASEY\n                           Oh... oh yeah.\n               They share the moment. Seeing what they forgot about each\n               other when they first met. It's enough for them to smile.\n\n                                     APRIL\n                           Where's your mask?\n\n          \n\n                                      M\n\n          \n\n          \n\n          \n\n          \n\n               E\n\n          \n\n          \n\n          \n\n          \n\n                                                                       77.\n\n          \n\n          \n\n          \n\n                                   CASEY\n                             (faking confusion)\n                         Mask? What mask?\n               April runs into the other room and comes back with her hands\n               behind her back. She takes out a NEW MASK for Casey - cool,\n               crisp and a badass paintjob.\n\n                                      CASEY\n                         No way...\n\n                                   APRIL\n                         I was saving it for our\n                         anniversary.\n\n                                      CASEY\n\n                             (BEAT)\n                         Thanks.\n               Almost awkward as Casey leans forward and is about to kiss\n               her... Then a MUSICAL TUNE (first bar of the TMNT series)\n               plays on a car horn outside, interrupting them again.\n\n                                   APRIL\n                         That's our ride.\n\n          \n\n          \n\n          89                                                                89\n\n               INT. VEHICLE - NIGHT\n\n               CAM PULLS BACK from the back seat. Everyone is in \"the zone\".\n               Splinter and Don sit in the back seat. Pulling further toward\n               the front, we see April and Casey.\n                nd on Raph in passenger seat and Mikey driving.\n\n                                    RAPHAEL\n                         You know I ain't much on speeches.\n\n                             (BEAT)\n                         But we can do this. Leo, or no Leo.\n                             (looks around)\n                         Not because of our individual\n                         strengths... but because of how we\n                         function as a team.\n\n                                    ICHAELANGELO\n                         I love you man.\n\n                                   RAPHAEL\n                         Don't push it.\n                             (to April)\n                         April, this is going to be\n                         dangerous. You sure you're in?\n\n                                   APRIL\n                         I feel responsible, fellas. I found\n                         the Generals for him.\n\n          \n\n               O\n\n          \n\n          \n\n          \n\n          \n\n                                                                          78.\n\n          \n\n          \n\n          \n               CAM CONTINUES TO PULL OUT - as the familiar jingle of\n               Cowabunga Carl fades in and we see the Cowabunga Carl Party\n\n                                    R\n               Van in full view.\n\n                                    APHAEL (O.S.)\n                         Nice an' incognito there, Mikey.\n\n                                   MICHAELANGELO (O.S.)\n                         Well, I didn't see you offering any\n                         suggestions... besides-\n                             (imitates Splinter)\n                         - a true ninja can hide in plain\n                         sight, my son!\n\n                                   SPLINTER (O.S.)\n                         I heard that!\n               Van takes off as the CAMERA SLOWS in the street, watching it\n               drive away. NYC civilians point to the sky, worried. PUSH IN\n               on a TV/STEREO STORE WINDOW - Simon's Electronics.\n               ON TV - Broadcasting a news report. Weather alert. Black\n               clouds brew over head.\n\n                                   BUBBLY WEATHER REPORTER (O.C.)\n                         Scientists are calling it the\n                         fiercest storm of the new\n                         millennium, with Dopler Radar\n                         readings coming in off the charts.\n                         Authorities are imposing a curfew\n                         to avoid possible civilian harm.\n                         Stay tuned for more in minutes.\n               FURTHER DOWN THE STREET - We see Winters Tower and the\n               darkest clouds of all beginning to collect overhead.\n\n          \n\n          \n\n               INT. WINTERS LOBBY\n\n\n          90                                                                90\n               Winters stands with Four Generals in his office, overseeing\n               the portal. Ready.\n\n          \n\n          \n\n               INT. WINTERS GARDEN - MOMENTS LATER\n\n\n          91                                                                91\n               Karai walks down the center path of the garden, flanked by a\n               DOZEN FOOT NINJA. She motions for them to take position.\n\n                                   KARAI\n                         As ordered - no one gets in. No one\n                         interferes. No one bears witness.\n               SUDDENLY - the security alarm from the front gate BUZZES.\n               Karai waits a beat. It buzzes again. She walks to the\n               SECURITY PANEL by the front gate.\n                N MONITOR - We see CASEY standing there, obscured by a LARGE\n               WOODEN CRATE IN FRONT OF HIM. Karai coldly opens the gate.\n\n          \n\n          C\n\n          \n\n          \n\n          \n\n          \n\n                                                                   79.\n\n          \n\n          \n\n          \n\n                              KARAI\n                    May I help you?\n\n                              CASEY\n                    Yeah, hey, I was supposed   to drop\n                    this off for Mr. Winters.   If I\n                    don't get this done, I am   majorly\n                    in the doghouse. You know   what I'm\n                    sayin', right? Right?\n          The two stare at each other as the CAM ANGLES BEHIND KARAI -\n          she's holding a KATANA SWORD behind her back!\n           AM DOLLIES OVERHEAD as we see that Casey is packing MAJOR\n          sports gear \"heat\" on his end too. Both don't let on.\n\n                              KARAI\n                    Please come in, then.\n\n                              CASEY\n                    Really!?\n                        (beat - gets composed)\n                    I mean, \"but of course\".\n          Casey wheels the crate inside. The gate closes only KARAI HAS\n          NOW DISAPPEARED! Casey opens the front hatch, revealing Don,\n          Raph, Mikey, April and Splinter.\n\n                               R\n\n                               APHAEL\n                    Let's NEVER do this again.\n                        (waves hand in front of\n                         nose, glares at MIkey)\n                    And who did that?!\n\n                              MICHAELANGELO\n                    What?! Why does everyone always\n                    call ME out?\n          A long beat. Then...\n\n                              SPLINTER\n                    I apologize my sons.\n          Everyone looks at sheepish Splinter. A beat. Suddenly-\n          WIDER - The empty garden begins to move. CREEPY, as DOZENS OF\n          FOOT NINJA begin to rise out of the shadows and slink toward\n          our heroes, surrounding them.\n          KARAI makes a dramatic entrance, landing in front of April\n          and Casey. Tense beat.\n\n                              CASEY\n                    I suppose this is where we all take\n                    out our sharp and pointy things?\n\n                              KARAI\n                    You suppose correctly.\n\n          \n\n                                    W\n\n          \n\n          \n\n          \n\n          \n\n                                                                       80.\n\n          \n\n          \n\n          \n               ON HEROES - As they all draw their weapons. HIGH ANGLE as the\n               Foot all draw theirs. Stand-off. Raph twirls his sais.\n\n                                   RAPHAEL\n                         I am SO gonna enjoy this...\n\n          \n\n          \n\n          92                                                             92\n\n               INT. WINTERS TOWER\n\n               Winters walks along all the cells - a final check. He\n               examines one of the cells.\n               PUSH IN - it's LEO. He's slowly waking up - groggy. Muttering\n               incoherently. He PASSES OUT AGAIN.\n\n          \n\n          \n\n          93                                                             93\n\n               EXT. WINTERS PARK\n\n               We finally get to see how much of an ass-kicker Master\n               Splinter is. Same with April, who squares off against Karai.\n               They fight hard. April ends up cornered, about to be skewered\n               by her blade when...\n               -CLUNK! She wobbles and then passes out. When Karai falls out\n               of frame, she reveals CASEY JONES a hundred yards behind her\n               holding his HOCKEY STICK! April frowns.\n\n                                   APRIL\n                         I had the situation under control.\n\n                                   CASEY\n\n                             (SMIRKS)\n                         You're welcome.\n               Mikey fights the most like Jackie Chan - comical maneuvers\n               backed by solid-hitting blows. Don uses his bo-staff in 1001\n               different ways, both offensively and defensively.\n               Casey is enjoying the hell out of it. High flying, adrenaline\n               rush. He even catches April checking him out, and vice versa.\n               April suddenly spots an opening to the front doors!\n\n                                   APRIL\n                         Guys! Front door is open. Now!\n               They all charge the front door!\n\n          \n\n          \n\n               INT. WINTERS TOWER\n\n\n          94                                                             94\n               Winters is happy. He looks up to the heavens. Checks a time\n               piece. Winters begins chanting ANCIENT MAGICK/SPELLS. Looks\n               up through the opening in the middle of the building.\n\n                                    INTERS\n\n                             (THEN)\n\n                         YESSSSSSS!!!!\n\n          \n\n                                                                       81.\n\n          \n\n          \n\n          \n               The cam PULLS UP through the building. Up over NYC. Through\n               the clouds... and into space until we pass all ALIGNED STARS.\n\n               S\n                PACE - The final star drifts into position. A LIGHT BURST\n               EFFECT travels down each star, headed to Earth.\n               BACK IN LOBBY - The light burst flies into the lobby and hits\n               the circle in the middle of all the monsters' cells.\n               ON CIRCLE - The pieces suddenly start to move around. Almost\n               like a sliding puzzle. Then they start to randomly SINK\n               further into the ground. Light pours out of them, until all\n               of them give way to create THE PORTAL.\n               POV OFFICE ABOVE - Each of the Thirteen Cells LIGHT UP to\n               acknowledge their contents. 1... 2... 3...\n\n                                   WINTERS\n                         Finally... finally!\n               ON GENERALS - they're still. Emotionless.\n               The light sequence gets to Leo's cell... it doesn't light up.\n\n                                    WINTERS\n                         What?\n               His mind reels. Looks down at the cells. Nothing. Then it\n               hits him like a ton of bricks. He turns to the Generals...\n\n                                   WINTERS\n                         What did you do?!\n\n          \n\n          \n\n          95                                                                95\n\n               INT. WINTERS LOBBY\n\n               Our six Heroes all tear into the lobby. They turn back, an\n               army of ninjas closing in on them!\n\n                                   MICHAELANGELO\n                         What do we do, dudes?!\n\n                                   DONATELLO\n                         I'm working on it.\n               Raph grips his sais with renewed strength. Casey looks\n               around, putting things together mentally. Tension builds!\n\n                                   RAPHAEL\n                         We get ready for round two.\n               ON CASEY IN CORNER - He reaches into his back, takes out a\n               hockey stick and - SMASH!!! - kills a LOBBY VASE. Suddenly,\n               sirens blare as the OUTSIDE BUILDING SECURITY SHUTTERS SLAM\n               DOWN just like in Act I!\n               The Ninjas are locked out!\n\n          \n\n                                                                    82.\n\n          \n\n          \n\n          \n\n                              RAPHAEL\n                    Yeah!\n          Everyone high fives Casey. Except April. She smiles.\n\n                              APRIL\n                    Nice work, Jones.\n\n                              CASEY\n                    I have my moments...\n\n                              DONATELLO\n                    Look!\n          OFF DON'S LOOK - the mayhem builds at the other end of the\n          vast lobby. The cells are glowing. The portal worsens.\n\n                               DONATELLO\n                    And that would be the swirling\n                    vortex to another world, I assume.\n\n                        (BEAT)\n                    Cool.\n          They all run over. Mikey runs to a cell.\n\n                              MICHAELANGELO\n                    Leo! Is that you?\n          RAARRGH! - A claw swoops out. He dodges out of the way.\n\n                              MICHAELANGELO\n                    I guess that would be a \"no\".\n          ON RAPH - He finds Leo!\n\n                              DONATELLO\n                    Out of the way, please.\n\n          D\n           on places a small EXPLOSIVE on a key lock. Raph pulls Leo\n          out. LIFELESS.\n\n                              RAPHAEL\n                    Hey buddy! Come on, man. Leo,\n                    please wake up!\n          Raph holds Leo in his lap on the floor. Looks like Leo is\n          DEAD. Raph's head falls low, as...\n\n                              LEONARDO (O.S.)\n                    Wh-wh-what took you s-so long?\n          WIDER - Leo is alive. Coughs and slowly gets his strength\n          back. Stands up. He and Raph look at each other. Leo can only\n          imagine what Raph's been through to rescue him. A beat.\n\n                              RAPHAEL\n                    Listen, I - I'm sorry.\n\n          \n\n          9\n\n          \n\n          \n\n          \n\n          \n\n               .\n\n          \n\n          \n\n          \n\n          \n\n                                                                         83.\n\n          \n\n          \n\n          \n               Leo forgives him. Moment is suddenly broken by an OS\n\n               SMASH!!!!\n               ANGLE UP - As WINTERS is thrown out the window of his\n               elevator office! He heads straight for a sword wielding\n               BRONZE STATUE... particularly the sword part. Closer...\n               closer... and...\n                ..just misses it. WHUMP! He crashes onto the floor.\n\n               MOTIONLESS.\n               ON GROUP - They just stare at him. Back up to the office,\n               nearly 150 feet above them.\n               ON BALCONY ABOVE - Aguila looks down. Snarls.\n\n          \n\n          \n\n           6                                                               96\n\n               INT. WINTERS LOBBY\n\n               Winters' body still lays on the floor. This is bad.\n\n                                   CASEY\n                         Is he... is he dead?\n               Mikey takes out a hockey stick from Casey's bag and pokes\n               Winters' limp body. Nothing.\n\n                                   MICHAELANGELO\n                         Yup. He's WAY dead, dude.\n               WINTERS GASPS FOR AIR! Startles everyone in the room.\n               ON EVERYONE - Their faces all drop as Winters stands up in\n               his mini-crater, brushes himself off and is perfectly fine!\n               Winters' mind is racing a mile a minute. Doesn't even notice\n               those around him.\n\n                                   WINTERS\n\n                             (GROANS)\n               Raph can't take it any more. He draws his sais and thrusts\n               them at Winters. THAT gets his attention. Winters looks up in\n               awe at seeing the mutated freaks in front of him.\n\n                                   WINTERS\n                         Fascinating...\n\n                                   SPLINTER\n                         Mister Winters. We mean you no\n                         harm.\n\n                                   RAPHAEL\n                         No harm?! Whatever! I'm about to\n                         give you piercin's in places you\n                         never imagined if you don't tell us\n                         what's going on.\n\n          \n\n               O\n\n          \n\n          \n\n          \n\n          \n\n               O\n\n          \n\n          \n\n          \n\n          \n\n                                                                          84.\n\n          \n\n          \n\n          \n\n                                   WINTERS\n                         We were so close... so close.\n               Winters collapses on the floor. Head in hands.\n\n                                   WINTERS\n                         This was our chance. We could have\n                         changed it all.\n\n                                   APRIL\n                         We know everything Max. We know\n                         you're trying to recreate what\n                         Yaotl started 3000 years ago.\n                N WINTERS - He looks up. Sees April. Exhausted, as we-\n\n                                                                WIPE TO:\n\n          \n\n          \n\n               EXT. FLASHBACK BATTLEFIELD - NIGHT\n\n\n          97                                                                97\n               The same red-tinted battlefield we left in Winter's\n               flashback. Monsters are leaping through the hoards.\n\n                                    W\n\n                                    INTERS (V.O.)\n                         There are things, Miss O'Neil, no\n                         one could possibly know...\n               Camera pushes in on YAOTL and his Four Generals high on a\n               hill, surveying the action.\n               ON YAOTL - He takes off his helmet... IT'S WINTERS HIMSELF.\n\n                                   WINTERS (V.O.)\n                         It was I who stood on that\n                         battlefield all those years ago.\n               Winters/Yaotl looks out at the death and destruction. He\n               looks shocked, surprised.\n               A SHADOW falls over Winters body. He looks up - it's a\n               ceremonial SHAMAN from their enemies' camp.\n\n                                   WINTERS (V.O.)\n                         And we had to pay a price.\n               The Shaman makes hand gestures, chanting. Winters is pulled\n               up in the air, and in a crackle of red electricity, we see\n               him become... grayer.\n                N GENERALS - Same electricity. Different effect. They\n               scream, slowly turned into STONE. Cracks form on their\n               bodies, light shooting out of it.\n\n                                   WINTERS (V.O.)\n                         We were cursed that day. My four\n                         comrades-in-arms were turned into\n                         stone.\n\n                                   (MORE)\n\n          \n\n          B\n\n          \n\n          \n\n          \n\n          \n\n                                                                  85.\n                               WINTERS(cont'd)\n                    Cursed to live on this Earth...\n                    immobile... yet fully aware at all\n                    times to ponder the crimes we've\n                    committed.\n          ON WINTERS - He stands on the battlefield. Alone. As he\n          walks, the CAM MOVES around him. During this, we X-DISSOLVE\n          BETWEEN A FEW SELECT TIME PERIODS between then and now.\n\n                              WINTERS (V.O.)\n                    My curse was to live... forever. To\n                    feel the pain of losing love time\n                    and time again. Of boredom. The\n                    pain... of time.\n           ACK IN PRESENT DAY. Winters stops walking...\n\n                              WINTERS\n                    We were doomed to live this way\n                    until, as the Shaman put it, \"you\n                    corrected the mistakes of your\n                    past\".\n                        (gestures to the lobby)\n                    That's what this is about. Penance,\n                    Miss O'Neil. Finally getting a\n                    chance to right our wrongs.\n\n                              GENERAL AGUILA (O.S.)\n                    Our master fails to include crucial\n                    points in his tale.\n          ON SHADOWS - The Four Generals thump forward.\n\n                              GENERAL AGUILA\n                    He fails to discuss the petrified\n                    agony of three thousand years.\n\n                              GENERAL SERPIENTE\n                    Of the torture of taking CENTURIES\n                    to merely blink an eye!\n\n                              GENERAL GATO\n                    Of watching the erosion of your own\n                    body throughout centuries.\n\n                               GENERAL AGUILA\n                    So, while our great leader basked\n                    in the warmth of the sun and the\n                    glory of fresh air... we rotted in\n                    the stone hell that lasted\n                    throughout Wmillennia.\n\n                               INTERS\n                    My brothers, I-\n\n                              GENERAL AGUILA\n                    WE ARE NO BROTHERS TO YOU! Our\n                    brotherhood was broken the day that\n                    you condemned us to this eternity.\n\n          \n\n                        (\n\n          \n\n          \n\n          \n\n          \n\n                                                                     86.\n\n          \n\n          \n\n          \n          ON DOORS - CAM PULLS BACK ALONG DOORS as each one is barely\n          forced open and dozens of Foot Ninjas pile in the lobby!\n          Karai comes to FG of group. Surveys as the scene continues.\n\n                              GENERAL GATO\n                    And now, our Master has tired of\n                    feeding on the nectar of life. Of\n                    loving his entire life. Of FEELING.\n                        (gestures to portal)\n                    So he prefers to end it all. End\n                    HIS \"misery\" at the expense of\n                    ours.\n          Aguila walks to the cells. The portal writhes in the bg,\n          sinking into the floor.\n\n                              GENERAL AGUILA\n                    But thanks to his cunning, his\n                    technology, we are now capable of\n                    LIVING... we have now become-\n                        (close, creepy)\n                    - gods.\n\n                              GENERAL SERPIENTE\n                    And we shall finish what we began\n                    all those years ago. We will\n                    finally have our victory.\n\n                              GENERAL GATO\n                    Even with one monster still free,\n                    the curse can never be broken!\n\n                              GENERAL AGUILA\n                        (to Winters)\n                    Join us. Join us Yaotl, and live a\n                    life eternal with us at your side!\n          ON WINTERS - He waits. A beat.\n\n                              WINTERS\n                    Never. This was our opportunity! We\n                    were wrong! Don't you understand?!\n\n                               GENERAL AGUILA\n\n                    NO! YOU WERE WRONG.\n\n                         BEAT)\n                    And you are weak.\n\n                              GENERAL AGUILA\n                        (to Karai)\n                    Destroy them.\n          Karai sees Winters' condition. Clearly getting screwed by the\n          very beings who have been nothing but hostile toward her and\n          her Foot Clan. She suddenly GESTURES WITH HER HANDS -\n          military/ninja style.\n\n          \n\n                                                                          87.\n\n          \n\n          \n\n          \n\n                                   APRIL\n                         What does THAT mean?\n\n                                   KARAI\n                         It means we're going to help you.\n               WIDER - 40 Foot Ninja disperse around out of the building,\n               leaving Karai and 4 Foot Ninja behind.\n\n                                   KARAI\n                         My soldiers will find the\n                         thirteenth monster. And you will\n                         bring it back here. Hurry - we\n                         don't have much time.\n               Karai runs off. April looks over at Winters. He nods, still\n               hurting. April takes off after Karai, leaving Casey behind\n               with the Four Foot. They run out into the garden, just in\n               time to see the other Foot disappear into the night.\n\n                                   CASEY\n                         I got shotgun!\n               BACK ON GENERALS - They move toward Winters! The Turtles\n               quickly look at one another. Know what they have to do.\n               They all leap in the way, standing between Winters and his\n               backstabbing Generals.\n               Aguila moves forward to Leo. Raph steps in beside him,\n               defiant. Then Mikey. Then Don.\n\n                                   RAPHAEL\n                         If you mess with one of us-\n                             (looks around)\n                         -you mess with all of us.\n               Aguila smiles at their chutzpa.\n\n                                   GENERAL AGUILA\n                         Challenge accepted.\n          97   The Portal worsens behind them. Sound and sight. The Eight 97\n               are ready to fight.\n               ...and the fight BEGINS! The Turtles leap, pounce and strike\n               with all the exuberance and intensity they've ever had.\n               Winters moves to help the Turtles.\n               Suddenly a WALKING STICK across his chest stops him!\n\n                                   SPLINTER\n                         They must face them alone. As\n                         brothers.\n               Winters debates it in his head for a beat - WHAM! - a\n               tentacle from the portal slams down next to him!\n\n          \n\n                                                                          88.\n\n          \n\n          \n\n          \n\n                                   WINTERS\n                         Alright. We have more important\n                         things to do!\n               ON PORTAL - A small DEMON makes its way out of the portal!\n               Winters runs and flips through the air and then CLOBBERS IT\n               with his bare hands, sending it back down!\n               He lands on the other side.\n\n                                   WINTERS\n                         Help me push the cells into the\n                         portal!\n               Splinter does as the two masters also manage to lay some\n               smackdown on any emerging creature out of the portal.\n\n                                                                 CUT TO:\n\n          \n\n          \n\n               EXT. NEW YORK CITY STREETS\n\n\n          98                                                                98\n\n                                   CASEY (O.S.)\n                         This has got to be the suckiest\n                         vehicle to save the world with.\n               - as the Cowabunga Carl van roars around the corner. Tinkling\n               musical notes chime along with the speed. Appropriately lame\n               and embarrassing.\n               INSIDE VAN - Casey drives, as April, Karai and Four Foot are\n               crammed in the back. Awkward silence.\n\n                                   CASEY\n                         So... anybody from out of town?\n\n               W\n\n                E BEGIN TO INTERCUT BACK AND FORTH BETWEEN THE LOBBY FIGHT,\n\n               AND CASEY/APRIL MONSTER CHASE...\n               LOBBY - The combatants all pair off for their final battle.\n               Utter commotion. Mikey is paired with Serpiente.\n               Donnie is paired with the General Mono. He uses his quick\n               speed and expert staff against the hammer-weilding Statue.\n               Leo fights with Gato. He can't dodge him. He's too fast. Leo\n               lands a lucky blow, but Gato recoils - BOOM! Leo's knocked\n               shell-first into a large GLASS DISPLAY CASE filled with\n               swords and bladed weapons of all kinds.\n\n                                   LEONARDO\n                         Come to daddy.\n               MOMENTS LATER - SMASH! - Leo steps out, ready for action.\n               Strapped with a dozen swords tucked all over his body. He\n               pulls them out randomly as needed throughout the fight.\n\n          \n\n                              C\n\n          \n\n          \n\n          \n\n          \n\n                              C\n\n          \n\n          \n\n          \n\n          \n\n                                                                  89.\n\n          \n\n          \n\n          \n          Raph and Aguila duke it out in and around the MONSTER CELLS.\n          It's a Jackie Chan-inspired sequence, where they have to be\n          aware of their environment to avoid defeat.\n\n                              RAPHAEL\n                    Sensei! How you guys doing?!\n          ON SPLINTER AND WINTERS - The portal is pulling the cells in.\n          About five more to go. Splinter also flips around and takes\n          out another demon trying to escape. Splinter actually seems\n          to be having FUN.\n\n                              SPLINTER\n                    Wonderful, my son. WONDERFUL!\n          BACK WITH APRIL AND CASEY - Rush the streets of NYC.\n\n                              KARAI\n                    My troops have located the final\n                    monster. At the harbor docks.\n\n                               ASEY\n                    Oh, I got this one covered.\n          Casey GUNS IT for the pier, music tinkling. CAM ZOOMS AHEAD\n          THROUGH THE STREETS until it reaches the pier. CAM CRANES\n          over the harbor warehouses until we see -\n          - the 13th monster! Looks like a land-locked GIANT CROCODILE.\n          It appears unconscious - a hundred or so TRANQ DARTS sticking\n          out of it's back. The Van pulls onto the scene.\n\n          I\n           NSIDE THE VAN - Everyone is in shock. The ninjas look at\n          each other.\n\n                               ASEY\n                    Huh. Now there's somethin' you\n                    don't see every day...\n          They pile out of the van.\n\n                              CASEY\n                        (off of monster)\n                    Well, I guess we have to figure out\n                    how to get handsome here back to\n                    Winters' Tower.\n\n                              KARAI\n                    We should tie it to the van and\n                    drag it back.\n\n                              CASEY\n                    Wow. You're... hard core.\n          ON CREATURE - A Foot Ninja stands next to the lifeless body.\n          As he turns his head he doesn't see THE CREATURE'S EYE OPEN!\n\n          \n\n                                                                  90.\n\n          \n\n          \n\n          \n          WIDER - The creature stands up as everyone turns to see. The\n          creature DOG SHAKES his hide, sending the tranq darts flying\n          everywhere! They slam into the walls like shrapnel.\n          ON FOOT - As they dive out of the way. One gets hit with a\n          dart in the chest. Looks down. Passes out.\n\n                                CASEY\n                    Incoming!\n          ON VAN - As they open the doors to act as shields as - THUNKA\n          THUNK THUNK - darts stick in the door!\n          ON CREATURE - He's now standing... and dying to chase\n          something. It GROWLS/SCREAMS as they all pile into the van!\n          Casey immediately throws it in reverse and starts peeling\n          back on the pier, barely staying out of the clutches of the\n          creature smashing the pier in front of them. Get to the end\n          and spin the vehicle around.\n\n                              APRIL\n\n                    FAST! GO FAST NOW!!!\n          Casey guns it, the 12-foot creature mere inches away!\n          STARS IN SKY - Karai sees the stars are slowly moving out of\n          alignment. Losing time fast.\n          BACK IN LOBBY - CRANE DOWN on Winters and Splinter. On the\n          last full cell.\n          ON PORTAL - A pair of LARGE EYES are threatening to come out.\n          In the BG, dozens of winged DEMONS fly around inside.\n\n                              LEONARDO\n                    They better hurry with that last\n                    monster!\n\n                              RAPHAEL\n                    I'm sure my man Casey's got it all\n                    under control...\n\n                              LEONARDO\n                    That's what I'm afraid of.\n          BACK WITH VAN - CLOSE ON CASEY'S FACE - As he's screaming his\n          guts out.\n\n                              CASEY\n\n                    I GOTTA TELL YA... I'M, UH, I'M\n\n                    STILL NOT SURE THAT THIS WAS THE\n\n                    BEST IDEA!!!!\n          WIDER - We see that he's on top of the Van, acting as LIVE\n          BAIT to attract the creature! It's working too! The creature\n          pounces along like an awkward greyhound run. April drives.\n\n          \n\n                              R\n\n          \n\n          \n\n          \n\n          \n\n                                                                     91.\n\n          \n\n          \n\n          \n          Casey is throwing SPORTS EQUIPMENT at it from his large\n          hockey bag. The creature is catching and eating it all.\n          INSIDE VAN - Casey slips in.\n\n                              APRIL\n                    What are you doing in here?!\n\n                              CASEY\n                    Ran outta food.\n          They all look out the back window as the creature pounds\n          closer and closer...\n          BACK IN LOBBY - The Turtles and Generals are at a standstill.\n          Turtles all get thrown into a pile between the Generals.\n\n                               APHAEL\n                    Listen. I'm the last guy to sound\n                    like a TV cartoon, but I think we\n                    need to work together.\n\n                              MICHAELANGELO\n                    Teamwork. The more you know...\n          Don clocks Mikey behind the head.\n\n                              LEONARDO\n\n                        (TEASING)\n                    Why Raph, no solo act tonight?\n          Raph grins. They stand, backs to back... finally as a TEAM.\n          They trust one another, and their efficiency shows.\n          ON PORTAL - More tentacles begin to come out. More claws\n          surround the surface edges.\n          ON TMNT - The music swells. The brothers act and think as\n          one. The way they should. They way they will from now on.\n          ON SPLINTER - As cam PUSHES IN, he stands up. Seeing his\n          sons. As one. As BROTHERS. He smiles.\n\n                              SPLINTER\n                    Yes. Yes, my sons.\n          The Generals can't keep up. It's enough to distract them to\n          make mistakes the TMNT take advantage of.\n          ON WINTERS - Sees the portal light beginning to SHRINK!\n          Because of the TMNT's moves, the Generals are now on the\n          precipice of the Portal, being pulled back. They struggle to\n          stand.\n          The brothers look at each other. The place is violent with a\n          whirlwind and screaming Monsters.\n\n          \n\n          T\n\n          \n\n          \n\n          \n\n          \n\n                                                                     92.\n\n          \n\n          \n\n          \n\n                                RAPHAEL\n                      So who wants ta call it a day?\n\n                                  LEONARDO\n                      I'm in.\n\n                                DONATELLO\n                      Affirmative.\n\n                                MICHAELANGELO\n                      Roger dodger, dude.\n          The   TMNT launch into their FINAL ATTACK - perfectly in synch\n          and   take out each of the Generals, knocking them back into\n          the   PORTAL! They're plucked out of mid-air by cloudy tendrils\n          and   pulled back!\n          The Turtles collapse onto the floor, back to the portal.\n          Silent. Splinter runs over to them.\n\n                                SPLINTER\n                      My sons, I am so proud of you all.\n          Then - BOOM! - the Generals' ARMS slam onto the ridge of the\n          portal - BEGINNING TO CLIMB OUT! The Turtles jump back.\n\n                                TURTLES\n\n                      WAAAHHHHH/OHMIGOD!/WHOOAAA!!!\n\n                                GENERAL AGUILA\n                      Silly children. We are immortals\n                      made of stone! The Earth has only\n                      BEGUN to feel our wrath!\n          The brothers are screwed. They can't stop the Generals. Until-\n          BEHIND TURTLES - Glowing headlights grow larger. Closer. As -\n          KERSMASH!!! The Van flies through the lobby, musical chime\n          and all, being trailed by the Creature! April clips a corner\n          as the vehicle spins out of the path.\n           he Creature tries to stop, but can't on the marble floor. It\n          falls, sliding, clicking its claws trying to stop!\n\n                                  WINTERS\n\n                      LOOK OUT!\n          Winters dives in and pushes the Turtles out of way as the\n          Creature flies in and knocks the Generals back into the\n          Portal! The Cloud Tendrils grab a hold of it and pull it back\n          into the Portal!\n          ON STARS - The Stars move out of alignment, ending the cycle.\n          ON PORTAL - It begins to close. The Generals struggle to get\n          out, only now, we see they are HUMAN... their curse broken...\n          and an eternity of pain and suffering ahead of them.\n\n          \n\n                                                                  93.\n\n          \n\n          \n\n          \n          Aguila tries to fight his way out of the portal.\n\n                              GENERAL AGUILA\n\n                    YOU CANNOT DEFEAT US! WE-\n          WHAM! - Raph and Leo team-roundhouse him back into oblivion!\n\n                              RAPHAEL\n                    I thought he'd never shut up.\n          WIDER - The portal EXPLODES in a upwards funnel. Silence.\n\n                              MICHAELANGELO\n\n                    HOLY CRAP!!!\n\n                                 RAPHAEL\n\n                    WE DID IT!\n\n                              TURTLES\n\n                    YEAH! WHOOHOO! WE DID IT!\n          The brothers high five one another. Splinter smiles proud.\n          ON VAN - Dusty and smoking. The door clangs open. Casey piles\n          out. Karai comes next and accidentally FALLS on Casey in a\n          very compromising position! She slyly smiles. April falls out\n          last beside them.\n\n                              CASEY\n                        (caught - looks at both)\n                    Oh. I, uh -\n          HUHN! - Casey tosses Karai off of him. April's eye cocks.\n\n                              APRIL\n                    Don't try to tell me for one second\n                    that you didn't enjoy tha-\n          Casey just grabs her, cutting her off and they kiss. Like\n          they should have been kissing all along.\n          They stop. Noses close. Smile. They pull apart, revealing\n          MIKEY standing there. Watching them all gooey-eyed.\n\n                              MICHAELANGELO\n\n                    AWWWWWW....\n          Raph and Leo look at each other. A beat. Then hug. Brothers\n          again. Dialogue would just ruin this moment.\n          Splinter walks over to them. CAM ADJUSTS to show Karai and\n          the Foot Ninja standing there. Silence. Finally, Karai steps\n          forward -\n\n                              KARAI\n                    You are every bit the warriors I\n                    was informed you were. You have\n                    passed.\n\n          \n\n                                                                  94.\n\n          \n\n          \n\n          \n          ON TMNT - they're confused.\n\n                              LEONARDO\n                    Passed what?\n\n                              RAPHAEL\n                    You know us?\n\n                              KARAI\n                    I've known OF you for some time.\n                        (beat, to Leo's question)\n                    Savor your victory tonight. For\n                    soon we will have further business\n                    together.\n\n                              SPLINTER\n                    What kind of business?\n\n                              KARAI\n                    The kind that involves familiar\n                    faces from your past...\n          ON TURTLES - They all look at each other.\n\n                              RAPHAEL\n                    She doesn't mean...\n          They look back - and see Karai and the Foot have DISAPPEARED.\n          Raph looks over at WINTERS. He's hunched over in the corner.\n          Can't tell what's going on. They walk over slowly.\n\n                               RAPHAEL\n                    Winters?\n          ON WINTERS - Looks like he's sobbing. They get concerned.\n          Then the sobs turn to LAUGHING. He stands up. His hand is\n          spotted red with his M\n                               own BLOOD from a cut on his cheek.\n\n                               ICHAELANGELO\n                    I'm never usually that happy to be\n                    bleeding.\n\n                              DONATELLO\n                    You would be if you were an\n                    immortal who couldn't bleed for\n                    three thousand years...\n          Winters looks at all the Turtles.\n\n                              WINTERS\n                    Thank you. Thank you from the\n                    bottom of my heart. You've made a\n                    very old man, very very happy.\n\n                              MICHAELANGELO\n                    So, um, what happens now?\n\n          \n\n                                    R\n\n          \n\n          \n\n          \n\n          \n\n                                                                   C\n\n          \n\n          \n\n          \n\n          \n\n                                                                        95.\n\n          \n\n          \n\n          \n                ON WINTERS - He just SMILES. Content. Finally at peace. As he\n                ages thousands of years in front of us... eventually turning\n                to DUST and blowing away.\n\n                                    MICHAELANGELO\n                          Okay... just a little bit creepy.\n\n                              (SNEEZES)\n                          Oh gawd. I think he's in my n-n-\n\n                          ATTCHOOOOO!! OH GROSS!!!\n                CAM PULLS BACK, out of the building, onto the street. See the\n                destruction. The clearing skies. THE SUNRISE.\n\n                                                                    UT TO:\n\n          \n\n          \n\n                INT. TURTLES LAIR - EVENING\n\n\n          99                                                                 99\n                Raph comes to Splinter's room.\n\n                                     APHAEL\n                          You wanted to see me Sensei?\n\n                                    SPLINTER\n                          Sit down, Raphael.\n\n                                    RAPHAEL\n                          Thank you, Master Splinter, for\n                          your guidance.\n                              (thinks, humble)\n                          I can only hope that one day, I\n                          will be able to begin the next\n                          stage of my training like Leo.\n                Splinter smiles. Reaches into a box and takes out a similar\n                MEDALLION to the one given to Leonardo.\n\n                                     SPLINTER\n                          That, my son, you already have.\n\n                              (BEAT)\n                          Our training works in mysterious\n                          ways. But the answer that lies in\n                          all our questions... is family.\n                Raph beams as he accepts the \"badge\". He excitedly stands up.\n                Splinter looks to the hallway where his eyes meet Leo's. They\n                exchange knowing smiles as Splinter winks and we-\n\n                                                              DISSOLVE TO:\n\n          \n\n          \n\n                INT. TURTLES LAIR - LATER\n\n\n          100                                                            100\n                A ROCKIN' NUMBER PLAYS as we cap everyone's adventures.\n                Splinter walks through the lair. It's empty. He walks past\n                their \"trophy room\". He places the ornate head of WINTERS'\n                CANE on the shelf.\n\n          \n\n                                    L\n\n          \n\n          \n\n          \n\n          \n\n                                    S\n\n          \n\n          \n\n          \n\n          \n\n                                                                          96.\n\n          \n\n          \n\n          \n                He sits down to meditate. But first reaches into his robe and\n                pulls out a TIN FOIL PACKAGE. He opens it up and smiles.\n\n                                     PLINTER\n                          Ahh. Double chocolate fudge.\n\n                                                                   WIPE TO:\n\n          \n\n          \n\n          101                                                               101\n\n                EXT. ROOFTOPS - NIGHT\n\n                Mikey and Don are on the rooftops. Leo and Raph join them on\n                top. Leo and Raph have an aside to themselves.\n\n                                    RAPHAEL\n                          So we're cool with the whole\n                          Nightwatcher thing?\n\n                                    LEONARDO\n                          Yeah, we're cool. Our secret, bro.\n                              (checks for clear coast)\n                          You got rid of the stuff, right?\n                QUICK SHOT - Nightwatcher's gear burning in a barrel.\n\n                                     EONARDO\n                          What about the bike, tho?\n\n                                     RAPHAEL\n                              (discreet/confessional)\n                          Okay, so I couldn't exactly destroy\n                          the bike.\n\n                              (BEAT)\n                          Let's just say it's in good hands.\n\n                                    LEONARDO\n                          What do you mean?\n\n                                    RAPHAEL\n                          I mean, it's in good hands.\n\n                                    LEONARDO\n                              (thinks, then realizes)\n                          Oh, you didn't.\n                Raph sheepishly shrugs as we-\n\n                                                               SMASH CUT TO:\n\n          \n\n          \n\n                EXT. NEW YORK CITY STREET\n\n\n          102                                                               102\n\n                                    CASEY (O.S.)\n\n                          WHAAAAAAAAAHOOOOOOOOOOOOOOOOOO!!!\n                As Casey roars down the street on the black motorcycle of\n                Nightwatcher, barely able to hang on.\n\n          \n\n                                                                          97.\n\n          \n\n          \n\n          \n                He drives past WINTERS TOWER - now being converted to a\n\n                NATURAL SCIENCES AND HISTORY MUSEUM.\n\n          \n\n          \n\n          103                                                               103\n\n                EXT. NEW YORK CITY STREET\n\n                A HITCHHIKER THUMB comes into frame. Casey stops his bike.\n                WIDER - It's April. She smiles. Casey hands her a helmet.\n                APRIL'S POV INSIDE HELMET - We see a small DIAMOND RING taped\n                to the visor. She takes it off. Beaming. Models it on her\n                hand. She leans forward.\n\n                                    APRIL\n                          ...yes.\n                She wraps her arms around his waist and holds tight for the\n                adventures that await...\n                CAM FOLLOWS for a beat, then rises up the buildings to-\n\n          \n\n          \n\n                EXT. ROOFTOPS - NIGHT\n\n\n          104                                                               104\n                All four turtles are horsing around. They get geared up...\n                and head off for a game of NINJA TAG.\n                The boys run, hoot and holler as they fly high on the\n                rooftops.\n\n                                    RAPHAEL (V.O.)\n                          So what makes a family? Personally,\n                          it's more than sharing a roof or a\n                          bathroom. It's sharing life... My\n                          father taught me that, and I think\n                          it's pretty much true... y'know,\n                          provided that you don't kill each\n                          other in the process. Or that no\n                          one touches your stuff. Or makes\n                          loud noises when you're trying to\n                          sleep. Or...\n\n                They run close to the camera, once again, a family.\n\n                                    RAPHAEL (V.O.)\n                          Hey, nobody said it was easy.\n\n                And as RAPHAEL and LEONARDO leap toward camera, we-\n\n                                                            CUT TO BLACK:\n\n                                    THE END\n\n\n\n\n\n\nTMNT\nWriters :   Kevin Munroe\nGenres :   Animation  Action  Adventure  Comedy  Drama  Fantasy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:23.856480"}