{"title": "To Sleep with Anger", "film_link": "/Movie Scripts/To Sleep with Anger Script.html", "script_link": "/scripts/To-Sleep-with-Anger.html", "info_raw": "\n\nTo Sleep with Anger Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Charles Burnett\nGenres  Drama\nScript Date : January 1989\n\nRead \"To Sleep with Anger\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nTo Sleep With Anger \n\n\n\n\nINT. ROOM - DAY  (EFX)\n\nGIDEON, a strongly built elderly black man, is sitting at a\ntable. On the table is a large bowl of fruit. A crocheted\ntablecloth hangs over the side of the table. Gideon is\ndressed in a white suit and wearing a pair of well-polished\nwing-tip shoes. His hat almost covers his eyes, which are two\npoints of greenish coals. The fruit in the bowl is engulfed\nin flames.\n\nThe flames look as if they are DRIPPING from the tablecloth\nto the floor. Gideon's shoes start to SMOULDER. His shoes\nBURST INTO FLAMES which spread up his pants leg. His head\nfalls forward as if he had suddenly fallen to sleep. He\ntwiddles his thumbs very slowly in a circle. He crosses his\nlegs as if to get comfortable.\n\nThe camera moves to a CLOSE UP of his burning shoes. The\nimage of his feet begins to appear through his shoes; the\nflames fade; the background changes as we\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. GIDEON'S BACKYARD - DAY\n\nGideon's bare feet are resting on reddish dry earth. Gideon\nis sitting in his backyard under a fruit tree with a Bible\nresting in his hands.\n\nHis house is a small, neatly painted bungalow in South\nCentral Los Angeles. Corn, tomatoes, other vegetables grow in\nthe yard. Chickens scratch around.\n\nHe slowly awakens; his hands are trembling. He looks around\nand sees the chickens. He looks up at the sky and sighs, with\nsome relief.\n\nSUNNY, Gideon's grandson, five years old, has been watching\nhim from the back window of the house. He leaves the window.\n\nINT. HALLWAY - DAY\n\nDOLLY SHOT OF SUNNY\n\nSunny peeps in the workroom. Through the crack in the door, a\nWoman waves to Sunny. \n\nINT. WORKROOM - DAY\n\nThe room is nearly filled with pregnant women and their\nhusbands. SUZIE, Gideon's wife, late 60's or early 70's, a\npicture of health, is giving a last bit of instruction before\nthe class ends. Some of the people are already preparing to\nleave.\n\n\t\t\tSUZIE \n\tRemember, especially you men, that\n\tworking together now will already\n\thave formed a bond before the child\n\tarrives. The woman is very\n\tsensitive.\n\nSomewhere in the room a Male Voice booms out.\n\n\t\t\tVOICE (O.S.) \n\tTell me about it.\n\nThere is a bit of LAUGHTER as all start putting away their\nthings.\n\nEXT. BACKYARD - DAY\n\nGideon looks over at the chickens, scratching around in the\ngarden. He calls to them, but they don't respond. He puts his\nshoes on and walks towards the back door of the house.\nEntering the house, he stops and waits inside the door\npeeping out. In a sort of devilish manner he talks to\nhimself.\n\n\t\t\tGIDEON \n\tSpoiling the little foxes that\n\tspoil my vines.\n\nEXT. BACKYARD - DAY \n\nShot of the backyard. Nothing. Suddenly, with the grace and\nsuspicion of alley cats, kids jump over Gideon's back fence,\nlook around timidly, and start climbing up his fruit tree.\n\nGideon walks down the steps slowly while humming in a deep\nvoice. He turns the water on and walks over to the tree,\ntrapping the kids. Dangling legs, hanging from the tree, try\nto scurry up the tree to safety. Gideon sprays the tree with\nwater. Wet kids fall out of the tree and in one motion leap\nthe fence. Gideon cuts the water off and slaps the dirt off\nhis hands. He is quite pleased with himself.\n\nEXT. ALLEYWAY - DAY\n\nOne of the wet kids is watching Gideon as he goes back inside\nthe house. The boy signals the others who slowly follow in\nsingle file. They jump the fence and climb back up the tree.\nThey let their half-eaten fruit fall to the ground.\n\nINT. BEDROOM - DAY\n\nSuzie opens a letter and a picture of a baby falls out. Suzie\nlooks at the picture before reading the letter.\nShe tries to find a place for it among the other baby\npictures that cover the entire mirror on the dresser. Gideon\ncomes in and starts to undress.\n\n\t\t\tGIDEON \n\tMy mind plays tricks on me. Is it\n\tokay if I take a bath now?\n\n\t\t\tSUZIE \n\tEveryone is gone. Rhonda is in the\n\tbathroom.\n\nRHONDA, Gideon's granddaughter, 13 years old, comes out of\nthe bathroom.\n\n\t\t\tGIDEON \n\tI was looking through my trunk and\n\tI can't find my toby.\n\n\t\t\tRHONDA \n\tWhat's that?\n\n\t\t\tGIDEON \n\tIt is a charm that my great\n\tgrandmother made me.\n\nEveryone notices the worried look on Gideon's face.\n\n\t\t\tSUZIE \n\tIt will show up.\n\n\t\t\tRHONDA \n\tIf my daddy calls, tell him I\n\twalked home.\n\n\t\t\tSUZIE \n\tYou be careful and thank you for\n\tlooking after Sunny.\n\nSunny is asleep on the sofa with a half-eaten apple ready to\nfall out of his hand.\n\n\t\t\tGIDEON \n\tBabe Brother and his wife are\n\ttaking advantage of a situation. I\n\thate to be mean to people but\n\tpicking Sunny up when they feel\n\tlike it has to come to an end. Now\n\tI'm going to ask him how come he\n\tcouldn't be at your birthday.\n\n\t\t\tSUZIE \n\tDon't bother the poor boy. It just\n\ttakes some people a little longer\n\tto figure out who they are.\n\n\t\t\tGIDEON \n\tI don't know how two brothers can\n\tbe so different.\n\nEXT. MRS. BAKER'S BACKYARD - DAY\n\nSKIP BAKER, who is thirteen, crawls out of his pigeon cage,\nholding two birds that he throws up in the air. He climbs\nupon the garage roof and throws rocks at the birds to keep\nthem flying. He WHISTLES and YELLS at them.\n\nCLOSE UP OF BIRDS FLYING\n\nAs the birds circle Skip's house, they do backward rolls and\ndeath grips. Skip throws more rocks to keep them flying. The\nrocks land on Gideon's roof.\n\nThe SOUND of a person trying to learn how to play a TRUMPET\nbreaks the pleasant SOUNDS of the pigeons popping their wings\nand flying in circles over the house.\n\nINT. MRS. BAKER'S HOUSE, RODNEY'S BEDROOM - DAY\n\nRODNEY BAKER is about nine. He stands next to a shaded\nwindow, trying to finger the right valves on his trumpet. He\ntries to hit a high note, but only succeeds in making an\nawful screeching sound.\n\nEXT. MRS. BAKER'S HOUSE - DAY\n\nA group of kids walking by Rodney's window shout insulting\nthings about his horn playing.\n\n\t\t\tKIDS \n\tShut up! Go help your mama wash\n\tdishes!\n\nINT. GIDEON'S KITCHEN - DAY\n\nSuzie is standing over an egg that just fell on the floor.\nThe SCREECHING SOUND of the trumpet from next door is\ninterrupted by the doorbell. Suzie cannot decide on what to\ndo, to clean the egg up or answer the door. The doorbell\nkeeps RINGING.\n\nEXT. FRONT PORCH - DAY\n\nTwo uniformed Police Officers stand impatiently at the door.\n\nINT. FRONT ROOM - DAY\n\nSuzie invites OFFICER SCOTT and OFFICER DAVIS in. Both men\nare white and are in their mid-twenties. Officer Davis does\nmost of the questioning.\n\n\t\t\tDAVIS \n\tWe have a complaint from one of\n\tyour neighbors about a rooster\n\tcrowing in the mornings.\n\nINT. BATHROOM - DAY\n\nGideon is shaving with a straight razor and humming to\nhimself, obviously in a good mood. Suzie sticks her head in.\n\n\t\t\tSUZIE \n\tThe police are here to talk to you\n\tabout the chickens.\n\nThe good mood that Gideon was in dissolves quickly. Gideon\nwipes the soap off his face and throws the towel down. Suzie\nleaves. Gideon brushes his hair and adjusts his bathrobe.\n\nINT. FRONT ROOM - DAY\n\nGideon comes in, still adjusting his bathrobe.\n\n\t\t\tGIDEON \n\tWhat can I do for you, Officer?\n\nSuzie returns to the kitchen to clean the egg on the floor.\nOfficer Scott keeps her in view.\n\n\t\t\tDAVIS \n\tYou know it is against the city\n\tordinance to keep chickens or live\n\tstock.\n\n\t\t\tGIDEON \n\tI always had chickens, ducks and\n\twhatnots.\n\n\t\t\tDAVIS \n\tNot anymore, not in the city.\n\n\t\t\tGIDEON \n\tWe grow most of our own food. The\n\tmoney I get from social security,\n\tmy pension and my wife's work,\n\tkeeps us living on the edge. What\n\tchoice do people like us have.\n\n\t\t\tDAVIS \n\tWell, you just have to move further\n\tout.\n\n\t\t\tGIDEON \n\tNow how far would further out be?\n\n\t\t\tDAVIS \n\tI'm not here to argue, sir.\n\n\t\t\tSCOTT \n\tYou guys don't make anything\n\tillegal, do you?\n\n\t\t\tGIDEON \n\tLike what may I ask?\n\n\t\t\tSCOTT \n\tYou might have a distillery pumping\n\tout barrels of moonshine.\n\nSuzie looks at Scott for a moment and goes into the kitchen.\nGideon is about to lose control. Davis heads off the\nconfrontation.\n\n\t\t\tDAVIS \n\tLook, just get rid of the chickens\n\tand you all have a nice day.\n\nGideon stands in the doorway watching the Police go down the\nsteps.\n\n\t\t\tGIDEON \n\tI'll be damned if I get rid of my\n\tchickens. I ought to get some hogs\n\tand put them out there.\n\nINT. FRONT ROOM - NIGHT\n\nThere is soft knocking on the door. Suzie enter frame wearing\na robe.\n\n\t\t\tSUZIE \n\tWho is it?\n\n\t\t\tBABE BROTHER (V.O.) \n\tBabe Brother.\n\nSuzie opens the door. BABE BROTHER, Gideon's youngest son,\nabout 31, handsome, wearing an expensive suit, comes in,\nbeating the cold off of him and blowing in his hands.\n\n\t\t\tBABE BROTHER \n\tI was hoping you came to the door\n\tinstead of him. It gets cold at\n\tnight.\n\n\t\t\tSUZIE \n\tThis doesn't make any sense; you\n\tare going to drag that poor boy out\n\tin the cold air.\n\n\t\t\tBABE BROTHER \n\tHe will be alright.\n\nThe camera follows Babe Brother. He passes Gideon's room\nwhere Gideon is asleep, snoring loudly.\n\nINT. GIDEON'S BEDROOM - NIGHT\n\nSuzie and Babe Brother enter the bedroom where Sunny is\nsleeping. Suzie gives Babe Brother a blanket to wrap Sunny up\nin.\n\n\t\t\tBABE BROTHER \n\tThanks for taking care of him. I\n\twill try not to be so long next\n\ttime.\n\nBabe Brother gives his mother a good-night kiss. Gideon comes\nto the door.\n\n\t\t\tGIDEON \n\tWhat time is it? Do you think you\n\tcan just treat us like your slave?\n\tIt's after one.\n\n\t\t\tBABE BROTHER \n\tI tried to call to let you know I\n\twas going to be late.\n\n\t\t\tGIDEON \n\tThat's a lie.\n\n\t\t\tSUZIE \n\tLet us settle this tomorrow.\n\n\t\t\tGIDEON \n\tLook! Don't try to get ahead by\n\triding our backs.\n\n\t\t\tBABE BROTHER \n\t\t(shouts)\n\tI pay my own way.\n\n\t\t\tGIDEON \n\tSince when?\n\nHe reaches for Babe Brother but Suzie comes between them.\n\n\t\t\tSUZIE \n\tTake Sunny home, please.\n\nShe pushes Babe Brother away. Babe Brother walks away,\nstaring back at his father.\n\nINT. GIDEON'S BEDROOM - SAME NIGHT\n\nGideon is lying in bed. Suzie gets in beside him.\n\n\t\t\tGIDEON \n\tYour feet are cold.\n\n\t\t\tSUZIE \n\tGo back to sleep.\n\n\t\t\tGIDEON \n\tI asked you to wake me when Babe\n\tBrother comes.\n\n\t\t\tSUZIE \n\tYou all act like two roosters.\n\n\t\t\tGIDEON \n\tI'm not going to let him get away\n\twith murder.\n\n\t\t\tSUZIE \n\tYou and Babe Brother are so much\n\talike...\n\n\t\t\tGIDEON \n\tHe ain't nothing like me. How come\n\ta man has to have sons that are day\n\tand night apart? You ought to stop\n\tprotecting him.\n\n\t\t\tSUZIE \n\tHush.\n\n\t\t\tGIDEON \n\tYou're always taking his side.\n\n\t\t\tSUZIE \n\tHush.\n\n\t\t\tGIDEON \n\tI'm trying to make him a man but\n\tyou keep babying him.\n\n\t\t\tSUZIE \n\tYou're going to find yourself on\n\tthe floor.\n\nINT. BABE BROTHER'S BEDROOM - MORNING\n\nThe bedroom is tastefully furnished with modern art and\npaintings by Barns.\n\nBabe Brother wakes up with Sunny standing in the doorway\nlooking at him. It takes Babe Brother some time to fully wake\nup.\n\nFinally he sits reluctantly on the side of the bed and Sunny\ncomes over and sits next to him, trying to get his weary\nfather interested in his remote-control racing car.\n\n\t\t\tBABE BROTHER \n\tI want you to be the richest man in\n\tthe world so I can be the richest\n\tfather in the world.\n\n\t\t\tSUNNY \n\tI don't want to be rich. I want to\n\twork on the railroad like\n\tgrandfather.\n\n\t\t\tBABE BROTHER \n\tSon, if you are going to have a\n\tfamily, you can't always choose a\n\tjob just because you like it. \n\t\t(beat)\n\tI don't want you to shine anybody's\n\tshoes or be a porter. You let\n\tsomebody else carry your bags.\n\nSunny quietly gets up and follows his car out of the room.\n\nINT. BABE BROTHER'S HOUSE - DAY\n\nBabe Brother, having showered but still wearing his pajamas,\ndrags himself to the kitchen table where his wife LINDA has a\nhuge coffee mug with the inscription, \"I'm the boss\", waiting\nfor him.\n\nLinda is about thirty years old and materially oriented like\nher husband. She is wearing a conservatively cut business\ndress.\n\nSunny stops playing with his car and gets himself an empty\ncup. Babe Brother is about to pour him some of his coffee\nwhen Linda objects.\n\n\t\t\tLINDA \n\tNO.\n\nSunny pleads with her in silence but Linda refuses to yield.\n\n\t\t\tBABE BROTHER \n\tHe wouldn't want any if you didn't\n\ttry to keep it away from him.\n\nLinda leaves the table but stops for a moment and looks down\nat her husband.\n\n\t\t\tLINDA \n\tBecause you were spoiled, don't try\n\tto spoil Sunny.\n\n\t\t\tBABE BROTHER \n\tMy daddy never gave me anything\n\twithout my having to sweat for it.\n\tEvery summer, the way they kept me\n\tand Junior out of trouble was to\n\tsend us to Big Daddy's farm. We\n\twould get up with the chickens.\n\tEvery summer the fence had to be\n\trepaired. The barn needed a coat of\n\tpaint. We had to pip all of Big\n\tMama's hundred laying hens and go\n\tto church all day on Sunday. For\n\tBig Daddy, calluses and sweat were\n\tthe mark of a man. Sunny will never\n\thave to bust his knuckles like we\n\tdid.\n\n\t\t\tLINDA \n\tI want Sunny to have an advantage\n\tthat you and I never had, but he\n\tneeds discipline, and you are not\n\thelping when I tell him to do\n\tsomething and you allow him to get\n\tout of it.\n\n\t\t\tBABE BROTHER \n\tWhat is a sip of coffee going to\n\tdo?\n\n\t\t\tLINDA \n\tCoffee is bad for anybody,\n\tespecially for a child.\n\n\t\t\tBABE BROTHER \n\tI don't see you crying about my\n\tdrinking it.\n\n\t\t\tLINDA \n\tHow old are you?\n\nEXT. BACKYARD - DAY\n\nA SLOW CLOSE UP DOLLY SHOT OF SUZIE'S HANDS DROPPING SEEDS IN\nTHE GROUND.\n\nGideon is raking out the chicken coop. He puts the rake down\nand walks over to the garden and watches Suzie plant seeds\nfor a while.\n\n\t\t\tGIDEON \n\tInstead of standing here doing\n\tnothing, I better give those\n\tchickens some scratch before they\n\tstart cackling.\n\nEXT. ALLEYWAY - DAY\n\nOLD JOHN is pushing his cart up the alley. Old John's face is\nwashed so clean that it shines. His pants are dirty and his\ncart is full of odds and ends of no value. He looks to be\nabout seventy and fit. Old John throws a sack on Gideon's\nfence.\n\nEXT. BACKYARD - DAY\n\nSuzie,is bent over a plant that she is tying to a stick. She\nlooks up and sees the sack on the fence. A smile appears on\nher face. She goes over to the fence.\n\nEXT. ALLEYWAY - DAY\n\nOld John is about to take up his journey when Suzie sticks\nher head over the fence.\n\n\t\t\tSUZIE \n\tHow are you?\n\n\t\t\tOLD JOHN \n\tTolerably well. I brought you some\n\tmore rabbit manure for your roses.\n\n\t\t\tSUZIE \n\tIt is so considerate of you.\n\nGideon sticks his head over the fence.\n\n\t\t\tGIDEON \n\tWell, well, look who is taking up\n\tall the sunshine. Brother John, how\n\tare you doing?\n\n\t\t\tOLD JOHN \n\tI'm still here.\n\nSuzie leaves the two men talking.\n\n\t\t\tGIDEON \n\tTell me something. How do you get\n\tenergy to stay on the move all day?\n\n\t\t\tOLD JOHN \n\tYou couldn't sit on your rump under\n\tmy daddy's roof. No sir. If you\n\tcouldn't outwork his mule, you\n\twasn't worth the salt you put in\n\tgreens. You had to wake up looking\n\tfor something to do. I was raised\n\tas a mule and now I'm a rolling\n\tstone.\n\nSuzie sticks her head over the fence and hands a bag of red\ntomatoes to Old John.\n\n\t\t\tOLD JOHN (CONT'D)\n\tI didn't mean for you to pay me for\n\tthat.\n\n\t\t\tSUZIE \n\tI know you didn't but you have been\n\tso thoughtful.\n\n\t\t\tOLD JOHN \n\tBut when your sunflowers come up,\n\tI'll pay you for them.\n\n\t\t\tSUZIE \n\tI planted a row just for you and\n\tyou don't owe me anything.\n\nEXT. NEIGHBORHOOD - DAY\n\nHIGH ANGLE SHOTS\n\noff in the distance, a man is cutting his lawn. Gideon and\nSuzie are working in their garden. Other couples working\ntheir gardens. Two young men are working on their car, which\nis creating a lot of smoke. A group of girls are sitting on a\nporch trying to sing while one of the smaller ones is trying\nto learn a step.\n\nSkip is on the roof with his radio listening to rap music\nwhile his birds circle over head. From time to time he throws\na rock at them.\n\nINT. DELIVERY ROOM - DAY\n\nTHE CAMERA IS OUTSIDE OF THE ROOM. THE SCENE IS SHOT THROUGH\nTHE PARTLY OPEN DOOR.\n\nIt is hard to see the woman giving birth. There are people\nblocking the view of the camera. Suzie is facing the camera\nand the woman has her back to the camera.\n\n\t\t\tMOTHER\n\tIt hurts.\n\n\t\t\tSUZIE\n\tDon't push too fast! Breathe! The\n\thard part is over. You can see the\n\ttop of the head.\n\n\t\t\tMOTHER\n\tIt hurts. The pain. \n\t\t(scream)\n\tIt's tearing me.\n\n\t\t\tSUZIE\n\tFather, give her a hand.\n\n\t\t\tFATHER\n\tHey, this is too much.\n\n\t\t\tSUZIE\n\tYou do your part.\n\n\t\t\tMOTHER\n\tCan you tell what it is?\n\n\t\t\tSUZIE\n\tAlmost there.\n\n\t\t\tFATHER\n\tIt's a junior.\n\n\t\t\tMOTHER \n\tAh, I wanted a girl.\n\nSuddenly the baby begins to SCREAM.\n\nEXT. BACKYARD - DAY\n\nA sack appears on Gideon's fence. The sound of Old John's\ncart is heard rattling off.\n\nINT. CHURCH - DAY\n\nSuzie, Gideon, JUNIOR (Gideon's elder son, 35 years old and\ndark skinned), PAT (Junior's wife, who is expecting, about\n32) and Rhonda are all seated next to one another in the same\nrow. The PREACHER is knee-deep in water. He is baptizing a\ngroup of young people. The members of the church are singing\n\"Take Me To The Water\". An Elderly Man who can hardly walk\nwithout help is being led down to the pool.\n\nINT. KITCHEN - DAY\n\nSuzie, Gideon, Junior, Pat and Rhonda are all seated at the\ntable eating. Babe Brother is standing up. He looks in the\npot but doesn't find it to his liking. Junior is irritated at\nhis brother.\n\n\t\t\tJUNIOR \n\tWhen are you going to find time to\n\thelp me fix the roof?\n\n\t\t\tBABE BROTHER \n\tYou all don't believe me when I\n\ttell you I'm afraid of heights.\n\n\t\t\tJUNIOR \n\tYou used that excuse to get out of\n\tthe army.\n\n\t\t\tBABE BROTHER \n\tYou always got something to say.\n\n\t\t\tGIDEON \n\tYour mother asked me not to mention\n\tit but your mother's birthday was\n\tlast week.\n\n\t\t\tBABE BROTHER \n\tI hadn't forgotten. I ordered some\n\tcloth but it didn't come in and I\n\tfelt so bad if I would have come to\n\ther birthday without that, I just\n\tstayed at home.\n\n\t\t\tGIDEON \n\tWhat did your wife get her?\n\n\t\t\tBABE BROTHER \n\tWe got the same thing.\n\nJunior laughs at Babe Brother's story.\n\n\t\t\tGIDEON \n\tBoy, go tell your wife to come in.\n\nEXT. STREET - DAY\n\nBabe Brother's car, a new Audi, is parked out front.\n\nLinda is in the front seat reading a magazine while Sunny is\nasleep in the back seat. Babe Brother sticks his head in the\nwindow.\n\n\t\t\tBABE BROTHER\n\tWhy don't you come in for a while?\n\n\t\t\tLINDA \n\tI would like to finish reading\n\tthis. What would I talk about? I\n\thaven't read this month's almanac.\n\tI don't care to hear about how the\n\tcorn was this fall or how to get\n\trid of gophers by putting garlic in\n\ttheir holes. They pride themselves\n\tin making life hard and that's not\n\tmy cup of tea.\n\nINT. KITCHEN - DAY\n\nSuzie, Gideon, Junior, Pat and Rhonda are still at the table\neating.\n\n\t\t\tSUZIE \n\tYou know, Babe Brother's wife just\n\tdumps greens in the pot without\n\twashing them.\n\n\t\t\tGIDEON \n\tBabe Brother is a poor boy.\n\n\t\t\tJUNIOR \n\tYou all should have been hard on\n\thim like you were me and he\n\twouldn't be the way he is.\n\n\t\t\tSUZIE \n\tEverybody got the same. I breast\n\tfed him like I breast fed you.\n\n\t\t\tPAT \n\tJunior, you are wrong.\n\nINT. CAR - DAY\n\n\t\t\tBABE BROTHER \n\tJust for a minute.\n\nA dirt rock HITS the front windshield. Linda lets out a\nlittle scream. Babe Brother looks around. Skip is on top of\nthe roof next door.\n\n\t\t\tSKIP \n\tI didn't mean to hit your car. I\n\twas throwing at my birds.\n\nINT. FEED STORE - DAY\n\nGideon is looking at the price of laying mash. He digs his\nhand into a barrel of scratch. Sunny also digs his hand in\nthe barrel.\n\nSuzie is looking at new young plants. She gives the\nvegetables a thorough going-over.\n\nGideon is standing in line waiting to place his order.\n\n\t\t\tGIDEON \n\tI need about five pounds of laying\n\tmash and you better give me about\n\tthe same of scratch.\n\nWhile at the counter, Gideon turns and looks around at the\nprices of different items. Suzie brings her plants and puts\nthem on the counter.\n\n\t\t\tGIDEON (CONT'D)\n\tWhen are you going to have a sale\n\ton weed killer?\n\n\t\t\tCASHIER \n\tYou missed it. We had a two-day\n\tsale last week.\n\n\t\t\tGIDEON \n\tWhat kind of a sale is a two-day\n\tsale? I thought sales last a week\n\tor two.\n\n\t\t\tCASHIER \n\tEvery day we have something\n\tdifferent. Today's sale is hay. 25%\n\toff. If you have a horse or cow,\n\tyou're in business.\n\nINT. CAR - DAY\n\nSunny looks at the Little Girl in the next car; she has her\nmouth pressed against the window. She is missing a tooth.\nGideon is behind the wheel while Suzie holds her new plants\nup to the sun, carefully looking at them.\n\nSunny, seated in the back, pokes a hole in the sack of feed.\nThe mash trickles to the floor as if from an hour glass.\n\nINT. KITCHEN - DAY\n\nSuzie is sitting in front of a table full of jars. Each jar\nhas a shoot and is half-filled with water. Gideon is on his\nknees trying to fix the hinge to a cabinet. Sunny is sitting\nalmost under him listening to him tell stories. Sunny has a\ncoffee can full of marbles.\n\n\t\t\tGIDEON \n\tAll of the preachers were down in\n\tthe basement of the church\n\tconfessing their sins to one\n\tanother. They were way down in the\n\tbasement 'cause they figured no one\n\twould hear them. One of the\n\tpreachers said, it makes me feel\n\ttoo shame to tell how bad I have\n\tbeen. You know them young gals that\n\tsit up in the first row. I can look\n\tat them and forget my text. I'm\n\tjust lost when it comes to women,\n\teven them middle age sisters. Then\n\tanother preacher said, I don't\n\tthink I can tell you what my sin is\n\t'cause it's bad. Another preacher\n\tsaid, Brother, we all amongst\n\tfriends. Tell us what's troubling\n\tyour soul. Clear your conscience.\n\nGideon takes a sip of water.\n\n\t\t\tGIDEON (CONT'D)\n\tSo the preacher said, we all got a\n\tbond 'cause we confessed to one\n\tanother. So let me tell you, my sin\n\tis corn liquor. I just acts a fool\n\tbehind that spirit water. I loves\n\tit more than preaching. Now ain't\n\tthat a sin, lord. So all the\n\tpreachers went on confessing, each\n\tone worst than the last. Finally\n\tthey came to the last preacher who\n\thad been very quiet and listening\n\tto every word that fell. One of the\n\tpreachers said to him, it's your\n\tturn. Confessing will lift you\n\tburden, Brother. Bare us your soul.\n\tWe did. The last preacher said, no,\n\tmy sin is the worst among all of\n\tyou. One of the preachers said, ah\n\tgo on man and stop all this\n\tsuspense. So the last preacher\n\tsaid, like I told you my sin is the\n\tlowest. \n\t\t(beat)\n\tMy sin is gossiping and I can't\n\twait to get out and tell what I\n\theard.\n\nSunny does not get the humor of the story. He is more\ninterested in picking up his marbles that Gideon's foot\nkicked over.\n\n\t\t\tSUZIE \n\tYou oughtn't tell him stories like\n\tthat.\n\n\t\t\tSUNNY \n\tTell me another story.\n\n\t\t\tGIDEON \n\tI'll you a story about the terrapin\n\tand the rabbit. No, you tell me a\n\tstory. Come on.\n\n\t\t\tSUNNY \n\tOnce upon a time, my mommy and\n\tdaddy lived in this big house that\n\tI bought for them. I got them this\n\tbig car.\n\nA strong wind causes the broom handle to knock against the\nchina teapot, KNOCKING IT TO THE FLOOR. Suzie stops Sunny\nfrom trying to help pick up the pieces.\n\n\t\t\tSUZIE \n\tYou stay back. You might cut your\n\tfingers.\n\nSuzie looks down sadly at her broken tea pot.\n\n\t\t\tGIDEON \n\tI looked everywhere for my toby.\n\nEXT. APPLE ORCHARD - DAY\n\nThe trees are barren, which gives them an unfriendly look. As\nwe LOOK at the ground, a man's distorted shadow stops in the\nframe.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. FRONT PORCH - DAY\n\nA shadow of a man appears on Gideon's porch. The camera tilts\nup to HARRY MENTION, a very dark-looking, ageless old man\ncarrying several boxes held together by a cord. He looks\nexhausted from his journey. He looks in his address book and,\nsatisfied that he reached the right house, he rings the\ndoorbell.\n\nINT. FRONT ROOM - DAY\n\nSuzie comes to the front door; she recognizes Harry right\naway. She invites him in. Harry stumps his feet on the porch\nseveral times and then enters.\n\n\t\t\tSUZIE \n\tHarry, I can't believe it is you.\n\tGideon, look who is here.\n\nGideon comes in, wiping his hands. Sunny, carrying the broom,\nfollows behind.\n\n\t\t\tGIDEON \n\tHarry, good God Almighty, man! It's\n\tbeen, what, thirty years or more.\n\tSuzie, we haven't seen Harry since\n\twe left home.\n\nHarry is more interested in the boy, but Sunny doesn't want\nto come near Harry. It is Gideon's arm that is keeping him\nwithin close range of Harry.\n\n\t\t\tGIDEON (CONT'D)\n\tThis is my grandson, Sunny. He is\n\tmy youngest son's child.\n\n\t\t\tHARRY \n\tHe kind of favors one of my boys\n\twhen he was about his age.\n\nSunny, playing with the broom, accidentally touches Harry's\nshoe with it. Harry hides his anger about being touched with\nthe broom. Harry takes the broom from Sunny and spits on the\nbottom of it.\n\n\t\t\tHARRY (CONT'D)\n\tBoy, that is bad luck to touch a\n\tfellow with a broom.\n\n\t\t\tGIDEON \n\tHe knows better. Sunny, apologize\n\tto Harry.\n\n\t\t\tSUNNY \n\tI'm sorry.\n\n\t\t\tGIDEON \n\tWhat are you doing in these parts?\n\n\t\t\tHARRY\n\tI came all the way from Detroit by\n\tbus going to Oakland. The bus\n\tstopped in Los Angeles. I had to\n\tget off and take a rest. I'll catch\n\tthe last bus leaving at midnight.\n\tI'm just too tired to go on.\n\n\t\t\tGIDEON \n\tWhy didn't you catch a plane?\n\n\t\t\tHARRY \n\tMy feet have never been on anything\n\tthat wasn't directly attached to\n\tthe ground.\n\n\t\t\tGIDEON \n\tStay until you feel better? I would\n\tlike to hear all the news.\n\n\t\t\tHARRY \n\tI'm worn out but won't you feel\n\tlike you are taking in a stranger?\n\n\t\t\tSUZIE \n\tStranger my foot, it was my\n\tgrandmother who helped you into\n\tthis world.\n\n\t\t\tHARRY \n\tWell, I don't want to put you out.\n\n\t\t\tGIDEON \n\tMan, put your boxes down and stay\n\tas long as you like. We have empty\n\trooms since the boys got their own\n\tfamilies and moved out.\n\n\t\t\tHARRY \n\tWell if you're sure, I won't be a\n\tbother. Oh, I don't sleep on no\n\tspring mattress. I always make\n\tmyself a pallet on the floor.\n\nINT. BEDROOM - DAY\n\nThe bedroom door to Harry's room is cracked open. Peering\nthrough the cracked door, we SEE Harry asleep on his pallet.\nHis back is turned to the camera. It is dead silent. There\ndoes not seem to be any sign of life. On the floor is a plate\nthat has water in it. It looks like it is for a dog.\n\nINT. KITCHEN - DAY\n\nSuzie is peeling potatoes and Gideon is ironing.\n\n\t\t\tSUZIE \n\tPoor old Harry, he really must have\n\tbeen worn out. He has been asleep\n\tall day.\n\nWithout anyone being aware, Harry has been standing in the\ndoorway for some time.\n\n\t\t\tHARRY\n\tGood evening. It must be all the\n\tdifferent time zones I crossed that\n\tmakes me feel this weary.\n\n\t\t\tSUZIE \n\tYou should go back and rest.\n\n\t\t\tHARRY \n\tNo, if I rest any longer, I won't\n\tsleep tonight. May I use your\n\tbathroom to wash up a bit?\n\n\t\t\tGIDEON \n\tMan, act like this is your home.\n\n\t\t\tHARRY \n\tThat's awful generous of you. I\n\talways ask to keep from wearing out\n\twelcome.\n\n\t\t\tSUZIE \n\tOne can tell you are from back\n\thome. These people nowadays don't\n\tknow what manners are.\n\n\t\t\tHARRY \n\tWhere we come from, you had to know\n\thow to act right. You had to know\n\thow to say yes sir and no sir. You\n\thad to know your place.\n\n\t\t\tGIDEON \n\tYou had to tread softly.\n\nThe doorbell rings and Gideon goes to answer it.\n\n\t\t\tSUZIE \n\tThose days you could always find\n\tsomething redeeming about even the\n\tworst person.\n\n\t\t\tHARRY \n\tYou remember that boy who lost his\n\tmind, Joe? You could hear him\n\tpitching horseshoes at night in the\n\tdark. He wouldn't miss a one. Make\n\thim mad and call yourself running\n\tin the house to be safe. He would\n\tpick up a brick and say \"go on in\n\tthere brick and hit somebody\" and\n\tit would find its mark.\n\n\t\t\tSUZIE \n\tI was afraid to go to Marcus Bottom\n\tbecause of him.\n\n\t\t\tHARRY \n\tAll those places that us coloreds\n\tlived, that we used to call\n\tBottoms, have all been changed to\n\tDrives and Heights. Everything is\n\tin what you call it, not in what it\n\tis.\n\nGideon comes back with Junior, Pal and Rhonda.\n\n\t\t\tGIDEON \n\tHarry, I would like for you to meet\n\tmy oldest son, his wife and\n\tdaughter.\n\n\t\t\tJUNIOR \n\tPleased to meet you. So you're from\n\tback home, too.\n\nHarry and Junior shake hands, but Rhonda gives Harry only a\nnod of her head and a smile.\n\nPat, who is pregnant, attempts to shake hands with Harry, but\nis forced to withdraw her hand because of a sudden pain in\nher stomach.\n\n\t\t\tPAT \n\tThis boy must be turning over. Oh,\n\the just kicked me again.\n\nJunior feels her stomach. Pat again tries to shake Harry's\nhand and again gets a jolt from her stomach. She finds a\nchair to sit down in.\n\nThe SOUND of rocks hitting the roof causes everyone to look\nup.\n\n\t\t\tGIDEON \n\tIt's the boy next door throwing at\n\this birds. I'm just waiting on him\n\tto hit a pane in the window\n\n\t\t\tHARRY \n\tI'm going to wash up now. You all\n\tplease excuse me.\n\nINT. GIDEON'S HOUSE - BATHROOM - DAY\n\nHarry is wiping off his face with a washcloth. He stares at\nhimself in the mirror for a long time. The sudden sound of\nthe boy next door starting to play his trumpet startles him.\nHe smiles at the trumpeter's efforts.\n\nHe wrings the wash cloth out. A reddish oil-like liquid DRIPS\ninto the face bowl.\n\nEXT. GIDEON'S HOUSE - EARLY MORNING\n\nA few of the houses have lights on. Suddenly, Gideon's\nrooster starts to CROW. A dog starts to bark and a garbage\ncan is knocked over. Bedroom lights in almost all the houses\nin the neighborhood pop on. The voices of neighbors\ncomplaining are heard.\n\nINT. BEDROOM - EARLY MORNING\n\nHarry is just waking up. He listens to the voices of Suzie\nand Gideon as they get ready for church.\n\nINT. FRONT ROOM - MORNING\n\nGideon is paging through the Bible as he stands by the door,\nwaiting for Suzie who is watering her plants. Harry comes in.\n\n\t\t\tHARRY \n\tGood morning.\n\n\t\t\tGIDEON \n\tYou ought to come hear our\n\tpreacher. Remember old Cat Iron?\n\tWell, our preacher is just as\n\tstrong.\n\n\t\t\tHARRY \n\tNext time when I feel a little\n\tbetter perhaps.\n\n\t\t\tGIDEON \n\tI was going to get up and get a hen\n\tout there for dinner, but time got\n\taway.\n\n\t\t\tHARRY \n\tOh, I would feel much at home if\n\tyou let me get one for you. I\n\thaven't wrung a chicken's neck in a\n\tmonth of Sundays. You know, folks\n\twould call my daddy to kill their\n\thogs. That used to be my trade from\n\ttime to time.\n\n\t\t\tGIDEON \n\tWell, I would appreciate that.\n\nEXT. HOUSE - DAY\n\nGideon and Suzie are stepping off the porch. Harry is\nstanding behind the screen door.\n\nGideon and Suzie get in Junior's car. Junior, Pat and Rhonda\nwave to Harry as the car pulls away.\n\nINT. LIVING HOUSE - DAY\n\nIT IS A TRACKING SHOT, FOLLOWING HARRY THROUGH THE HOUSE.\n\nHarry looks through Gideon's and Suzie's private things. He\nlooks at the baby pictures that fill the mirror. He reads\nSuzie's letters that are dated years ago. In one of the\nletters, he finds a picture of a man standing behind a\nplough. \"Uncle Joe after Ella's death\" is written on the\nback. A picture of a mule holds his interest. He looks at it\nfor a long time and carries it with him as he continues his\nsearch.\n\nEXT. BACKYARD - DAY\n\nHarry slowly walks along the rows in Suzie's garden. He\nstands by the chicken cage. Suddenly, the chickens start to\nrun about and CACKLE as if a dog had gotten in.\n\nHarry turns from the chicken coop. He stands still. Sunny is\nhiding behind a bush.\n\nSunny steps around the bush. Harry looks at Sunny with such\nconcentration that Sunny takes a step backward as if getting\nready to defend himself.\n\nMRS. BAKER, a black woman in her early thirties, comes out on\nthe back porch. She shakes out a rug. She stops shaking the\nrug and stares at Harry.\n\nHarry becomes aware of Mrs. Baker's stare. He comes to\nhimself and smiles at her.\n\nINT. GIDEON'S KITCHEN - DAY\n\nHarry and Babe Brother are playing cards while Linda watches\nand Sunny plays by himself on the floor. In the sink is a\nnewspaper full of bloody feathers. A small flame is under a\npot on the stove. Harry looks at the chicken in the pot and\nsits back down.\n\n\t\t\tLINDA \n\tYou don't act like the rest of\n\tGideon's friends. They believe if\n\tyou are not hard at work, you are\n\thard at sin.\n\n\t\t\tHARRY \n\tOh, I'm more modern in my ways. I\n\tdon't believe in sin, though there\n\tis good and evil. \n\t\t(beat)\n\tAnd evil is a thing you work at.\n\nHarry takes his knife, a crab apple switch, out. It has a\nrabbit foot attached to it. Harry cleans his fingernail with\nthe knife. Sunny is interested in the rabbit foot. He reaches\nfor the knife.\n\n\t\t\tHARRY (CONT'D)\n\tNot you mustn't touch. Your mama\n\tmight not like you handling knives.\n\n\t\t\tLINDA \n\tI think he wants to see your rabbit\n\tfoot.\n\n\t\t\tHARRY \n\tI let this rabbit foot do in place\n\tof my toby that I lost years ago.\n\n\t\t\tLINDA \n\tWhat's a toby?\n\n\t\t\tHARRY \n\tYou don't want to be at crossroads\n\twithout one. It's a charm that old\n\tpeople teach you how to make. I had\n\tone for a long time that belonged\n\tto my grandmother who had it ever\n\tsince she was a child. \n\t\t(beat)\n\tIn my travels I misplaced it. I\n\thave been looking over my shoulder\n\tever since.\n\n\t\t\tLINDA \n\tI thought you weren't old\n\tfashioned.\n\n\t\t\tHARRY \n\tIn some things. When we were\n\tchildren, there used to be an old\n\tman that came around and would\n\tsnatch your soul if you didn't have\n\tsomething on you that didn't make a\n\tX.\n\nHarry is aware that Babe Brother is interested in the knife.\nAfter cleaning his last fingernail, he hands the knife to\nBabe Brother.\n\nHarry looks at the cards in his hand. He smiles to himself.\n\n\t\t\tHARRY \n\tDid you have your child at home?\n\n\t\t\tLINDA \n\tNo. No. No. No. I had my Child at\n\tCedars and Sinai. And that ain't no\n\tcounty hospital. You have to have\n\tcash or check before you come in\n\tthe door.\n\n\t\t\tHARRY \n\tSome folks take that natural stuff\n\ttoo far.\n\n\t\t\tLINDA \n\tJunior's wife kept her afterbirth'\n\tin the refrigerator. That's why I\n\tdo not eat over there now.\n\n\t\t\tHARRY \n\tCountry people got so many strange\n\tways,\n\nHarry looks again at the chicken that he is boiling.\n\n\t\t\tBABE BROTHER \n\tDid you ever have to use this\n\tthing?\n\n\t\t\tHARRY \n\tThat is called a crab apple switch.\n\tIt's for those bad acting monkeys\n\tand just the thing for a mean dog.\n\tNow I don't know if I actually did\n\twhat I did or got my life and story\n\tmixed in with other folk's stories\n\tbut I seem to recall that I had to\n\tuse my crab apple on a boy from\n\tback home. I was up in Memphis\n\tworking on the railroad, like your\n\tdaddy who had an easy job. He would\n\tsing a song that had a cadence and\n\twe would lay track. Anyway I was\n\tcoming down Beale Street and I\n\theard this music coming from a\n\tsaloon. Sure enough it was Emory.\n\tMy daddy taught both of us to play\n\tbut Emory was natural at it. Got in\n\ta blues band and what not. He and\n\tanother boy had killed a boy named\n\tHocker sometime back and they\n\tballed the Jack leaving town. Emory\n\thad lost one eye and had a scar\n\trunning down his face. Bad luck I\n\twould say. He got to drinking that\n\tcorn liquor. We went to his girl's\n\troom and he wouldn't stop drinking.\n\tHe started talking about the old\n\tdays and he went mad. He pulled his\n\tknife and I got to mine first. The\n\tlights went out.\n\nLinda picks up a card and looks at it. There is a naked woman\non the back.\n\n\t\t\tBABE BROTHER\n\tDon't pick up the cards if you are\n\tnot in the game. Did he die?\n\n\t\t\tHARRY \n\tI don't know what happened to him.\n\tHe just ran out into the streets. \n\t\t(beat)\n\tI got some old records I want you\n\tto hear. I like the blues sung\n\tsimply, man and a guitar. Or sung\n\tby a woman who had bad luck all her\n\tlife. Don't ever let anyone tell\n\tyou his life's story if it is of a\n\tweary life full of sadness. When I\n\twas a boy, a man told me a story of\n\thow he lost all of his sons and\n\tI'll be damned if the same thing\n\tdidn't happen to me.\n\nSunny is busy playing in the curtains.\n\nThe SOUND of Gideon and Suzie arriving makes them scurry to\nget the cards put away. Harry puts his knife away just as\nSuzie and Gideon enter. Linda feels a little embarrassed.\n\n\t\t\tLINDA \n\tHow was church?\n\nGideon and Suzie are surprised to see Linda. They don't know\nwhat to say.\n\nEXT. MRS. BAKER'S BACKYARD - DAY\n\nRodney walks around in the yard BLOWING his trumpet as loud\nas he can. The SOUND of the trumpet frightens Skip's birds.\n\nINT. BATHROOM - DAY\n\nGideon is repairing the pipes under the face bowl. Harry is\nleaning against the door.\n\n\t\t\tHARRY \n\tHow often is your wife called to\n\thelp delivery?\n\n\t\t\tGIDEON \n\tIt was slow. Now it seems like\n\teveryone is having births at home.\n\nGideon takes the pipe off. It has rotted. Gideon cannot\nbelieve it.\n\n\t\t\tGIDEON (CONT'D)\n\tWhat could have caused this? I just\n\tchanged this damn thing.\n\n\t\t\tHARRY \n\tEverything these days is made\n\toverseas.\n\n\t\t\tGIDEON \n\tYou and Babe Brother hit it off so\n\twell.\n\n\t\t\tHARRY \n\tCourse, it is your business, but I\n\tfeel obliged to tell you that maybe\n\tyou have not been fair with the\n\tboy.\n\n\t\t\tGIDEON \n\tI tried to teach him right from\n\twrong just like I did his Junior.\n\n\t\t\tHARRY \n\tEveryone has to follow his own\n\tplough. A man doesn't have to know\n\thow to cut a wick and clean a\n\tchimney nowadays. City people don't\n\tgive a hoot and a holler about the\n\tshape of the moon nowadays. You\n\tdon't plant old ways...\n\t\t(beat)\n\t... but, at the end, you find\n\tyourself doing what your father did\n\tbut you have to have the land in\n\tyou.\n\t\t(beat)\n\tIt's when you want to give the\n\thouse or farm to the kids and they\n\tdon't want it. You sell it to a\n\tstranger. You worked your whole\n\tlife, for what?\n\t\t(beat)\n\tI doubt if people nowadays have\n\tknowledge of a victory garden or\n\tseen an inch worm. All what we've\n\texperienced has no meaning.\n\n\t\t\tGIDEON \n\tYou're suppose to teach your\n\tchildren what you know. Junior, I\n\tdon't have to worry about. Babe\n\tBrother is a different story.\n\n\t\t\tHARRY \n\tYou still call him boy. You call\n\tBabe Brother boy in front of his\n\twife and son.\n\n\t\t\tGIDEON \n\tMy daddy called me boy up to the\n\ttime he died. I was always boy to\n\thim.\n\n\t\t\tHARRY \n\t'Course, you could be right. Your\n\tsons are alive. All my sons are\n\tdead.\n\nOff-screen, Rodney starts to practice on his HORN.\n\nINT. BABE BROTHER'S LIVING ROOM - EVENING\n\nBabe Brother is sitting with Sunny by the screen door blowing\ngiant bubbles. The bubbles drift past Linda, who is sitting\nat the table with real estate papers all over the table. She\nis talking on the phone with a client and signals them to\nstop disturbing her.\n\nBabe Brother sends more bubbles floating by, causing her to\nshake the water off her papers while she talks to a first\ntime buyer.\n\n\t\t\tLINDA \n\tIt has three bedrooms, one and a\n\thalf baths. Well, yes, that means\n\ttwo toilets and one bath. Well...\n\tYes, by appointment... Call me back\n\tif you decide.\n\nShe hangs up the phone.\n\n\t\t\tLINDA \n\tYou would think people never lived\n\tin a house if they have to ask what\n\tdoes 1 1/2 baths mean.\n\n\t\t\tBABE BROTHER \n\tWill you still get the money from\n\tyour father?\n\n\t\t\tLINDA \n\tI told him we might not need it, if\n\tyou can talk your parents into\n\tgiving you your share of the\n\tproperty.\n\n\t\t\tBABE BROTHER \n\tPops put Big Daddy's farm in\n\tRhonda's and Sunny's name and fixed\n\tit so no one can borrow on it.\n\n\t\t\tLINDA \n\tWe could borrow on that land and\n\tput the money to work.\n\n\t\t\tBABE BROTHER \n\tI preached to Mom and Dad about it\n\tbut they are stuck in their ways,\n\tit's like talking to a brick. But\n\tif there is a way...\n\nBabe Brother is lost in his thoughts. He stares down at his\nhands resting on his knees. He picks up the telephone.\n\nINT. JUNIOR'S HOUSE - DAY\n\nJunior is on the phone with Babe Brother. Pat crosses in\nfront of the camera shaking her head in a negative manner.\nBabe Brother's voice is just audible.\n\n\t\t\tJUNIOR \n\tYou want me to mortgage my house to\n\tinvest in a scheme of yours? You\n\tknow the last time we went into\n\tsomething together Daddy had to go\n\tin his savings to keep us from\n\tending on the street.\n\n\t\t\tBABE BROTHER (O.S.) \n\tWhy are you always afraid to get\n\tsomewhere?\n\n\t\t\tJUNIOR \n\tThis is not a good time to take\n\tchances. Your best friend, Robert,\n\tan accountant, lost his home and is\n\tout on the street. We see him from\n\ttime to time. He comes down to\n\tchurch for a free meal.\n\n\t\t\tBABE BROTHER (O.S.) \n\tThis is what it is all about,\n\ttrying to keep from being out on\n\tthe street.\n\n\t\t\tJUNIOR \n\tRobert asks about you. When are you\n\tgoing to do something to help him?\n\n\t\t\tBABE BROTHER (O.S.) \n\tMaybe I can get down there next\n\tweek.\n\nJunior turns to his wife, who is off-camera.\n\n\t\t\tJUNIOR \n\tBabe Brother always acts like a\n\tgambler who is in the biggest game\n\tof his life and don't know about\n\tplaying cards.\n\nEXT. RAILROAD TRACKS - HOT AFTERNOON\n\nHarry and Gideon are walking along a railroad track. The sun\nis blinding. The heat makes the asphalt Appear to turn into a\nlake off in the distance. Gideon appears exhausted; beads of\nsweat continually form on his forehead. He fans himself with\nhis hat. Harry is unaffected by the hot temperature.\n\n\t\t\tHARRY \n\tI can sit here and look at train\n\ttracks all day. We laid enough of\n\tthem, didn't we? So many memories\n\tare stretched along tracks like\n\tthese.\n\nGideon looks down the tracks. A bowl of dust stirs off in the\ndistance. The hot temperature makes the tracks appear liquid.\n\nEXT. RAILROAD TRACKS - HOT AFTERNOON (EFFECT)\n\nThe tracks begin to twist and bend. Off in the distance,\nfaint images of men laying track to a song.\n\nEXT. RAILROAD TRACKS - HOT AFTERNOON\n\nGideon is standing with his hat in his hand. His posture is\nthat of an extremely old man.\n\n\t\t\tGIDEON \n\tIn weather like this, you cannot\n\twalk around bare-headed.\n\nHe wipes the sweat from his hat band.\n\n\t\t\tHARRY \n\tWe'll go a little farther. The walk\n\twill do us some good.\n\nINT. KITCHEN - DAY\n\nSuzie is peeling apples while Sunny, standing next to her,\ncatches peelings in his mouth. Pat is sitting next to the\nwindow. She is uncomfortable. She loosens her pants, giving\nher stomach more room. Rhonda is leaning over the back of the\nchair with her arms around Pat's neck. They are in\nsilhouette.\n\n\t\t\tPAT \n\tDid you do your homework?\n\n\t\t\tRHONDA \n\tYes.\n\t\t(beat)\n\tMama?\n\n\t\t\tPAT \n\tWhat?\n\n\t\t\tRHONDA \n\tCan I name the baby?\n\nINT. HARRY'S BEDROOM - DAY\n\nSuzie knocks on the door. Harry comes to the door still\nbuttoning his shirt.\n\n\t\t\tSUZIE \n\tI have someone I want you to meet.\n\n\t\t\tHARRY \n\tI'll be right there.\n\nINT. FRONT ROOM - DAY\n\nGideon in the background in the kitchen washing off the\nvegetables. Suzie and HATTIE are sitting at the table. Harry\ncomes in and is surprised to see Hat tie. Hattie is in her\nlate sixties but looks well. She makes a conscious effort to\ndress plainly.\n\n\t\t\tHATTIE \n\tI couldn't believe it when Suzie\n\tcalled and said you were staying\n\there. How have you been?\n\n\t\t\tHARRY \n\tGirl, do you still sing and dance?\n\n\t\t\tHATTIE \n\tNo, I'm a different person now,\n\tHarry.\n\nHattie has a nervous condition that causes her to squint from\ntime to time. Gideon comes in from the kitchen.\n\n\t\t\tGIDEON \n\tHaven't the years been good to\n\tHattie?\n\n\t\t\tHARRY \n\tIt hasn't been the years; it's been\n\tthe men in her life.\n\n\t\t\tHATTIE \n\tHarry, that's not nice. I'm in\n\tchurch now.\n\n\t\t\tHARRY \n\tWhy run out and close the barn door\n\twhen the horse is gone? I remember\n\twhen you weren't saved. That was\n\tway back yonder when the Natchez\n\tTrace was just a dirt road.\n\n\t\t\tHATTIE \n\tSome people grow up and change\n\ttheir ways.\n\n\t\t\tHARRY \n\tI know your mother ain't still\n\toperating that house of hers.\n\n\t\t\tHATTIE \n\tMy mother passed on years ago.\n\nEXT. STREET IN FRONT OF HOUSE - DAY\n\nM.C. slams the door to his car and hurries up the steps,\nleaving HERMAN, in spite of his bad condition, to get out of\nthe car the best he can. The car door almost knocks poor\nHerman over. M.C. seems rather youthful because of his energy\nand awkwardness. He is a large muscular man.\n\nHerman is a dried-up man with nothing, not even a shadow. He\nhas a racking COUGH.\n\nINT. FRONT ROOM - DAY\n\nM.C. gives Gideon a bear hug, lifting him off his feet. On\nseeing Suzie, he drops Gideon and rushes over to lift her up\noff her feet.\n\nEXT. STREET - DAY\n\nHerman is still trying to get out of the car.\n\nINT. FRONT ROOM - DAY\n\nM.C. lifts Suzie off the ground twice. He runs over to Hattie\nwho does not want to be handled, tries to withdraw but M.C.\nforces her to her feet and gives a big bear hug. Hattie has a\nseries of squinting attacks. M.C. squints in return.\n\n\t\t\tHATTIE \n\tM.C., you still ain't house broken.\n\n\t\t\tGIDEON \n\tGood God Almighty, if it ain't like\n\ta parade of people from out of the\n\tpast. M.C., where did you come\n\tfrom?\n\n\t\t\tM.C.\n\tI live here.\n\nThere is a TAPPING on the door.\n\n\t\t\tM.C. (CONT'D)\n\tThat's old Herman.\n\n\t\t\tHATTIE\n\tHarry, what did you do, rob the\n\tgraveyard?\n\nHerman hobbles in and, after a minute of COUGHING, a smile\nforms on his face.\n\nINT. LIVING ROOM - NIGHT\n\nSuzie, Gideon and Hattie are seated at the table while M.C.\nbounces from one end of the table to the other. One moment he\nis on his knees and next moment he is leaning over someone to\nflick his ashes in the ashtray on the table. Hattie hates it\nwhen he comes near her.\n\nHarry and Herman sit together in the corner chewing on\nstarch.\n\n\t\t\tM.C. \n\tHattie, do you still dance?\n\n\t\t\tHATTIE\n\tI'm in church.\n\n\t\t\tM.C.\n\tWhat does that got to do with it?\n\n\t\t\tHATTIE\n\tSuzie, you still have Joe's number?\n\n\t\t\tSUZIE\n\tI will have to look for it.\n\n\t\t\tM.C.\n\tWho's Joe?\n\n\t\t\tHATTIE\n\tNone of your business.\n\n\t\t\tHARRY\n\tThat is a boy from home, Lulla's\n\tbrother.\n\nSuzie is surprised.\n\n\t\t\tSUZIE \n\tHarry, you know everything.\n\n\t\t\tHARRY \n\tYou got to know everything, do\n\teverything, and be everything.\n\nGideon brings a fresh pot of coffee. Gideon tries to signal\nM.C. to stop harassing Hattie. M.C. leans over Hattie again\nto use the ashtray.\n\nHarry is helping Herman to his feet. Herman starts to cough.\nThey come over and join the rest of the crowd at the table.\nHarry seats Herman next to Gideon and pours Herman a cup of\ncoffee. He puts the sugar and cream in the coffee for Herman.\nSuzie comes back with Joe's number and hands it to Hattie.\n\n\t\t\tHERMAN \n\tM.C., I'm worn out. You ready to\n\tgo?\n\n\t\t\tM.C. \n\tIf you are tired, go sit in the\n\tcar.\n\n\t\t\tHERMAN \n\tSuzie, do you have any Swamp Root?\n\n\t\t\tSUZIE \n\tNo, but I might have some Indian\n\tChief Tonic.\n\n\t\t\tHATTIE \n\tI haven't heard anyone mention\n\tSwamp Root since button-up shoes\n\twent out.\n\n\t\t\tHARRY \n\tYou can certainly tell how old you\n\tare, my dear.\n\nHattie is angered.\n\n\t\t\tHATTIE \n\tYou know the saying, \"your heart is\n\tin your left hand.\"\n\n\t\t\tHARRY \n\tNow I was trying to be nice, to\n\tmake conversation, since we go back\n\tsome.\n\n\t\t\tHATTIE\n\tI was quoting from the Bible. If\n\tthe shoe fits, wear it.\n\n\t\t\tHARRY \n\t\"Out of weariness, I spoke to my\n\town heart; to leave it all and to\n\tdie. And I gave my heart to know\n\tmadness and folly.\"\n\n\t\t\tM.C. \n\tYou ain't going to win playing the\n\tdozens with Harry.\n\n\t\t\tHERMAN \n\tYou all ought to get along.\n\n\t\t\tHATTIE \n\tHarry, you know you remind me of so\n\tmuch that went wrong in my life.\n\tWhen I heard you were here, I made\n\ta special effort to come and see\n\tyou. I see you are still a pile of\n\twet chicken feathers.\n\n\t\t\tHERMAN \n\tOh Lord.\n\n\t\t\tHARRY \n\tMy sister, women can get away with\n\tso much. I don't have any enemies\n\t'cause I don't live in the past. As\n\tPushkin, you don't know him, said,\n\t\"In the hope of glory and good, I\n\tlook without fear ahead.\"\n\n\t\t\tM.C. \n\tHarry has got your number.\n\n\t\t\tHATTIE \n\tAn empty wagon makes a lot of noise\n\tand you, tappy head, you ain't\n\tworth the salt you put in greens.\n\n\t\t\tHARRY \n\tSpeaking of tappy heads, we ought\n\tto have an old fashion fish fry.\n\n\t\t\tHERMAN \n\tI don't have too many fish fries\n\tleft.\n\n\t\t\tHARRY \n\tWe can have it here next week.\n\n\t\t\tHATTIE \n\tIs this your house?\n\n\t\t\tHARRY \n\tOh. I'm sorry. Gideon, what do you\n\tsay?\n\n\t\t\tGIDEON \n\tWell, it's up to Suzie.\n\n\t\t\tSUZIE \n\tIt would be nice.\n\n\t\t\tHATTIE \n\tIn the meantime Harry can slaughter\n\tus a hog.\n\n\t\t\tHARRY \n\tI already have, my dear.\n\n\t\t\tHERMAN \n\tPlease, M.C., take me home.\n\nINT. LIVING ROOM - DAY\n\nThe children of the women in Suzie's natural birth group are\nhuddled together SINGING \"Ashiine Ca Chew\". The voices of the\nwomen in the next room are audible. The kids go outside to\nsit on the porch.\n\nINT. HOUSE, WORK ROOM - DAY\n\nMost of the women have their newborns with them and are\nengaging in talk about how their other children had to adjust\nand etc.\n\nA young white mother, REBECCA WILSON, with both her children,\na four year old and one just a few months old, talks with a\ndeep southern accent.\n\n\t\t\tWILSON \n\tNo one in my family ever been to a\n\thospital to give birth. My sister\n\thas four children and all were born\n\tat home. My mother and her mother,\n\tit just goes on and on.\n\nEXT. FRONT YARD - DAY\n\nA mother leaves with her baby wrapped in a blanket. The kids\nsurround her, wanting to see the baby.\n\nINT. GIDEON'S BEDROOM - DAY\n\nPat is looking at a book of baby names. Harry passes the door\nand stops.\n\n\t\t\tHARRY \n\tA woman in family way just reminds\n\tof spring and my younger days.\n\n\t\t\tPAT \n\tThat's nice.\n\n\t\t\tHARRY \n\tWell, you and your husband are\n\tspecial. Ya, Gideon tells me you do\n\tvolunteer work to help feed the\n\tpoor.\n\nPat beams with joy because Harry recognizes the important\nwork she is doing.\n\n\t\t\tHARRY\n\tHow many people do you all feed?\n\n\t\t\tPAT \n\tLast Saturday we handed out over\n\ttwo hundred meals.\n\n\t\t\tHARRY \n\tGood God Almighty, bless your\n\tbones.\n\t\t(pause)\n\tBut the problem grows.\n\n\t\t\tPAT \n\tWeek by week the crowds at the door\n\tkeeps getting larger. We can't feed\n\tall the hungry.\n\n\t\t\tHARRY \n\tOf course not. Have you ever heard\n\tof a man jumping in the river to\n\tsave five hundred drowning people?\n\tNo you ain't.\n\t\t(pause)\n\tYou have to take just one and\n\tfatten him up. When you spread help\n\ttoo thin, you , you just nickel and\n\tdime the situation. If you try to\n\tsave all, all die but if you save\n\tone life, life goes on. You just\n\thave to remember, medicine that\n\tworks leaves a bitter taste.\n\nHarry looks at the baby picture pasted over the mirror. He\ntakes the picture of his children from his old black dusty\nwallet and compares the faces of his kids with those on the\nmirror. He talks to himself more than to Pat.\n\n\t\t\tHARRY (CONT'D)\n\tYou just take one; you thaw out the\n\tcold and hunger in his bones from\n\tsleeping on the bare ground.\n\nPat watches him and loses herself in what he is doing. She\nresponds automatically\n\n\t\t\tPAT\n\tI don't know if we could take one\n\tin with Rhonda and me at home alone\n\tat times.\n\n\t\t\tHARRY\n\tOh, I wasn't pointing my finger at\n\tyou. Hey, you have to think of\n\tyourself. A lot of them have all\n\tkinds of diseases and will cut your\n\tthroat while you sleep. There are\n\ttoo many bad people out there.\n\nEXT. GIDEON'S BACK PORCH - DAY\n\nJunior is taking the back door off to paint. Harry helps him\ncarry the door and lay it on a saw horse.\n\n\t\t\tJUNIOR\n\tI appreciate you lending me a hand.\n\tThat lazy ass brother of mine was\n\tsuppose to help me.\n\n\t\t\tHARRY\n\tWell some folks are still waiting\n\tfor their comeuppance. Don't take\n\tme wrong but you can't judge people\n\tby how you act. You're a caring\n\tperson.\n\n\t\t\tJUNIOR \n\tHe should be caring. That is not\n\ttoo much to ask.\n\n\t\t\tHARRY \n\tYa, but you can't do the shuffle\n\twith one leg. You and your wife, in\n\tyour spare time, work with the less\n\tfortunate. Now I'm not talking\n\tabout you and what you do but some\n\tfolks that always run to help the\n\tvictim, deep down are attracted to\n\tpain and suffering and love to be\n\tnear the dying.\n\n\t\t\tJUNIOR \n\tAll the people working with us are\n\treally doing it 'cause they hate to\n\tsee suffering.\n\n\t\t\tHARRY \n\tYou never know what's in the heart\n\tand just because you can cry\n\tdoesn't make you human.\n\nINT. JUNIOR'S HOUSE - NIGHT\n\nRhonda is in the background washing dishes. Pat and Junior\nare sitting at the dining room table, arguing.\n\n\t\t\tJUNIOR \n\tWe can't really bring another\n\tfamily in here with us.\n\n\t\t\tPAT\n\tWhy not? Harry says that's the only\n\tway to do good.\n\n\t\t\tJUNIOR \n\tWhen did you talk to Harry?\n\n\t\t\tPAT \n\tDon't shout!\n\nEXT. BACKYARD - DAY\n\nGideon and Sunny are in the garden digging for worms. The\nchickens\n\n\t\t\tGIDEON \n\tI think we have enough. So now tell\n\tme a story.\n\nEXT. BALDWIN HILLS LAKE - LATE AFTERNOON\n\nGideon is sitting on a rock by the lake. His image is\nreflected in the lake. He is asleep. Sunny is putting new\nbait on one of the reels and with a whip of the pole, he\ncasts to the center of the lake. He leans against a tree.\nSunny looks at his sleeping grandfather. Gideon has his pant\nlegs rolled up. His socks have lost their elastic. His head\nis resting on his chest.\n\nSunny goes near the water.\n\n\t\t\tGIDEON \n\tBe careful of the water.\n\nSunny looks back at his grandfather, who appears to be\nasleep.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nThere is one fish in the bucket.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nEXT. LAKE - SUNSET\n\nWIDE ANGLE SHOT FROM HIGH ANGLE\n\nGideon and Sunny are sitting next to each other. The lake\nreflects the sky: a deep red. The eerie sound of a long train\nwhistle breaks the silence.\n\nINT. LIVING ROOM - MORNING\n\nHarry, Babe Brother and Linda come in after staying out all\nnight. Linda looks as though she is about to fall asleep\nstanding up. She awakes and looks at Harry. There is dislike\nin her stare. Suzie and Gideon notice Linda fading away.\n\n\t\t\tSUZIE \n\tAre you feeling well?\n\n\t\t\tLINDA \n\tI've never been so tired in my\n\tlife. Where is Sunny?\n\n\t\t\tSUZIE \n\tHe is getting his things together.\n\tBabe Brother, you ought to take\n\tyour wife home so she can get some\n\trest.\n\n\t\t\tBABE BROTHER \n\tIn a minute.\n\nSunny comes in carrying his night-clothes folded neatly. He\nstands next to Linda. Harry, in a mild but demanding way,\nushers Babe Brother out of the door.\n\n\t\t\tHARRY \n\tTake your wife and child home, boy.\n\nBabe Brother seems all too happy to obey Harry. After Harry\ncloses the door behind Babe Brother, he turns with a wide\nsmile.\n\n\t\t\tHARRY (CONT'D)\n\tI got a surprise for you tonight.\n\nHarry flops down on the couch and kicks his shoes off.\n\n\t\t\tHARRY (CONT'D)\n\tThis old buffalo has been in the\n\tsun too long.\n\nINT. LIVING ROOM - NIGHT\n\nSuzie and Gideon are getting the food ready while Harry,\nwearing a shirt that looks like it is made of shiny\nsnakeskin, sits in a darkened corner of the room, cutting his\nfingernails with his knife.\n\nThe door bell rings and Harry slowly walks over to answer the\ndoor. Suzie puts the punch bowl down and hurries over to meet\nthe first guests, FRED JENKINS, an elderly black man whom she\nhasn't seen in years, and Esme Jenkins, his wife.\n\n\t\t\tSUZIE \n\tFred Jenkins.\n\n\t\t\tJENKINS \n\tSuzie, you haven't changed and you,\n\tGideon, if you don't look like John\n\tHenry. Oh, this is my wife, Esme.\n\tMy first wife Lulie died.\n\nMore people arrive, bottle-necking the doorway. Gideon helps\nthe Jenkinses to a chair. Hattie comes with her brother\nMARSH, who is not too pleased to see Harry. OKRA TATE, an\nelderly black man with dark circles under his eyes, comes in\nlimping badly with an old Polaroid camera hanging from his\nneck.\n\nBabe Brother, Linda, Junior, Pat and Rhonda, who is holding\nSunny's hand, all come in together. M.C. drags Herman through\nthe door coughing. FLIM ANDERSON and his son DOUG are\nfollowed by the twins, WILLIAM and LOVIRAY NORWOOD, who are\nin their late 70's.\n\nBabe Brother leaves Linda standing by herself to be next to\nHarry.\n\nZenia Dent, an elderly white woman with a strong Southern\naccent, arrives with her husband, Howard Dent, a black man,\nwho is in a wheelchair. The Twins and Howard are the center\nof attention.\n\nOkra comes over and whispers into Harry's ear. Okra leaves\nthrough the front door. Okra comes back in with a bag. Harry,\nBabe Brother, M.C. and Herman follow Okra to the kitchen.\n\nINT. KITCHEN - NIGHT\n\nOkra sets the bag on the table and steps back to allow Harry\nto unveil the bottle of corn liquor.\n\n\t\t\tBABE BROTHER\n\tWhat is that?\n\n\t\t\tHARRY\n\tBoy, that is the real South. That\n\tis real corn liquor.\n\nA crowd starts to gather around.\n\n\t\t\tFLIM\n\tWhat is in the bottle?\n\n\t\t\tM.C.\n\tIt ain't Geritol.\n\nM.C. starts to hand out tea cups while Harry pours everyone a\ndrink.\n\n\t\t\tHERMAN\n\tThere is a fight in every bottle.\n\n\t\t\tGIDEON\n\tYou tappy heads better not tear\n\tdown my house.\n\nINT. LIVING ROOM - NIGHT\n\nAn attractive Woman, in her younger days a knockout, puts on\na record and starts to pop her fingers to the music as she\nmoves towards the center of the floor dancing by herself,\ninviting anyone bold enough to join her.\n\nA group of Men who haven't seen each other in years are\nasking questions about news of old friends.\n\nOkra is trying to get his camera working.\n\nHerman is following M.C. through the crowd with his hand\nresting on M.C.'s shoulder as if he were a blind person. His\nracking COUGH is frightening.\n\nAn older couple dancing attract the attention of the crowd.\nThe man is wearing Stacy Adams shoes polished to see one's\nface in them. He gives expression to his moves as if he and\nthe woman are talking with their bodies.\n\nJunior and Pat try to bring in something more modern to outdo\nthe older couple.\n\nHerman corners Hattie, trying to get her to sing.\n\n\t\t\tHATTIE \n\tLook, you better get out of my face\n\tbefore I slap the living daylights\n\tout of you.\n\nHarry stops the music.\n\n\t\t\tHARRY \n\tYou folks excuse me but you know we\n\thave a celebrity from out of the\n\tpast, our own nightingale. If you\n\thad any good times in your life,\n\tyou remember Hattie. She use to\n\tkeep those juke joints steaming. If\n\tMa Rainey and Bessie Smith were the\n\tstars, she was the sun. Let's get\n\tHattie to sing something from the\n\told days.\n\nHattie has started her nervous twitch again. She is so mad\nthat she bites her lip to keep from exploding.\n\n\t\t\tHATTIE \n\tHarry always tries to be the king\n\tfish. I told him I'm a new person.\n\tI'm saved.\n\nHarry signals an old man, PERCY, to start playing his guitar.\nPercy starts to play but Hattie doesn't join him. He looks to\nHarry for a sign of what to do. Hattie walks away.\n\nPercy starts to SING by himself but someone puts a record on,\ninterrupting his singing. People are back to dancing.\n\nA YOUNGER WOMAN is dancing with an OLDER MAN with such vigor,\nforcing the old man to try to keep up, that people grow\nconcerned. People near him try to make him slow down but his\npride forces him to be ridiculous.\n\nINT. BEDROOM - NIGHT\n\nLinda sits with Sunny and Rhonda watching TV.\n\nINT. FRONT ROOM - NIGHT\n\nThe noise has gotten louder, everyone talking at the top of\nhis voice.\n\nGideon is busy going around to everyone seeing if everything\nis okay. Gideon and Suzie have worked up a sweat trying to\nattend to everyone's needs.\n\nLinda rejoins the party. She moves through the crowd and sees\nBabe Brother standing next to Harry. She is disappointed and\nstays at a distance.\n\nHarry is with a group of people. Marsh tries to get Harry's\nattention.\n\n\t\t\tMARSH \n\tHarry, you will not remember me but\n\twe go back quite a ways. I'm glad\n\tHattie told me that you will be\n\there 'cause there is a matter that\n\thas been troubling me all these\n\tyears that maybe you can help me\n\tclear it up.\n\nHarry stares into Marsh's eyes, then looks him over from head\nto toe.\n\n\t\t\tHARRY \n\tMan, I can't talk to you now. I'm\n\tfilling in the gaps with these\n\tfolks.\n\nHarry turns his back on Marsh. Marsh stands there looking at\nHarry's profile. He turns and walks away.\n\nThe record ends. The Younger Woman and the Older Man wait for\nthe next record.\n\n\t\t\tYOUNGER WOMAN \n\tHow do you manage to keep in step\n\tand move around so like one of them\n\tyoung boys?\n\n\t\t\tOLDER MAN \n\tGet yourself a pace-maker like me.\n\nLinda is standing by herself. She watches Babe Brother and\nHarry walk towards the kitchen. Pat comes to talk to her.\n\n\t\t\tPAT \n\tThese old folks can dance better\n\tthan I can. Get rid of that long\n\tface. Get one of these old farts to\n\tshow you how to do the Black\n\tBottom.\n\nOkra, holding his camera, all of the attachments in one hand\nand a glass in his other hand, tries to offer Hattie a drink.\n\n\t\t\tOKRA \n\tDon't be so stand-offish.\n\nHattie pushes him away. The drink spills on him. She turns\nand walks away. He follows her.\n\nINT. KITCHEN - NIGHT\n\nMarsh sits in a chair opposite Harry. Babe Brother stands\nbehind Harry. Harry, knowing that Marsh is going to bring up\nunpleasant things of the past, feels the need to get rid of\nBabe Brother.\n\n\t\t\tHARRY \n\tSon, you haven't danced with your\n\twife all night.\n\nBabe Brother is reluctant to leave, but Harry gives him a\nnudge. He goes looking for Linda.\n\n\t\t\tMARSH \n\tThere is something that I always\n\twanted to know. Tell me, how did\n\tthose boys die?\n\n\t\t\tHARRY \n\tNow who are we talking about?\n\n\t\t\tMARSH \n\tMiss Clara's boy, Emory, to start\n\twith. The Johnson's Hocker was\n\tanother one...\n\n\t\t\tHARRY \n\tWasn't Hocker lynched?\n\n\t\t\tMARSH \n\tYou know as well as I do that it\n\twas made to look like he was\n\tlynched. Now who would hang someone\n\tfrom a persimmon tree?\n\n\t\t\tHARRY \n\tWhat difference does it make if\n\tit's persimmon, oak tree or\n\thuckleberry bush?\n\nINT. FRONT ROOM - NIGHT\n\nGideon, Babe Brother, and Linda go outside.\n\nEXT. FRONT YARD - NIGHT\n\nThe sounds of the party drift out from the house as Gideon,\nLinda and Babe Brother talk.\n\n\t\t\tGIDEON \n\tTell me, how come me and Suzie have\n\tto be mother and father to your\n\tchild? You never take the boy to\n\tthe park, circus or anything. If we\n\tdid not take him to church, he\n\twouldn't have any sense of\n\treligion.\n\n\t\t\tLINDA \n\tI think forcing him to go to church\n\twhen he really doesn't understand\n\tis not saving his soul. When he\n\tgets old enough to make up his own\n\tmind about religion, that will be\n\tbetter. It will be his intellectual\n\tdecision.\n\n\t\t\tGIDEON \n\tIs that the way your parents raised\n\tyou?\n\n\t\t\tBABE BROTHER \n\tWhy, you don't want us to bring him\n\tover?\n\n\t\t\tGIDEON \n\tNo, it's that when do you have time\n\tto be parents to him? You guys\n\tdon't pick him up until nine, ten\n\tat night. You are into yourselves,\n\tas the saying goes. Spend some time\n\ttrying to be parents. Take him to\n\tthe mountains, fishing. You ought\n\tto let him get to know nature.\n\n\t\t\tBABE BROTHER \n\tWell, you are his grandfather. He\n\tis supposed to spend some time with\n\tyou. You're supposed to show him\n\tthose woodsy things and this and\n\tthat.\n\n\t\t\tGIDEON \n\tJunior spends time with his child.\n\n\t\t\tBABE BROTHER \n\tOh here we go with that.\n\nINT. FRONT ROOM - NIGHT\n\nOkra is trying to get enough light for his old Polaroid\ncamera. M.C. takes a shade off a lamp and holds it next to\nthe Twins, nearly blinding them.\n\n\t\t\tWILLIAM \n\tHurry up and take this picture.\n\n\t\t\tFRED \n\tIf it wasn't for the NRA, colored\n\tpeople would have been the lost\n\ttribe.\n\n\t\t\tFLIM \n\tRemember what they use to call the\n\tNRA? Negro Raggedy-ass Army.\n\nM.C. is still holding the naked lamp while Okra tries to take\npictures.\n\nINT KITCHEN - NIGHT\n\n\t\t\tMARSH \n\tHocker's death almost caused a race\n\triot. A lot of innocent people\n\tcould have been hurt behind that.\n\n\t\t\tHARRY \n\tStrange as it may seem, it might\n\thave cleared the waters. Sometimes\n\tthe right action comes from the\n\twrong reason.\n\nEXT. FRONT YARD - NIGHT\n\nGideon, Babe Brother and Linda are just standing, facing one\nanother. Suzie comes out on the porch.\n\n\t\t\tSUZIE \n\tDo you want your coat? It's cold\n\tout here.\n\n\t\t\tGIDEON \n\tNo, I'm too hot now.\n\n\t\t\tSUZIE \n\tYou better be careful. You'll get a\n\tstroke arguing.\n\n\t\t\tGIDEON \n\tI wouldn't care if I drop dead if\n\the learn something from it. \n\t\t(beat)\n\tSon, you make me wish I was dead.\n\n\t\t\tSUZIE \n\tGideon, don't say things like that.\n\n\t\t\tBABE BROTHER \n\tWhy does he always pick on me?\n\n\t\t\tLINDA \n\tHe is just being like all parents,\n\tconcerned about the ones they love.\n\n\t\t\tBABE BROTHER \n\tI don't need that kind of love. And\n\tI don't want to be reminded all the\n\ttime that Big Mama's grandmother\n\twas born in slavery. If you really\n\tcare about me, just tell me how I\n\tcan make money.\n\n\t\t\tSUZIE \n\tBabe Brother, I'm going to take my\n\thand and hit you across your mouth.\n\n\t\t\tLINDA \n\tHe doesn't mean what he says.\n\n\t\t\tGIDEON \n\tLet us go back in before the night\n\tof celebration becomes a night of\n\tme killing my son.\n\n\t\t\tSUZIE \n\tNo. Before anyone moves, you two\n\tshake hands and don't carry it any\n\tfurther.\n\nLinda gives Babe Brother a jab with her elbow. His hand\nreaches out to Gideon.\n\nINT. FRONT ROOM - NIGHT\n\nM.C. and Herman put the unshaded lamps next to Hattie so okra\ncan get a better picture. Percy starts to play his guitar.\nHerman stands behind Percy.\n\n\t\t\tHATTIE \n\tDon't make me say something nasty\n\tnow.\n\nPercy starts to play an old religious number and Hattie\nSTARTS TO SING. Everything stops for a moment as her VOICE\nfills the room.\n\nThen most of the guests pick up and join in. M.C. moves the\nlamp next to Percy so Okra can take his picture.\n\nINT. KITCHEN - NIGHT\n\nMarsh and Harry are getting quite loud in their argument. It\nhas become a kind of controlled anger.\n\n\t\t\tHARRY \n\tI think if anybody had a hand in\n\tkilling Hocker, you ought to ask or\n\tyou should have asked Emory and\n\tChick.\n\n\t\t\tMARSH \n\tChick was outright killed by a mob.\n\tHe killed a white man that owed him\n\tsome money and when they caught up\n\twith him, they tied him behind a\n\tcar and dragged him from out of the\n\thills back to town.\n\n\t\t\tHARRY \n\tThose boys never did have good\n\tluck.\n\n\t\t\tMARSH \n\tYou damn right they didn't,\n\tespecially Emory, my cousin.\n\n\t\t\tHARRY \n\tEmory had made a lot of enemies. He\n\thad a big mouth.\n\nM.C. and Okra come in wanting to take pictures. Marsh is\npretty mad about them intruding. M.C. sets the naked lamp in\nfront of Marsh, on the floor, almost between his legs.\n\nBefore Okra can get his camera set to shoot, Marsh leaves.\nHarry smiles as if he had won a major victory. Herman flops\ndown in the empty chair and starts to COUGH.\n\nSuddenly Suzie and Gideon burst into the kitchen holding up\none of the twins, Loviray. They carry the twin towards\nHerman's seat. Herman is slow to react. Herman gets up very\nslow. Finally, they are able to seat the twin.\n\n\t\t\tHARRY (CONT'D)\n\tWhat's the problem here?\n\n\t\t\tSUZIE \n\tShe has a fish bone caught in her\n\tthroat. Could all of you go in the\n\tother room? Gideon, get some bread\n\tand toast it quickly and find me\n\tthe cod liver oil.\n\nThe twin is holding her throat and PANTING like a fish out of\nwater. She is in a lot of pain. William, the twin brother, is\nstanding at the door with a tragic face.\n\nINT. GIDEON'S BEDROOM - MORNING\n\nGideon is trying to get out of bed. He sits on the side of\nthe bed and starts to COUGH.\n\nINT. HARRY'S BEDROOM - MORNING\n\nHarry has his back to the camera, sitting in a chair facing a\nwall. He is naked from the waist up. An empty plate is placed\nnot too far from where he is sitting. He is cutting an apple.\nHe licks the blade of his knife.\n\nINT. BABE BROTHER'S BEDROOM - MORNING\n\nBabe Brother is asleep. Linda is dressed to go to work. She\nthrows his suit on the foot of the bed.\n\n\t\t\tLINDA \n\tAre you going to work or sleep all\n\tday?\n\nHe snores louder. She opens the window and pulls back the\ncover. The cold air makes him draw up. On walking out, Linda\nsays in a rather hurt voice:\n\n\t\t\tLINDA \n\tRemember, you promised to take\n\tSunny to Magic Mountain today.\n\nBabe Brother slowly gets up holding his chest as if his heart\nis bothering him.\n\nINT. GIDEON'S BEDROOM - MORNING\n\nGideon tries to put his pants on. He is too weak and sits\nback on the bed with his pants only up as far as his knees.\n\nINT. KITCHEN - MORNING\n\nSuzie gets up to turn off the coffee kettle. When the kettle\nWHISTLE dies away, the sound of Gideon's VOICE is heard\ncalling Suzie for help. The sound of his voice frightens her.\n\nINT. BEDROOM - DAY\n\nSuzie bursts into the room and then moves very slowly to\nGideon, who is sitting on the bed out of breath.\n\n\t\t\tGIDEON \n\tI'm worn out.\n\n\t\t\tSUZIE \n\tJust stay in bed and rest.\n\n\t\t\tGIDEON \n\tI have to feed the chickens before\n\tthey wake everybody up.\n\n\t\t\tSUZIE \n\tYou stay inside. I will see to\n\tthem.\n\n\t\t\tGIDEON \n\tI will appreciate that.\n\nINT. DINING ROOM - EVENING\n\nSuzie and Junior are sitting at the dining room table. Harry,\nlooking like he has just gotten out of bed, drags himself in.\n\n\t\t\tHARRY \n\tHow is everybody?\n\n\t\t\tSUZIE \n\tTolerable well.\n\n\t\t\tJUNIOR \n\tHow did you sleep last night?\n\nThere is obvious hostility in Junior's tone. Harry senses\nJunior's hostility and chooses to ignore it.\n\n\t\t\tHARRY \n\tAh, you young folks don't know how\n\tit is. How is Gideon today?\n\n\t\t\tSUZIE \n\tHe wasn't able to get out of bed\n\ttoday.\n\n\t\t\tHARRY \n\tI hope that it's nothing serious.\n\n\t\t\tSUZIE \n\tHe has never gotten rid of the\n\tmalaria. He is usually up and at it\n\tthe next day. I'm going to make him\n\tfresh chicken broth.\n\n\t\t\tHARRY \n\tLet me earn my keep. I'll go out\n\tand get a hen and have it picked\n\tand ready for the pot. Try to make\n\thim some cow tea next time.\n\nJunior stares at Harry. Harry returns Junior's stare and\nJunior finds himself embarrassed. Junior looks down at his\npants leg and attempts to fix the crease in his pants by\nmaking a wedge with his fingers and running his fingers along\nthe old crease.\n\nAs Harry walks towards the back door, he looks back at\nJunior.\n\nEXT. BACKYARD - EVENING\n\nThe pigeons take to the air like an explosion. The chickens\nstart to CACKLE and run about as Harry reaches for one with\nhis cane. The SOUND of the boy next door practicing with his\ntrumpet adds to the bedlam.\n\nSuzie is standing on the steps, shouting to Harry. The noise\nof the panicked chickens and the boy playing the trumpet next\ndoor drown out Suzie's voice. Not getting Harry's attention,\nshe hurries down the steps.\n\nHarry has caught a hen that is SCREAMING her head off. He\nlooks around and finds Suzie hurrying towards him.\n\n\t\t\tSUZIE \n\tCan you watch Gideon for a while?\n\tOne of the girls is going into\n\tlabor. Junior is going to drive me\n\tover.\n\n\t\t\tHARRY \n\tYou just run along. I'll fix him\n\this soup. He will be all right.\n\nINT. ROOM - NIGHT\n\nSuzie and another woman who will be helping her are asleep.\nSuzie is in the chair and the woman is asleep on the floor.\nThe woman who is in labor is reading a magazine and seems\nsomewhat bored.\n\nINT. GIDEON'S BEDROOM - NIGHT\n\nHarry opens the door and slowly walks in. Gideon is asleep.\nHarry picks up Gideon's pants from the back of the chair.\nGideon's false teeth fall to the floor.\n\nINT. ROOM - NIGHT\n\nThere is a flurry of activity; the woman is contracting.\n\nINT. BEDROOM - MORNING\n\nThe untouched chicken broth sits on the night stand. Gideon\nis TALKING in his sleep. Morning light filters through the\nwindow shade. The room takes on a brownish tint. Gideon has\ndark rings under his eyes and looks like he has aged\nconsiderably.\n\nINT. HARRY'S BEDROOM - MORNING\n\nHarry is reading the Bible. He runs his finger over the print\nof the Bible. After reading the passage, he stares at the\nempty plate on the floor for what seems like a long time. He\nclaps the Bible shut, causing a loud NOISE to ECHO through\nthe house.\n\nEXT. FRONT OF HOUSE - MORNING\n\nSuzie is walking slowly up the steps.\n\nINT. BEDROOM - MORNING\n\nSuzie raises the window shade and is shocked to see the state\nthat Gideon is in.\n\n\t\t\tSUZIE \n\tOh my Lord!\n\nINT. BEDROOM - DAY\n\nThe room is crowded with people. Suzie is putting Gideon's\nshirt on. Harry is leaning against the door. After having put\nhis shirt on, Suzie puts his house shoes on and directs Babe\nBrother and Junior to hold him up while she tucks his shirt\nin and puts on his suspenders.\n\nIt takes almost everyone to hoist Gideon. Linda and Pat push\nthe bed and night-stand out of the way as Babe Brother and\nJunior struggle to lift Gideon. They almost stumble at the\ndoor. Harry is left standing in the room alone.\n\nEXT. BACKYARD - DAY\n\nHarry, Okra and Herman are trying to catch another chicken.\nHerman is COUGHING badly and Okra is out of breath.\n\n\t\t\tOKRA \n\tYou think old Gideon is going to\n\tlive to see this month out?\n\n\t\t\tHARRY \n\tWhen I came upon the valley of\n\tbones, the serpent said, \"Make this\n\tyour home. Dry as my soul be,\n\theaven is lost to thee.\" We all got\n\tto make way.\n\nHarry puts the rooster face to the ground and draws a\nstraight line. Harry lets the rooster go, but the rooster\nstays motionless, unable to move.\n\n\t\t\tHARRY (CONT'D)\n\tA chicken hates to see the preacher\n\tcoming to dinner.\n\nHerman hands Harry the ax. Harry is poised over the chicken\nwith the ax, appreciating the moment. Harry raises the ax.\nThe SOUND of Rodney starting to practice his trumpet brings\nthe rooster out of the trance.\n\nBefore Harry can react, the rooster jumps away.\n\n\t\t\tOKRA \n\tHerman, you will have to catch the\n\tnext one 'cause I'm out of breath.\n\n\t\t\tHERMAN \n\tIf I have to chase after one, we\n\twon't eat.\n\nA sack drops over the fence. Okra limps over to see what is\nin the bag. He uses a stick to open the bag. He doesn't like\nwhat he sees and throws the bag back over the fence.\n\nINT. VETERAN'S HOSPITAL, WARD - DAY\n\nSuzie, Junior and Pat are standing around Gideon's bed. He is\nin a room full of old veterans who are apparently nearing the\nend.\n\nTwo old veterans, one white and the other black, sitting\nopposite each other wearing medals, sit in silence staring\ninto each other's eyes.\nA nurse empties an old man's urine bag. The old man doesn't\nshow any embarrassment about his predicament. Gideon looks at\nhow the patients are treated.\n\n\t\t\tGIDEON \n\tI don't want to stay here. \n\t\t(beat)\n\tWhere is Babe Brother?\n\nINT. HERMAN'S ONE ROOM HOUSE - DAY\n\nM.C. is sitting on the bed, reading the job section of the\npaper. Herman is putting Vicks Vapo-Rub in a bowl of boiling\nwater. He covers his head over the bowl with a towel. Okra is\nsitting at the table examining his gun. He points it at the\nfloor, seeing if the sight is straight.\n\nHarry is sitting at the table with Babe Brother. Harry is\nshowing him how to cheat at cards.\n\n\t\t\tHARRY \n\tNever play with someone's else's\n\tcards. You always get a new deck.\n\tLook at this card. See anything?\n\n\t\t\tBABE BROTHER\n\tIt is just a regular card.\n\n\t\t\tHARRY \n\tSon, I can take everything you got\n\twith that deck. It is marked. Now\n\tI'm going to show you how to make\n\tsome money in case you get stuck\n\tsomewhere.\n\nINT. FRONT ROOM - NIGHT\n\nA moth flies around the light casting a shadow that floats\nover everything. Suzie turns out the kitchen light and then\nturns out the dining-room light. She goes to her room and\ncloses the door, leaving the room dark. A car headlight\npassing outside casts a moving pattern that moves along the\nwall.\n\nThe light reveals Harry's presence standing in the hall\ndoorway.\n\nEXT. HOUSE - DAY\n\nGideon is being helped up the steps by his sons.\n\nINT. FRONT ROOM - DAY\n\nSuzie is holding the door open while Gideon is carried in by\nJunior and Babe Brother. Gideon is led to a chair. He still\nlooks awful.\n\n\t\t\tBABE BROTHER \n\tDoesn't he look a whole of lot\n\tbetter?\n\n\t\t\tSUZIE \n\tWell, you look better than you did\n\tyesterday.\n\n\t\t\tGIDEON \n\tNext time, I don't care how sick\n\tI'll be, don't take me back to the\n\tVeteran's Hospital.\n\nHarry comes out of the bathroom, having just taken a bath.\nHarry seems delighted to see Gideon again.\n\n\t\t\tHARRY \n\tBoy, I thought you were about to\n\tcross the river.\n\n\t\t\tGIDEON \n\tI tell you, I feel like a ghost.\n\nHarry signals Babe Brother to come over to him.\n\n\t\t\tHARRY \n\tSon, would you do me a favor and\n\tsee if you could turn off that tap\n\tin the bathroom. My hand is too\n\tweak. And would you do me another\n\tfavor? I don't like asking this but\n\twould you clean the tub for me? I\n\thave trouble bending over.\n\n\t\t\tBABE BROTHER \n\tAnytime you need someone to do\n\tsomething for you, just let me\n\tknow.\n\nHarry flops down on the couch. Suzie sets a cup of coffee on\nthe table for Gideon. Harry looks up from sharpening his\nknife on a hand sharpening stone. He spits on it.\n\n\t\t\tHARRY \n\tThat smells like fresh coffee.\n\n\t\t\tSUZIE \n\tLet me get you a cup?\n\n\t\t\tHARRY \n\tOnly if you can spare it.\n\nJunior stands over Harry's shoulder looking at him sharpening\nhis knife. Harry feels uncomfortable with Junior standing\nbehind him. Harry looks up at him.\n\n\t\t\tHARRY (CONT'D)\n\tSon, would you get me an old piece\n\tof newspaper?\n\nSuzie sets a cup of coffee in front of Harry.\n\n\t\t\tHARRY (CONT'D)\n\tLord if you ain't an angel.\n\nJunior hands Harry the newspaper. Harry puts the paper under\nhis foot and trims his toenails with it. Harry is aware of\nJunior standing over him.\n\n\t\t\tHARRY (CONT'D)\n\tI will leave you something in my\n\twill.\n\nINT. BATHROOM - DAY\n\nJunior looks in but Babe Brother is too busy trying to clean\nthe bathtub to notice anyone. Babe Brother complains to\nhimself.\n\n\t\t\tBABE BROTHER \n\tWhat in the hell...\n\nINT. FRONT ROOM - DAY\n\nGideon and Suzie are in silhouette against the window.\n\nThe SOUND of the boy trying to play his horn next door\nstartles Gideon. Gideon turns to look out of the window\ntowards Mrs. Baker's house.\n\n\t\t\tGIDEON \n\tIt's good to be able to hear that.\n\n\t\t\tSUZIE \n\tYou must have been really sick.\n\n\t\t\tGIDEON \n\tHow is the garden doing?\n\n\t\t\tSUZIE \n\tI need to get out there and get\n\tthose weeds out.\n\n\t\t\tGIDEON \n\tHow is that hen doing? I was\n\tmeaning to pip her before I fell\n\tsick.\n\nHe takes a deep breath and blows it out.\n\n\t\t\tGIDEON (CONT'D)\n\tI'm going to lie down. Take my,\n\thand and help me up, lest I fall.\n\nINT. BEDROOM - DAY\n\nSuzie helps Gideon to undress. Gideon loses hit balance but\ncatches himself on the side of the bed.\n\n\t\t\tGIDEON \n\tOh, I couldn't have last another\n\tday in that hospital. You get weary\n\tbeing in the old soldiers home, old\n\tsoldiers and war stories. They wait\n\tto tell you their last story; the\n\tnext morning the nurse pulls a\n\tsheet over their face.\n\nINT. DINING ROOM, JUNIOR'S HOUSE - NIGHT\n\nJunior is putting up a new light fixture. Pat hands him a\ntool. Rhonda is washing dishes in the kitchen.\n\n\t\t\tPAT\n\tHe just leeches off your parents.\n\tHe is a master at wearing out\n\twelcome. \n\n\t\t\tJUNIOR\n\tHarry is the kind of guy you would\n\tlove to take out in the woods and\n\tleave under a rock. \n\n\t\t\tPAT\n\tWhere does her get the power to\n\tsummon all his old raffish friends?\n\tThey all smell of moth balls. \n\nJunior slips on the ladder and the wires touch. There is a\nbig spark. All the lights in the house go out. \n\nINT. BABE BROTHER'S KITCHEN - NIGHT\n\nLinda is standing over the stove, sweating as she stirs a hot\npot of boiling soup.\nBabe Brother and Harry are seated at the table playing cards.\nSunny is on the floor near his mother. Every time she move,\nhe follows her. Harry notices Sunny has his shoes on the\nwrong foot and adds in a sarcastic way:\n\n\t\t\tHARRY\n\tHow old is that boy?\n\nBabe Brother looks at Sunny's shoe.\n\n\t\t\tBABE BROTHER\n\tLinda, how come you don't see that\n\tSunny puts his shoes on right?\n\n\t\t\tLINDA \n\tWhy in the h...\n\nClose to tears, she turns and with exaggerated care, puts the\nspoon down and gently puts Sunny in a chair. She starts to\nuntie his shoes. Sunny stares at her while she keeps wiping\nher eyes.\n\n\t\t\tHARRY \n\tLet's give Dry Bones a call to see\n\tif he is coming or not. Okra likes\n\tto exaggerate, keep you waiting all\n\tnight.\n\nHarry slowly gets to his feet and goes in the other room to\nuse the phone. Linda watches him go. She is deep in thought.\n\nBabe Brother, attempting to cut the roast before it is ready,\nis pushed aside by Linda, who is almost out of control with\nrage.\n\n\t\t\tLINDA\n\tWhy don't you wait?\n\nBabe Brother, attempting to forcibly cut a piece of roast,\nslings Linda's arm away. His hand accidentally hits her in\nthe eye.\n\nLinda grabs the fork, poised to strike, but gains control of\nherself She looks like a person who is on the verge of having\na breakdown. She goes back to putting the shoes on Sunny.\n\nBabe Brother, feeling sorry, doesn't know what to do. He\nautomatically picks up the fork and washes it off. Linda\npicks up Sunny.\n\nINT. DINING ROOM - BABE BROTHER'S HOUSE - NIGHT\n\nLinda is standing at the door, with a red eye, welcoming\nHarry's friends, which seem to be a long line of sickly\npeople.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. DINING ROOM - NIGHT\n\nLinda is busy serving everyone, running in and out of the\nkitchen bringing more things, and removing used plates, etc.\nLinda's eye is swollen and discolored. The guests look at\nLinda's eye and then cast a naughty-boy glance at Babe\nBrother.\n\nLinda stops serving to pay attention to an elderly man, who\ndeliberately bends one of her spoons. She catches another man\nputting a fork in his pocket and an elderly lady putting a\ncigarette out in one of her plates.\n\nAs she is about to confront the man about pocketing her\nspoon, a peal of LAUGHTER forces her to turn around only to\nwitness a lady knocking over a glass filled with a green\ndrink with her elbow. The stain spreads across the table\ncloth in an even manner like a single wave. She watches it\nmove from one end of the table to the other.\n\nHarry is seated in the middle. The composition hints at The\nLast Supper.\n\nINT. BEDROOM - NIGHT\n\nLinda is reading a book to Sunny, who has his coffee can of\nmarbles emptied on the bed. The NOISE from the party in the\nnext room is clearly heard. Every time she hears something\nCRASHING to the floor, she wrenches. Babe Brother comes in\nand stands in the doorway. Linda's eye is still swollen.\n\n\t\t\tBABE BROTHER \n\tYou okay?\n\n\t\t\tLINDA \n\tI'm okay. Go back to your friends.\n\nBabe Brother closes the door and leaves Linda reading stories\nof Brer Rabbit to Sunny. She stops reading to look at him\nplaying marbles on the bed. She smiles.\n\nEXT. GIDEON'S HOUSE - DAY\n\nFive weighty Women, dressed in church robes, and the Preacher\nwalk up Gideon's steps.\n\nSuzie invites the church members in.\n\n\t\t\tPREACHER \n\tSister, we've come to see how you\n\twere doing. We came to ask if we\n\tcould pray over Gideon.\n\nINT. GIDEON'S BEDROOM - DAY\n\nGideon is asleep. The church members gather around his bed.\nThe Preacher puts his hand on the foot of the bed and\ndiscovers that there is something strange under the covers.\nSuzie looks at him and lifts the covers at the foot of the\nbed. Gideon's feet are resting on dead leaves.\n\n\t\t\tSUZIE \n\tI put some Plummer Christian Leaves\n\tunder his feet to draw the fever\n\tout.\n\n\t\t\tPREACHER \n\tWhat else have you been giving him?\n\n\t\t\tSUZIE \n\tI crossed his stomach with cold oil\n\tand gave him some cow tea.\n\n\t\t\tPREACHER \n\tSuzie, I would think you would\n\tdepend on prayer rather than these\n\told fashion remedies. Let us read\n\tfrom the Bible.\n\nThe Preacher opens his Bible and reads silently. The choir\nHUMS and begin to sway. Gideon's SNORING is very competitive.\nThe choir becomes louder. Gideon starts to TALK in his sleep.\nSuzie is alarmed.\n\nCLOSE UP GIDEON'S EAR.\n\nTHE SOUND OF A TRAIN WHISTLE IS HEARD.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. PHOTO STUDIO, 1930 - DAY (DREAM EFX)\n\nA lady steps upon the stage which has different backdrops.\nShe is the same lady in a photo that Gideon has hanging in\none of the kid's rooms. The photographer, who is off-screen,\nasks about the background.\n\n\t\t\tPHOTOGRAPHER (O.S.) \n\tWhat scene would you like in the\n\tbackground?\n\n\t\t\tLADY \n\tSomething pleasant.\n\n\t\t\tPHOTOGRAPHER (O.S.)\n\tWe have plantations.\n\nThe woman shakes her head.\n\n\t\t\tPHOTOGRAPHER (O.S.) (CONT'D)\n\tNatchez, cotton fields, Harlem,\n\tsunflowers, the Mississippi River.\n\n\t\t\tLADY \n\tPut the river behind me.\n\nA large picture of the Mississippi appears behind the lady.\nIt changes from a painted backdrop to a moving picture. There\nis a storm developing off in the distance. The SOUND of\nthunder is heard. The picture in the background then changes\nto a boy on a mule.\n\nEXT. WET DIRT ROAD - DAY (RAINING) (DREAM EFX)\n\nThe boy on the gray mule doesn't have a shirt on. A light\nmist like rain covers him. Gideon walks along the picket\nfence towards the boy on the mule.\n\nAhead of Gideon seems to be a puddle but as he approaches, he\ndiscovers that it is an abyss. The boy and the mule on the\nother side fade away. Everything FADES TO BLACK.\n\nINT. GIDEON'S BEDROOM - DAY\n\nThe Preacher turns a page in the Bible. Gideon has his mouth\nopen like a fish trying to get air. The Choir continues to\nSING. The Preacher gets down on his knees and holds Gideon's\nhand; he bows his head. The Choir stops singing. The Bessie\nSmith recording of \"Muddy Water\" is coming from somewhere in\nthe house. The Preacher looks around. Suzie is more puzzled.\nShe goes to find where the music is coming from.\n\nINT. HARRY'S BEDROOM - DAY\n\nSuzie knocks on the door. No one answers. She peeps in. No\none is in the room.\n\nINT. GIDEON'S BEDROOM\n\nThe Preacher and the choir all have their hands on Gideon.\nSuzie enters the room.\n\n\t\t\tSUZIE \n\tI don't know where that music is\n\tcoming from.\n\nINT. JUNIOR'S HOUSE - DAY\n\nJunior and Pat are helping Linda carry her baggage inside as\nSunny reluctantly follows. It is obvious that Linda has left\nBabe Brother.\n\n\t\t\tSUNNY \n\tI want my daddy.\n\n\t\t\tJUNIOR \n\tBoy, hush that noise and get in\n\tthis house. Make haste.\n\n\t\t\tSUNNY \n\tI want my daddy; I told you.\n\n\t\t\tJUNIOR \n\tRhonda, drag him in here. If you be\n\tnice, I will take you to\n\tDisneyland.\n\nPat, Linda and Junior put the suitcases down.\n\n\t\t\tPAT \n\tNow you don't have to say anything\n\tif you don't want to.\n\n\t\t\tJUNIOR \n\tI want to hear what happened. My\n\tbrother is a jackass and a damn\n\tfool. The both of you have been as\n\tscarce as hen's teeth.\n\nLinda looks down, embarrassed.\n\n\t\t\tPAT \n\tRhonda, take Sunny in the backyard.\n\tTake a bowl so you can pick some\n\tstrawberries. Sunny will enjoy it.\n\nRhonda and Sunny leave. Pat turns on Junior about talking bad\nabout Babe Brother and Linda in front of Sunny.\n\n\t\t\tPAT \n\tYou shouldn't talk about the boy's\n\tfather in front of him. This is\n\tfamily business and we have to pull\n\ttogether.\n\n\t\t\tJUNIOR \n\tWhether the boy hears it or not,\n\tthe man is still a jackass.\n\tEveryone should have some mother\n\twit.\n\n\t\t\tLINDA \n\tSomething just took control of him.\n\tHe stays out all night and comes\n\thome with a pocket full of money.\n\n\t\t\tPAT \n\tIt's probably Harry, but I hate to\n\tmention his name, because every\n\ttime we say something about him\n\tsomething bad happens.\n\nEXT. BACKYARD - DAY\n\nRhonda and Sunny are looking under a strawberry plant. Sunny\nhas strawberry stains around his mouth and on his shirt.\nRhonda is putting her strawberries in the bowl. After getting\na bowl full, they lay on the grass, eating strawberries while\nlooking up at the clouds slowly drifting by.\n\nEXT. COUNTRY ROAD - DAY\n\nBabe Brother is driving along a country road while Harry,\nsitting in the front seat next to him, yawns. Harry is tired.\n\n\t\t\tHARRY \n\tLet us walk awhile. I grow weary\n\twhen I sit still too long.\n\nBabe Brother's car stops in an orchard-like area.\n\nEXT. ORCHARD - DAY\n\nBabe Brother and Harry get out of the car. They walk on a\npath that takes them under low hanging tree limbs. It gets\ndarker as they go deeper into the orchard. Babe Brother finds\nthe going rough and loses his footing.\n\n\t\t\tHARRY \n\tGive me your arm lest you fall.\n\nHarry has to help him stay on his feet. Babe Brother finds it\nnecessary to take Harry's arm. Babe Brother stops and Harry\nwalks a few more steps ahead and waits for Babe Brother. Just\nahead sitting on a branch is a huge white owl camouflaged by\ntree branches.\n\n\t\t\tBABE BROTHER\n\tI could swear I heard my son call\n\tme.\n\n\t\t\tHARRY \n\tYou probably heard the wind\n\tstirring up those dead leaves over\n\tthere.\n\n\t\t\tBABE BROTHER \n\tI heard his voice as clear as day.\n\tI better get back. Maybe something\n\tis wrong.\n\nBabe Brother turns and starts hurrying back before Harry can\nobject. He walks slowly after Babe Brother who is doubling\nthe distance between himself and Harry as he runs through the\norchard to his car. Harry stops and looks around.\n\nINT. FRONT ROOM - DAY\n\nPat, Linda and Junior are seated at the table. The suitcases\nare in the middle of the floor.\n\n\t\t\tLINDA \n\tI told Babe Brother that if Harry\n\tsets foot in our house again, I'm\n\ttaking Sunny and leaving. Just as I\n\tsaid that, here come Harry and his\n\told resurrected friends, hobbling\n\tup the steps.\n\n\t\t\tJUNIOR \n\tIs that how you got that black eye?\n\n\t\t\tPAT \n\tDon't ask that.\n\n\t\t\tLINDA \n\tNo, this was an accident.\n\n\t\t\tJUNIOR \n\tSure.\n\n\t\t\tLINDA \n\tIt was unintentional.\n\n\t\t\tJUNIOR \n\tBabe Brother reminds me of the\n\tstory of the man who wanted to be\n\tsizable. He wanted to be tall but\n\twhat he was really short on was\n\tbrains. There was a time when\n\tpeople had moon fever were treated\n\twith leeches.\n\nThe phone rings and Junior goes to pick it up. Linda's and\nPat's attention is focused on the phone. Junior hands the\nphone to Linda.\n\n\t\t\tJUNIOR (CONT'D)\n\tIt's that nut of yours.\n\nLinda hesitates but Pat takes the phone from Junior and puts\nit in her hand.\n\n\t\t\tLINDA \n\tWhat do you want? \n\t\t(beat)\n\tNo. Nothing happened to him.\n\nSunny and Rhonda enter. Linda turns to look. Sunny's hands\nand face look bloody from eating strawberries. She puts the\nphone down and examines his dirty face. Pat brings Linda a\nwet towel.\n\nINT. THE BAKERS' GARAGE - NIGHT\n\nMR. BAKER, a well built black man in his late 40's, is making\na new fishing pole. He is very involved. Mrs. Baker is\nstanding beside him with her arms folded. She stares at him.\nMr. Baker glances at her. \n\n\t\t\tMR. BAKER\n\tWhat are you doing?\n\n\t\t\tMRS. BAKER \n\tCounting the gray hairs in your\n\thead.\n\n\t\t\tMR. BAKER \n\tCounting the what? What does that\n\thave to do with the price of\n\tbutter?\n\n\t\t\tMRS. BAKER \n\tI was just trying to make\n\tconversation.\n\n\t\t\tMR. BAKER \n\tWhere is Skip?\n\n\t\t\tMRS. BAKER \n\tHe is in his pigeon cage.\n\n\t\t\tMR. BAKER \n\tI'm sorry he got those birds.\n\n\t\t\tMRS. BAKER \n\tYou know the man next door is near\n\tdeath.\n\nMr. Baker doesn't answer. He pauses for a moment of thought.\nMrs. Baker sees that she is not going to get a response from\nher husband. She picks up an eyelet and Mr. Baker looks at\nher as if to say, keep your hands off. She gets the message\nand lays the eyelet back on the work bench.\n\n\t\t\tMRS. BAKER (CONT'D)\n\tHe must have gotten rid of those\n\tchickens. You don't hear them\n\tcrowing anymore... I kind of miss\n\tit now.\n\nMr. Baker admires his pole. He looks very closely at the\ndetails of his work.\n\nRodney comes in, polishing his horn. Mr. Baker's expression\nchanges as he watches Rodney out of the corner of his eye.\nMrs. Baker gives Rodney a motherly pat on the head. Rodney\nputs the trumpet to his mouth.\n\n\t\t\tMR. BAKER \n\tDon't blow that thing in here. You\n\tblow that thing when I'm at work.\n\nEXT. STREET - DAY\n\nThere is a man lying on a bus bench with his belongings. A\nspotted dog is standing guard next to the bench. The dog's\nreflection is caught in a puddle of water. The dog has\ncircles and sixes painted over his body.\n\nOld John taps on the bench with his pipe. The man lying on\nthe bench stirs and gives Old John a wave to indicate that he\nis alright. Old John slowly gets his cart moving again.\n\nEXT. JUNIOR'S HOUSE - DAY\n\nBabe Brother drives around the block past Junior's house.\n\nINT. JUNIOR'S HOUSE - DAY\n\nJunior is at the window, looking out.\n\n\t\t\tJUNIOR \n\tWhy doesn't he just park his car\n\tand come in and apologize?\n\nEXT. JUNIOR'S HOUSE - DAY\n\nBabe Brother sits in his car with the windows up. Junior\ntries to talk to him but Babe Brother will not roll down the\nwindows. He just stares at Junior, who is getting angry.\n\n\t\t\tJUNIOR \n\tRoll down the window and let me\n\ttalk to you.\n\nBabe Brother only stares at him. Junior gets more violent and\nstarts to shake the car.\n\nPat calls from the doorway.\n\n\t\t\tPAT \n\tStop it Junior!\n\nINT. PREGNANT WOMAN'S ROOM - DAY\n\nA woman is in a squatting position. Suzie and her aide are\nholding the woman by the arms.\n\nEXT. JUNIOR'S HOUSE - DAY\n\nRhonda is painting her fingernails. Sunny watches her. She\nlooks around to see if any adult is watching. She tries to\ntalk Sunny into letting her paint his nails. He refuses but\nshe tries to pull his hand towards her. He fights his way\nfree and stands up and kicks the bottle of nail polish over.\n\n\t\t\tRHONDA \n\tMama, come see what Sunny did.\n\nINT. GIDEON'S BEDROOM - NIGHT\n\nSuzie is sitting in a chair; her head is bent forward. Gideon\nis TALKING in his sleep. She awakes and nods off again. Harry\nsticks his head in.\n\n\t\t\tHARRY \n\tHow is he doing?\n\n\t\t\tSUZIE \n\tAs long as he keeps his throat\n\tclear, he is able to get some rest.\n\n\t\t\tHARRY \n\tI made a fresh pot of coffee. Okra\n\tand I thought you need a rest. I'll\n\tstand guard. Okra wants to talk to\n\tyou anyway.\n\nHarry helps Suzie to her feet.\n\nINT. KITCHEN - NIGHT\n\nOkra is painfully standing on his bad feet. He is in his\nsecurity-guard uniform, holding a bouquet of greens. As Suzie\ncomes in, Okra tries to stand upright at attention.\n\n\t\t\tOKRA \n\tI brought you these greens and some\n\tsalt meat.\n\n\t\t\tSUZIE \n\tThat is very thoughtful of you. I\n\thaven't had time to tend to my\n\tgarden like I should.\n\nSuzie takes the greens and puts them on the counter. She\nsqueezes Okra's hand as a thank you. She pours him a cup of\ncoffee. Okra eases down into the chair. He crosses his legs\nand starts massaging his feet.\n\nSuzie get herself a cup of coffee and sits opposite him. She\nstretches and tries to hold back a yawn. Okra looks at her in\na slightly desirous way.\n\n\t\t\tOKRA \n\tYou know Gideon and I are lodge\n\tbrothers and it has always been a\n\tpolicy to take care of the wives if\n\tsomething happens to our brother.\n\n\t\t\tSUZIE \n\tYou are very sweet, but Gideon has\n\talready taken care of everything in\n\tcase something happens to him. He\n\thas a policy.\n\n\t\t\tOKRA \n\tIf you become a widow, you will\n\tneed someone around to fix the\n\twhatnots. We like for the widow to\n\tmarry someone in the lodge. I know\n\tGideon ain't gone yet, but there\n\twill be a lot of his old friends\n\tcoming around to get in line. I\n\tjust want you to consider this as a\n\tkind of a conditional proposal, to\n\tbe first in line so to speak.\n\nSuzie keeps herself under control; she tries to find words to\nsay. She stands up.\n\n\t\t\tSUZIE \n\tExcuse me. I have to go feed my\n\tdog.\n\nShe turns the fire out from under the coffee pot and exits\nthe back door.\n\nOkra unties his shoes and begins to massage his feet.\n\nINT. BEDROOM / EXT. YARD - NIGHT\n\nHarry is sitting by the bed, just visible through the window.\nHe seems restless.\n\nEXT. GIDEON'S BACKYARD - DAY\n\nThere is only one hen left in the coop. The garden is full of\nweeds. The sunflowers are bent by the force of the wind. A\nbag is thrown over the fence.\n\nThe shadows of pigeons flying overhead race along the ground.\n\n\t\t\t\t\t\t\tDISSOLVE TO:\n\nINT. KITCHEN - DAY\n\nTwo shadows on the wall are facing each other. The shadows\nare the heads of two women, Suzie and Hattie.\n\n\t\t\tHATTIE \n\tYou know Harry lied about how that\n\tboy Hocker got kilt. And it was\n\tHarry who saw Emory last before\n\tthey found him hanging over a levee\n\tlike someone would hang a hog.\n\n\t\t\tSUZIE \n\tI remember Harry always trying to\n\thelp someone. He got Lulla's\n\tdaughter out of trouble. He was\n\talways running to the store for\n\tsomeone who couldn't leave the\n\thouse.\n\n\t\t\tHATTIE \n\tHarry always shows his good side\n\tand, like the moon, the other side\n\tis black. Back home he always did\n\ttry to act like the colored\n\tgentleman. I'm telling you Harry is\n\tnothing but evil. I'm warning you --\n\tyou can't keep a wild animal as a\n\tpet around children.\n\nINT. HARRY'S ROOM - DAY\n\nHarry has a plate of food in his hand. He stands facing\nhimself in the mirror, staring at himself while he eats. He\nopens the door to leave but Sunny is in the hallway with his\nback turned sweeping. Harry stares at him and decides to go\nback in his room.\n\nINT. KITCHEN - DAY\n\n\t\t\tSUZIE \n\tYou know Okra asked me to marry him\n\tthe other evening.\n\n\t\t\tHATTIE \n\tRush your mouth, girl. No, he\n\tdidn't. He cannot be that big of a\n\tdamn fool.\n\n\t\t\tSUZIE \n\tI asked Harry about it. He didn't\n\town up to it. He said he didn't\n\tknow what got into Okra.\n\n\t\t\tHATTIE \n\tHe's just raffish. Harry put him up\n\tto it. Before evening sun sets, I\n\twould have his belongings back on\n\tRoute 55, that old fox.\n\n\t\t\tSUZIE \n\tI can't accuse him just dry long\n\t80.\n\n\t\t\tHATTIE\n\tEverybody who have been associated\n\twith Harry end up with pennies over\n\ttheir eyes.\n\n\t\t\tSUZIE \n\tWhat must I do?\n\n\t\t\tHATTIE \n\tIf it was left up to me, I would\n\tpoison him.\n\nINT. HALLWAY - DAY\n\nHarry sees that it is safe to leave. He sees Sunny sweeping\nin Gideon's room. Gideon is sound asleep. Sunny is sweeping\naround the bed.\n\nINT. KITCHEN - DAY\n\nHarry comes in and Hattie and Suzie stop talking. Harry is\naware that he was the subject. The SOUND of the boy next door\nplaying his horn is heard.\n\n\t\t\tHARRY \n\tGood afternoon, ladies.\n\n\t\t\tSUZIE\n\tGood afternoon to you.\n\nHarry waits for Hattie to respond but it is obvious that\nHattie isn't about to speak to him.\n\n\t\t\tHATTIE \n\tI'm going to check on Gideon.\n\nHarry moves out of her way to let her go by. Hattie doesn't\neven give him a glance. Harry continues to look at her as she\ndisappears into Gideon's room.\n\n\t\t\tHARRY \n\tAs God is my witness, I have never\n\tdone anything to that woman.\n\n\t\t\tSUZIE \n\tYou must have done something to\n\ther.\n\n\t\t\tHARRY \n\tSince she has repented, all she\n\tdoes is throw stones.\n\n\t\t\tSUZIE \n\tHattie is a different person now.\n\n\t\t\tHARRY \n\tI don't make no bones about where\n\tI'm going to spend eternity. I have\n\talways been wild and you know that.\n\tIf you are made to feel half a man,\n\twhat do you think the other half\n\tis?\n\n\t\t\tSUZIE \n\tI'm glad you brought that up as to\n\twho you are. I have to know who is\n\tin my house.\n\n\t\t\tHARRY \n\tYou invited me.\n\n\t\t\tSUZIE \n\tOnly if you are a good man, a\n\tfriend. Are you a friend?\n\nHarry takes his time in looking for an answer.\n\n\t\t\tHARRY \n\tLike that boy next door playing\n\tthat his horn. If he was a friend,\n\the would stop irritating people,\n\tbut if he stops practicing, he\n\twouldn't be perfect in what he does\n\tsomeday.\n\nINT. HARRY'S BEDROOM - DAY\n\nHattie enters Harry's room. She goes through his things. She\nreads one of his letters. As she walks over to the window\nreading his letter, she steps on the plate, cracking it.\n\nINT. KITCHEN - DAY\n\n\t\t\tSUZIE \n\tI want you to leave.\n\nHarry looks sad and suddenly a lot older as if what she said\nhas taken away some of his life.\n\n\t\t\tHARRY \n\tOkra, M.C. and Herman want to go\n\tback home with me. \n\t\t(beat)\n\tSuzie, I'm not a bad fellow; I just\n\tlike to have a good time. \n\t\t(beat)\n\tM.C. is coming by to pick me up\n\ttonight. I'll come back to get my\n\tthings. Well, I hope Gideon\n\trecovers. You know I have an extra\n\tpicture of one of my sons that I\n\twould like for you to put with\n\tthose baby pictures over your\n\tdresser. It's better than being in\n\tmy dusty wallet with addresses and\n\tnames of people who are no longer\n\ton this earth.\n\nSuzie takes the picture. She seems as if she has doubts about\nhaving asked Harry to leave.\n\n\t\t\tHARRY (CONT'D)\n\tI'll say my so-longs to Gideon\n\tbefore I leave and I truly wish\n\tthat he will get well.\n\nSuzie continues to look at the picture.\n\nINT. HARRY'S BEDROOM - DAY\n\nHattie is reading Harry's letters when he appears behind her.\nHattie turns but is not surprised or concerned about Harry.\nShe hands him back his letters, looks at him for a moment and\ngoes. Harry looks down at the cracked dish.\n\nINT. HERMAN'S HOUSE - EVENING (RAIN)\n\nM.C. and Herman are packing. Okra is all dressed up with a\npair of Stacy Adams shoes that make his feet look\nexaggeratedly long. Babe Brother and Harry are sitting at a\ntable playing blackjack. Okra picks up one thing at a time,\nmaking the packing much harder. There is a stack of old dusty\n78 record; Okra, trying to step over the records, kicks over\na box of mothballs that roll across the floor. Okra has to\nstep over boxes of toilet paper.\n\n\t\t\tOKRA \n\tWhy did you buy so much toilet\n\tpaper?\n\n\t\t\tM.C.\n\tI got that on the job when I was a\n\tjanitor. They didn't pay me.\n\nHarry picks up an old cigar box that falls opens. Dice,\nshotgun shells, some spent .38 slugs and an old rusty knife,\na crab apple switch, land on the floor. Harry picks up the\nknife.\n\n\t\t\tHARRY \n\tWhose old piece of knife is this?\n\n\t\t\tHERMAN \n\tThat was my brother's knife.\n\nHarry gives the knife to Babe Brother and signals him to put\nit in his pocket.\n\nThe SOUND of the thunder has an unreal violence to it.\n\n\t\t\tHARRY \n\tI don't want to wear out welcome,\n\tbut you can stay in someone's heart\n\tlonger than you can stay in their\n\thouse. Come with us, boy. We are\n\tgoing to have a good time.\n\n\t\t\tBABE BROTHER \n\tThis would be a bad time for me to\n\tleave.\n\n\t\t\tHARRY \n\tWe are going where the action is.\n\tAin't that right, Okra?\n\t\t(then back to Babe\n\t\tBrother)\n\tLet's play for a couple of bucks\n\tunless you want to start off with\n\ttwo bits and work our way up.\n\t\t(beat)\n\tWhat would you give to be rich?\n\nBabe Brother humps his shoulder. Babe Brother looks at his\nhand.\n\n\t\t\tBABE BROTHER \n\tHad Moms and Pops given me my share\n\tof what was mine, I could have been\n\trich by now. Linda and I had it all\n\tworked out.\n\nHarry wins the first hand.\n\n\t\t\tHARRY \n\tI know your mind is on your wife\n\tbut you should never treat a woman\n\tas an equal. You want to get your\n\twife back, get another woman, one\n\tof those big hip women that will\n\tride you till you sweat.\n\nHarry wins another hand. M.C. and Okra are still packing\nwhile Herman is eating Argo Starch.\n\n\t\t\tHARRY (CONT'D)\n\tDouble the stakes?\n\nBabe Brother agrees but his thoughts are obviously somewhere\nelse. Harry studies his hand and looks at Babe Brother; he\nputs down his hand. Babe Brother wins and is quite pleased.\nThe next series of hands are won by Babe Brother.\n\n\t\t\tHARRY (CONT'D)\n\tM.C., you ever heard of a real man\n\thaving one woman?\n\n\t\t\tM.C. \n\tNo, lord!\n\n\t\t\tHARRY \n\tWhen one woman puts you out, you\n\thave another to take you in. You\n\tdon't drive around without a spare\n\ttire, do you? The more mules you\n\thave hitched, the easier it is to\n\tplough.\n\nHarry loses another hand and Babe Brother suddenly has a pile\nof money.\n\n\t\t\tHARRY \n\tHerman, let me borrow a few bucks.\n\nHerman stand over him with a roll of bills and peels off\nseveral.\n\n\t\t\tHARRY (CONT'D)\n\tBless you. Bless you.\n\nHerman is standing behind Babe Brother, SINGING to himself.\n\n\t\t\tHERMAN \n\tIn the ground there is a hole and\n\tgreen grass growing around the\n\thole. Now in the hole there is tree\n\tand green grass growing all around\n\tthe tree. Now there is a hole in\n\tthe ground, a tree in the hole and\n\tgreen grass growing around the\n\thole.\n\n\t\t\tHARRY \n\tLet me share something with you.\n\nHarry stops and thinks for a while.\n\n\t\t\tHARRY (CONT'D)\n\tHattie is a snake. That woman broke\n\tup so many homes and caused a lot\n\tof misery and because she calls\n\therself getting religion everything\n\tis put right.\n\nOkra is taking several shotguns out of the closet.\n\n\t\t\tOKRA \n\tThese damn things are unloaded,\n\tain't they?\n\n\t\t\tHARRY \n\tIt's important to know the\n\tdifference between the incoming\n\tfire and the outgoing fire. As Amos\n\tand Andy might say, \"We is the\n\toutgoing fire.\" Come with us, son.\n\tWe'll show you some steaming hot\n\tjuke joints, steaming hot women.\n\n\t\t\tM.C. \n\tA pot full of chitlins and a good\n\ttime.\n\n\t\t\tBABE BROTHER \n\tLet me go by the house first.\n\n\t\t\tHARRY \n\tWe will wait for you as long as we\n\tcan. I got to get my things from\n\tyour mother's house.\n\nBabe Brother hurries out. M.C., Herman and Okra flop down in\nchairs and on the bed and look at their watches.\n\nHarry sits at the table tapping out a rhythm on the table and\nWHISTLING very softly to himself. Suddenly Harry sees that\nBabe Brother left the pile of money on the table. A look of\nconcern comes over his face.\n\nEXT. GIDEON'S HOUSE - NIGHT (RAIN)\n\nIt is raining hard. Babe Brother gets out of the car. Running\nto get out of the rain, he slips and falls; he tries to get\nup but slips and falls again. He gets up and walks slowly up\nthe steps as if he doesn't care whether he gets wet or not.\n\nINT. FRONT ROOM - NIGHT (RAIN)\n\nSuzie helps him to take his wet coat off. She goes into the\nkitchen, puts his coat in front of the stove. The knife falls\nout. She picks it up and looks at it like she would throw it\naway but Babe Brother takes it.\n\n\t\t\tBABE BROTHER \n\tI need to get my suitcase out of\n\tthe garage.\n\n\t\t\tSUZIE \n\tWhat for?\n\n\t\t\tBABE BROTHER \n\tI'm going back home with Harry.\n\n\t\t\tSUZIE \n\tI've heard some foolish things in\n\tmy life.\n\n\t\t\tBABE BROTHER \n\tHarry is coming to pick me up.\n\n\t\t\tSUZIE \n\tHave you lost your mind? Have you\n\tthought about your wife and child,\n\tnot to mention your sick father?\n\tAnd I need your help to move his\n\tbed from under the leak in the\n\tceiling.\n\n\t\t\tBABE BROTHER \n\tI'm busy.\n\n\t\t\tSUZIE \n\tDon't make me raise my hand to you.\n\tYou have to see for yourself that\n\tyou are going in the wrong\n\tdirection.\n\n\t\t\tBABE BROTHER \n\tCan't I be myself without you\n\tjumping in with your right and\n\twrong? The world is not black and\n\twhite. Show me one perfect person.\n\tIf you can't, don't ask me to be.\n\n\t\t\tSUZIE \n\tI do have a right to ask you to be\n\ta little bit better than me and\n\tyour father because we gave you a\n\tbetter head start. You have no\n\tright to complain to us about your\n\tnot having enough. \n\t\t(forcefully)\n\tYou sit right there with your no\n\tmanners self.\n\nEXT. HOUSE - NIGHT (RAIN)\n\nJunior is carrying a roll of roofing paper. Pat, Rhonda,\nLinda and Sunny run to the porch to get out of the rain.\nJunior stacks the roofing paper in the corner of the porch\nand stamps the mud off his shoes.\n\nINT. BEDROOM - NIGHT (RAIN)\n\nJunior, Pat, Linda and Rhonda come in to help Suzie move the\nbed from under the rain dripping through the hole in the\nceiling.\n\nINT. KITCHEN - NIGHT (RAIN)\n\nSunny stands in the doorway watching his father sharpen his\nknife that he got from Harry. Babe Brother is unaware that\nhis son is watching him.\n\nINT. BEDROOM - NIGHT (RAIN)\n\n\t\t\tJUNIOR \n\tWhere is Babe Brother?\n\n\t\t\tSUZIE \n\tBrother is in the kitchen.\n\n\t\t\tJUNIOR \n\tHow come you didn't ask Babe\n\tBrother to help you?\n\n\t\t\tSUZIE \n\tHe said he was busy. He is mad\n\t'cause he wanted to get in the\n\tgarage to get his things so he\n\tcould go with Harry.\n\nLinda has a surprised look on her face.\n\n\t\t\tJUNIOR \n\tSo he is busy?\n\nINT. KITCHEN - NIGHT (RAIN)\n\nBabe Brother is preoccupied sharpening his knife with a\nsharpening stone. He is almost in a trance. Junior comes in\nrather angrily. Sunny goes and sits in the shadows in the\ndining room.\n\n\t\t\tJUNIOR \n\tWhy in the hell didn't you help\n\tmama?\n\n\t\t\tBABE BROTHER \n\tI told her I would if she would\n\tgive me time.\n\n\t\t\tJUNIOR \n\tI bet you if your master would have\n\ttold you to fix the hole in the\n\troof, you would have rebuilt the\n\twhole damn house.\n\n\t\t\tBABE BROTHER \n\tYou always got the best of it\n\taround here and when Dad always\n\ttalks about my son, it is always\n\tyou, so you fix the roof.\n\n\t\t\tJUNIOR \n\tThat is a damn lie and you know it.\n\tEvery time father asks you to do\n\tsomething, you either half-ass do\n\tit or run off and hide. Mama asked\n\tyou to turn the dirt in her garden\n\tand you told her, with your smart\n\tass self, that you weren't a\n\tfarmer; get Junior to do it. Every\n\ttime someone asks you to do\n\tsomething, you always say, tell\n\tJunior to do it. Boy, you ought to\n\tgrow up.\n\n\t\t\tBABE BROTHER \n\tI told you about calling me boy. I\n\tain't no boy. See, you and Dad got\n\ta bad habit of calling me boy. You\n\tcall me boy in front of my wife.\n\tYou think I'm going to fix the\n\troof? I hope the wind blows the\n\twhole damn thing off and it pours\n\tdown rain.\n\n\t\t\tJUNIOR\n\tI ought to break your damn neck.\n\nINT. DINING ROOM - NIGHT (RAIN)\n\nSunny is sitting in a chair listening to his father and uncle\nargue in the kitchen. A car outside passes and the lights\nfrom the car form a crochet-like moving pattern on the wall\nbehind him. Sunny is only lit for a moment.\n\nINT. KITCHEN - NIGHT (RAIN)\n\nBabe Brother starts gathering up his things to leave.\n\n\t\t\tBABE BROTHER \n\tI'm leaving and don't even call me\n\twhen the shoe falls 'cause all he\n\tdid for me was to try and run my\n\tlife. I'm tired of people saying\n\tBabe Brother this, Babe Brother\n\tthat. What's my name?\n\n\t\t\tJUNIOR \n\tYou dumb ass, it's Babe Brother.\n\n\t\t\tBABE BROTHER \n\tMy name is Sam. Samuel.\n\nBabe Brother attempts to get up but Junior pushes him down.\n\n\t\t\tJUNIOR \n\tSit down!\n\nBabe Brother hits Junior on the jaw, driving him backwards,\ncausing the overhead lamp to sway violently.\n\nINT. BEDROOM - NIGHT (RAIN)\n\nSuzie, Pat and Linda hear the noise coming from the kitchen\nand rush to see what is going on.\n\nINT. KITCHEN - RAINY NIGHT\n\nBabe Brother and Junior are both reaching for the knife.\nJunior is on top of Babe Brother, who is stretched out on the\ntable trying to reach the knife. Junior grabs the knife first\nand Babe Brother flips over to defend himself. Babe Brother\ngrabs Junior's wrist as Junior tries to push the knife\nagainst his throat.\n\nSuzie comes in and grabs part of the knife with her hand and\nJunior's wrist with her other hand. Pat and Linda try to pull\nthe two men apart while pleading with Junior.\n\nBlood drips from Suzie's hand to the table, forming a pool\nunder Babe Brother's head.\n\n\t\t\tPAT \n\tStop it! Stop it! Look what you are\n\tdoing!\n\nBabe Brother's eyes are rolled to the back. Junior's eyes are\nhuge; he has an animal look on his face. The SOUND of\nstruggling people breathing heavily is amplified. The pool of\nblood on the table grows larger.\n\nJunior slowly becomes aware of the blood and his body\nrelaxes. He calmly releases the knife.\n\nJunior takes his mother's hand.\n\n\t\t\tJUNIOR \n\tSomeone get some lard out of the\n\tice box.\n\nPat attempts to get the lard but pain in her stomach forces\nher to sit down. Linda gets the lard out and hands it to\nJunior. Babe Brother raises himself. The blood from Suzie's\ndripping from his head. Rhonda is trying to hold Sunny back.\n\nJunior holds his mother's hand under the faucet. It is a deep\ncut. The bleeding won't stop.\n\nPat is sitting at the blood-stained table unable to move. She\nis PANTING, sweating, and holding her stomach. Linda is\ncaught between trying to help Suzie and attending to Pat.\n\nBabe Brother helps to make a wad of cloth to press in her\nhand to Stop the bleeding.\n\n\t\t\tLINDA \n\tYou are going to need some\n\tstitches. We better take her to the\n\temergency hospital.\n\nBabe Brother is shamefully calm now and very humble.\n\n\t\t\tBABE BROTHER \n\tI'll drive her to the hospital.\n\n\t\t\tJUNIOR \n\tWe will take her. You all stay here\n\tand watch Dad.\n\n\t\t\tLINDA \n\tWhat about Pat?\n\n\t\t\tPAT \n\tI'm okay now.\n\nSuzie attempts to go see Gideon but Babe Brother and Junior\nturn her to the door. Going through the kitchen door, Junior\nintentionally turns his back to Babe Brother. Babe Brother\nstares at Junior's back as he walks ahead.\n\nINT. HOSPITAL, EMERGENCY RECEPTION ROOM - NIGHT (RAIN)\n\nThe automatic doors open and Junior, Babe Brother and Suzie\nenter. There is a long line of people waiting at the\nregistration window as well as groups of people filling out\nforms. Other patients are seated and waiting patiently to see\nthe doctor.\n\nSuzie finally gets to the registration window. A NURSE,\nwhite, 25, with extremely long fingernails that curve back\naround, is surprisingly sympathetic.\n\n\t\t\tNURSE \n\tWhat sort of emergency are you here\n\tfor?\n\n\t\t\tSUZIE \n\tI cut my hand.\n\n\t\t\tNURSE \n\tLet me take a look at it.\n\nSuzie puts her hand through the window. The Nurse stands up\nto get a better look. The Nurse takes the wad out of her\nhand. The bleeding has stopped.\nThe Nurse takes a deep breath. The Nurse glances up to notice\nthe blood stains on the back of Babe Brother head.\n\n\t\t\tNURSE (CONT'D)\n\tAre you all together?\n\n\t\t\tJUNIOR \n\tYes.\n\n\t\t\tNURSE \n\tThe bleeding has stopped but it\n\twill need stitches. You will have\n\tto fill out this form. How will\n\tthis be covered, insurance, cash or\n\tcheck?\n\n\t\t\tJUNIOR \n\tDon't worry about it. It will be\n\tpaid. Just let her see a doctor.\n\n\t\t\tSUZIE \n\tI have Medicare.\n\nThe Nurse hands Suzie a form, but Babe Brother takes the\nform. The Nurse looks again at Babe Brother's head.\n\n\t\t\tNURSE \n\tDo you need to see the doctor too?\n\n\t\t\tBABE BROTHER \n\tNo, just my mother.\n\nBabe Brother fills out the form with Suzie's help and hands\nthe form back to the Nurse.\n\nThey find a seat all together.\n\n\t\t\t\t\t\t\tDISSOLVE:\n\nINT. HOSPITAL, EMERGENCY RECEPTION ROOM - NIGHT (RAIN)\n\nThe room slowly fills with people and Babe Brother and Junior\noffer their seats to those there for medical care.\n\n\t\t\t\t\t\t\tDISSOLVE:\n\nINT. HOSPITAL, EMERGENCY RECEPTION ROOM - NIGHT (RAIN)\n\nTwo Police Officers bring in a man handcuffed to a bed. The\nwoman officer carries a shotgun. The male police officer\ncarries a clip board. The Prisoner is obviously in no\ncondition to escape or cause trouble. They are allowed to go\ndirectly to the emergency room without waiting.\n\n\t\t\t\t\t\t\tDISSOLVE:\n\nINT. HOSPITAL, EMERGENCY RECEPTION ROOM - NIGHT (RAIN)\n\nMore injured people come but in spite of their condition they\nare told that they have to wait. There is only standing room.\n\nJunior and Babe Brother are standing next to the wall.\n\nOn the other side of the room, Suzie is looking quietly at\nthem as if she is in deep thought.\n\nJunior walks over to the reception desk.\n\n\t\t\tJUNIOR \n\tWhy is it so crowded?\n\n\t\t\tNURSE \n\tWell, it is Friday night and a full\n\tmoon.\n\nJunior whispers to Babe Brother. They both start to laugh.\n\nSuzie looks up and finds them in a fit of laughter. A faint\nsmile appears on her face.\n\nINT. GIDEON'S BEDROOM - NIGHT (RAIN)\n\nGideon is slowly getting up. He looks around. He calls for\nSuzie. He slowly gets to his feet.\n\n\t\t\tGIDEON \n\tSuzie, I'm hungry.\n\nINT. FRONT ROOM - NIGHT (RAIN)\n\nHe walks by Linda, Pat, Rhonda, and Sunny, who are sleeping\nin chairs, on the floor and on the sofa.\n\n\t\t\tGIDEON \n\tSuzie.\n\nINT. KITCHEN - NIGHT (RAIN)\n\nGideon opens the refrigerator and starts taking out bowls of\nfood and placing them on the table. He puts on a pot of\ncoffee.\n\n\t\t\tGIDEON \n\tSuzie.\n\nINT. KITCHEN - NIGHT (RAIN) (LATER)\n\nGideon is busy eating almost everything in sight. A group of\nmystified and sleepy faces appear at the door. Pat, Linda,\nRhonda and Sunny are all looking rather dumbfounded.\n\nEXT. BACKYARD - MORNING\n\nEverything is wet from the night's rain. The garden looks\nmore like a graveyard. Moisture drips from the sunflowers.\n\nGideon's nervous looking rooster jumps the fence and starts\nto CROW.\n\nSkip is out early throwing rocks at his birds. The rocks land\non Gideon's roof.\n\nEXT. HOUSE - MORNING\n\nBabe Brother and Junior help Suzie out of the car. She has\nher left hand bandaged. They are extremely exhausted. They\nwalk up the porch to find Harry holding the door open.\n\n\t\t\tHARRY \n\tI can't believe what I heard took\n\tplace.\n\nINT. FRONT ROOM - DAY\n\nOn seeing Suzie, Sunny jumps up, knocking the can of marbles\nover the kitchen floor. He runs to give Suzie a hug. Sunny\nwants to touch her bandaged hand, but Linda stops him.\n\n\t\t\tSUZIE \n\tHow is Gideon doing?\n\n\t\t\tRHONDA \n\tHe is asleep now, but he was up all\n\tnight eating.\n\nAs Suzie goes to Gideon's room, she comes face to face with\nHarry. She doesn't say anything.\n\n\t\t\tHARRY\n\tI came to pick up my things.\n\nINT. GIDEON'S BEDROOM - DAY\n\nGideon is SNORING loudly. On the night-stand is a plate with\nfood left on it. Suzie feels his forehead.\n\nINT. FRONT ROOM - DAY\n\nHarry sadly gets up. He looks at Babe Brother. Linda steps in\nfront of Babe Brother.\n\n\t\t\tLINDA \n\tYou ought to go see how your father\n\tis doing and then wash that blood\n\toff you and change shirts.\n\nBabe Brother is surrounded by Linda and Sunny who has his\neyes fixed on Harry. They move as one heading for the\nbedroom.\n\nHarry seems a lot older. He sadly walks towards the kitchen\nwith his coffee cup.\n\nLOW ANGLE SHOT: Harry is slowly walking towards the MARBLES\nthat are scattered over the kitchen floor.\n\nINT. BEDROOM - DAY\n\nPat, Linda, Junior, Rhonda, Babe Brother, Sunny and Suzie are\nall standing around waiting for Gideon to wake up.\n\n\t\t\tSUZIE \n\tGideon.\n\nGideon's only response is to SNORE louder.\n\n\t\t\tPAT \n\tHow long is Harry going to hang\n\taround?\n\nBabe Brother is in a corner all by himself. He looks down\nwhen Pat asks the question about Harry.\n\nA loud CRASHING SOUND comes from the kitchen.\n\nINT. KITCHEN - DAY\n\nHarry is trying to raise himself from the floor. He pauses\nfor a moment and then collapses. Harry is in a lot of pain.\nHarry's body contorts and then remains still.\n\nBabe Brother, Junior, Pat, and Linda, Suzie run in. Suzie\ntries to see if he is alive. Babe Brother tries to give him\nmouth to mouth resuscitation but Linda pulls him away. Junior\ntries to push down on Harry's chest.\n\nBabe Brother stares down at Harry and then goes slowly back\ninto the living room. Pat is on the phone dialing the\nparamedics. Everyone stands around Harry.\n\nINT. KITCHEN - DAY\n\nTwo PARAMEDICS work on Harry. One of the paramedics is a\nyoung Asian. The other is white with red hair. They listen\nfor a heart beat and shake their heads in a negative manner.\nThey pack up their medical case. The Asian's accent is very\ndifficult to understand.\n\n\t\t\tWHITE PARAMEDIC \n\tThere is nothing we can do for him.\n\nThe Paramedics start to leave without the body.\n\n\t\t\tJUNIOR \n\tWell, aren't you going to take him\n\twith you?\n\n\t\t\tASIAN PARAMEDIC \n\tIf he had died in our care, we\n\twould be required to take him.\n\tSince we found him dead, you will\n\thave to wait for the county to pick\n\thim up.\n\n\t\t\tJUNIOR \n\tHow long will that take?\n\n\t\t\tWHITE PARAMEDIC \n\tThat would depend on how busy it\n\tis. I'm sorry.\n\n\t\t\t\t\t\t\tDISSOLVE:\n\nINT. KITCHEN - DAY\n\nHarry is stretched out on the floor. A blanket covers\neverything except his shoes.\n\nINT. FRONT ROOM - DAY\n\nHattie, Marsh, Okra, Herman, and M.C. all come in. Marsh\nlooks cheerful.\n\n\t\t\tMARSH \n\tWhat happened?\n\n\t\t\tJUNIOR \n\tHe slipped on some marbles that\n\twere on the floor. Then his heart\n\tgave out.\n\n\t\t\tLINDA \n\t\t(to Sunny)\n\tI told you to always put those\n\tmarbles up and not to leave them\n\tjust anywhere.\n\n\t\t\tPAT \n\tThe poor thing is not to blame.\n\tRhonda, take Sunny for a walk.\n\nMarsh hands Rhonda several dollars.\n\n\t\t\tMARSH \n\tHere, go around to the store and\n\tbuy what you want.\n\n\t\t\tHATTIE \n\tWould anybody object if I take a\n\tlook at him?\n\n\t\t\tHERMAN \n\tI don't think Harry would like it.\n\nHattie goes over and pulls the blanket back. Okra, M.C. and\nHerman hurry over to take a quick glance. They huddle behind\nHattie, peeping over her shoulder.\n\n\t\t\tHATTIE \n\tI never noticed how big his eyes\n\twere.\n\n\t\t\t\t\t\t\tDISSOLVE:\n\nINT. BATHROOM - EVENING\n\nLinda is helping Babe Brother wash Suzie's blood out of his\nhair. She dries his hair with a towel. Sonny hands Babe\nBrother a clean shirt, Gideon's shirt. He puts it on.\n\nINT. BEDROOM - NIGHT\n\nGideon is sitting on the edge of his bed looking through the\nscraps of leftovers on his plate. He puts his pants on. As he\nmoves about, his joints SNAP and POP. He picks up the empty\nplate.\n\nINT. FRONT ROOM - NIGHT\n\nBabe Brother is on the phone with the county morgue. He gets\ninto an argument with the people on the other end of the\nphone.\n\n\t\t\tBABE BROTHER \n\tMister... Mister... Excuse me for\n\tcutting you off but we pay taxes\n\ttoo. We should not have to pay you\n\tto take a 24-hour lunch break.\n\nBabe Brother hands the phone to Linda.\n\n\t\t\tBABE BROTHER (CONT'D)\n\tThe coroner said that he was out\n\there, and knocked on the door and\n\tno one was here.\n\nJunior steps over the body, holding a pot of coffee in his\nhand.\n\nThe Preacher is sitting with Suzie talking in a low voice.\n\nPat, Rhonda and Sunny come in with boxes of chicken snack.\n\nLinda hangs up the phone.\n\n\t\t\tLINDA \n\tHe doesn't know when he will be out\n\tthis way again. Somebody downtown\n\tis going to hear about this.\n\n\t\t\tM.C. \n\tThey just do that in the colored\n\tneighborhood. If he had been white,\n\tthey would had him on his feet and\n\tout of here.\n\n\t\t\tPAT \n\tI got white meat and I got dark\n\tmeat. I know it sounds cruel but we\n\thave to eat.\n\nGideon comes in walking very slowly, holding his plate out.\nEveryone is shocked. Gideon is completely unaware of the\nperiod that he has been sick.\n\n\t\t\tGIDEON \n\tWhat, are you having another party?\n\n\t\t\tSUZIE \n\tYou better come sit down. You are\n\tstill sick.\n\n\t\t\tGIDEON \n\tGal, you're talking to John Henry.\n\tWhen was I sick?\n\n\t\t\tJUNIOR \n\tYou have been out for almost three\n\tweeks.\n\nThe Preacher gives him a pat on the back and shakes Gideon's\nhand.\n\n\t\t\tPREACHER \n\tWe had long conversations with the\n\tLord about you. Didn't we, Sister\n\tSuzie? I said we need him down\n\there, Lord.\n\nGideon smiles in appreciation. He pushes his plate out to\nPat, indicating that he wants it filled with chicken. Gideon\nis about to bite into the chicken when he notices Harry's\nfeet sticking out. He points with the chicken in his hand. He\nhas a mystified look on his face.\n\n\t\t\tOKRA \n\tThat's our friend Harry.\n\n\t\t\tGIDEON \n\tNot our Harry?\n\n\t\t\tOKRA \n\tI wish it wasn't.\n\nGideon seems to weaken for a moment.\n\n\t\t\tGIDEON \n\tWhat happened to him?\n\n\t\t\tHATTIE\n\tHe dropped dead.\n\n\t\t\tHERMAN\n\tHattie, you can be so mean.\n\n\t\t\tGIDEON\n\tHow long has he been dead?\n\n\t\t\tSUZIE\n\tSince this morning.\n\n\t\t\tGIDEON\n\tWhat happened to your hand?\n\n\t\t\tSUZIE\n\tI cut it on an old rusty knife.\n\nGideon is deeply concerned.\n\n\t\t\tGIDEON\n\tWhat did you put on it?\n\n\t\t\tSUZIE\n\tIt's healing now.\n\nGideon looks over at his two sons as if to ask them about it.\n\n\t\t\tGIDEON\n\tI hope you will take care of your\n\tmother better than that when I'm\n\tgone.\n\nJunior and Babe Brother both have their heads down. Linda and\nSunny move closer to Babe Brother.\n\n\t\t\tGIDEON (CONT'D)\n\tBabe Brother, is that my shirt that\n\tyou're wearing?\n\n\t\t\tBABE BROTHER\n\tYes.\n\n\t\t\tGIDEON\n\tHow come you're not wearing my\n\tshoes?\n\n\t\t\tBABE BROTHER\n\tThey're too big.\n\nGideon stares at Babe Brother and then looks around towards\nHarry.\n\n\t\t\tGIDEON \n\tWhen is the undertaker coming?\n\n\t\t\tLINDA \n\tThey can't say. I'll try calling\n\tthem again.\n\nHattie moves closer to Herman and speaks so only he can hear.\n\n\t\t\tHATTIE \n\tWhy don't M.C. and you drag him to\n\tyour house?\n\nHerman moves away with a look of disdain.\n\n\t\t\tMARSH \n\tHarry didn't have any relatives\n\tliving, did he?\n\n\t\t\tM.C. \n\tHarry was in the world by himself.\n\n\t\t\tMARSH \n\tSomebody has to take responsibility\n\tfor him.\n\n\t\t\tPAT \n\tWhy don't you look through his\n\tthings to see if you can find a\n\tnumber?\n\nOkra, Marsh, Hattie, Herman, and M.C. go to Harry's room,\nleaving Suzie and Gideon sitting opposite each other with the\ndoor to the kitchen separating them. Junior, the Preacher and\nPat are eating chicken. Linda is on the phone trying to get\nthrough to the morgue.\n\n\t\t\tLINDA \n\tHow do you like that? They hung up\n\tin my face. I'll fix them. I'll\n\tshow them just how mean I can get.\n\nShe rapidly dials the number. There is a BUSY SIGNAL.\n\n\t\t\tLINDA (CONT'D)\n\tThis has been a nightmare.\n\nINT. BEDROOM - RIGHT\n\nM.C. and Marsh are going through Harry's boxes. They take out\nold blues records, books, a big Bible, and books on Dunbar.\n\n\t\t\tMARSH \n\tThese are letters to his son.\n\nHattie reads the letters in a corner by herself. She stops\nreading for a moment.\n\n\t\t\tHATTIE \n\tI still don't know if I was right\n\tabout Harry.\n\nShe seems frustrated with herself not being able to come to\nterms about who was Harry.\n\nEXT. FRONT YARD - NIGHT\n\nA crowd of people are standing around looking at Gideon's\nhouse.\n\nINT. FRONT ROOM - NIGHT\n\nThe Preacher is sleep in his chair, SNORING loudly. Babe\nBrother and Linda are sitting together, talking in almost a\nwhisper. Sunny is asleep in his lap. Babe Brother is finding\nit difficult to apologize for his recent behavior.\n\n\t\t\tBABE BROTHER \n\tI have more sense than to give up\n\teverything, my family, you and\n\tSunny. It wasn't me, I mean the\n\treal me inside my body. I'm glad\n\tit's over. It's like a veil has\n\tbeen lifted.\n\n\t\t\tLINDA \n\tLike a veil has been lifted?\n\n\t\t\tBABE BROTHER \n\tIt's like I've been swimming in\n\tmuddy waters.\n\n\t\t\tLINDA \n\tLike muddy waters?\n\n\t\t\tBABE BROTHER \n\tIt was like all those things old\n\tcountry people try to tell you what\n\thell is like.\n\n\t\t\tLINDA \n\tYou were in hell?\n\n\t\t\tBABE BROTHER \n\tI couldn't believe the things I was\n\tdoing. It was like an internal\n\tstruggle going on inside my body.\n\n\t\t\tLINDA \n\tDo you think you won?\n\n\t\t\tBABE BROTHER \n\tIt was nip and tuck.\n\n\t\t\tLINDA \n\tAnd what lesson have we learned\n\tfrom all of this, Babe Br... Sam...\n\tI mean Samuel?\n\n\t\t\tBABE BROTHER \n\tI guess it proves you really care\n\tabout me. You hung in there.\n\nLinda looks at Babe Brother for a length of time.\n\n\t\t\tGIDEON \n\tWhen are you boys going to fix that\n\troof?\n\n\t\t\tBABE BROTHER \n\tSoon as I rest a bit. \n\t\t(beat)\n\tI meant as soon as we are back to\n\tnormal again, anytime.\n\n\t\t\tGIDEON \n\tHere I am thinking about myself\n\twhen poor Harry is resting on the\n\tfloor of the kitchen.\n\nINT. KITCHEN - NIGHT\n\nHarry's body lies there motionless.\n\nINT. FRONT ROOM - DAY\n\nThe Preacher is SNORING violently.\n\nBabe Brother is asleep on the floor. Sunny is asleep sitting\non Linda's lap. Linda's feet rest on Babe Brother's chest.\n\nJunior and Pat are looking at the baby pictures. Pat is\nholding her hand across her stomach feeling the baby kick.\nRhonda is asleep in a chair.\n\nSuzie and Gideon are sitting at the dining room table. Suzie\nis cutting the dead leaves off of a small potted plant.\n\n\t\t\tSUZIE \n\tIt feels like a storm has passed...\n\tHattie read some of Harry's letters\n\tto a woman he had a child by. The\n\tchild had died and he was writing\n\tto give her some comfort. Hattie\n\tdidn't know that deep down at the\n\tbottom of Harry's hate, there was\n\tsome love.\n\nThe SOUND of Rodney's trumpet is heard but is no longer\nirritating.\n\n\t\t\tGIDEON \n\tDid I ever tell you the story about\n\tthe man who wanted to make his own\n\tmind up about heaven and hell? He\n\tdidn't want nobody's opinion but\n\this own.\n\nSuzie doesn't pay any attention; she is involved with her\npotted plant. Gideon looks over at the Preacher, who is still\nasleep.\n\n\t\t\tGIDEON (CONT'D)\n\tHe's going to check out heaven\n\tfirst. He gets a round trip ticket\n\tto heaven. He gets in heaven and\n\tfinds it just like back home.\n\tPeople dripping with sweat, working\n\tin the fields, hardly surviving. He\n\tasked a man who was getting a drink\n\tof water, \"I thought the streets\n\twere paved with gold.\" \"They are\n\tbut you won't see them,\" he said.\n\t\"Boy, you got to work day and night\n\tcause idleness is sinfulness.\" So\n\the takes the other half of his\n\tticket and takes the express to\n\thell. He sees people stretched out\n\ton their backs kicking back,\n\tpicking their teeth. \"Man, this is\n\ta dream.\" He asked, \"What's you'll\n\tdoing?\" They all hollered back,\n\t\"Sinning.\" The devil was shaking\n\thands with everyone and came up to\n\thim and said, \"Please to meet you.\"\n\tHe asked, \"I thought you'll was\n\tsupposed to be burning in fire.\"\n\tSomeone said, \"Man, ain't no fire\n\tdown here except under that pot of\n\tchitlins.\" The man was going go ask\n\tthe preacher back on earth...\n\n\t\t\tSUZIE \n\tI don't want to hear any joke about\n\tcolored people being in hell.\n\tYou're being irreverent.\n\n\t\t\tGIDEON \n\tI'm almost finished. I'm about to\n\tcome to the punch line.\n\n\t\t\tSUZIE \n\tI don't want to hear any tales\n\tabout colored people...\n\n\t\t\tGIDEON \n\tBut these are white people,\n\tanybody. The punch...\n\n\t\t\tSUZIE \n\tI don't care to hear any jokes\n\tabout people being in hell. This\n\tcut on my hand reminds me that it\n\tis nothing to laugh at.\n\n\t\t\tGIDEON \n\tIt's only a tale.\n\nThe RATTLING of pots and dishes starts suddenly. Harry's body\nstarts to sway gently as if he were about to get up.\nEveryone is frozen. Babe Brother and Linda remain asleep. The\nrocking caused by the earthquake doesn't wake them.\n\nM.C., Herman, Okra and Hattie and Marsh enters the dining\nroom. Harry's feet are seen in the kitchen still swaying.\n\n\t\t\tM.C \n\tIs that an earthquake?\n\n\t\t\tHERMAN \n\tIt's something.\n\nBabe Brother wakes in a sweat and sits next to Linda like a\nchild needing protection.\n\n\t\t\tBABE BROTHER \n\tI'm cold. I need to get out into\n\tthe sunlight.\n\n\t\t\tJUNIOR \n\tWhat is it, noontime?\n\n\t\t\tPREACHER\n\tI wonder how they going to bury\n\tthis man.\n\n\t\t\tHATTIE \n\tPlant him in Potter's Field. He\n\tdoesn't need a marked grave.\n\n\t\t\tHERMAN\n\tHattie, your true colors are\n\tunbearable. You got some mean ways.\n\tDon't worry about the boy getting a\n\tburial. He still has some friends\n\tleft on this earth.\n\n\t\t\tHATTIE \n\tHis winter has come and gone and I\n\tknow right now he is answering for\n\ta lot of things.\n\nM.C., Okra and Herman move away from Hattie.\n\n\t\t\tPREACHER \n\tIt is my job to pray for his soul\n\tand I would like to do that.\n\nEXT. GIDEON'S HOUSE - DAY\n\nRhonda is sitting next to Sunny on the front porch. She has\nan angry expression. Sunny is trying to please her by\noffering her his airplane.\nHe pushes the airplane near her and she pushes it back with a\nviolent shove. He persists in offering her his airplane.\n\nA crowd of people is still standing around in front of\nGideon's house.\n\n\t\t\tMAN \n\tHey boy, you still got that dead\n\tman in your house.\n\nSunny and Rhonda don't respond. A middle-aged woman,\nVIRGINIA, one of Gideon's neighbors, passes Sunny and Rhonda,\nknocks on the screen door and goes in.\n\nINT. FRONT ROOM - DAY\n\n\t\t\tVIRGINIA \n\tI know you all haven't had a chance\n\tto cook or do anything with that\n\tdead man in your kitchen. You must\n\tbe starved to death. Some of your\n\tneighbors have got together and we\n\tset up a picnic table in my\n\tbackyard with food and everything\n\tto feed all you all.\n\n\t\t\tSUZIE \n\tVirginia, that is so wonderful of\n\tyou all!\n\n\t\t\tMARSH \n\tIf the dead wagon comes, we ought\n\tto leave a note telling them we'll\n\tbe down the street at a picnic.\n\nGideon comes back in with Suzie, who is helping tie his tie.\nThey all line up and file out the front door with Suzie and\nGideon leading the way. Pat is holding her stomach with a\nthoughtful look on her face.\n\n\t\t\tPAT \n\tI think we better be ready.\n\nJunior looks concerned as he follows Pat out the door. Sunny\nfollows Rhonda, who is still mad at him. Babe Brother and\nLinda are the last ones out. Babe Brother takes a long look\nin the direction of Harry as Linda pulls him out. She slams\nthe door.\n\nINT. KITCHEN - DAY\n\nHarry's body lies on the floor. On the kitchen sink are\nSuzie's jars of cuttings, which have developed a maze of\nroots.\n\n\t\t\t\t THE END\n\n\n\n\n\n\n\nTo Sleep with Anger\nWriters :   Charles Burnett\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:24.815335"}