{"title": "Trainspotting", "film_link": "/Movie Scripts/Trainspotting Script.html", "script_link": "/scripts/Trainspotting.html", "info_raw": "\n\nTrainspotting Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Irvine Welsh  John Hodge\nGenres  Drama\nScript Date :  1996\n\nRead \"Trainspotting\" Script\n\n\n", "script": "\n\t\t\n\n                                Trainspotting\n\n                                Screenplay by\n\n                                 John Hodge\n\n                            Based on the Novel by\n\n                                Irvine Welsh\n\n                                 Directed by\n\n                                 Danny Boyle\n\n----------------------------------------------------------------------------\n\nEXT. STREET. DAY\n\nLegs run along the pavement. They are Mark Renton's.\n\nJust ahead of him is Spud. They are both belting along.\n\nAs they travel, various objects (pens, tapes, CDs, toiletries, ties,\nsunglasses, etc.) either fall or are discarded from inside their jackets.\n\nThey are pursued by two hard-looking Store Detectives in identical uniforms.\nThe men are fast, but Renton and Spud maintain their lead.\n\n                                   RENTON\n                                (voice-over)\n\n     Choose life. Choose a job. Choose a career. Choose a family,\n     Choose a fucking big television, Choose washing machines, cars,\n     compact disc players, and electrical tin openers.\n\nSuddenly, as Renton crosses a road, a car skids to a halt, inches from him.\n\nIn a moment of detachment he stops and looks at the shocked driver, then at\nSpud, who has continued running, then at the Two Men, who are now closing in\non him.\n\nHe smiles.\n\nINT. SWANNEY'S FLAT ROOM. DAY\n\nIn a bare, dingy room, Renton lies on the floor, alone, motionless and\ndrugged.\n\n                                   RENTON\n                                    (v.o)\n\n     Choose good health, low cholesterol and dental insurance. Choose\n     fixed-interest mortgage repayments. Choose a starter home. Choose\n     your friends.\n\nEXT. FOOTBALL PITCH. NIGHT\n\nOn a flood lit five-a-side pitch, Renton and his friends are taking on\nanother team at football.\n\nThe opposition all wear an identical strip (Arsenal), whereas Renton and his\nfriends wear an odd assortment of gear.\n\nThree girls -- Lizzy, Gail, and Allison and Baby -- stand by the side,\nwatching.\n\nThe boys are outclassed by the team with the strip but play much dirtier.\n\nAs each performs a characteristic bit of play, the play freezes and their\nname is visible, printed or written on some item of clothing. (T-Shirt,\nbaseball cap, shorts, trainers). In Begbie's case, his name appears as a\ntatoo on his arm.\n\nSick Boy commits a sneaky foul and indignantly denies it.\n\nBegbie commits an obvious foul and make no effort to deny it.\n\nSpud, in goal, lets the ball in between his legs.\n\nTommy kicks the ball as hard as he can.\n\nRenton's litany continues over the action:\n\n                                   RENTON\n                                    (v.o)\n\n     Choose leisure wear and matching luggage. Choose a three piece\n     suite on hire purchase in a range of fucking fabrics. Choose DIY\n     and wondering who you are on a Sunday morning. Choose sitting on\n     that couch watching mind-numbing sprit-crushing game shows,\n     stuffing fucking junk food into your mouth. Choose rotting away at\n     the end of it all, pishing you last in a miserable home, nothing\n     more than an embarrassment to the selfish, fucked-up brats you\n     have spawned to replace yourself. Choose your future. Choose life.\n\nRenton is hit straight in the face by the ball. He lies back on the\nastroturf. Voice-over continues.\n\n     But who would I want to do a thing like that?\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton lies on the floor.\n\nSwanney, Allison and Baby, Sick Boy and Spud are shooting up or preparing to\nshoot up. Sick Boy is talking to Allison as he taps up a vein on her arm.\n\n                                   RENTON\n                                    (v.o)\n\n     I chose not to choose life: I chose something else. And the\n     reasons? There are no reasons. Who need reasons when you've got\n     heroin?\n\n                                  SICK BOY\n\n     Goldfinger's better than Dr. No. Both of them are a lot better\n     than Diamonds are Forever a judgement reflected in its relative\n     poor showing at the box office, in which field, of course,\n     Thunderball was a notable success.\n\n                                   RENTON\n                                    (v.o)\n\n     People think it's all about misery and desperation and death and\n     all that shite, which is not to be ignored, but what they forget -\n\nSpud is shooting up\n\n     is the pleasure of it. Otherwise we wouldn't do it. After all,\n     we're not fucking stupid. At least, we're not that fucking stupid.\n     Take the best orgasm you ever had, multiply it by a thousand and\n     you're still nowhere near it. When you're on junk you have only\n     one worry: scoring. When you're off it you are suddenly obliged to\n     worry about all sorts of other shite. Got no money: can't get\n     pished. Got money: drinking too much. Can't get a bird: no chance\n     of a ride. Got a bird: too much hassle. You have to worry about\n     bills, about food, about some football team that never fucking\n     winds, about human relationships and all the things that really\n     don't matter when you've got a sincere and truthful junk habit.\n\n                                  SICK BOY\n\n     I would say, in those days, he was a muscular actor, in every\n     sense, with all the presence of someone like Cooper or Lancaster,\n     but combined with a sly wit to make him a formidable romantic\n     lead, closer in that respect to Cary Grant.\n\n                                   RENTON\n                                    (v.o)\n\n     The only drawback, or at least the principal drawback, is that you\n     have to endure all manner of cunts telling you that -\n\nINT. PUB I. NIGHT\n\nBegbie, smoking and drinking, speaks to camera.\n\n                                   BEGBIE\n\n     No way would I poison my body with that shite, all they fucking\n     chemicals, no fucking way.\n\nINT. PUB I. NIGHT\n\nTommy sits beside Lizzy. He speaks to camera.\n\n                                    TOMMY\n\n     It's a waste of your life, Rents, poisoning your body with that\n     shite.\n\nINT. RENTON FAMILY HOME, LIVING ROOM. NIGHT\n\nRenton's father and mother sit at the table eating.\n\nRenton is seated but not eating.\n\n                                   FATHER\n\n     Every chance you've ever had, you've blown it, stuffing your veins\n     with that filth.\n\n--------\n\nINT. ELECTRICAL RETAILERS. DAY\n\nGav wears the corporate jacket.\n\n                                     GAV\n\n     Get off that stuff, Rents and get a job. It's not as bad as it\n     looks. While you're here, you don't fancy buying a cooker, do you?\n\n--------\n\nINT. SWANNEY'S FLAT. DAY\n\nSick Boy and Spud lie drugged up. Allison and Baby wait while Swanney cooks\nup.\n\nRenton is standing up.\n\n                                   RENTON\n                                    (v.o)\n\n     From time to time, even I have uttered the magic words.\n\n                                   SWANNEY\n\n     Are you serious?\n\n                                   RENTON\n\n     Yeah. No more. I'm finished with that shite.\n\n                                   SWANNEY\n\n     Well, it's up to you.\n\n                                   RENTON\n\n     I'm going to get it right this time. Going to get it set up and\n     get off it for good.\n\n                                   SWANNEY\n\n     Sure, sure. I've heard it before.\n\n                                   RENTON\n\n     The Sick Boy method.\n\nThey both look at Sick Boy\n\n                                   SWANNEY\n\n     Yeah, well, it surely worked for him.\n\n                                   RENTON\n\n     He's always been lacking in moral fibre.\n\n                                   SWANNEY\n\n     He knows a lot about Sean Connery.\n\n                                   RENTON\n\n     That's hardly a substitute.\n\n                                   SWANNEY\n\n     you'll need one more hit.\n\n                                   RENTON\n\n     No, I don't think so.\n\n                                   SWANNEY\n\n     To see you through the night that lies ahead.\n\nFreeze Frame on Swanney.\n\n                                   RENTON\n                                    (v.o)\n\n     We called him the mother superior on account of the length of his\n     habit. He knew all about it. On it, off it, he knew it all. Of\n     course I'd have another shot: after all, I had work to do.\n\nINT. RENTON'S FLAT ROOM. DAY\n\nThe door opens and Renton enters carrying shopping bags. He empties them on\nto a mattress beside three buckets and a television.\n\n                                   RENTON\n                                    (v.o)\n\n     Relinquishing junk. Stage One: preparation. For this you will\n     need: one room which you will not leave; one mattress; tomato\n     soup, ten tins of; mushroom soup, eight tins of, for consumption\n     cold; ice cream, vanilla, one large tub of; Magnesia, Milk of, one\n     bottle; paracetamol; mouth wash; vitamins; mineral water;\n     Lucozade; pornography; one bucket for urine, one for feces, and\n     one for vomitus; one television; and one bottle of Valium, which I\n     have already procured, from my mother, who is, in her own domestic\n     and socially acceptable way, also a drug addict.\n\nRenton swallows several Valium tablets. Voice-over continues.\n\n     And now I'm ready. All I need is a final hit to soothe the pain\n     while the Valium takes effect.\n\n--------\n\nINT. SWANNEY'S FLAT. DAY\n\nSwanney, Sick Boy, Spud and Allison and Baby all lie inert while the\ntelephone rings.\n\n--------\n\nINT. CALL BOX. DAY\n\nRenton curses as he slams down the receiver. He dials again.\n\n                                   RENTON\n\n     Mikey. It's Mark Renton. Can you help me out?\n\nINT. MIKEY'S FLAT. DAY\n\nRenton holds two opium suppositories in the palm of his hand.\n\n                                   RENTON\n                                    (v.o)\n\n     This was typical of Mikey Forrester.\n\n                                 (on screen)\n\n     What the fuck are these?\n\n                                    (v.o)\n\n     Under the normal run of things I would have had nothing to do with\n     the cunt, but this was not the normal run of things.\n\n                                    MIKEY\n\n     Opium suppositories. Ideal for your purpose. Slow release, like.\n     Bring you down gradually. Custom fucking designed for your needs.\n\n                                   RENTON\n\n     I want a fucking hit.\n\n                                    MIKEY\n\n     That's all I've got: take it or leave it.\n\nRenton sticks his hand down the back of his trousers and sticks the\nsuppositories into his rectum.\n\n     Feel better now?\n\n                                   RENTON\n\n     For all the good they've done me I might as well have stuck them\n     up my arse.\n\nHe smiles.\n\nEXT. STREET. DAY\n\n                                   RENTON\n                                    (v.o)\n\n     Heroin makes you constipated. The heroin from my last hit is\n     fading away and the suppositories have yet to melt. I am no longer\n     constipated.\n\nHe looks around the local amenities. He is in discomfort, clutching his\nabdomen and falling to his knees.\n\nHe notices a betting shop.\n\nINT. BETTING SHOP. DAY\n\nRenton walks through the crowded, smoky betting shop towards a door marked\n'toilet' with a bit of card.\n\n                                   RENTON\n                                    (v.o)\n\n     I fantasize about massive pristine convenience.\n\nHe stumbles through.\n\n                                    (v.o)\n\n     Brilliant gold taps, virginal white marble, a seat carved from\n     ebony, a cistern full of Chanel No. 5, and a flunky handing me\n     pieces of raw silk toilet roll. But under the circumstances I'll\n     settle for anywhere.\n\nINT. HORRIBLE TOILET. DAY\n\nThis is the most horrible toilet in Britain.\n\nAlone, Renton makes his way through the horrors to a cubicle.\n\nINT. HORRIBLE TOILET CUBICLE. DAY\n\nRenton locks the door.\n\nHe looks into the bowl and winces with disgust, even in his state.\n\nHe pulls the chain. The chain comes off.\n\nHe drops his trousers, sits on the bowl and closes his eyes.\n\n--------\n\nMONTAGE\n\nA lorry on a building site dumps a load of bricks, B52's shed their load on\nVietnam, the Blue Peter elephant, etc.\n\n--------\n\nINT. CUBICLE. DAY\n\nRenton has his eyes closed. They snap open.\n\nHe looks down between his legs.\n\nHe drops to his knees in front of the bowl and rolls his sleeve up.\n\nWith no more hesitation he plunges his arm into the bowl and trawls for the\nsuppositories.\n\nIt seems to take ages. He cannot find them. He sticks his arm further and\nfurther into the toilet, moving his whole body close. He strains to find it.\n\nHis head is over the bowl now. Gradually he reaches still further until his\nhead is lowered into the bowl, followed by his neck, torso, other arm, and\nfinally his legs, all disappearing.\n\nThe cubicle is empty.\n\nINT. UNDER WATER. DAY\n\nRenton, dressed as before, swims through murky depths until he reaches the\nbottom, where he picks up the suppositories, which glow like luminous\npearls, before heading up towards the surface again.\n\nINT. HORRIBLE TOILET CUBICLE. DAY\n\nThe toilet is empty.\n\nSuddenly Renton appears through the bowl, then his arms as he lifts himself\nout. Still clasping his two suppositories, he walks out of the toilet.\n\nINT. RENTON'S ROOM. DAY\n\nThe mattress, buckets and supplies are laid out as before.\n\nThe door opens and Renton enters, still soaking and dripping.\n\nThe suppositories are in his hand. He holds them up, and they twinkle in the\nlight.\n\n                                   RENTON\n\n     Now. Now I'm ready.\n\nINT. RENTON'S ROOM. DAY\n\nThe cans of soup, the bottle of water, and the carton of ice cream are\nempty, the bottle of pills spilt, the magazines well thumbed.\n\n--------\n\n                                  SICK BOY\n\n     You Only Live Twice?\n\n                                   RENTON\n\n     Nineteen-sixty-seven.\n\n                                  SICK BOY\n\n     Running time?\n\n                                   RENTON\n\n     One hundred and sixteen minutes.\n\n                                  SICK BOY\n\n     Director?\n\n                                   RENTON\n\n     Lewis Gilbert.\n\n                                  SICK BOY\n\n     Screenwriter?\n\n                                   RENTON\n\n     Eh - Ian Fleming?\n\n                                  SICK BOY\n\n     Fuck off! He never wrote any of them.\n\n                                   RENTON\n\n     OK, so who was it, then?\n\n                                  SICK BOY\n\n     You can look it up.\n\nSick Boy throws across a worn copy of a film guide.\n\nRenton cannot be bothered to pick it up.\n\n     How are you feeling since you came off the skag? For myself, I'm\n     bored.\n\n                                   RENTON\n\n     Who wrote it?\n\n                                  SICK BOY\n\n     But you're looking better, it has to be said. Healthier. Radiant\n     even.\n\n                                   RENTON\n\n     You don't know, do you?\n\n                                  SICK BOY\n\n     And I wondered if you'd care to go to the park tomorrow.\n\n                                   RENTON\n\n     The park?\n\n                                  SICK BOY\n\n     Tomorrow afternoon. Usual set-up.\n\n                                   RENTON\n\n     Who wrote it?\n\n                                  SICK BOY\n\n     Roald Dahl.\n\n                                   RENTON\n\n     Roald Dahl. Fuck me.\n\n--------\n\nEXT. PARK. DAY\n\nTypical weather, neither good nor bad. The park is nondescript arid green\nwith a few bushes. This is not Kew Gardens. Renton and Sick Boy appear,\ndressed as before but for the addition of cheap sunglasses.\n\nRenton is carrying a battered old cassette player and a carry-out in a\nplastic bag.\n\nSick Boy is carrying a small, tatty suitcase from Oxfam.\n\nThey scan the horizon and give each other the nod. They walk towards the\nbushes.\n\n                                   RENTON\n                                    (v.o)\n\n     The down side of coming off junk was that I knew I would need to\n     mix with my friends again in a state of full consciousness. It was\n     awful: they reminded me so much of myself I could hardly bear to\n     look at them. Take Sick Boy, for instance, he came off junk at the\n     same time as me, not because he wanted too, you understand, but\n     just to annoy me, just to show me how easily he could do it,\n     thereby downgrading my own struggle. Sneaky fucker, don't you\n     think? And when all I wanted to do was lie along and feel sorry\n     for myself, he insisted on telling me once again about his\n     unifying theory of life.\n\nEXT. PARK. DAY\n\nSeen through the telescopic sight of an air rifle that wanders over various\npotential targets (children, pensioners, couples, gardeners, etc.).\n\n                                  SICK BOY\n\n     It's certainly a phenomenon in all walks of life.\n\n                                   RENTON\n\n     What do you mean?\n\n                                  SICK BOY\n\n     Well, at one time, you've got it, and then you lose it, and it's\n     gone for ever. All walks of life: George Best, for example, had it\n     and lost it, or David Bowie, or Lou Reed -\n\n                                   RENTON\n\n     Some of his solo stuff's not bad.\n\n                                  SICK BOY\n\n     No, it's not bad, but it's not great either, is it? And in your\n     heart you kind of know that although it sounds all right, it's\n     actually just shite.\n\n                                   RENTON\n\n     So who else?\n\n                                  SICK BOY\n\n     Charlie Nicholas, David Niven, Malcolm McLaren, Elvis Presley. -\n\n                                   RENTON\n\n     OK, OK, so what's the point you're trying to make?\n\nEXT. PARK. DAY\n\nSick Boy rests the gun down.\n\n                                  SICK BOY\n\n     All I'm trying to do is help you understand that The Name of the\n     Rose is merely a blip on an otherwise uninterrupted downward\n     trajectory.\n\n                                   RENTON\n\n     What about The Untouchables?\n\n                                  SICK BOY\n\n     I don't rate that at all.\n\n                                   RENTON\n\n     Despite the Academy award?\n\n                                  SICK BOY\n\n     That means fuck all. The sympathy vote.\n\n                                   RENTON\nRight. So we all get old and then we can't hack it any more. Is that it?\n                                  SICK BOY\n\n     Yeah.\n\n                                   RENTON\n\n     That's your theory?\n\n                                  SICK BOY\n\n     Yeah, Beautifully fucking illustrated.\n\n                                   RENTON\n\n     Give me the gun.\n\nEXT. PARK. DAY Through the sight again. This time a Skinhead and his\nmuscle-bound dog are in view.\n\nSick Boy and Renton talk like Sean Connery.\n\n                                  SICK BOY\n\n     Do you see the beast? Have you got it in you sights?\n\n                                   RENTON\n\n     Clear enough, Moneypenny. This should present no significant\n     problem.\n\nThe gun fires and the dog yelps, jumps up and bites its owner (the\nSkinhead).\n\n                                  SICK BOY\n\n     For a vegetarian, Rents, you're a fucking evil shot.\n\nEXT. PARK. DAY\n\nRenton loads up again.\n\n                                   RENTON\n                                    (v.o)\n\n     Without heroin, I attempted to lead a useful and fulfilling life\n     as a good citizen.\n\nINT. CAFÉ. DAY\n\nTwo milkshakes clink together.\n\nRenton and Spud and seated at a booth, dressed in their own fashion for job\ninterviews.\n\n                                   RENTON\n\n     Good luck, Spud.\n\n                                    SPUD\n\n     Cheers.\n\n                                   RENTON\n\n     Now remember --\n\n                                    SPUD\n\n     Yeah.\n\n                                   RENTON\n\n     If they think you're not trying, you're in trouble. First hint of\n     that, they'll be on to the DSS, 'This cunt's no trying' and your\n     Giro is fucking finished, right?\n\n                                    SPUD\n\n     Right.\n\n                                   RENTON\n\n     But try too hard --\n\n                                    SPUD\n\n     And you might get the fucking job.\n\n                                   RENTON\n\n     Exactly.\n\n                                    SPUD\n\n     Nightmare.\n\n                                   RENTON\n\n     It's a tightrope, Spud, a fucking tightrope.\n\n                                    SPUD\n\n     My problem is that I tend to clam up. I go dumb and I can't answer\n     any questions at all. Nerves on the big occasion, like a\n     footballer.\n\n                                   RENTON\n\n     Try this.\n\nRenton unfolds silver foil to reveal some amphetamine. Spud dips in a finger\nand takes a dab. He nods in appreciation as he tastes it. Renton leaves the\npacket in Spud's hand.\n\n                                    SPUD\n\n     A little dab of speed is just the ticket.\n\n--------\n\nINT. INTERVIEW OFFICE. DAY\n\nA Woman and Two Men (1 and 2) are interviewing Renton. His job application\nform is on the desk in front of them.\n\n                                    MAN 1\n\n     Well, Mr. Renton, I see that you attended the Royal Edinburgh\n     College.\n\n                                   RENTON\n\n     Indeed, yes, those halcyon days.\n\n                                    MAN 1\n\n     One of Edinburgh's finest schools.\n\n                                   RENTON\n\n     Oh, yes, indeed. I look back on my time there with great fondness\n     and affection. The debating society, the first eleven, the soft\n     know of willow on leather --\n\n                                    MAN 1\n\n     I'm an old boy myself, you know?\n\n                                   RENTON\n\n     Oh, really?\n\n                                    MAN 1\n\n     Do you recall the school motto?\n\n                                   RENTON\n\n     Of course, the motto, the motto --\n\n                                    MAN 1\n\n     Strive, hope, believe and conquer.\n\n                                   RENTON\n\n     Exactly. Those very words have been my guiding light in what is,\n     after all, a dark and often hostile world.\n\nRenton looks pious under scrutiny.\n\n                                    MAN 2\n\n     Mr. Renton --\n\n                                   RENTON\n\n     Yes.\n\n                                    MAN 2\n\n     You seem eminently suited to this post but I wonder if you could\n     explain the gaps in your employment record?\n\n                                   RENTON\n\n     Yes, I can. The truth -- well, the truth is that I've had a\n     long-standing problem with heroin addiction. I've been know to\n     sniff it, smoke it, swallow it, stick it up my arse and inject it\n     into my veins. I've been trying to combat this addiction, but\n     unless you count social security scams and shoplifting, I haven't\n     had a regular job in years. I feel it's important to mention this.\n\nThere is silence.\n\nA paper clip crashes to the floor.\n\n--------\n\nINT. OFFICE. DAY\n\nThe same office. The same team are interviewing Spud.\n\n                                    SPUD\n\n     No, actually I went to Craignewton but I was worried that you\n     wouldn't have heard of it so I put the Royal Edinburgh College\n     instead, because they're both schools, right, and we're all in\n     this together, and I wanted to put across the general idea rather\n     than the details, yeah? People get all hung up on details, but\n     what's the point? Like which school? Does it matter? Why? When?\n     Where? Or how many O grades did I get? Could be six, could be one,\n     but that's not important. What's important is that I am, right?\n     That I am.\n\n                                    MAN 1\n\n     Mr. Murphy, do you mean that you lied on your application?\n\n                                    SPUD\n\n     Only to get my foot in the door. Showing initiative, right?\n\n                                    MAN 1\n\n     You were referred here by the Department of Employment. There's no\n     need for you to get you \"foot in the door\", as you put it.\n\n                                    SPUD\n\n     Hey. Right. No problem. Whatever you say, man. You're the man, the\n     governor, the dude in the chair, like. I'm merely here. But\n     obviously I am. Here, that is. I hope I'm not talking too much. I\n     don't usually. I think it's all important though, isn't it?\n\n                                    MAN 2\n\n     Mr. Murphy, what attracts you to the leisure industry?\n\n                                    SPUD\n\n     In a word, pleasure. My pleasure in other people's leisure.\n\n---------\n\n                                    WOMAN\n\n     What do you see as your main strengths?\n\n                                    SPUD\n\n     I love people. All people. Even people that no one else loves, I\n     think they're OK, you know. Like Beggars.\n\n                                    WOMAN\n\n     Homeless people?\n\n                                    SPUD\n\n     No, not homeless people. Beggars, Francis Begbie -- one of my\n     mates. I wouldn't say my best mate, I mean, sometimes the boy goes\n     over the score, like one time when we -- me and him -- were having\n     a laugh and all of a sudden he's fucking gubbed me in the face,\n     right --\n\n---------\n\n                                    WOMAN\n\n     Mr. Murphy, {leaving your friend aside,} do you see yourself as\n     having any weaknesses?\n\n                                    SPUD\n\n     No. Well, yes. I have to admit it: I'm a perfectionist. For me,\n     it's the best or nothing at all. If things go badly, I can't be\n     bothered, but I have a good feeling about this interview. Seems to\n     me like it's gone pretty well. We've touched on a lot of subjects,\n     a lot of things to think about, for all of us.\n\n                                    MAN 1\n\n     Thank you, Mr. Murphy. We'll let you know.\n\n                                    SPUD\n\n     The pleasure was mine. Best interview I've ever been to. Thanks.\n\nSpud crosses the room to shake everyone by the hand and kiss them.\n\n                                   RENTON\n                                    (v.o)\n\n     Spud had done well. I was proud of him. He fucked up good and\n     proper.\n\n--------\n\nINT. PUB 1. DAY\n\nRenton and Spud meet up after the interviews.\n\n                                    SPUD\n\n     A little too well, if anything, a little too well, that's my only\n     fear, compadre.\n\n                                   RENTON\n\n     Another dab?\n\n                                    SPUD\n\n     Would not say no, would not say no.\n\nINT. OFFICE. DAY\n\nThe Woman and Two Men sit in silence.\n\n--------\n\nINT. PUB 2. NIGHT\n\nIt is Saturday night in a busy, city-centre pub on two levels. On a large\nupper balcony, overlooking the bar and floor downstairs, sit Spud, Gail,\nRenton, Sick Boy, Tommy, Lizzy and Begbie.\n\nBegbie's story overlaps with the subsequent depiction of the incident.\n\n                                   BEGBIE\n                                    (v.o)\n\n     Picture the scene. Wednesday morning in the Volley. Me and Tommy\n     are playing pool. No problems, and I'm playing like Paul fucking\n     Newman by the way. I'm giving the boy here the tanning of a\n     lifetime. So anyway, it comes to the final ball, the deciding shot\n     of the tournament: I'm on the black and he's sitting in the\n     corner, looking all biscuit-arsed. Then this hard cunt comes in.\n     Obviously fancied himself. Starts looking at me. Right fucking at\n     me. Trying to put off, like, just for kicks. Looking at me as if\n     to say, 'Come ahead, square go.' Well, you know me, I'm no looking\n     for trouble but at the end of the day I'm the cunt with the pool\n     cue and I'm game for a swedge. So I squared up, casual like. So\n     what does the hard cunt do, or so-called hard cunt? Shites it.\n     Puts down his drink, turns around and gets the fuck out of there.\n     And after that, the game was mine.\n\nINT. POOL HALL. DAY\n\nThe events in the pool hall, as described by Begbie.\n\nBegbie and Tommy are playing pool.\n\nBegbie is playing like a wizard.\n\nTommy looks defeated.\n\nLining up for the final ball, Begbie is distracted by a large Hard Man\nstanding at the bar staring at him.\n\nBegbie stands up and walks slowly towards the Hard Man.\n\nThey stand, eye to eye, for a moment.\n\nBegbie swings the pool cue slowly into his palm.\n\nThe Hard Man turns and leaves.\n\nBegbie drinks the Hard Man's pint, then pots the black with a brilliant\nshot.\n\nINT. PUB 2. DAY\n\nBegbie, his story complete, finishes his pint. The others continue to stare\nat him, frozen as though expecting something more. Begbie smiles and throws\nthe pint over his head.\n\nFreeze-frame: the glass in mid-air and Begbie's smiling face.\n\n                                   RENTON\n                                    (v.o)\n\n     And that was it. That was Begbie's story. Or at least that was\n     Begbie's version of the story. But a couple of days later I got\n     the truth from Tommy. It was one of his major weaknesses: he never\n     told lies, never took drugs, and never cheated on anyone.\n\nINT. TOMMY'S FLAT. DAY\n\nRenton's hand flicks through a long row of videos on the floor while the\nsound of weights being lifted (by Tommy) emanates from nearby.\n\nMost of the videos are feature films or comedy shows, some with titles\nwritten in Tommy's hand, but two catch Renton's attention.\n\nThey are 100 Great Goals and Tommy and Lizzy Vol. 1, the latter a\nhandwritten title.\n\nRenton looks from the video round to Tommy, who is engrossed in lifting\nweights.\n\n                                    TOMMY\n\n     Well, sure it was Wednesday morning, we were in the Volley playing\n     pool, that much is true.\n\nINT. POOL HALL. DAY\n\nTommy's account over a depiction of his version.\n\n                                    TOMMY\n                                    (v.o)\n\n     But Begbie is playing absolutely fucking gash. He's got a hangover\n     so bad he can hardly hold the fucking cue, never mind pot the\n     ball. I'm doing my best to lose, trying to humour him, like, but\n     it's not doing any good: every time I touch the ball I pot\n     something, every time Begbie goes near the table he fucks it up.\n     So he's got the hump, right, but finally I manage to set it up so\n     all he's go to do is pot the black to win one game and salvage a\n     little pride and maybe not kick my head in, right. So he's on the\n     black, pressure shot, and it all goes wrong, big time. What does\n     he do? Picks on this specky wee gadge at the bar and accuses him\n     of putting him off by looking at him. Can you believe it? I mean,\n     the poor cunt hasn't even glanced in our direction. He's sitting\n     there quiet as a mouse when Beggars gubs him with the cue. He was\n     going to chib him, I tell you, then I thought he was going to do\n     me. The Beggar is fucking psycho, but he's a mate, you know, so\n     what can you do?\n\nThe events are as follows:\n\nBegbie and Tommy are playing pool.\n\nBegbie, furious, miscues, goes in off, etc.\n\nTommy deliberately misses sitters and tries to look annoyed.\n\nBegbie lines up to play the black. It is unmissable.\n\nAt the bar beyond sits a harmless young Man, wearing the same clothes as the\nHard Man in Begbie's account except that they are now baggy rather than\ntaut. He is clearly not staring at Begbie but drinks a half-pint and eats\nsome crisps.\n\nAs Begbie plays, the Man bites a crisp.\n\nBegbie miscues, rips the cloth and the ball flies off the table.\n\nTommy catches it and looks up to see Begbie assaulting the young Man.\n\nTommy cautiously restrains Begbie and he reaches into his jacket for a\nknife.\n\nBegbie turns and for a moment looks as though he might attack Tommy.\n\nINT. TOMMY'S FLAT. DAY\n\nTommy puts down his weights.\n\nRenton holds up 100 Great Goals.\n\n                                   RENTON\n\n     Can I borrow this one?\n\nINT. PUB 2. NIGHT\n\nThe freeze-frame of the glass in mid-air and Begbie's smiling face.\n\n                                   RENTON\n                                    (v.o)\n\n     Yeah, the guy's a psycho, but it's true, he's a mate as well, so\n     what can you do? Just stand back and watch and try not to get\n     involved. Begbie didn't do drugs either, he just did people. That\n     what he got off on: his own sensory addiction.\n\nThe glass falls into the crowd.\n\nScreaming starts. A Woman is bleeding from a wound in her head. The Men\nbeside her turn furiously around to look for the source of the glass.\n\nUp on the balcony, Begbie stands up. The screams and shouting continue\nbelow.\n\nBegbie appears at the bottom of the staircase down from the balcony.\n\nHe strides towards the bleeding Woman and begins shouting.\n\n                                   BEGBIE\n\n     All right. Nobody move. The girl got glassed and no cunt leaves\n     here until we find out which cunt did it.\n\nA man stands up from one of the tables.\n\n                                     MAN\n\n     And who the fuck do you think you are?\n\nBegbie kick the Man in the groin. Another moves towards him but is blocked\nby the Men surrounding the girl. Soon the whole mass dissolves into a brutal\nscrum, in which Begbie plays a prominent part.\n\nUp on the balcony, the rest of the gang watch in silence.\n\nINT. RENTON'S FLAT. DAY\n\nThe empty cover for 100 Great Goals lies on the floor.\n\nSick Boy and Renton sit dispassionately watching Tommy and Lizzy in their\nhome-made soft-porn video.\n\n                                   RENTON\n                                    (v.o)\n\n     And as I sat watching the intimate and highly personal video,\n     stolen only hours earlier from one of my best friends, I realized\n     that something important was missing from my life.\n\nINT. CLUB. NIGHT\n\nA mass of dancing bodies fills the floor. The music is very loud.\n\nAt the side of the dance floor sit Tommy and Spud. The look rather gloomy.\nThere is an empty seat beside each of them. Spud is drinking heavily.\n\nTommy turns and speaks to Spud. His lips move but nothing is audible. Spud\nis not ever aware that Tommy has spoken.\n\nTommy bellows in Spud's ear.\n\nTommy's words and all subsequent conversation in the dance area of the club\nappear as subtitles, the character's communications somewhere between speech\nand mime.\n\n                                    TOMMY\n\n     How's it going with Gail?\n\n                                    SPUD\n\n     No joy yet.\n\n                                    TOMMY\n\n     How long is it?\n\n                                    SPUD\n\n     Six weeks.\n\n                                    TOMMY\n\n     Six weeks!\n\n                                    SPUD\n\n     It's a nightmare. She told me she didn't want our relationship to\n     start on a physical basis as that is how it would be principally\n     defined from then on in.\n\n                                    TOMMY\n\n     Where did she come up with that?\n\n                                    SPUD\n\n     She read it in Cosmopolitan.\n\n                                    TOMMY\n\n     Six weeks and no sex?\n\n                                    SPUD\n\n     I've got balls like watermelons, I'm telling you.\n\nINT. NIGHTCLUB, WOMEN'S TOILET. NIGHT\n\nGail and Lizzy are smoking and talking.\n\n                                    GAIL\n\n     I read it in Cosmopolitan.\n\n                                    LIZZY\n\n     It's an interesting theory.\n\n                                    GAIL\n\n     Actually it's a nightmare. I've been desperate for a shag, but\n     watching him suffer was just too much fun. You should try it with\n     Tommy.\n\n                                    LIZZY\n\n     What, and deny myself the only pleasure I get from him? Did I tell\n     you about my birthday?\n\n                                    GAIL\n\n     What happened?\n\n                                    LIZZY\n\n     He forgot. Useless motherfucker.\n\nINT. NIGHTCLUB. DANCE AREA. NIGHT\n\nTommy and Spud seated as before. Their words are subtitled.\n\nAs they are speaking Gail and Lizzy return and sit down.\n\n                                    TOMMY\n\n     Useless motherfucker, that's what she called me. I told her, I'm\n     sorry, but theses things happen. Let's put it behind us.\n\n                                    SPUD\n\n     That's fair enough.\n\n                                    TOMMY\n\n     Yes, but then she finds out I've bought a ticket for Iggy Pop the\n     same night.\n\n                                    SPUD\n\n     Went ballistic?\n\n                                    TOMMY\n\n     Big time. Absolutely fucking radge. 'It's me or Iggy Pop, time to\n     decide.'\n\n                                    SPUD\n\n     So what's it going to be?\n\n                                    TOMMY\n\n     Well, I've paid for the ticket.\n\n                               GAIL AND LIZZY\n\n     What are you two talking about?\n\n                               TOMMY AND SPUID\n\n     Football. What were you talking about?\n\n                               GAIL and LIZZY\n\n     Shopping\n\nStanding nearby but apart from them is Renton.\n\nRenton notes Spud and Tommy with their partners, and across the other side\nSick Boy and Begbie are engaged in flirtatious conversation with Two Women.\n\n                                   RENTON\n                                    (v.o)\n\n     The situation was becoming serious. Young Renton noticed the haste\n     with which the successful, in the sexual sphere as in all others,\n     egregated themselves from the failures.\n\nBegbie and Sick Boy with the Two Women.\n\nRenton standing among a group of lone nerds.\n\nRenton wades on to the dance floor, looking at countless women, all whom\neither turn away or are spoken for.\n\n                                   RENTON\n                                    (v.o)\n\n     Heroin had robbed Renton of his sex drive, but now it returned\n     with a vengeance. And as the impotence of those days faded into\n     memory, grim desperation took hold in his sex-crazed mind. His\n     post-junk libido, fuelled by alcohol and amphetamine, taunted him\n     remorselessly with his own unsatisfied desire dot.\n\nRenton notices one girl (Diane) walking on her own towards the door.\n\nA Man carrying two drinks catches up with her and walks backwards, talking\nto her.\n\nShe says nothing. He blocks her way.\n\nShe takes one drink and downs it, then the other, handing him back the empty\nglasses. She steps past him and walks on towards the door.\n\n                                    (v.o)\n\n     And with that, Mark Renton had fallen in love.\n\nEXT. STREET. NIGHT\n\nThe Girl walks away from the club, scanning the street for a taxi, and hail\none which stops just as Renton calls out.\n\n                                   RENTON\n\n     Excuse me, I don't mean to harass you, but I was very impressed by\n     the capable and stylish manner in which you dealt with that\n     situation. I thought to myself: she's special.\n\n                                    DIANE\n\n     Thanks.\n\n                                   RENTON\n\n     What's your name?\n\n                                    DIANE\n\n     Diane.\n\n                                   RENTON\n\n     Where are you going, Diane?\n\n                                    DIANE\n\n     I'm going home.\n\n                                   RENTON\n\n     Where's that?\n\n                                    DIANE\n\n     It's where I live.\n\n                                   RENTON\n\n     Great.\n\n                                    DIANE\n\n     What?\n\n                                   RENTON\n\n     I'll come back if you like, but I'm not promising anything.\n\nDiane halts abruptly as a taxi pulls up.\n\n                                    DIANE\n\n     Do you find that this approach usually works, or, let me guess,\n     you've never tried it before. In fact, you don't normally approach\n     girls, am I right? The truth is that you're a quite, sensitive\n     type but if I'm prepared to take a chance I might just get to know\n     the inner you: witty, adventurous, passionate, loving, loyal, a\n     little bit crazy, a little bit bad, but, hey, don't us girls just\n     love that?\n\n                                   RENTON\n\n     Eh-\n\n                                    DIANE\n\n     Well, what's wrong, boy? Cat got your tongue.\n\n                                   RENTON\n\n     I think I left something back at the -\n\nThe girl has disappeared into the back of the taxi.\n\nRenton looks around.\n\n                                 TAXI DRIVER\n\n     Are you getting in or not, pal?\n\nEXT. ROAD. NIGHT\n\nThe taxi motors along.\n\nINT. TAXI. NIGHT\n\nRenton and Diane are kissing passionately in the back.\n\nEXT. STREET. NIGHT\n\nSpud is pushed against the wall held by his lapels. He drinks from a bottle\nof beer in one hand.\n\n                                    GAIL\n\n     Do you understand?\n\nSpud nods drunkenly.\n\nGail releases her grip.\n\n     Our relationship is not being redefined; it is developing in an\n     appropriate, organic fashion. I expect you to be a considerate and\n     thoughtful lover, generous but firm. Failure on your part to live\n     up to these very reasonable expectations will result in swift\n     resumption of a non-sex situation. Right?\n\nSpud drinks from a bottle in the other hand and says nothing but he does not\nlook too happy.\n\nINT. TOMMY'S FLAT. NIGHT\n\nTommy and Lizzy kiss while Tommy unlocks the door.\n\nINT. DIANE'S HOME, HALLWAY. NIGHT\n\nIn a darkened suburban hallway, the door opens and two figures enter.\n\n                                   RENTON\n\n     Diane.\n\n                                    DIANE\n\n     Ssshh!\n\n                                   RENTON\n\n     Sorry.\n\n                                    DIANE\n\n     Shut up.\n\nThey walk through another door and close it behind them.\n\nINT. TOMMY'S FLAT. NIGHT\n\nTommy and Lizzy kiss against the inside of th door, taking their outer\nclothes off.\n\nINT. DIANE'S BEDROOM. NIGHT\n\nBy a pale bedside light, Diane and Renton undress.\n\nINT. GAIL'S BEDROOM. NIGHT\n\nSpud is lying unconscious on the bed. Gail stands over him.\n\n                                    GAIL\n\n     Wake up, Spud, wake up. Sex.\n\nShe kicks him. He moans.\n\n     Casual sex.\n\nShe kicks him again. He moans again.\n\n     You useless bastards. So, let's see what I'm missing.\n\nShe begins undressing him.\n\nINT. DIANE'S BEDROOM. NIGHT\n\nRenton lies on his back while Diane rides above him.\n\nINT. GAIL'S BEDROOM. NIGHT\n\nGail throws Spud's clothes to the floor and throws a blanket over him.\n\n                                    GAIL\n\n     Not much.\n\nShe switches out the light.\n\nINT. TOMMY'S FLAT. NIGHT\n\nTommy and Lizzy now lie on the bed in a state of semi-undress.\n\n                                    LIZZY\n\n     Tommy, let's put the tape on.\n\n                                    TOMMY\n\n     Now?\n\n                                    LIZZY\n\n     Yes, I want to watch ourselves while we're screwing.\n\n                                    TOMMY\n\n     Fuck, OK.\n\nTommy gets up and reaches into the row of videos on the floor. He lifts out\nTommy and LIzzy, Vol. 1 and hastily shoves it into the video.\n\nTommy sits back on the bed with the remote control and presses 'play' as\nLizzy kisses him.\n\nHis face registers consternation.\n\nOn the television, Archie Gemmill scores his famous goal against Holland in\n1978.\n\nINT. DIANE'S BEDROOM. NIGHT\n\nRenton and Diane climax together.\n\nDiane immediately climbs off and wraps herself in a robe.\n\n                                   RENTON\n\n     Christ, I haven't felt that good since Archie Gemmill scored\n     against Holland in 1978.\n\n                                    DIANE\n\n     Right. You can't sleep here.\n\n                                   RENTON\n\n     What?\n\n                                    DIANE\n\n     Out.\n\n                                   RENTON\n\n     Come on.\n\n                                    DIANE\n\n     No argument. You can sleep on the sofa in the living room, or go\n     home. It's up to you.\n\n                                   RENTON\n\n     Jesus.\n\n                                    DIANE\n\n     And don't make any noise.\n\nINT. TOMMY'S FLAT. NIGHT\n\nThe lights are full on now. Lizzy sits on the bed clutching a blanket around\nherself.\n\nTommy hops around in his underwear, searching desperately.\n\nAll the videos are opened and scattered everywhere.\n                                    LIZZY\n\n     What do you mean, it's 'gone'? Where has it gone, Tommy?\n\n                                    TOMMY\n\n     It'll be here somewhere. I might have returned it by mistake.\n\n                                    LIZZY\n\n     Returned it? Where? To the video shop, Tommy? To the fucking video\n     store? So every punter in Edinburgh is jerking off to our video?\n     God, Tommy, I feel sick.\n\nINT. DIANE'S HOME, LIVING-ROOM. MORNING\n\nRenton lies submerged under a blanket.\n\nThe sounds of a normal morning travel from a room nearby: whistles, radio,\nvoices.\n\nRenton peeps over the edge of the blanket, then covers his head again.\n\nINT. GAIL'S BEDROOM. MORNING\n\nSpud opens his eyes. With his fingers, he feels crusted liquid around his\nmouth.\n\nAbruptly he turns around: the bed is soaked in vomit.\n\nHe looks under the cover and drops it again in revulsion.\n\nINT. DIANE'S HOME, LIVING-ROOM. DAY\n\nRenton pulls himself up off the sofa and dresses as quickly as possible.\n\nINT. GAIL'S BEDROOM. DAY\n\nSpud wipes the vomit from his chest with a pillowcase, which he dumps in the\nmiddle of the sheets before gathering the whole lot up as a bundle.\n\nINT. DIANE'S HOME, HALL/KITCHEN. DAY\n\nThe door swings open. A Man and a Woman, about Renton's age, sit at the\nkitchen table. They look up to see Renton in the doorway.\n                                     MAN\n\n     Good Morning.\n\n                                    WOMAN\n\n     Come in and sit down. You must be Mark.\n\nRenton walks to the table and sits down.\n                                   RENTON\n\n     Yes, that's me.\n\n                                    WOMAN\n\n     You're a friend of Diane's?\n\n                                   RENTON\n\n     More of a friend of a friend, really.\n\n                                     MAN\n\n     Right.\n\n                                   RENTON\n\n     Are you her flatmates?\n\nThe couple exchange a look and laugh.\n                                    WOMAN\n\n     Flatmates. I must remember that one.\n\nThe Man and Woman look beyond Renton. He too turns and follows their gaze.\n\nDiane stands in the doorway.\n\nShe is wearing school uniform.\n\nINT. GAIL'S HOME, HALL/KITCHEN. DAY\n\nThe door swings open to reveal the kitchen. Gail, her Father, and Mother are\nseated around the table, eating breakfast. They look towards Spud, who\ncarries the knotted bundle of sheets as he approaches the table.\n                                    GAIL\n\n     Good morning, Spud.\n\n                                    SPUD\n\n     Morning, Gail. Morning, Mrs. Houston, Mr. Houston.\n\n                                   MOTHER\n\n     Morning, Spud. Sit down and have some breakfast.\n\n                                    SPUD\n\n     Sorry about last night -\n\n                                    GAIL\n\n     It's all right. I slept fine on the sofa.\n\n                                    SPUD\n\n     I had a little too much to drink. I'm afraid I had a slight\n     accident.\n\n                                   FATHER\n\n     Oh, don't worry, these things happen. It does everyone good to cut\n     loose once in a while.\n\n                                    GAIL\n\n     This one could do with being tied up once in a while.\n\n                                   MOTHER\n\n     I'll put the sheets in the washing machine just now.\n\n                                    SPUD\n\n     No, I'll wash them. I'll take them home and bring them back.\n\n                                   MOTHER\n\n     There's no need.\n\n                                    SPUD\n\n     It's no problem.\n\n                                   MOTHER\n\n     No problem for me either.\n\n                                   MOTHER\n\n     Honestly, it's no problem.\n\n                                    SPUD\n\n     I'd really rather take care of it myself.\n\n                                   MOTHER\n\n     Spud, they're my sheets.\n\nShe takes hold of the bundle.\n\nSpud does not yield.\n\nShe pulls harder. Spud holds on. She tugs powerfully.\n\nThe bundle bursts open with an explosion of vomit and excrement that covers\neverything in the kitchen.\n\nOnly Spud remains untouched.\n\n---------\n\n                                    SPUD\nI guess this means I'll never get to have sex with Gail.\n\nINT. TOMMY'S FLAT. DAY\n\nTommy sits alone, watching\n\n100 Great Goals\n\n---------\n\nEXT. STREET. DAY\n\nRenton paces briskly down the street, followed by Diane.\n                                    DIANE\nI don't see why not.\n\n                                   RENTON\n\n     Because it's illegal.\n\n                                    DIANE\n\n     Holding hands?\n\n                                   RENTON\n\n     No, not holding hands.\n\n                                    DIANE\n\n     In that case you can do it. You were quite happy to do a lot more\n     last night.\n\n                                   RENTON\n\n     And that's what's illegal. Do you know what they do to people like\n     me inside? They'd cut my balls off and flush them down the fucking\n     toilet.\n\nThey stop at the school gates.\n                                    DIANE\n\n     Calm down. You're not going to jail.\n\n                                   RENTON\n\n     Easy for you to say.\n\n                                    DIANE\n\n     Can I see you again?\n\n                                   RENTON\n\n     Certainly not.\n\nRenton walks away.\n                                    DIANE\n\n     If you don't see me again I'll tell the police.\n\nRenton turns and walks back to her. They stand for a moment, then Renton\nwalks away again. Diane smiles.\n                                (to herself)\n\n     I'll see you around then.\n\nEXT. VIDEO STORE. DAY\n\nIn the cold light of morning, Tommy and Lizzy wait, not speaking, outside\nthe still-closed video store.\n\n---------\n\nEXT. RAIL BRIDGE. DAY\n\nA train speeds across.\n\nINT. TRAIN. DAY\n\nSick Boy, Tommy, Spud and Renton sit drinking from an extensive carry-out.\n                                  SICK BOY\n\n     This had better be good.\n\n                                    TOMMY\n\n     It will be. It'll make a change for three miserable junkies who\n     don't know what they want to do with themselves since they stopped\n     doing smack.\n\n                                  SICK BOY\n\n     If I'm giving up a whole day and the price of a ticket, I'm just\n     saying it had better be good. There's plenty of other things I\n     could be doing.\n\n                                    TOMMY\n\n     Such as?\n\n                                  SICK BOY\n\n     Such as sitting in a darkened room, watching videos, drinking,\n     smoking dope and wanking. Does that answer your question?\n\nThey sit in silence.\n\n---------\n\nEXT. STATION. DAY\n\nThe station is in the middle of a moor. There appears to be no habitation\naround. In the distance are some hills.\n\nThe train stands at the station.\n\nAs it pulls away, Renton, Spud, Tommy and Sick Boy are left standing on the\nplatform, looking around.\n                                  SICK BOY\n\n     Now what?\n\n                                    TOMMY\n\n     We go for a walk.\n\n                                    SPUD\n\n     What?\n\n                                    TOMMY\n\n     A walk.\n\n                                    SPUD\n\n     But where?\n\nTommy points vaguely across the moor.\n                                    TOMMY\n\n     There.\n\n                                  SICK BOY\n\n     Are you serious?\n\nThey step across the tracks toward the vast moorland. They stop.\nAll but Tommy sit down on rocks or clumps of heather.\n                                    TOMMY\n\n     Well, what are you waiting for?\n\n                                    SPUD\n\n     I don't know, Tommy. I don't know if it's... normal.\n\nA group of three serious Walkers trudge past from the other end of the\nplatform, decked out in regulation Berghaus from head to foot. They tramp\noff towards the wilderness. The boys watch them go.\nSpud opens a can.\n                                    TOMMY\n\n     It's the great outdoors.\n\n                                  SICK BOY\n\n     It's really nice, Tommy. Can we go home now?\n\n                                    TOMMY\n\n     It's fresh air.\n\n                                  SICK BOY\n\n     Look, Tommy, we know you're getting a hard time off Lizzy, but\n     there's no need to take it out on us.\n\n                                    TOMMY\n\n     Doesn't it make you proud to be Scottish?\n\n                                   RENTON\n\n     I hate being Scottish. We're the lowest of the fucking low, the\n     scum of the earth, the most wretched, servile, miserable, pathetic\n     trash that was ever shat into civilization. Some people hate the\n     English, but I don't. They're just wankers. We, on the other hand,\n     are colonized by wankers. We can't even pick a decent culture to\n     be colonized by. We are ruled by effete arseholes. It's a shite\n     state of affairs and all the fresh air in the world will not make\n     any fucking difference.\n\nThe three serious Walkers are receding into the distance.\nThe boys troop back towards the platform.\n                                    (v.o)\nAt or around this time, we made a healthy, informed, democratic decision to\nget\n\n     back on drugs as soon as possible. It took about twelve hours.\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton hands over money to Swanney.\nRenton then begins cooking up.\nAlso present and cooking or shooting up are Spud, Swanney, Allison and Baby,\nand Sick Boy.\n                                   RENTON\n                                    (v.o)\n\n     It looks easy, this, but it's not. It looks like a doss, like a\n     soft option, but living like this, it's a full-time business.\n\nHe injects.\n\n---------\n\nINT. SHOP. DAY\n\nRenton, Spud, and Sick Boy are stuffing objects into their shirts and\npockets.\n\n---------\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton lies back, narcotized.\n\nEXT. STREET. DAY\n\nRenton and Spud are running along the street.\nTwo uniformed Store Detectives are running after them.\nSick Boy stands in a doorway. As the Detectives run past, he strolls away in\nthe opposite direction.\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton lies back as before.\n                                  SICK BOY\n\n     Ursula Andress was the quintessential Bond girl. That's what\n     everyone says. The embodiment of his superiority to us: beautiful,\n     exotic, highly sexual and yet unavailable to everyone but him.\n     Shite. Let's face it: if she'd shag one punter from Edinburgh,\n     she'd shag the fucking lot of us.\n\nINT. SWANNEY'S FLAT. LATER\n\nSpud cooks up, watched by Swanney.\nNearby lie the drugged forms of Renton, Sick Boy and Allison and Baby.\n\nINT. RENTON FAMILY HOME, LIVING-ROOM. NIGHT\n\nRenton's Mother and Father sit reading the paper and a magazine.\n\nINT. RENTON FAMILY HOME, PARENTS' BEDROOM. NIGHT\n\nRenton trawls through drawers and any containers (shoe boxes, make-up boxes,\nunder the mattress, etc.) until he finds some cash/jewelry.\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton lies back, staring vacantly ahead.\nTommy flops down beside him. Renton shows barely a flicker of awareness.\n                                    TOMMY\n\n     Lizzy's gone, Mark, she's gone and fucking dumped me. It was the\n     video tape and that Iggy Pop business and all sorts of other\n     stuff. She told me where to go and no mistake. I said, is there\n     any chance of getting back together, like, but no way, no fucking\n     way.\n\nINT. HOSPITAL WARD SITTING-ROOM. DAY\n\nA few elderly patients sit in armchairs watching daytime television.\nRenton and Spud jump and climb through an open window. Watched by the\nhelpless patients, they calmly disconnect the television and take it with\nthem as they leave by the same route.\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton and Tommy slumped side by side as before.\n                                    TOMMY\n\n     I want to try it, Mark. You're always going on about how it's the\n     ultimate hit and that. Better than sex. Come on, I'm a fucking\n     adult. I want to find out for myself.\n\nRenton huddles up and leans away from Tommy.\nI've got the money.\nTommy produces ten pounds from his pocket.\n\nEXT. STREET. DAY\n\nRenton and Spud run along the street.\n\nINT. SWANNEY'S FLAT. DAY\n\nTommy lies drugged on the floor.\n\n---------\n\nINT. FLAT TO BE BURGLED. DAY\n\nThe door of an ordinary flat is kicked open.\nBegbie walks in, crowbar in hand, followed by Sick Boy and Spud.\n\nINT. SWANNEY'S FLAT. DAY\n\n                                  SICK BOY\n\n     Honor Blackman a.k.a. Pussy Galore, what a total fucking misnomer.\n     I wouldn't touch her with yours. I'd sooner shag Col Kreb. At\n     least you know where you are with a woman like that. Not much to\n     look at, like, but personality, that's what counts, that's what\n     keeps a relationship going through the years. Like heroin. I mean,\n     heroin's got fucking great personality.\n\nSick Boy opens the heel of a his shoe to reveal a syringe.\n\n---------\n\nINT. SWANNEY'S FLAT. DAY\n\nSwanney hands over a small bag of heroin in exchange for ten pounds from\nRenton.\n\n---------\n\nINT. FLAT TO BE BURGLED, KITCHEN. DAY\n\nSpud checks the fridge and pulls out a large chunk of deep-frozen meat.\nHe hits with the crowbar until it fractures and splits. Inside there is some\njewellery.\n\n---------\n\nINT. CAR. DAY\n\nThe car is empty. A window is broken and the door opened.\nThe car alarm goes off.\nRenton reaches under the seat and finds the radio/cassette. He then pulls\nthe bonnet release.\n\nEXT. CAR. DAY\n\nThe car alarm rings on until Renton calmly produces a pair of wire cutters\nand a spanner to cut free and release the battery.\nThe alarm is silenced.\nRenton walks away with the battery and the stereo.\n\nINT. GP'S SURGERY. DAY\n\n                                   RENTON\n                                    (v.o)\n\n     Swanney taught us to adore and respect the National Health\n     Service, for it was the source of much of our gear. We stole\n     drugs, we stole prescriptions, or bought them, sold them, swapped\n     them, forged them, photocopied them or traded them with cancer\n     victims, alcoholics, old age pensioners, AIDS patients, epileptics\n     and bored housewives. We took morphine, diamorphine, cyclozine,\n     codeine, temazepam, nitrezepam, phenobarbitone, sodium amytal\n     dextropropoxyphene, methadone, nalbuphine, pethidine, pentazocine,\n     buprenorphine, dextromoramide chlormethiazole. The streets are\n     awash with drugs that you can have for unhappiness and pain, and\n     we took them all. Fuck it, we would have injected Vitamin C if\n     only they'd made it illegal.\n\nThe GP examines Renton's chest and smiles.\nThe GP turns to wash his hands. Renton pulls on his shirt and steals a\nprescription pad off the desk.\n\n---------\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton lies back with his eyes close. A football enters the frame to bounce\noff his head and out again.\nHe opens his eyes and it happens again.\nOpposite him, Spud, Sick Boy and Tommy stand looking down on him.\nTommy throws the ball again.\n\n---------\n\nINT. PUB I. DAY\n\nIt's the first day of the Edinburgh Festival.\nRenton, Tommy, Spud, Sick Boy and Begbie sit drinking.\nThey observe a young male American Tourist walk in in a bulky red anorak and\nglasses. He goes past them towards the toilet.\nBegbie stands up.\n\nINT. PUB I, TOILET. DAY\n\nThe American Tourist turns from the urinal to see Begbie, Renton, Sick Boy,\nSpud and Tommy approaching. Begbie punches and kicks the Tourist and pulls\nout a knife.\n\n---------\n\nINT. TAXI. DAY\n\nThe door of the taxi opens, Begbie, Tommy, Spud, Sick Boy and Renton get in,\ncarrying the red anorak and glasses.\nAs the taxi pulls away they study the photograph in the passport. They look\nat one another in agreement.\n\nEXT. TAXI. DAY\n\nThe taxi motors along.\n\n---------\n\nINT. PUB I. NIGHT\n\nA man at the bar is now wearing the red anorak.\nBegbie divides up the money among Sick Boy, Tommy, Spud, and Renton.\nRenton takes his share.\n                                   BEGBIE\n\n     And remember, Rents: no skag.\n\n                                   RENTON\n\n     Aye, OK, Fr.\n\n                                   RENTON\n                                    (v.o)\n\n     But the good times couldn't last for ever.\n\nINT. SWANNEY'S FLAT. DAY\n\nRenton lies as before. Around the room are Swanney, Allison, Tommy, Spud and\nSick Boy.\nAllison begins screaming and wailing.\nSlowly, the others rouse themselves to varying degrees.\n                                   RENTON\n                                    (v.o)\n\n     I think Allison had been screaming all day, but it hadn't really\n     registered before. She might have been screaming for a week for\n     all I knew. It's been days since I've heard anyone speak, though\n     surely someone must have said something in all that time, surely\n     to fuck someone must have.\n\n                                  SICK BOY\n\n     What's wrong, Allison?\n\nAllison points toward the bundle of dirty blankets in which her baby is\nwrapped. Sick Boy follows her directions.\n                                    SPUD\nCalm down, calm down. It's going to be all right, everything's going to be\njust fine.\n\n                                   RENTON\n                                    (v.o)\n\n     Nothing could have been further from the truth. In point of fact,\n     nothing at all was going to be just fine. On the contrary,\n     everything was going to be bad. Bad? I mean worse than it already\n     was.\n\nSick Boy stands over the bundle. The baby is dead.\n                                  SICK BOY\nOh, fuck. Sick Boy reaches out to Allison.\n                                   RENTON\n                                    (v.o)\n\n     It wasn't my baby. She wasn't my baby. Baby Dawn. She wasn't mine.\n     Spud's? Swanney's? Sick Boy's? I don't know. Maybe Allison knew.\n     Maybe not. I wished I could think of something to say, something\n     sympathetic, something human.\n\n                                  SICK BOY\nSay something, Mark, say something --\n                                   RENTON\nI'm cooking' up. There is a silence.\nRenton begins scrambling around through the works.\n                                   ALLISON\n\n     Cook one for me, Renton. I need a hit.\n\n                                   RENTON\n                                    (v.o)\n\n     And so she did, I could understand that. To take the pain away. So\n     I cooked up and she got a hit, but only after me. That went\n     without saying.\n\nEXT. STREET. DAY\n\nRenton, Spud and Sick Boy cross the road to approach the shop.\n                                   RENTON\n                                    (v.o)\n\n     Well, at least we knew who the father was now. It wasn't just the\n     baby that died that day. Something inside Sick Boy was lost and\n     never returned. It seemed he had no theory with which to explain a\n     moment like this.\n\n---------\n\nINT. SHOP. DAY\n\nRenton, Spud and Sick Boy are stuffing their pockets, as seen before.\nRenton's theft is interrupted by Diane's voice.\n                                    DIANE\n\n     Hello there, Mark.\n\nDiane is standing just beside him.\n\n     What are you doing?\n\nRenton is speechless, but a few stolen items fall from inside his jacket\ndown to the floor.\nDiane looks down.\nSpud and Sick Boy start to snigger.\nOne of the Store Detectives become aware of the group. He starts walking\ntowards them.\n\n     You didn't tell me you were a thief.\n\n                                    SPUD\n\n     Hey, go easy, lady. The boy's got a habit to support.\n\n                                  SICK BOY\n\n     Opium doesn't just grow on trees, you know.\n\nA few more items fall from Renton's jacket as the store Detective closes in.\nRenton looks at Diane.\n\n---------\n\nEXT. STREET. DAY\n\nRenton and Spud are running, pursued by the Two Store Detectives.\n                                   RENTON\n                                    (v.o)\nNor did I. Our only response was to keep on going and fuck everything. Pile\nmisery upon misery, heap it up on a spoon and dissolve it with a drop of\nbile, then squirt it into a stinking purulent vein and do it all over again.\nKeep on going: getting up, going out, robbing, stealing, fucking people\nover, propelling ourselves with longing towards the day it would all go\nwrong. As seen in the opening scene, Renton is nearly hit by a car that\nscreeches to a halt as he crosses a road.\nHe looks at the driver, at Spud running away and the Store Detectives\napproaching.\n                                    (v.o)\nBecause no matter how much you stash or how much you steal, you never have\nenough. No matter how often you go out and rob and fuck people over you\nalways need to get up and do it all again. Renton smiles and waits.\n                                    (v.o)\nSooner or later, this sort of thing was bound to happen. One of the\nDetectives runs straight past him, after Spud.\nThe other Detective crashes into Renton with a mighty punch in the stomach.\n\nINT. COURT. DAY\n\nSpud and Renton stand in the dock. Renton's Mother and Father, Sick Boy,\nBegbie, and Spud's Mother (Mrs. Murphy) are among those in the gallery.\nThe Sheriff delivers his sentence.\n                                   SHERIFF\n\n     ...because shoplifting is theft, which is a crime, and, despite\n     what you may believe, there is no such entity as victimless crime.\n     Heroin addiction may explain your actions, but it does not excuse\n     them. Mr Murphy, you are a habitual thief, devoid of regret or\n     remorse. In sentencing you to six months' imprisonment my only\n     worry is that it will not be long before we meet again. Mr Renton,\n     I understand that you have entered into a programme of\n     rehabilation in an attempt to wean yourself away from heroin. The\n     suspension of your sentence is conditional upon your continued\n     cooperation with this programme. Should you stand guilty before me\n     again, I shall not hesitate to impose a custodial sentence.\n\n                                   RENTON\n\n     Thank you, your honour. With God's help, I'll conquer this\n     affliction.\n\nThe Sheriff and Renton stare at one another for a moment. Renton turns to\nlook at Spud, then back towards the Sheriff, who is now leaving the court.\n                                    (v.o)\n\n     What can you say? Well, Begbie had a phrase for it.\n\nINT. PUB I. DAY\n\nThe pub is crowded. Around Renton are his mother, Father, Begbie, Sick Boy\nand Gav.\n                                   BEGBIE\n\n     It was fucking obvious that that cunt was going to fuck some cunt.\n\nThere is a round to nodding and 'poor Spud'ing. Everyone begins to talk at\nonce.\n                                   FATHER\n\n     I hope you've learned your lesson, son.\n\n                                   MOTHER\n\n     Oh, my son, I thought I was going to lose you there. You're\n     nothing but trouble to me, but I still love you.\n\n                                   BEGBIE\n\n     Clean up your act, sunshine. Cut that shite out for ever.\n\n                                   MOTHER\n\n     You listen to Francis, Mark, he's talking sense.\n\n                                   BEGBIE\n\nFucking right I am. See, inside, you wouldn't last two fucking days.\n\n                                  SICK BOY\n\nThere's better things that the needle, Rents. Choose life.\n\nHe winks.\n                                   MOTHER\n\nI remember when you were a baby, even when you would never do what you were\ntold.\n\n                                   BEGBIE\n\n     But he pulled it off, clever bastard, and he got a result.\n\nThey laugh, then fall silent.\nRenton turns around. Behind him stands Spud's mother.\n                                   RENTON\n\nMrs Murphy, I'm sorry about Spud. It's wasn't fair, him going down and not\nme --\n\nTears in her eyes, Mrs Murphy turns and walks away.\nRenton watches her go. Behind him Begbie shouts.\n                                   BEGBIE\n\n     It's no our fault. Your boy went down because he was fucking\n     smack-head and if that's not your fault, I don't know what is.\n\nBegbie turns back to Renton.\n\n     Right. I'll get the drinks in.\n\nHe moves towards the bar.\nRenton slips away.\nRenton walks through the bar towards the toilets, then out of a back door.\n\nEXT. YARD. DAY\n\nRenton emerges into a narrow yard surrounded by a high wall. He looks\naround. The steel back gate is locked.\n                                   RENTON\n                                    (v.o)\n\n     I wished I had gone down instead of Spud. Here I was surrounded by\n     my family and my so-called mates and I've never felt so alone,\n     never in all my puff. Since I was on remand they've had me on this\n     programme, the state-sponsored addiction, three sickly sweet doses\n     of methadone a day instead of smack. But it's never enough, and at\n     the moment it's nowhere near enough. I took all three this morning\n     and now I've got eighteen hours to go till my next shot and a\n     sweat on my back like a layer of frost. I need to visit the mother\n     superior for one hit, one fucking hit to get us over this long,\n     hard day.\n\nRenton climbs the wall. He stands on top, then dives off the other side,\nexecuting a somersault in mid-air.\n\nINT. SWANNEY'S FLAT. NIGHT\n\nSwanney is cooking up. Renton lands on the floor behind him like a gymnast.\n                                   RENTON\n\n     What's on the menu this evening?\n\n                                   SWANNEY\n\n     Your favourite dish.\n\n                                   RENTON\n\n     Excellent.\n\n                                   SWANNEY\n\n     Your usual table, sir?\n\n                                   RENTON\n\n     Why, thank you.\n\nRenton sits on his usual cushion on the floor.\n                                   SWANNEY\n\n     And would sir care to settle his bill in advance?\n\n                                   RENTON\n\n     Stick it on my tab.\n\n                                   SWANNEY\n\n     Regret to inform, sir, that your credit limit was reached and\n     breached a long time ago.\n\n                                   RENTON\n\n     In that case --\n\nHe produces twenty pounds.\n                                   SWANNEY\n\n     Oh, hard currency, why, sir, that'll do nicely.\n\nHe swipes the notes underneath a UV forgery checker.\n\n     Can't be too careful when we're dealing with your type, can we?\n\nRenton begins his search for a vein.\n\n     Would sir care for a starter? Some garlic bread perhaps?\n\n                                   RENTON\n\n     No, thank you. I'll proceed directly to the intravenous injection\n     of hard drugs, please.\n\n                                   SWANNEY\n\n     As you wish.\n\nHe hands Renton the syringe. Renton inject, then lies back on the dirty,\nred, carpeted floor. He lies completely still. His pupils shrink. His\nbreathing becomes slow, shallow and intermittent. He sinks into the floor\nuntil he is lying in a coffin-shaped and coffin-sized pit, lined by the red\ncarpet. Swanney stands over him.\n                                   SWANNEY\n\n     Perhaps sir would like me to call for a taxi?\n\nAn ambulance siren becomes faintly audible.\n\nINT. SWANNEY'S STAIRWELL. NIGHT\n\nThe siren is a little louder. Swanney holds Renton under his arms and drags\nhim backwards down the steps.\n\nEXT. STREET. NIGHT\n\nAs Swanney emerges, still dragging Renton, the siren grows louder and then\nan ambulance speeds by without stopping. Swanney drags Renton across the\npavement and into the open door of a waiting taxi. Swanney then steps out of\nthe taxi's other door, pausing only to tuck a ten-pound note into Renton's\npocket before closing the door.\n\nINT. TAXI. NIGHT\n\nRenton lies on the floor of the taxi, as Swanney left him, rolling slightly\nas the taxi takes a corner.\n\nEXT. HOSPITAL/TAXI. NIGHT\n\nThe taxi is stationary. We do not see the driver's face but his hand opens\nthe door and then drags Renton out on to the pavement by his ankles before\ntaking the ten pound note, getting back in the cab and driving away. Renton\nlies on the pavement. Two Porters life him by arms and ankles on to a\ntrolley. We do not see the Porters's faces as they wheel Renton into the\nhospital.\n\nINT. HOSPITAL ACCIDENT AND EMERGENCY DEPARTMENT. NIGHT\n\nRenton is wheeled through the department, then into a bay surrounded by a\nwhite nylon curtain.\n\nINT. TROLLEY BAY. NIGHT\n\nThe Porters lift Renton from one trolley on to another, then leave him alone\nin the bay surrounded by the curtain. Renton lies alone. His breathing is\nstill shallow and erratic. Around him is the usual accident and emergency\nparaphernalia: blood pressure machine, oxygen tap, bandages, etc. A Doctor\ncomes in and gives Renton an injection, then leaves.\n                                   DOCTOR\n\n     Wake up. Wake up.\n\nRenton breathes more easily.\n\n---------\n\nThe Two Porters return with another trolley. They lift Renton roughly on to\nit and wheel him away.\n\nINT. HOSPITAL CORRIDOR. NIGHT\n\nThe Porters wheel Renton along.\n\nINT. WARD. NIGHT\n\nThe Porters lift Renton off the trolley and dump him on the bed. A nurse\nsticks a thermometer in his mouth.\n\nINT. WARD. DAY\n\nRenton's Father and Mother lift Renton, now fully conscious, off the bed and\ndump him in a wheelchair.\n\nINT. HOSPITAL CORRIDOR. DAY\n\nMother walks ahead. Behind her, Father pushes Renton in the wheelchair.\n\n---------\n\nINT. TAXI. DAY\n\nMother and Father sit on either side of Renton.\n\nINT. RENTON'S BEDROOM. DAY\n\nFather shoves Renton on to the bed, then walks out past Mother, who looks at\nRenton for a moment before closing the door.\n\nINT. OTHER SIDE OF RENTON'S BEDROOM DOOR. DAY\n\nRenton's Father's hand slides three bolts across to lock the door.\n\nINT. RENTON'S BEDROOM. DAY\n\nRenton lies on the bed.\n                                   RENTON\n                                    (v.o)\n\n     I don't feel the sickness yet, but it's in the post, that's for\n     sure. I'm in the junky limbo at the moment, too ill to sleep, too\n     tired to stay awake, but the sickness is on its way. Sweat,\n     chills, nausea, pain and craving. Need like nothing else I have\n     ever known will soon take hold of me. It's on the way.\n\nThe door opens. Renton's Mother walks in with a bowl of soup and a piece of\nbread. Father watches from the doorway.\n                                   MOTHER\n\n     We'll help you, son. You'll stay with us until you get better.\n     We'll beat this together.\n\n                                   RENTON\n\n     Maybe I could go back to the clinic.\n\n                                   MOTHER\n\n     No. No clinics, no methadone. That made you worse, you said so\n     yourself. You lied to us, son, your own mother and father.\n\n                                   RENTON\n\n     At least get us some Tempazepam.\n\n                                   MOTHER\n\n     No, you're worse coming off that than you are with heroin. Nothing\n     at all.\n\n                                   FATHER\n\n     It's a clean break this time.\n\n                                   MOTHER\n\n     You're staying where we can keep an eye on you.\n\n                                   RENTON\n\n     I do appreciate what you're trying to do, I really do, but I need\n     just one score, to ease myself off it. Just one. Just one.\n\nMother retreats past Father, who closes the door. The bolts go home again.\nRenton lies back and closes his eyes. His forehead is damp with sweat. He\nbegins to shake. He tosses and turns, becoming wrapped up in a swathe of\nblankets. As he unravels them, he is astonished to find a fully clothed\nBegbie in the bed with him.\n                                   BEGBIE\n\n     Well, this is a good laugh, you fucking useless bastard. Go on,\n     sweat that shite out of your system, because if I come back and\n     it's still there, I'll fucking kick it out.\n\nBegbie laughs and covers himself up. Renton rips away the blankets, but\nBegbie has gone. Renton looks up. Baby Dawn is crawling across the ceiling.\nRenton looks down to see Diane sitting on the end of the bed. Diane sings\n'Temptation' by New Order.\n                                    DIANE\n\n     'Oh, you've got green eyes, oh, you've got red eyes, and I've\n     never met anyone quite like you before.'\n\nRenton looks back up. Dawn continues her slow crawl, leaving behind a thick\nrail of unidentifiable slime. Renton looks down. Sick Boy sits on the end of\nthe bed, holding a cup of tea and a chocolate biscuit. Mother stands behind\nhim.\n                                  SICK BOY\n\n     It's a mug's game, Mrs Renton. I'm not saying I was blameless\n     myself, far from it, but there comes a time when you have to turn\n     your back on that nonsense and just say no.\n\nSick Boy takes a bit of his biscuit. Dawn crawls on. She has fangs now. Spud\nsits on the end of the bed, in a caricature prison uniform with arrows on\nit, plus a ball and chain. Dawn has claws as well. Tommy sits on the end of\nthe bed. He looks terrible.\n                                    TOMMY\n\n     Better than sex, Rents, better than sex. The ultimate hit. I'm a\n     fucking adult. I'll find out for myself. Well, I've found out all\n     right.\n\nRenton looks up again just as the baby drops on to his face. He tears her\noff and throws her into a corner. Renton's Mother and Father are washing\nhim. Mother bends down and picks up the large, damp sponge from the corner,\nwhere it landed. She wipes her son's face with it.\n                                   FATHER\n\n     Mark, there's something you need to do.\n\n---------\n\nINT. CONSULTING ROOM. DAY\n\nA Doctor stands up as Renton enters.\n                                   DOCTOR\n\n     Come in. Sit down, please.\n\nThey both sit down.\n\n     Well, you've already spoken to one of our counsellors, but before\n     we go on there're just a few questions I'd like to ask you.\n\n---------\n\nINT. RENTON FAMILY HOME, LIVING-ROOM. DAY\n\nRenton, his mother and Father sit watching television.\n\nINT. STUDIO. DAY\n\nRenton is sitting inside a plastic booth shaped like a giant syringe. The\nDoctor, now dressed as a game-show host, stands in front, with Renton's\nMother and Father beside him.\n                                   DOCTOR\n\n     Question number one: the human immunodeficiency virus is a - what?\n\n                                   FATHER\n\n     Retrovirus?\n\n                                   DOCTOR\n\n     Retrovirus is the correct answer.\n\nFanfare.\n\n     Question number two: HIV binds to which receptor on the host\n     lymphocyte? Which Receptor?\n\nMother and Father confer.\n                                   FATHER\n\n     CD4.\n\n                                   DOCTOR\n\n     CD4 receptor is the correct answer.\n\nFanfare.\n\n     And now, question number three: is he guilty or not guilty?\n\n                                   MOTHER\n\n     He's our son.\n\n                                   DOCTOR\n\n     Is the correct answer.\n\nFanfare.\n\n     And now it's time to 'Take the Test'.\n\nLights flash. Music. A garish Hostess walks on with two envelopes. She holds\nthem out for Mother to choose one.\n\nINT. CONSULTING ROOM. DAY\n\nThe Doctor watches in silence as the Hostess, now dressed as a medical\ntechnician, draws blood from Renton's arm and puts it into a tube. She marks\nthe tube with a pre-printed, numbered label.\n\nINT. STUDIO. DAY\n\nMother opens one of the envelopes. She is speechless with joy. The plastic\nbooth opens up. Lights flash again, etc. Renton steps out.\n\nINT. SOCIAL CLUB. NIGHT\n\nRenton, his Mother and Father sit at a table in the local social club. It is\na Saturday night and the club is busy. Everyone sits in rapt silence. It is\nnot initially clear what is going on. Near the bar a Caller with a\nmicrophone calls over the PA - Two and four,\ntwenty-four...seven...fifteen...clickety-click, sixty-six - And so on, as he\ndraws the numbers from the drum. Everyone studies their cards, except\nRenton, who studies the people instead, his drink untouched. The\nnumber-calling continues until suddenly interrupted by Mother's voice.\n                                   MOTHER\nMark...Mark, you've got a house. House! House! For goodness's sake, Mark.\nThey bustle around him and pass his card to the front.\n                                   RENTON\n                                    (v.o)\n\n     It seems, however, that I really am the luckiest guy in the world.\n     Several years of addiction right in the middle of an epidemic,\n     surrounded by the living dead, but not me -- I'm negative. It's\n     official. And once the pain goes away, that's when the real battle\n     starts. Depression. Boredom. You feel so fucking low, you'll want\n     to fucking top yourself.\n\nHis mother counts a wad of money in front of him.\n\nEXT. HOUSING ESTATE. DAY\n\nOn the door of a flat 'plaguer', 'HIV', and 'junky AIDS scum' are daubed on\nthe walls. The sound of a ball being regularly bounced against a wall can be\nheard.\n\nINT. TOMMY'S FLAT. NIGHT\n\nIt is poorly furnished. Tommy is seated. Renton has the football, which he\nkicks against the wall and catches, then drops and kicks again, and so on.\nThe ball is slightly flat.\n                                   RENTON\n\n     Are you getting out much?\n\n                                    TOMMY\n\n     No.\n\n                                   RENTON\n\n     Following the game at all?\n\n                                    TOMMY\n\n     No.\n\n                                   RENTON\n\n     No. Me Neither.\n\nRenton drops the ball. It rolls to a halt in the corner. He sits down.\n                                    TOMMY\n\n     You take the test?\n\n                                   RENTON\n\n     Aye.\n\n                                    TOMMY\n\n     Clear?\n\n                                   RENTON\n\n     Aye.\n\n                                    TOMMY\n\n     That's nice.\n\n                                   RENTON\n\n     I'm sorry, Tommy.\n\n                                    TOMMY\n\n     Have you got any gear on you?\n\n                                   RENTON\n\n     No, I'm clean.\n\n                                    TOMMY\n\n     Well, sub us, then, mate. I'm expecting a rent cheque.\n\nRenton produces some of his bingo win. As he hands the notes over, their\neyes and hands meet for a moment. Tommy puts the money away.\n                                    TOMMY\n                                 (continued)\n\n     Thanks, Mark.\n\n                                   RENTON\n\n     No problem.\n\n                                    (v.o)\n\n     No problem -- easy to say when its some other poor cunt with shite\n     for blood.\n\n---------\n\nINT. HOSPITAL. NIGHT\n\nRenton walks along a corridor and into a ward.\n\nINT. WARD. DAY\n\nSheets cover the lower half of Swanney in bed. They are thrown back to\nreveal the stump of an above-knee amputation.\n                                   SWANNEY\n\n     Surprise! Pa-pah!\n\nRenton sits down and takes it in silence.\n\n     Hit the artery by mistake. Common enough error, or so the quack\n     tells us, as though that's going to make my leg grown back. Still,\n     it could have been worse, it could have been my fucking dick. And\n     I tell you what, in this place you get looked after: clean sheets,\n     regular meals and all the morphine you can eat.\n\n                                   RENTON\n\n     Great.\n\n                                   SWANNEY\n\n     And see when I get out of here. I've got plans. Going to get\n     myself straightened out and head off to Thailand, where women\n     really know how to treat a guy. See, out there you can live like a\n     king if you've got white skin and a few crisp tenners in your\n     pocket. No fucking problem.\n\n                                   RENTON\n\n     Sure.\n\n                                   SWANNEY\n\n     The strategy is this: get clean, get mobile, get into dealing, and\n     this time next year I'll be watching the rising sun with a posse\n     of oriental buttocks parked on my coupon.\n\n                                   RENTON\n\n     Sounds great, Swanney.\n\n                                   SWANNEY\n\n     Yeah.\n\n                                   RENTON\n\n     You'll have to send us a postcard.\n\n                                   SWANNEY\nSure will, pal, sure will.\n\nEXT. PARK. DAY\n\nRenton and Sick Boy are seated in their firing patch, sitting on plastic\nbags with beer, vodka, hash and the cassette player. The airgun is present\nas before, but they are not making any use of it.\n                                  SICK BOY\nEughh. Sounds horrible.\n                                   RENTON\nIt wasn't that bad.\n                                  SICK BOY\nDid he -- you know?\n                                   RENTON\nWhat?\n                                  SICK BOY\nYou know.\n                                   RENTON\nNo, he didn't make me touch it.\n                                  SICK BOY\nOh no, don't even mention it.\n                                   RENTON\nHe made me lick it.\n                                  SICK BOY\nGod, you're sick.\n                                   RENTON\n\n     And I got a stitch stuck between my teeth, jerked my head back and\n     the whole fucking stump fell off.\n\n                                  SICK BOY\n\n     Cut it out.\n\n                                   RENTON\n\n     When are you going to visit him?\n\n                                  SICK BOY\n\n     Don't know. Maybe Thursday.\n\n                                   RENTON\n\n     You're a real mate. And what about Tommy? Have you been to see him\n     yet?\n\nSick Boy is silent. He stiffens as he avoids Renton's gaze. They shift\nfractionally apart. RENTON tuts.\n                                  SICK BOY\n\n     Fuck you. OK, so Tommy's got the virus. Bad news, big deal. The\n     gig goes on, or hadn't you noticed? Swanney fucks his leg up.\n     Well, tough shit, but it could have been worse.\n\n                                   RENTON\n\n     You're all hear.\n\n                                  SICK BOY\n\n     I know a couple of addicts. Stupid wee lassies. I feed them what\n     they need. A little bit of skag to keep them happy while the\n     punters line up at a fiver a skull. It's easy money for me. Not\n     exactly a fortune, but I'm thinking, 'I should be coining it\n     here.' Less whores, more skag. Swanney's right. Get clean, get\n     into dealing, that's where the future lies. Set up some contacts,\n     get a good load of skag, punt it, profit. What do you think?\n\n                                   RENTON\n\n     Fuck you.\n\n                                  SICK BOY\n\n     And I'll tell you why. Because I'm fed up to my back teeth with\n     losers, no-hopers, draftpacks, schemies, junkies and the like. I'm\n     getting on with life. What are you doing?\n\n---------\n\nINT. RENTON'S BEDSIT. NIGHT\n\nRenton sits alone on the bed, making a joint and reading a book. There is a\nknock at the door. Renton answers the door.\n                                   RENTON\n\n     What do you want?\n\n                                    DIANE\n\n     Are you clean?\n\n                                   RENTON\n\n     Yes.\n\n                                    DIANE\n\n     Is that a promise, then?\n\n                                   RENTON\n\n     Yes, as a matter of fact, it is.\n\n                                    DIANE\n\n     Calm down, I'm just asking. Is that hash I can smell?\n\n                                   RENTON\n\n     No.\n\n                                    DIANE\n\n     I wouldn't mind a bit, if it is.\n\n                                   RENTON\n\n     Well, it isn't.\n\n                                    DIANE\n\n     Smells like it.\n\n                                   RENTON\n\n     You're too young.\n\n                                    DIANE\n\n     Too young for what?\n\nRenton looks in each direction along the empty passageway.\n\nINT. RENTON'S BEDSIT. NIGHT\n\nRenton and Diane are lying in the bed. Diane, wearing one of Renton's\nT-shirts, is rolling a mega-joint, quite unaware of the scrutiny of Renton.\n                                    DIANE\n\n     You're not getting any younger, Mark. The world is changing, music\n     is changing, even drugs are changing. You can't stay in here all\n     day dreaming about heroin and Ziggy Pop.\n\n                                   RENTON\n\n     It's Iggy Pop.\n\n                                    DIANE\n\n     Whatever. I mean, the guy's dead anyway.\n\n                                   RENTON\n\n     Iggy Pop is not dead. He toured last year. Tommy went to see him.\n\n                                    DIANE\n\n     The point is, you've got to find something new.\n\nDiane completes the joint.\n                                   RENTON\n                                    (v.o)\n\n     She was right. I had to find something new. There was only one\n     thing for it.\n\nEXT. LONDON. DAY\n\nAs contemporary retake of all those 'Swinging London' montages: Red\nRoutemaster/Trafalgar Square/Big Ben/Royalty/City gents in suits/Chelsea\nladies/fashion victims/Piccadilly Circus at night. Incut with close-ups of\nclassic street names on a street map (all the ones made famous by Monopoly.\n\nINT. ESTATE AGENT'S OFFICE. DAY\n\nThe montage ends on one street, then draws back to reveal the whole map of\nLondon pinned to a wall. A Man holding a telephone walks in front of the\nmape and belches loudly. Revealing more, he is in a scruffy, cramped office\nwith half a dozen occupied desks and twice as many telephones. Seated at the\none nearest to the belching Man is Renton. He is wearing a shirt and tie\nnow. He turns in response to the belch.\n                                     MAN\n\n     Can you take this call?\n\nRenton takes the telephone and reaches for a piece of paper from which he\nreads.\n                                   RENTON\n\n     Hello, yes, certainly. It's a beautifully converted Victorian town\n     house. Ideally located in a quiet road near to local shops and\n     transport.\n\nRenton checks his watch.\n\nEXT. THE AI IN NORTH LONDON. DAY\n\nRenton stands waiting beside this busy London road, outside some very\nunfortunate housing, as the traffic streams past.\n                                   RENTON\n                                    (v.o)\n\n     Two bedrooms and a kitchen/diner. Fully fitted in excellent\n     decorative order. Lots of storage space. All mod cons. Three\n     hundred and twenty pounds per week.\n\nA couple approach. Renton unlocks the door of a flat and holds the door open\nwhile he ushers them in.\n\nINT. LONDON FLAT. DAY\n\nRenton shows the Couple round a typical London flat nightmare. A poor\nconversion, poor decor, everything small and ill-fitting. The windows rattle\nas the traffic roars by.\n                                   RENTON\n                                    (v.o)\n\n     I settled in not too badly and I kept myself to myself. Sometimes,\n     of course, I thought about the guys, but mainly I didn't miss them\n     at all. After all, this was boom town where any fool could make\n     cash from chaos and plenty did. I quite enjoyed the sound of it\n     all. Profit, loss, margins, takeovers, lending, letting,\n     subletting, subdividing, cheating, scamming, fragmenting, breaking\n     away. There was no such thing as society and even if there was, I\n     most certainly had nothing to do with it. For the first time in my\n     adult life I was almost content.\n\nINT. LONDON BEDSIT. NIGHT\n\nRenton finishes eating a pot noodle. He puts it down and picks up a letter.\nHe lies back and reads. Intercut with:\n\nINT. SCHOOLROOM. DAY\n\nA class is in progress. A teacher lectures to a mixed class, but Diane is\nnot listening as she is writing.\n\nEXT. SCHOOL. DAY\n\nDiane is leaving the school when Sick Boy catches up with her. They stop and\nthen she walks away.\n\nEXT. PARK. DAY\n\nDiane walks along a concrete path. As she does so she has to step over Spud,\nwho lies asleep/unconscious beside the remains of a carry out.\n                                    DIANE\n                                    (v.o)\n\n     Dear Mark, I'm glad you've found a job and somewhere to live.\n     School is fine at the moment. I'm not pregnant but thanks for\n     asking. Your friend Sick Boy asked me last week if I would like to\n     work for him but I told him where to go. I met Spud, who sends his\n     regards, or at least I think that's what he said. No one has seen\n     Tommy for ages. And finally, Fracis Begbie has been on television\n     a lot this week. --\n\nINT. LONDON BEDSIT. NIGHT\n\nRenton turns the page.\n                                    DIANE\n                                    (v.o)\n\n     as he is wanted by the police in connection with an armed robbery\n     in a jeweller's in Corstorphine. Take care. Yours with love,\n     Diane.\n\nThere is a buzz at the door. Renton re-examines the letter. There is another\nbuzz.\n                                   RENTON\n\n     Oh no.\n\nINT. HALLWAY OUTSIDE BEDSIT. NIGHT\n\nRenton opens the door to an unseen figure. It is Begbie.\n\nINT. BEDSIT. NIGHT\n\nRenton sits on the bed. Begbie stands over him, pointing a gun at his head.\nHe pulls the trigger. It clicks harmlessly.\n                                   BEGBIE\n\n     Armed robbery? With a replica? How can it be armed robbery? It's a\n     fucking scandal.\n\nHe 'fires' the gun a few more times at his own head, then chucks it to the\nfloor.\n\n     And the haul. Look.\n\nHe digs a few rings out of his pocket and throws them to Renton.\n\n     Solid silver, my arse. I took it to a fence -- it's trash, pure\n     trash. There's young couples investing all their hopes in that\n     stuff, and what are they getting?\n\n                                   RENTON\n\n     It's a scandal, Franco.\n\n                                   BEGBIE\n\n     Too right it is. Now look, have you got anything to eat, 'cos I'm\n     fucking Lee Marvin, by the way.\n\nINT. BEDSIT. DAY\n\nBegbie is sitting on the bed in his underwear, eating cereal while watching\ntelevision. A small carry-out is nearby. Renton finishes dressing for work.\nHe pauses at the open door, looking back towards his guest.\n                                   RENTON\n                                    (v.o)\n\n     Begbie settled in in no time at all.\n\nBegbie opens a can of beer. Renton closes the door.\n\nINT. HALLWAY OUTSIDE BEDSIT. DAY\n\nRenton closes his door. He is about to walk away when he heard Begbie\nshouting.\n                                   BEGBIE\n                              (from the bedsit)\n\n     Rents, Rents, come fucking back here.\n\nRenton opens the door. Begbie is holding out an empty packet of cigarettes.\n\n     Look.\n\n                                   RENTON\n\n     What?\n\n                                   BEGBIE\n\n     I've no fucking cigarettes.\n\nBegbie throws the packet down to the floor. It lands near the door. He has\nturned back to the television and takes a swig of beer.\n                                   RENTON\n\n     Right.\n\nRenton closes the door again.\n\nINT. BEDSIT. NIGHT\n\nRenton and Begbie lie in the single bed with their heads at opposite ends.\nBegbie snores. Renton is wide awake, with a pair of smelly- socked feet only\ninches from his nose.\n                                   RENTON\n                                    (v.o)\n\n     Yeah, the guy's a psycho, but it's true, he's a mate as well, so\n     what can you do?\n\nINT. LONDON BEDSIT. DAY\n\nWhere the first empty packet of cigarettes fell to the floor there is now a\nlarge heap of empty packets: the product of weeks at sixty a day. Another\none lands on the pile. Begbie, still in his underwear, still can in hand,\nsits watchig the racing as before. Behind his, cigarettes and alcohol are\nstacked up like a miniature duty-free warehouse. Renton sits behind him,\nreading a book.\n                                   BEGBIE\n\n     Hey, I'm wanting a bet put on.\n\n                                   RENTON\n\n     Can you not go yourself.\n\n                                   BEGBIE\n\n     I'm a fugitive from the law. I can't be seen on the fucking\n     streets. Now watch my lips. Kempton Park. Two-thirty. Five pounds\n     to win. Bad Boy.\n\nINT. HALLWAY OUTSIDE BEDSIT. DAY\n\nThe door opens, Renton walks out, the door closes and Renton walks away. A\nwild, frightening scream erupts from beyond the door.\n\nINT. LONDON BEDSIT. DAY\n\nBegbie, alone in the bedsit, is screaming a cry of primal joy.\n                                   RENTON\n                                    (v.o)\n\n     Bad Bot came in at 16 to 1. And with the winnings, we went out to\n     celebrate.\n\nINT. LONDON PARTY. NIGHT\n\nTo loud music and strobing, fractured lights, surrounded by dry ice, Begbie\ndances near a tall woman. Other people dance nearby. Begbie gives the thumbs\nup to Renton, who sits on a stool at one side drinking from a bottle of\nbeer. Begbie and the Woman walk away. Renton looks around the club at the\nvarious men and women.\n                                   RENTON\n                                    (v.o)\n\n     Diane was right. The world is changing, music is changin, drugs\n     are changing, even men and women are changing. One thousand years\n     from now there'll be no guys and no girls, just wankers. Sounds\n     great to me. It's just a pity that no one told Begbie.\n\nEXT. STREET. NIGHT\n\nA car sits in a street near the club, windows steamed up.\n\nINT. CAR. NIGHT\n\nBegbie and the Woman embrace passionately. The Woman undoes Begbie's\ntrousers.\n\nINT. PARTY. NIGHT\n\nRenton's gaze continues to wander around.\n                                   RENTON\n                                    (v.o)\n\n     You see, if you ask me, we're heterosexual by default, not be\n     decision. It's just a question of who you fancy.\n\nINT. CAR. NIGHT\n\nBegbie and the Woman continue their embrace as she unbuttons his shirt.\n                                   RENTON\n                                    (v.o)\n\n     It's all about aesthetics and it's fuck all to do with morality.\n\nSuddenly Bedbie freezes. He is holding the 'Woman's' groin. There is\nsomething there that shouldn't be. Begbie goes crazy, simultaneously trying\nto put his clothes back on, hit the Woman and get out of the car.\n\nEXT. STREET. NIGHT\n\nBegbie stumbles away from the car, pulling up his trousers as he goes.\n                                   RENTON\n                                    (v.o)\n\n     But you try telling Begbie that.\n\nINT. BEDSIT. NIGHT\n\nBegbie sits on the bed. Renton is sitting on the floor watching.\n                                   BEGBIE\n\n     I'm no a fucking buftie and that's the end of it.\n\n                                   RENTON\n\n     Let's face it, it could have been wonderful.\n\nBegbie leaps off the bed, grabs Renton and head-butts him, then holds him by\nthe lapel.\n                                   BEGBIE\n\n     Now, listen to me, you little piece of junky shit. A joke's a\n     fucking joke, but you mention that again and I'll cut you up.\n     Understand?\n\nBegbie produces his knife. There is a knock on the door. They do not move.\nThere is another knock.\n\nINT. BEDSIT. NIGHT\n\nBegbie lies sleeping on the bed. There are now two sets of feet by his head,\none on each side. At the other end lie Renton (awake) and Sick Boy (asleep).\n                                   RENTON\n                                    (v.o)\n\n     Since I last saw him, Sick Boy had reinvented himself as a pimp\n     and a pusher and was here to mix business and pleasure, setting up\n     'contacts', as he constantly informed me, for the great skag deal\n     that was one day going to make him rich.\n\n----------\n\nINT. ESTATE AGENT'S OFFICE. DAY\n\nRenton sits at his desk, haggard and tired. Other people bustle around him.\nTelephones ring, etc... In the background the Man (who belched) is trying to\npromote a flat down the telephone.\n                                     MAN\n\n     Beautifully converted Victorian town house. Ideally located in a\n     quiet road near to local shops and transport. Two bedrooms and a\n     kitchen/diner. Fully fitted in excellent decorative order. Lots of\n     storage space. All mod cons. Three hundred and twenty pounds a\n     week.\n\n----------\n\nINT. BEDSIT. NIGHT\n\nRenton (still dressed for work), Begbie and Sick Boy sit in a line on the\nbed with fish suppers laid out on their laps, but Renton's is untouched.\n                                  SICK BOY\n\n     Good chips.\n\n                                   RENTON\n\n     I can't believe you did that.\n\n                                  SICK BOY\n\n     I got a good price for it. Rents, I need the money.\n\n                                   RENTON\n\n     It was my fucking television.\n\n                                  SICK BOY\n\n     Well, Christ, if I'd known you were going to get so humpty about\n     it, I wouldn't have bothered. Are you going to eat that?\n\nHe takes Renton's fish supper and adds it to his own.\n\n     Have you got a passport?\n\n                                   RENTON\n\n     Why?\n\n                                  SICK BOY\n\n     Well, this guy I've met runs a hotel. Brother. Loads of contacts.\n     Does a nice little sideline in punting British passports to\n     foreigners. Get you a good price.\n\n                                   RENTON\n\n     Why would I want to sell my passport?\n\n                                  SICK BOY\n\n     It was just an idea.\n\nINT. LEFT LUGGAGE ROOM. DAY\n\nRenton drops his passport into an envelope and throws the envelope into a\nlocker. He turns the key and pockets it. RENTON (v.o)\n\n     I had to get rid of them. Sick Boy didn't do his drug deal and he\n     didn't get rich. Instead, he and Begbie just hung around my bedsit\n     looking for things to steal. I decided to put them in the worst\n     place in the world.\n\nEXT. BUSY LONDON ROAD. DAY\n\nTraffic floods past as before.\n\nINT. LONDON FLAT. DAY\n\nInside the flat that Renton showed the couple around. Sick Boy and Begbie\nare standing in the hallway. Renton is in the open doorway. He throws them\nthe keys and leaves.\n\nINT. LONDON BEDSIT. NIGHT\n\nThe cramped bedsit is a mess, filled with litter and unwashed clothes.\nRenton lies on his bed, content to be alone.\n\nINT. LONDON FLAT. NIGHT\n\nThe flat is in darkness. The door opens a figure enters. It is the man from\nRenton's office.\n                                   RENTON\n                                    (v.o)\n\n     But, of course, they weren't paying any rent, so when my boss\n     found two desperate suckers who would, Sick Boy and Begbie were\n     bound to feel threatened.\n\nMan is followed by another couple. He switches on a light.\n                                     MAN\n\n     As you can see, it's a beautiful conversion. Two bedrooms,\n     kitchen/diner. Fully fitted. Lots of storage. All mod cons. Three\n     hundred and twenty quid a week.\n\nFrom nowhere, Begbie and Sick Boy spring out at him.\n\n----------\n\nINT. BEDSIT. DAY\n\nRenton looks around the stripped, empty bedsit one last time before closing\nthe door as he leaves.\n\n----------\n\n                                   RENTON\n                                    (v.o)\n\n     And that was that. But by then we had another reason to go back.\n     Tommy.\n\nEXT. RAILWAY. DAY\n\nAn InterCity train speeds by.\n\nINT. TOMMY'S FLAT. NIGHT\n\nA kitten sits on the floor.\n                                     GAV\n                                    (v.o)\n\n     Tommy knew he had the virus, like, but never knew he'd gon\n     full-blown.\n\n                                   RENTON\n                                    (v.o)\n\n     What was it, pneumonia or cancer?\n\n                                     GAV\n                                    (v.o)\n\n     No, toxoplasmosis. Sort of like a stroke.\n\n                                   RENTON\n                                    (v.o)\n\n     Eh? How's that?\n\nINT. CREMATORIUM CHAPEL. DAY\n\nA service is in progress. Those present include Renton and Gav, who are\nengaged in hushed conversation, Begbie, Spud, Sick Boy, and Lizzy.\n                                     GAV\n\n     He wanted to see Lizzy again.\n\nHe indicated Lizzy. Lizzy wouldn't let him near the house. So he brought a\npresent for her, brought her a kitten.\n                                   RENTON\n\n     I bet Lizzy told him where to put it.\n\n                                     GAV\n\n     Exactly. I'm not wanting a cat, she says. Get to fuck, right. So\n     there's Tommy stuck with this kitten. You can imagine what\n     happened. The thing was neglected, pissing and shitting all over\n     the place. Tommy was lying around fucked out of his eyeballs on\n     smack or downers. He didn't know you could get toxoplasmosis from\n     cat shit.\n\n                                   RENTON\n\n     I didn't either. What the fuck is it?\n\nINT. TOMMY'S FLAT. DAY\n\nThe kitten as before. Slow track back to reveal more.\n                                     GAV\n                                    (v.o)\n\n     He starts getting headaches, so he just uses more smack, for the\n     pain, like. There he has a stroke. A fucking stroke. Just like\n     that. God home from hospital and died about three weeks later.\n     Been dead for ages before the neighbours complained about the\n     smell and the police broke the door down. Tommy was lying face\n     down in a pool of vomit.\n\nThe lower half of Tommy's clothed body is visible.\n\nINT. CREMATORIUM CHAPEL. DAY\n\nThe coffin travels away. Gav and Renton watch it go.\n                                     GAV\n\n     The kitten was fine.\n\nINT. PUB I. NIGHT\n\nGav, Renton, Spud, Sick Boy, Begbie and a few others are gathered in the\npub, still dressed in their funeral garb.\n\n----------\n\n                                    SPUD\n\n     Every time I think of Tommy I think of Australian, because every\n     time I went round he was just lying there, junked out of his mind,\n     watching Aussie soaps. Until he sold the telly, of course, then he\n     was just lying there. Buy every time I think of him, I still think\n     of Australia.\n\n----------\n\nThere is a short silence before Spud begins softly singing 'Two Little\nBoys'. He finishes unaccompanied.\n\nINT. SWANNEY'S FLAT. NIGHT\n\nSpud, Begbie, and Renton are seated. Sick Boy is handing around bottles of\nbeer before he too sits down. They are all wearing their funeral garb.\nRenton raises his bottle.\n                                   RENTON\n\n     Tommy.\n\nThey all drink.\n                                  SICK BOY\n\n     Did you tell him?\n\n                                   BEGBIE\n\n     No. On you go.\n\n                                   RENTON\n\n     What?\n\n                                  SICK BOY\n\n     There's a mate of swanney's. Mikey Forrester -- you know the guy.\n     He's come into some gear. A lot of gear.\n\n                                   RENTON\n\n     How much?\n\n                                  SICK BOY\n\n     About four kilos. So he tells me. Got drunk in a pub down by the\n     docks last week, where he met two Russian sailors. They're fucking\n     carrying the stuff. For sale there and then, like. So he wakes up\n     the next morning, realizes what he's done and get very fucking\n     nervous. Wants rid of this. {---------- He's looking for Swanney\n     to punt it, but Swanney's nowhere to be seen since he lost his\n     leg. ----------}\n\n                                   RENTON\n\n     So?\n\n                                  SICK BOY\n\n     So he met me and I offered to take it off his hands at a very\n     reasonable price, with the intention of punting it on myself to a\n     guy I know in London.\n\n                                   RENTON\n\n     So we've just come from Tommy's funeral and you're telling me\n     about a skag deal?\n\n                                   BEGBIE\n\n     Yeah.\n\nThere is silence.\n                                   RENTON\n\n     What was your price?\n\n                                  SICK BOY\n\n     Four Grand.\n\n                                   RENTON\n\n     But you don't have the money?\n\n                                  SICK BOY\n\n     We're two thousand short.\n\n                                   RENTON\n\n     That's tough.\n\n                                  SICK BOY\n\n     Come on, Mark, every cunt knows you've been saving up down in\n     London.\n\n                                   RENTON\n\n     Sorry, boys, I don't have two thousand pounds.\n\n                                   BEGBIE\n\n     Yes, you fucking do. I've seen your statement.\n\n                                   RENTON\n\n     Jesus.\n\n                                   BEGBIE\n\n     Two thousand, one hundred and thirty-three pounds.\n\n                                   RENTON\n\n     Four kilos. That's what -- Ten years' worth? Russian sailors?\n     Mikey Forrester? What the fuck are you on these days? You've been\n     to jail, Spud, so what's the deal -- like it so much you want to\n     go back again?\n\n                                    SPUD\n\n     I want the money, Mark, that's all.\n\n                                   BEGBIE\n\n     If everyone keeps their mouth shut, there'll be no one going to\n     jail.\n\n----------\n\nEXT. STREET. DAY\n\nRenton is visible first, apparently talking to himself, then Diane.\n                                   RENTON\n\n     It's so simple. We buy it at four grand, we punt it at twenty to\n     this guy that Sick Boy knows, and he punts it at sixty. Everyone's\n     happy, everyone's in profit. I put up two. I come away with six.\n\n                                    DIANE\n\n     Unless you get caught.\n\n                                   RENTON\n\n     So long as everyone keeps their mouths shut, we'll not be getting\n     caught.\n\n                                    DIANE\n\n     So why have you told me about it?\n\n                                   RENTON\n\n     Well, you're not going to tell anyone, are you, and besides, I\n     thought we could meet up afterwards, maybe go somewhere together.\n\n                                    DIANE\n\n     I've got a boyfriend, Mark.\n\n                                   RENTON\n\n     What? Steady like?\n\n                                    DIANE\n\n     That's right: 'going steady' for four weeks now.\n\n                                   RENTON\n\n     And what age are you? Thirteen? Fourteen?\n\n                                    DIANE\n\n     Sixteen next month.\n\n                                   RENTON\n\n     Happy birthday.\n\n                                    DIANE\n\n     What do you think -- I should be carrying a torch for you?\n\nRenton thinks it over.\n                                   RENTON\n\n     So, what's he like?\n\n                                    DIANE\n\n     Well, he's young and he's healthy.\n\nThey both laugh.\n\n     And you're such a deadbeat, Mark.\n\n----------\n\nINT. SWANNEY'S FLAT. DAY\n\nHeroin is in the process of being prepared for injection: heated, drawn up,\netc. An arm is prepared for injection: sleeve rolled up, tourniquet bound,\nveins tapped, etc. Mikey forrester, Sick Boy, Spud, and Begbie look on.\n                                   RENTON\n                                    (v.o)\n\n     I hadn't told anyone everything that was running through my mind\n     about what might happen in London. There were a lot of\n     possibilities I didn't want to talk to anyone about. Ideas best\n     kept to myself. What no one told me was that when we bought the\n     skag, some lucky punter would have to try it out. Begbie didn't\n     trust Spud and Sick Boy was too careful these days, so I rolled up\n     my sleeve and did what had to be done.\n\nRenton injects the heroin into a vein in his arm.\n                                   RENTON\nIt's good, it's fucking good.\n\n----------\n\nEXT. BUS STATION. NIGHT\n\nRenton walks past a Beggar huddling against a wall. The Beggar's sign reads:\n'FALKLANDS VETERAN. I LOST MY LEG FOR MY COUNTRY. PLEASE HELP.' The beggar\nis Swanney.\n\n----------\n\n                                   RENTON\n                                    (v.o)\n\n     Yes, that hit was good. I promised myself another one before I got\n     to London -- just for old time's sake, just to piss Begbie off.\n\nEXT. ROAD. NIGHT\n\nThe bus travels towards London.\n\nINT. BUS. NIGHT\n\nSick Boy dabs at amphetamine. Spud drinks.\n\nINT. BUS TOILET. NIGHT\n\nRenton cooks up in the bus toilet.\n                                   RENTON\n                                    (v.o)\n\n     This was to be my final hit. But let's be clear about this:\n     there's final hits and final hits. What kind was this to be?\n     {----------Some final hits are actually terminal one way or\n     another, while others are merely transit points as you travel from\n     station to station on the junky journey through junky life.\n     ----------}\n\nINT. BUS. NIGHT\n\nBegbie sits grimly. The others are relaxed.\n                                   RENTON\n                                    (v.o)\n\n     This was his nightmare. The dodgiest scam in a lifetime of dodgie\n     scams being perpetrated with three of the most useless and\n     unreliable fuck-ups in town. I knew what was going on in his mind:\n     any trouble in London and he would dump us immediately, one way or\n     another. He had to. If he got caught with a bagful of skag, on top\n     of that armed robbery shit, he was going down for fifteen to\n     twenty. Begbie was hard, but not so hard that he didn't shite it\n     off twenty years in Saughton.\n\n                                   BEGBIE\n\n     Did you bring the cards?\n\n                                  SICK BOY\n\n     What?\n\n                                   BEGBIE\n\n     The cards. The last thing I said to you was mind the cards.\n\n                                  SICK BOY\n\n     Well, I've not brought them.\n\n                                   BEGBIE\n\n     It's fucking boring after a while without the cards.\n\n                                  SICK BOY\n\n     Well, I've not brought them.\n\n                                   BEGBIE\n\n     It's fucking boring after a while without the cards.\n\n                                  SICK BOY\n\n     I'm sorry.\n\n                                   BEGBIE\n\n     Bit fucking late, like.\n\n                                  SICK BOY\n\n     Well, why didn't you bring them?\n\n                                   BEGBIE\n\n     Because I fucking told you to do that, you doss cunt.\n\n                                  SICK BOY\n\n     Christ.\n\nEXT. LONDON. DAY\n\nThe bus travels through London.\n\nEXT. STREET. DAY\n\nThe gang enter a cheap hotel. Begbie's bag contains the heroin.\n\nINT. HOTEL. DAY\n\nThey are met by Andreas, a man in his late thirties of Mediterranean\nappearance. He shakes Sick Boy's hand.\n                                   ANDREAS\n\n     These are your friends?\n\n                                  SICK BOY\n\n     These are the guys I told you about.\n\n                                   ANDREAS\n\n     OK.\n\n                                  SICK BOY\n\n     Is he here?\n\n                                   ANDREAS\n\n     Yes, he's here. I hope you didn't get followed or nothing.\n\n                                   BEGBIE\n\n     We didn't get followed.\n\nAndreas leads them along a corridor and into a room.\n\nINT. HOTEL ROOM. DAY\n\nAn exceptional Man is waiting. Andreas leaves the room and closes the door.\nThe Man opens both and tastes the heroin. He produces a set of kitchen\nscales from his bag and weighs the two bags.\n                                   RENTON\n                                    (v.o)\n\n     Straight away he clocked us from what we were: small-time wasters\n     with an accidental big deal.\n\n                                     MAN\n\n     So what do you want for it?\n\n                                   BEGBIE\n\n     Twenty thousand.\n\n                                     MAN\n\n     But it's not worth more than fifteen.\n\n                                   BEGBIE\n\n     Ninteen.\n\nThe man shakes his head and lights a cigarette.\n                                     MAN\n\n     Nineteen I can't offer you, I'm sorry.\n\n                                   RENTON\n                                    (v.o)\n\n     This was a real drag to him. He didn't need to negotiate. I mean,\n     what the fuck were we going to do if he didn't buy it? Sell it on\n     the streets. Fuck that.\n\nThe deal is done. The Man hands over the money and waits as it is counted,\nthen leaves with the drugs.\n                                    (v.o)\n\n     We settled on sixteen thousand pounds. He had a lot more in the\n     suitcase, but it was better than nothing. And just for a moment it\n     felt really great, like we were all in it together, like friends,\n     like it meant something. A moment like that, it can touch you deep\n     inside, but it doesn't last long, not like sixteen thousand\n     pounds.\n\nINT. LONDON PUB. DAY\n\nThe pub is crowded with afternoon drinkers. Renton, Spud, Sick Boy and\nBegbie sit drinking. Begbie is still keeping a firm hand on the sports bag,\nwhich now holds the money.\n                                  SICK BOY\n\n     So what are you planning with your share, Spud?\n\n                                   RENTON\n\n     Buy yourself that island in the sun?\n\n                                   BEGBIE\n\n     For four fucking grand? One plam tree, a couple of rocks, and a\n     sewage outflow.\n\n                                    SPUD\n\n     I don't know, maybe I'll buy something for my ma, and then buy\n     some good speed, no bicarb like, then get a girl, take her out\n     like, and treat her -- properly.\n\n                                   BEGBIE\n\n     Shag her senseless.\n\n                                    SPUD\n\n     No, I don't mean like that -- I mean something nice, like, that's\n     all --\n\n                                   BEGBIE\n\n     You daft cunt. If you're going to waste it like that, you might as\n     well leave it all to me. Now get the drinks in.\n\n                                  SICK BOY\n\n     I got a round already.\n\n                                    SPUD\n\n     I got the last one.\n\n                                   RENTON\n\n     It's your round Franco.\n\nBegbie stands up.\n                                   BEGBIE\n\n     OK. Same again?\n\n                                  SICK BOY\n\n     I'm off for a pish. When I come back, that money's still here, OK?\n\n                                   RENTON\n\n     The moment you turn your back, we're out that door.\n\nSick Boy walks away towards the toilet.\n                                  SICK BOY\n\n     I'll be right after you.\n\n                                   BEGBIE\n\n     You'll never catch us, you flabby bastard. Right, see, when I come\n     back --\n\n                                   RENTON\n\n     We'll be half-way down the road with the money.\n\n                                   BEGBIE\n\n     I'd fucking kill you.\n\n                                   RENTON\n\n     I guess you would, Franco.\n\nBegbie walks away to the bar. Spud and Renton look at each other and the bag\nof money.\n\n     Are you game for it?\n\nSpud looks at the bag and around the pub towards the toilet door and Begbie.\nBegbie stands at the bar, awaiting the pints.\n\n     Well?\n\n                                    SPUD\n\n     Are you serious?\n\nRenton looks around.\n                                   RENTON\n\n     I don't know. What do you think?\n\nSpud says nothing. Suddenly they are interrupted.\n                                  SICK BOY\n\n     Still here, I see.\n\nSick Boy sits down.\n                                   RENTON\n\n     Why not? I know I would. Where's Franco?\n\nRenton turns to see Begbie making his way through the crowd with the pints\nhelf precariously. As he reaches the table a Man standing with a group of\nfriends accidentally nudges Begbie, causing a pint to spill over him.\n                                   BEGBIE\n\n     For fuck's sake.\n\n                                     MAN\n\n     Sorry, mate, I'll get you another.\n\n                                   BEGBIE\n\n     All down my fucking front, you fucking idiot.\n\n                                     MAN\n\n     Look, I'm sorry, I didn't mean it.\n\n                                   BEGBIE\n\n     Sorry's no going to dry me off, you cunt.\n\n                                   RENTON\n\n     Cool down, Franco. The guy's sorry.\n\n                                   BEGBIE\n\n     Not sorry enough for being a fat cunt.\n\n                                     MAN\n\n     Fuck you. If you can't hold a pint, you shouldn't be in the pub,\n     mate. Now fuck off.\n\nBegie drops the remaining three pints. As the Man looks down to the falling\nglasses, Begbie punches him in the face and knees him in the groin. A fight\nbreaks out between the Man and Begbie. Sick Boy rushes forward to restrain\nBegbie. Renton sits still, not even looking at the fight or what follows.\nHis eyes are fixed on the bag while his hands fiddle. Begbie stabs Spud in\nthe hand.\n                                    SPUD\n\n     Jesus Christ.\n\n                                  SICK BOY\n\n     Good one, Franco.\n\n                                   BEGBIE\n\n     Shut you mouth or you'll be next.\n\n                                    SPUD\n\n     You've stabbed me, man.\n\n                                   BEGBIE\n\n     You were in my way.\n\nBegbie, blade still in hand, addresses the entire pub.\n\n     And anyone in my way gets it, fucking gets it. Everybody hear\n     that? Everybody happy?\n\nNobody says anything. Renton is seated as before, avoiding Begbie's gaze.\nBegbie addresses him.\n\n     Hey, Rent-boy, bring us down a smoke.\n\nRenton does not move.\n                                  SICK BOY\n\n     We'd better go, Franco.\n\n                                    SPUD\n\n     I've got to get to the hospital, man.\n\n                                   BEGBIE\n(to Spud)\n\n     You're not going to and fucking hospital.\n\n(to Sick Boy)\n\n     You're staying there.\n\n(to Renton)\n\n     And you bring me a fucking cigarette.\n\nRenton swivels and stands up.\n\n     And the bag.\n\nRenton lifts the bag and slowly approaches Begbie. Renton, nervous, hand\nshaking, pulls a packet of cigarettes from a pocket and holds it towards\nBegbie. Begbie does not move. Renton holds out the bag. Begbie takes it. Now\nRenton selects a cigarette and hands it over to Begbie. Begbie inhales\ndeeply and then blows the smoke towards Renton\n\nINT. HOTEL ROOM. DAY\n\nRenton lies awake, sharing a bed with Sick Boy, who is asleep. Spud and\nBegbie lie on the other, both asleep. Begbie has an arm draped over the bag,\nholding it close. Renton gets up and goes to the small bathroom. He puts the\nlight on above the mirror and looks at himself. He washes his face and\ndrinks a glass of water, then walks back to the bedroom. Renton pulls on his\njacket and shoes. He stands over Begbie, then reaches carefully down to life\nBegbie's arm up. As he does so he realizes that Spud is watching him. They\nsay nothing. Renton takes the bag. Begbie stirs but does not wake.\n\n----------\n\nRenton looks down at Spud for a moment before unzipping the bag. He pulls\nout a small wad of cash, which he hands to Spud. Spud tucks the wad away.\n\n----------\n\nRenton walks to the door and opens it. He nods to Spud, then disappears.\n\nINT. LOCKER. DAY\n\nEnvelope being removed.\n\nINT. LEFT LUGGAGE. DAY\n\nRenton takes the passport from the envelope.\n\nEXT. STREET. DAY\n\nRenton walks away.\n                                   RENTON\n                                    (v.o)\n\n     Now, I've justified this to myself in all sorts of ways: it wasn't\n     a big deal, just a minor betrayal, or we'd outgrown each other,\n     you know, that sort of thing, but let's face it, I ripped them\n     off. My so-called mayes. But Begbie, I couldn't give a shit about\n     him, and Sick Boy, well, he'd have done the same to me if only\n     he'd thought of it first, and Spud, well, OK, I felt sorry for\n     Spud -- he never hurt anybody.\n\nINT. HOTEL. DAY\n\nProstitutes, punters, Sick Boy and Spud line the corridor as two Policement\nwalk past towards:\n\nINT. HOTEL ROOM. DAY\n\nBegbie goes radge.\n\nEXT. STREET. DAY\n\n                                   RENTON\n                                    (v.o)\n\n     So why did I do it? I could offer a million answers, all false.\n     The truth is that I'm a bad person, but that's going to change,\n     I'm going to change. This is the last of this sort of thing. I'm\n     cleaning up and I'm moving on, going straight and choosing life.\n     I'm looking forward to it already. I'm going to be just like you:\n     the job, the family, the fucking big television, the washing\n     machine, the car, the compact disc and electrical tin opener, good\n     health, low cholesterol, dental insurance, mortgage, starter home,\n     leisurewear, luggage, three-piece suite, DIY, game shows, junk\n     food, children, walks in the park, nine to five, good at golf,\n     washing the car, choice of sweaters, family Christmas, indexed\n     pension, tax exemption, clearing the gutters, getting by, looking\n     ahead, to the day you die.\n\n                                   THE END\n\n\n\n\n\nTrainspotting\nWriters :   Irvine Welsh  John Hodge\nGenres :   Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:32.399920"}