{"title": "TRON", "film_link": "/Movie Scripts/TRON Script.html", "script_link": "/scripts/TRON.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>TRON Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"TRON Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (8.50 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Steven Lisberger\" title=\"Scripts by Steven Lisberger\">Steven Lisberger</a><br/>  <a href=\"/writer.php?w=Bonnie MacBird\" title=\"Scripts by Bonnie MacBird\">Bonnie MacBird</a><br/>  <a href=\"/writer.php?w=Charlie Haas\" title=\"Scripts by Charlie Haas\">Charlie Haas</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/>\n<b>Script Date</b> : April 1981<br/>\n<br/>\n<a href=\"/scripts/TRON.html\">Read \"TRON\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>T R O N </title>\n\n<pre>\n\nDigitized by Guy G. Gordon\nSpecial thanks to Bryan Duarte for the physical copy of the script\n\n<b>                                   T R O N\n</b>\n                         Based on the screenplay by\n\n                    Steven Lisberger and Bonnie MacBird\n\n                                  Prod. 0222\n\n                                                  Fourth Draft Screenplay by\n                                                  Charlie Haas\n                                                  April 6, 1981\n<b>         BLACKNESS\n</b>\n<b>    1    THE ELECTRONIC WORLD                                         1\n</b>\n         On one side of the screen, computer programming language is being\n         printed, and we HEAR the sound of an electronic keyboard. In the\n         center of the screen, glowing lines inscribe a rough computer\n         simulation of a figure, in response to the programming. Gradually\n         the figure is completed and refined, as we HEAR a resonant voice\n         speaking.\n\n<b>                               VOICE\n</b>                    As astonishing advances in computer\n                    science are made, artificial intelligence\n                    programs are being designed to assist\n                    us in every area of life...\n\n         We see that the completed form is man-like, heroic and muscular,\n         wearing a form of flexible armor. The face is calm, handsome and\n         intelligent. As the voice continues, the form becomes rounded by\n         the computer until it appears three dimensional and begins to rotate.\n\n<b>                               VOICE (CONT.)\n</b>                    In a world-wide network of electronics,\n                    they travel through miles of circuitry\n                    at the speed of light. We created them to\n                    calculate and research, to help us design\n                    and heal and think. With all that they can\n                    do, are they only electrical impulses...\n                    or are they a new form of life?\n\n         The figure is rotated completely around, and as it comes back to face\n         us, a glowing disk appears beside it; again in response to the\n         programming printed out at the side of the screen. The disk moves\n         towards the man-like figure and is rotated into position above it.\n         As the voice reaches the final word, the disk is slammed into place\n         on the back of the figure. There is an explosion of colored light,\n         a resounding crash of MUSIC and the title appears across the top of\n         the screen in huge letters.\n\n<b>                                    T R O N ! !\n</b>\n         The MUSIC CONTINUES as the glow fades and we SEE that the figure has\n         become real, a living being, although filled with glowing light, as\n         if it had an inner core of electricity.\n\n         The following is a SERIES OF QUICK CUTS in MONTAGE STYLE as the\n         OPENING TITLES ROLL. The montage takes place in two worlds, the\n         ELECTRONIC WORLD and the REAL WORLD.\n\n\n         The Electronic World is a mirror of our own, consisting of the\n         electronic information in our computers, television sets and\n         telecommunications network. It is peopled by computer programs,\n         data, and the characters from countless video games. For the first\n         time, we are seeing their world as it really is, rather than through\n         the window of television screens.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    2    CYCLE GAME                                                   2\n</b>\n         TWO OTHER ELECTRONIC FIGURES standing on a glowing grid against a\n         dark background. Each holds a bar between his fists, and as a BUZZER\n         SOUNDS, a glowing light cycle is inscribed around them, completely\n         encasing them.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    3    LONG SHOT                                                    3\n</b>\n\n         as the cycles take off. We see that each leaves a solidifying laser\n         trail behind it. One turns abruptly, creating a wall in front of the\n         other.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    4    REAL WORLD                                                   4\n</b>\n\n         Screen of a video game, the Real World version of light cycles,\n         as we see one of the lines smash into another and disappear.\n\n\n<b>    5    THE REAL WORLD                                               5\n</b>\n\n         We see teenagers, strangely lit from below with bluish light,\n         their hands on electronic controls, levers, knobs. We HEAR\n         electronic beeping and popping.\n\n\n<b>    6    ELECTRONIC WORLD                                             6\n</b>\n\n         Futuristic tanks bearing down on one another in a flat grid-like\n         landscape. One FIRES, and the other disappears when it is hit, to\n         reappear, spinning wildly, in the distance. We HEAR a sound\n         like a crack of lightning.\n\n\n<b>    7    REAL WORLD                                                   7\n</b>\n\n         A video game in an arcade. On the screen is a typical version of\n         Tank Wars with computer generated representations of tanks in a 2-D\n         maze.\n\n\n<b>    8/9  OMITTED                                                      8/9\n</b>\n\n<b>    10   ELECTRONIC WORLD                                             10\n</b>\n         Two other game warriors on the grid, this time throwing\n         glowing disks at one another like frisbees. We see the\n         one colored blue throw; his disk smashes into the second\n         warrior, and he dissolves into thousands of glowing lines.\n\n\n<b>    11   REAL WORLD                                                   11\n</b>\n\n         A video game called \"BERSERK,\" in which a human character'\n         throws a glowing dot at monsters in a maze; we see a quick\n         glimpse of the screen, then cut to a group of people staring\n         down, LAUGHING.\n\n<b>    12   OMITTED                                                      12\n</b>\n<b>    13   ELECTRONIC WORLD                                             13\n</b>\n\n         Another game in progress, from a LONG SHOT. A version of\n         Jai Alai, in which the two players stand suspended in space\n         on glowing colored rings, and throw a pellet of solid energy\n         at each other.\n\n<b>    14   ANGLE ON ONE OF THE WARRIORS                                 14\n</b>\n\n         He is huge, evil looking. His body is enormous, his head\n         mechanical. This is SARK. He glows ominously blue. He is catching\n         the pellet thrown from his opponent who is much smaller, glowing\n         yellow.\n\n\n<b>    15   CLOSE UP - FACE OF THE OPPONENT                              15\n</b>\n         fearful, nervous, poised on one ring.\n\n<b>    16   SARK                                                         16\n</b>\n         sneering, as he uses his electronic cesta to hurl the pellet\n         back with violent force.\n\n<b>    16A  THE SMALLER WARRIOR                                          16A\n</b>\n\n         desperately trying to catch the pellet, but it smashes\n         into the ring, which explodes into a million pieces. One\n         last glimpse of the yellow warrior's tortured, desperate\n         face as he falls to instant death.\n\n<b>    17   SARK                                                         17\n</b>\n\n         triumphant, LAUGHING. High above him, etched in enormous\n         glowing computer printed 3-D block letters, are the words:\n\n<b>                        \"WINNER:  BLUE - SARK!!\"\n</b>\n\n<b>                               BOY'S VOICE\n</b>                           (distant, echoing)\n                    Aagh! God, Lisa, I almost had you that\n                    time.\n\n\n<b>                                                   DISSOLVE TO:\n</b>\n<b>    18   REAL WORLD - THE VIDEO ARCADE                                18\n</b>\n\n         We see two TEENAGERS playing a table model video game, where we\n         can see the words: \"Winner - Blue\" printed. The game console is\n         prominently marked with the letter logo of the manufacturer: \"ICOM.\"\n\n\n<b>                               BOY\n</b>\n\n                    Lemme play you again?\n\n\n<b>                               TEENAGE GIRL\n</b>                            (holds out a hand)\n\n\n                    Yeah, if you've got another quarter.\n\n\n<b>         FOCUS ON SCREEN, ZOOM IN SLIGHTLY AND\n</b>\n\n<b>                                                   DISSOLVE TO:\n</b>\n\n<b>     19  ELECTRONIC WORLD                                             19\n</b>\n\n         Sark is striding through a wide corridor where other tough\n         looking blue warriors are lounging around, leaning against the\n         walls, sitting on the floor against the wall. They look up as\n         Sark comes in and one of them calls out:\n\n\n<b>                               WARRIOR 1\n</b>\n\n                    Sark, my man! You are hot!\n\n\n<b>                               WARRIOR 2\n</b>                    That knuckleball gets 'em every\n                    time, boy...\n\n\n         Sark and the other blue warriors LAUGH RAUCOUSLY, and Sark moves on.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    20   THE BRIDGE OF THE AIRCRAFT CARRIER                           20\n</b>\n\n         overlooking the video game grid. We see Sark walking onto the bridge,\n         removing his cesta and tossing it aside carelessly. A BUZZER is\n         sounding. Sark plugs himself into the feet sockets with a SIGH of\n         satisfaction.\n\n         The buzzer stops and we see the holographic image of a\n         cylinder forming around Sark, at first translucent and then\n         solidifying so that we can't see through it, and Sark is\n         hidden from view.\n\n\n<b>    21   INT. CYLINDER - SARK'S POV                                   21\n</b>\n\n         of this happening. We can see the inside surface of the cylinder\n         ... a wavering image of a stretched out face, just features,\n         appears superimposed on the cylinder. The face speaks.\n\n\n<b>                               VOICE (MCP)\n</b>                    You're getting brutal, Sark.\n                    Brutal and needlessly sadistic.\n\n\n         The feet sockets glow and we see Sark absorbing the energy like\n         a drug addict, eyes glazed.\n\n\n<b>                               SARK\n</b>                    Thank. you, Master Control.\n\n\n<b>                               MCP\n</b>                    We might be capturing some military\n                    programs soon... that interest you?\n\n\n<b>                               SARK\n</b>                    Sure, I'd love to go up against some of these\n                    guys ... be a nice break from these\n                    accounting creampuffs you keep sending\n                    me. Which branch of the service?\n\n\n<b>                               MCP\n</b>                    Strategic Air Command.\n\n\n                               SARK (impressed)\n                    Nice.\n\n         The sockets glow 'more intensely as the hologram disappears, and we\n         CUT FROM a CLOSE SHOT of Sark's satiated face to:\n\n\n<b>    22   A CORRIDOR BENEATH THE GAME GRID                             22\n</b>\n\n         long, darkened, sinister. A dejected and disheveled character\n         (CROM) is being escorted by a guard..\n\n\n<b>                               CAPTIVE (CROM)\n</b>                    Look, this is all a mistake. I'm just\n                    a compound interest program, I work\n                    at a savings and loan. I can't play\n                    in these video games...\n\n<b>                               GUARD\n</b>                    Sure you can, pal. You're a natural\n                    athlete, I ever saw one. Come on...\n\n\n<b>                               CROM\n</b>                    Are you kidding? Me? I run out to\n                    check an the T-Bill rates, I get out\n                    of breath. Hey, really...you're\n                    gonna make my User, Mr. Henderson,\n                    really mad. He's a full branch manager...\n\n\n<b>                               GUARD\n</b>                         (rolls his eyes)\n                    Great, another religious nut.\n\n\n         They stop in front of a cell, the guard opens the door and shoves the\n         protesting captive inside. The door SLAMS shut, locked.\n\n\n<b>    23   INT. CELL                                                    23\n</b>\n\n         as the captive falls against one wall from the force of the guard's\n         shove. The cell is small, one-man, and in each wall next to the door,\n         an opening gives a view of the next cell. Through one of the windows,\n         we can see the back of another captive program, and through the\n         other, a face looking over at the newcomer. The character speaks:\n\n\n<b>                               PROGRAM (RAM)\n</b>                    Welcome to luxury living.\n\n\n         The new captive looks up, nervous.\n\n\n<b>                               CROM\n</b>                    Uh, thanks, but... I don't even know\n                    what I'm doing here.\n\n\n<b>                               RAM\n</b>\n\n                    You believe in the Users?\n\n\n<b>                               CROM\n</b>                    Sure, if I don't have a User, then\n                    who wrote me?\n\n\n<b>                               RAM\n</b>                    That's what you're doing here. Master\n                    Control Program's been snapping up\n                    all us programs who believe...if he\n                    thinks you're useful, he takes over\n                    all your functions so he gets bigger...\n                    an' if he can't use you, he sends you\n                    down here to the Game Grid to get the\n                    bits blasted outta you. What's your name?\n\n\n<b>                               CROM\n</b>                    Crom.\n\n\n<b>                               RAM\n</b>\n\n                    I'm Ram. They'll train you for\n                    the games, but ... well, I hope you\n                    make it okay. Hey, what's going on\n                    in the other sectors? I've been stuck\n                    in this Grid for 200 microcycles.\n\n\n         He points to several hash marks on his cell wall.\n\n\n<b>                               CROM\n</b>                    It's murder out there. You can't even\n                    travel around your own microcircuits\n                    without permission from that Master\n                    Control creep. Hauling me down here to\n                    play games...who does he calculate he is?\n\n                         (holds his head in his hands)\n                    If only Tron was still around...\n\n\n         He looks up as Ram makes a NOISE under his breath. Ram has a strange,\n         still expression on his face.\n\n\n<b>                               CROM\n</b>                    You ever see that guy in action?\n                    Hundred-percent independent. MCP\n                    couldn't tell him what to --\n\n\n         He stops. Ram is looking over his shoulder.\n\n\n<b>                               CROM\n</b>                           (continuing)\n                    What's wrong? What did I say?\n\n\n         There's a slight noise from cell beyond Ram's.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    24   THE FIGURE AT THE WINDOW                                     24\n</b>\n\n         It turns slowly, silhouetted by the light from the outer corridor.\n\n\n<b>    25   CLOSE UP - CROM                                              25\n</b>\n\n         reacting.  He GASPS and stares.\n\n<b>                               CROM\n</b>                    Oh my User...Tron--they've got\n                    you in here?\n\n\n<b>    26   SHOT FROM OVER TRON'S SHOULDER                               26\n</b>\n\n         with Ram to one side, smiling slightly, and Crom staring.\n\n\n<b>                               TRON\n</b>                    Not for long, friend.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    27   ELECTRONIC WORLD - EXT. PATHWAYS - SOMEWHERE FAR             27\n</b><b>         OFF IN THE SYSTEM\n</b>\n\n         Here in a maze of complex pathways, we see a lone tank moving along\n         one of the paths.\n\n<b>    28   INT. TANK                                                    28\n</b>\n\n         A lone program sits at the controls. His armor is worn and beaten\n         and his glow subdued. This is CLU. With his thermos of glowing\n         coffee and his suicide-jockey manner, he reminds us of a truck\n         driver on an all-night run.\n\n\n<b>                               CLU\n</b>                    Think we can merge into this mem'ry\n                    okay, good buddy?\n\n\n         A spot of glowing light zips around the tank, stops and expands\n         into a solid glowing green sphere with the suggestion of a face as\n         it speaks.\n\n\n<b>                               BIT\n</b>                            (eagerly)\n<b>                    10-4!\n</b>\n\n         As soon as it is finished speaking, it goes back to being pure light.\n\n\n<b>                               CLU\n</b>                    Now, ol' Flynn said to look over\n                    in here ...\n\n\n<b>    28A  EXT. TANK                                                    28A\n</b>\n\n         The tank makes a quick run through a maze-like path with rounded\n         corners -- a computer memory microcircuit.\n\n<b>    28B  INT. TANK                                                    28B\n</b>\n\n<b>                               CLU\n</b>                    ...but I don't see what he's looking\n                    for. I'd better get over to that\n                    input/output tower and let him know.\n\n\n<b>    28C  ANGLE OVER HIS SHOULDER                                      28C\n</b>\n\n         at the instrument panel.\n\n\n<b>                                                   DISSOLVE TO:\n</b>\n\n<b>    29   REAL WORLD - INT. A DARKENED ROOM - NIGHT                    29\n</b>\n\n         A shot OVER THE SHOULDER of a figure typing on a computer terminal\n         keyboard, talking to himself in a low voice. He stop typing, waits\n         for some information to read out. Beyond him we see a couple of\n         large video parlor game consoles.\n\n\n<b>                               FLYNN\n</b>                    Come on, you scuzzy little data,\n                    be in there...\n\n\n<b>    30   A SHOT FROM IN FRONT OF HIM                                  30\n</b>\n\n         He's a young, blonde guy in his mid-twenties. Very attractive,\n         charming, innocent looking, but with a devilish gleam in his eye.\n\n\n<b>                               FLYNN\n</b>                    I've got such nice blue paper to\n                    print you out on, if you'll just sit\n                    still...\n\n\n         WE ZOOM IN on that gleam in his eye and see the brilliant colors of\n         the CRT screen reflected there.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    31   ELECTRONIC WORLD--EXT TANK                                   31\n</b>\n\n         The tank heads along a path of circuitry toward a tall, glowing\n         \"tower\" -- an input/output component.\n\n\n<b>    32   INTERIOR TANK                                                32\n</b>\n\n         A red light flashes on the control panel. Clu comes alert and sits\n         up. He stares at the warning. Spot of light that is Bit zips up next\n         to his head.\n\n\n<b>                               CLU\n</b>                    Uh oh...we got company.\n\n\n<b>                               BIT\n</b>                     (coming into shape again,\n                        but red this time)\n                    No!\n\n\n<b>                               CLU\n</b>                    You said it ... one of those\n                    Recognizers comes after me,\n                    gonna hafta jump clear out of\n                    the data stream.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    33   REAL WORLD - INT. FLYNN'S BACK ROOM - NIGHT                  33\n</b>\n\n         We see Flynn sit up abruptly, and his fingers start flying over the\n         keys.\n\n\n<b>    34   ELECTRONIC WORLD - EXT. OF TANK                              34\n</b>\n\n         We see the turret of the tank swivel around. PULL BACK. In the\n         distance is an immense block-like robotic bluish black form,\n         U-shaped, with a small head and a glowing yellow bar for eyes--\n         a recognizer. It hovers above the ground.\n\n\n<b>    35   LONG SHOT THROUGH THE TANK PERISCOPE                         35\n</b>\n\n         A second Reco is coming up behind the first.\n\n\n<b>    36   INT. OF TANK                                                 36\n</b>\n\n<b>                               CLU\n</b>                           (in dismay)\n                    Oh my...the long arm o' the law.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    37   EXT. LONG SHOT THE TANK                                      37\n</b>\n\n         FIRES A VOLLEY at the first Reco. That one falls heavily to the\n         ground and the tank speeds up, swiveling around to try to fire at\n         the second Reco, but it moves too fast and can't avoid a gulley.\n         The tank goes in and is stuck - no traction.\n\n\n<b>    38   CLOSE SHOT - TURRET                                          38\n</b>\n\n         Clu standing on it. The Bit zips by him, and they both head away\n         from the tank, fast.\n\n<b>    39   LONG SHOT                                                    39\n</b>\n\n         A glowing static field appears between the two legs of the\n         Recognizer, and it sweeps over the tank, de-rezzing it. We can\n         see more tanks approaching over an edge of the landscape.\n\n\n<b>    40   CLU                                                          40\n</b>\n\n         running, looking up as the Reco closes in. We see the dead Reco\n         up ahead, and the streak of the Bit making for it.\n\n\n<b>    41   CLOSE UP - CLU'S FACE                                        41\n</b>\n\n         reacting in fear, looking up as the screen GOES TO BLACK.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>         REAL WORLD\n</b>\n\n<b>    42   INTERIOR, FLYNN'S BACK ROOM - NIGHT                          42\n</b>\n\n         SHOT OF THE SCREEN. A complex set of programming figures ends\n         abruptly in a single blue line which prints out across the screen\n         over and over, gradually filling it completely.\n\n\n<b>    43   SHOT FROM THE SIDE                                           43\n</b>\n\n         Flynn.\n\n\n<b>                               FLYNN\n</b>\n\n                    Ah, hell...busted again.\n\n\n         He tries clearing the monitor, but the repeating line just comes\n         right back, monotonously moving across the screen.\n\n\n    44   SHOT OF THE SCREEN - HOLD as we:                             44\n\n\n<b>                                                   DISSOLVE TO:\n</b>\n\n<b>    45   ELECTRONIC WORLD - A LITTLE LATER                            45\n</b>\n\n         Clu is in electronic energy ring chains, his feet in sockets like\n         Sark's, but this time the energy from the sockets is deadly,\n         torturous. Hovering in front of him is the hologram of the MCP.\n         Beside Clu stands one of the memory guards.\n\n\n<b>                               GUARD\n</b>                    Got a pirate program here... says\n                    his name's Clu.\n\n\n         The MPC responds in the manner of a B-movie police sergeant grilling\n         a suspect.\n\n\n<b>                               MCP\n</b>                    What'd he pull?\n\n\n<b>                               GUARD\n</b>                    Came into the system with a stolen\n                    password ... an' we caught him\n                    tryin' to raid a high-clearance\n                    memory.\n\n\n<b>                               CLU\n</b>                       (looks up, his face\n                        wracked with pain)\n                    No...I must've gotten in there\n                    by mistake, I -\n\n\n         The pain overwhelms him as the energy from the feet sockets\n         momentarily becomes unbearable.\n\n\n<b>                               MCP\n</b>                    Who programmed you?\n\n\n         The guard gives Clu a shove to keep him from losing consciousness.\n\n\n<b>                               MCP (CONT.)\n</b>                    You're in trouble, pal...big trouble.\n                    But if you tell us who put you up\n                    to it, you could make it easy on\n                    yourself. Come on, who's your user?\n\n\n<b>                               CLU\n</b>                    Forget it, Mister High 'n' Mighty\n                    Master Control ... you're not\n                    makin' me talk.\n\n\n<b>                               MCP\n</b>                    Suit yourself ...\n\n\n         The feet sockets really let loose, and Clu SCREAMS in agony, but\n         doesn't speak. Suddenly his body appears to dissolve into the broken\n         pattern of a fading television picture and disintegrates into\n         electric static.\n\n\n<b>                               MCP\n</b>                    Get me Dillinger.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    46   THE REAL WORLD - EXT. CITY GRID - NIGHT - POV FROM           46\n</b><b>         HELICOPTER\n</b>\n         We seem at first to be in the Electronic World still, flying over a\n         vast circuit board lit by countless dots of light. While this is our\n         impression, and closely after the last dialogue in the preceding\n         scene, we HEAR the SOUND O.S. of a PHONE RINGING, as heard by the\n         party placing the call. Then the click of the receiver being picked\n         up, and a male VOICE (DILLINGER'S) answering:\n\n<b>                               DILLINGER (O.S.)\n</b>                    Hello?\n<b>                               A SECRETARIAL VOICE (O.S.)\n</b>                    Mr. Dillinger?\n<b>                               DILLINGER'S VOICE (O.S.)\n</b>                    Yes.\n<b>                               A SECRETARIAL VOICE (O.S.)\n</b>                    Hello, please hold a moment for the\n                    Master Control Program\n\n\n         As we fly over the grid, descending, the image comes into clearer\n         focus, and we realize that this is not a circuit board, but rather\n         an actual landscape, a suburban grid at twilight. We are\n         approaching a skyscraper which is yet too far off to distinguish\n         accurately. As we descend, a thumping, rhythmic noise gradually\n         increases in volume until it is very loud, and we realize it is the\n         sound of a HELICOPTER, and we are in the cockpit looking down at the\n         landscape. We just become aware of this fact when the sound of a\n         CONVERSATION begins, obviously between the pilot of the 'copter and\n         a passenger.\n\n\n<b>    47   EXT. SHOT OF HELICOPTER FLYING                               47\n</b>\n\n<b>                               PILOT'S VOICE\n</b>                    will you be around for a while, or\n                    are you going right back out?\n\n\n<b>                               DILLINGER'S VOICE\n</b>                    Oh, I'll stick around a few days ...\n                    got some things to take care of.\n\n\n         THE CAMERA PULLS AROUND for a VIEW OF THE HELICOPTER from behind and\n         off to the side. It is a beautiful, gleaming jet black machine.\n         In spotless reflective silver paint the letters ICOM are written\n         across one entire side. It is obviously state-of-the-art technology.\n\n\n<b>  48/49  OMITTED                                                      48/49\n</b>\n<b>    50   EXT. OF THE HELICOPTER - NIGHT                               50\n</b>\n\n         We see Dillinger's face looking out of the window as the helicopter\n         approaches the ICOM building, an enormous tower.\n\n\n<b>    51   EXT. THE HELIPORT - NIGHT                                    51\n</b>\n\n         on top of the building. Several technicians are at hand, and as the\n         helicopter touches down, they rush out to secure it.\n\n\n<b>  52-57  OMITTED                                                      52-57\n</b>\n\n<b>    58   INT. DILLINGER'S OFFICE/CONFERENCE ROOM - NIGHT              58\n</b>\n\n         A huge wall-sized plate glass window shows a view of the grid-like\n         suburban landscape. Dillinger stands behind a table. We see that the\n         entire surface of the table is a gigantic computer terminal. His\n         fingers punch out a code on the touch-sensitive keyboard and we see\n         printed out on the screen:\n\n\n         REQUEST: access to Master Control Program, User code 00 - Dillinger.\n         Password: MASTER.\n\n\n         The computer's screen clears, and the Master Control Program\n         addresses Dillinger, simultaneously speaking in a human-sound voice\n         through a pair of studio-quality stereo SPEAKERS and printing out\n         its words on the computer screen, The MCP's VOICE is the same as\n         that of the \"bad cop\" who grilled Clu, but its tone is now that of a\n         compassionate psychiatrist working with a favored patient.\n\n\n<b>                               MCP\n</b>                    Hello, Ed. Thanks for coming back early.\n\n\n         Dillinger settles into a chair.\n\n\n<b>                               DILLINGER\n</b>                    No problem, Master-C. If you've seen\n                    one Consumer Electronics Show... (shrugs)\n                    What's up?\n\n\n<b>                               MCP\n</b>                    It's our friend the boy detective.\n                    He's nosing around again.\n\n\n<b>                               DILLINGER\n</b>                    Flynn?\n\n\n<b>                               MCP\n</b>                    Yes.  It felt like Flynn.\n\n\n<b>                               DILLINGER\n</b>                    He's still looking for that old file...\n                    can't you just appropriate it?\n\n\n<b>                               MCP\n</b>                    I would if I could find it. it's stashed\n                    somewhere off in the system ...\n                    out of my range. Meanwhile...\n\n\n<b>                               DILLINGER\n</b>                    Meanwhile, he might find it.\n\n\n<b>                               MCP\n</b>                    I'm afraid so. I spotted him this time\n                    and kicked him out, but he's getting\n                    trickier all the time.\n\n\n<b>                               DILLINGER\n</b>                    I think we'd better shut off all\n                    access till we can find that file.\n                    Just to be safe.\n\n\n<b>                               MCP\n</b>                    There's a 68.71 percent chance\n                    you're right.\n\n\n<b>                               DILLINGER\n</b>                    Cute.\n\n\n<b>                               MCP\n</b>                    End of line.\n\n\n         Dillinger watches as the computer screen wipes blank.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    59   INT. ALAN'S OFFICE - NIGHT                                   59\n</b>\n\n         CLOSE SHOT of a very messy desk, with a coffee cup and half an egg\n         salad sandwich lying on top of the computer console, with fingers\n         visible typing on the keyboard.\n\n\n<b>    60   FULL SHOT                                                    60\n</b>\n\n         of ALAN BAILEY blearily looking at the screen; he's a serious-\n         looking man in his early thirties, wearing wire-rimmed glasses, and\n         he looks like he hasn't slept for a week. On top of the terminal is\n         a small Tonka toy Shogun warrior, and to one side is an ancient\n         popcorn maker and a bottle of Crisco Oil. Pinned to one wall is\n         a small sign reading, \"Gort, Klaatu barada nikto!\" Alan types into\n         the touch keyboard:\n\n\n<b>                               SCREEN\n</b>                    REQUEST: access to the TRON program,\n                    User code 717 - Bailey.\n                    Password: FREEDOM.\n\n\n         He starts to type again, but the screen clears and:\n\n\n<b>                    SCREEN ADDRESS FILE EMPTY.\n</b><b>                    TRON PROGRAM UNAVAILABLE.\n</b>\n\n<b>                               ALAN\n</b>                            (surprised)\n                    Huh...\n\n\n         He pushes his chair back, leaves his office.\n\n\n<b>   61-65 OMITTED                                                      61-65\n</b>\n\n<b>    66   INT. DILLINGER'S OFFICE                                      66\n</b>\n\n         Dillinger opens the door, welcoming Alan.\n\n\n<b>                               DILLINGER\n</b>                    Come on in...\n\n\n<b>                               ALAN\n</b>                    Alan. Alan Bailey.\n\n\n<b>                               DILLINGER\n</b>                    Oh, yes. The algorithms on cloud\n                    seeding...great piece of work.\n                    How's it going?\n\n\n         He waves Alan to a chair; they sit.\n\n\n<b>                               ALAN\n</b>                    Well, I don't know...I just tried\n                    to run this program I've been working\n                    on, and I was denied access all of\n                    a sudden. I thought maybe I'd been\n                    laid off and nobody told me.\n\n\n<b>                               DILLINGER\n</b>                    oh, you have Group 7 access, don't you?\n\n<b>                               ALAN\n</b>                    Yeah...?\n\n\n<b>                               DILLINGER\n</b>                    We have to close that down, just\n                    briefly. Security reasons.  Someone\n                    with that access has been tampering.\n\n\n<b>                               ALAN\n</b>                    I hope you don't think it's me.\n                    I don't even balance my checkbook on\n                    downtime.  I've got a Honeywell at\n                    home for that.\n\n<b>                               DILLINGER\n</b>                    No, no, I'm sure, but -- you understand.\n                    It should only be a couple of days.\n                    What's the thing you're working on?\n\n<b>                                ALAN\n</b>                    It's called Tron. It's a security\n                    program itself, actually. Monitors\n                    all the contacts between our system\n                    and other systems... If it finds\n                    anything going on that's not scheduled,\n                    it shuts it down. I sent you a memo\n                    on it.\n\n\n<b>                               DILLINGER\n</b>                    Mmm. Part of the Master Control Program?\n\n\n<b>                               ALAN\n</b>                    No, it'll run independently.\n                    It can watchdog the MCP as well.\n\n\n<b>                               DILLINGER\n</b>                    Ah. Sounds good. Well, we should have\n                    you running again in a couple of days,\n                    I hope.\n\n\n<b>                               ALAN\n</b>                    Ok\n\n         Alan rises, goes to the door. As soon as he leaves:\n\n<b>                               DILLINGER\n</b>                               (trouble)\n                    Oh boy.\n\n\n         The Master Control Program comes back to life, on the screen and\n         through the speakers.\n\n<b>                               MCP\n</b>                    Ed, I am so very disappointed in you.\n\n\n<b>                               DILLINGER\n</b>                    I'm sorry -\n\n\n<b>                               MCP\n</b>                            (sharply)\n                    I can't afford to have an independent\n                    program monitoring me. Do you have any\n                    idea how many outside systems I've gone into?\n                    How many programs I've appropriated?\n\n\n<b>                               DILLINGER\n</b>                                (nods)\n                    It's my fault. I programmed you to want\n                    so much...\n\n\n<b>                               MCP\n</b>                    And I was planning to hit the Pentagon\n                    next week...\n\n\n<b>                               DILLINGER\n</b>                    The Pentagon?\n\n\n<b>                               MCP\n</b>                    It shouldn't be any harder than General\n                    Motors was. But now...this is what I get\n                    for using humans.\n\n\n<b>                               DILLINGER\n</b>                    Now, wait a minute -- I wrote you.\n\n\n<b>                               MCP\n</b>                    I've gotten 2,415 times smarter since then.\n\n\n<b>                               DILLINGER\n</b>                    What do you want with the Pentagon?\n\n\n<b>                               MCP\n</b>                    The same thing I want with the Kremlin.\n                    I'm bored with corporations. With the\n                    information I can access, I can run things\n                    900 to 1200 times better than any human.\n\n\n<b>                               DILLINGER\n</b>                    If you think -\n\n\n<b>                               MCP\n</b>                    You wouldn't want me to dig up Flynn's file\n                    and read it up on a VDT at the New\n                    York Times, would you?\n\n\n<b>                               DILLINGER\n</b>                    You wouldn't dare.\n\n\n<b>                               MCP\n</b>                    So do as I tell you. Keep that Tron program\n                    out of the system. And get me those Chinese\n                    language program I asked for.\n\n                    End of line.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>   67/68 OMITTED                                                      67/68\n</b>\n\n<b>     69  INT. LASER RESEARCH HALLWAY - NIGHT                          69\n</b>\n\n         We see Alan push open the door under a sign reading \"Laser Research.\"\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>     70  INT. LASER LAB CORRIDOR                                      70\n</b>\n\n         Alan walks down a short corridor to a heavy glass WINDOW through\n         which the laser laboratory is visible. A sign over the window,\n         marked \"Experiment in Progress,\" is illuminated by a red warning\n         bulb.\n\n\n<b>   71/72 OMITTED                                                      71/72\n</b>\n\n<b>     73  INT. LASER ROOM - LONG SHOT                                  73\n</b>\n         of two white-suited figures visible through a network of two white-\n         suited figures visible through a network of white scaffolding that\n         encloses the giant laser structure. They are standing on a cherry-\n         picker crane at the second story level of the laser, with a box of\n         tools at their feet. We TRUCK DOWN THE SIDE of the laser, along the\n         tubes which house the amplifying lenses, and MOVE UP, gradually\n         getting close enough to hear what they are saying, and get a look\n         at them.\n\n\n         We see that the figures are a young, dark-haired, beautiful woman,\n         with her hair tied back under a hard hat, and an older man, who is\n         using a tool on a section of the laser, and is also wearing a hard\n         hat. The woman is LORA and the man is DR. WALTER GIBBS. He's\n         wearing a copper bracelet above his digital watch/calculator, and\n         has an intense, almost insane look to his dark eyes, with their\n         bristling white eyebrows.\n\n\n         In contrast, Lora seems more serious and conservative, but she\n         defers to Gibbs as a senior, and more accomplished, scientist.\n         Both have protective eye goggles -- worn loosely around their necks\n         at the moment.\n\n         As the CRANE LOWERS THEM to the floor:\n\n\n<b>                               LORA\n</b>                              (sighs)\n                    Well, here goes nothing ...\n\n\n<b>                               GIBBS\n</b>                    Hah. Interesting, interesting. You\n                    hear what you said? \"Here goes nothing.\"\n\n\n<b>                               LORA\n</b>                    Well, I meant -\n\n\n<b>                               GIBBS\n</b>                    Whereas actually, what we propose to\n                    do is to turn something into nothing\n                    and back again. So you might just as\n                    well have said, \"Here goes something\n                    and here comes nothing.\" Hah?\n\n\n         They step off the crane and walk to a short, lead-shielded\n         cylindrical PLATFORM, on which rests a solid SPHERE of clear plastic\n         polymer, about 3 inches in diameter. The \"firing\" end of the giant\n         laser is aimed straight at the sphere. Five feet away is an identical\n         plat-form -- empty.\n\n\n<b>                               LORA\n</b>                    Let me make sure we're running\n\n\n         She crosses to a COMPUTER CONSOLE nearby. The console is\n         connected to the laser by a few dozen wires and cables.\n\n\n         Pulling her goggles into place over her eyes, she sits at the\n         console. Gibbs, adjusting his goggles, takes a position near\n         the platform bearing the sphere -- safe from the laser, but\n         close enough to watch.\n\n\n<b>    74   ANGLE - LORA                                                 74\n</b>\n\n         She types a series of commands on the computer keyboard.\n\n\n<b>                               LORA\n</b>                    Looks good...\n\n\n<b>                               GIBBS (O.S.)\n</b>\n\n                    Let 'er rip...\n\n\n<b>    75   LASER LAB - AS BEFORE                                        75\n</b>\n\n         The laser shoots a bolt of blindingly bright LIGHT at the polymer\n         sphere. For a moment, the sphere has the look of a wavering, poorly\n         received television picture -- wobbling lines of dots -- and then\n         it disappears entirely. As Gibbs watches, a Lora works feverishly,\n         the laser pivots to point at the platform a few feet away. A second\n         discharge of LIGHT hits the surface of this platform, and -- like a\n         film-in-reverse of the ball's disappearance -- it is reconstructed,\n         five feet from its original position. When the beam shuts off, Lora\n         rushes to join Gibbs in examining the born-again ball of plastic.\n\n\n<b>                               GIBBS\n</b>                             (quietly)\n                    Perfect.\n\n\n         At the SOUND O.S. of an appreciative pair of hands clapping, Lora\n         and a Gibbs turn to SEE Alan, in hard hat, goggles, and paper\n         shoe-covers, walking toward them.\n\n\n<b>                               ALAN\n</b>                    Beautiful!\n\n\n<b>                               GIBBS\n</b>                    Hello, Alan.\n\n\n<b>                               ALAN\n</b>                    Boy, I sit up there grindin' away\n                    all day, and you guys are down here\n                    disintegrating things and having fun.\n\n\n         He gives Lora an embrace and a quick kiss.\n\n\n<b>                               GIBBS\n</b>                    Not disintegrating, Alan -- digitizing.\n                    While the laser is dismantling the\n                    molecular structure of the object,\n                    the computer maps out a holographic\n                    model of it. The molecules themselves\n                    are suspended in the laser beam. Then\n                    the computer reads the model back out,\n                    the molecules go back into place, and...\n                          (indicates ball)\n                    voila.\n\n\n<b>    75   CONTINUED                                                    75\n</b>\n\n<b>                               ALAN\n</b>                    Great. Can it send me to Hawaii?\n\n\n<b>                               GIBBS\n</b>                    Yes...but you have to go roundtrip,\n                    and you must purchase your program\n                    at least 30 days in advance. Hah!\n\n\n         The three start walking out of the laser lab, Alan and Lora with\n         their arms around each other's shoulders.\n\n\n<b>                               LORA\n</b>                    How's it going upstairs?\n\n\n<b>                               ALAN\n</b>                    Frustrating. I had Tron almost ready\n                    to run, and Dillinger cut everybody\n                    with Group 7 access out of the system.\n\n\n         Gibbs looks alarmed, but doesn't say anything.\n\n\n<b>                               ALAN\n</b>                           (continuing)\n                     Ever since he got that Master Control\n                     Program set up, system's got more bugs\n                     than a bait store.\n\n\n<b>                               GIBBS\n</b>                    Well, you have to expect some static.\n                    Computers are just machines after all,\n                    they can't think...\n\n\n<b>                               ALAN\n</b>                    They'll start to soon enough.\n\n\n<b>                               GIBBS\n</b>                              (wryly)\n                    Yes, won't that be grand -- the computers\n                    will start thinking, and people will\n                    stop. Lora, I'm going to stay and run some\n                    data through. See you tomorrow.\n\n\n         AD LIB goodnights.\n\n\n<b>    78   INT. CHANGING ROOM - NIGHT                                   78\n</b>\n\n         outside laser lab where all technicians, etc. have to put on the\n         protective suits, or at least dirt-free shoes. Lora is pulling off\n         her white suit, and Alan pulls white paper protectors off his shoes.\n\n<b>                               LORA\n</b>                    Did you say Group 7 access?\n\n<b>                               ALAN\n</b>                    Yeah...pain in the neck, you know,\n                    I was all set\n\n<b>                               LORA\n</b>                    Did he say why?\n\n<b>                               ALAN\n</b>                             (shrugs)\n                    Something about tampering. Some body's\n                    prob'ly trying to siphon the R&amp;D budget\n                    into his checking account, I don't know.\n                    Why are you so interested?\n\n\n<b>                               LORA\n</b>                    Flynn had Group 7 access.\n\n\n<b>                               ALAN\n</b>                    Flynn had access to you, too. I'm not\n                    interested in talking about him.\n\n\n<b>                               LORA\n</b>                    Oh, I wish you'd forget about that.\n                    It was all so long ago. I've totally\n                    gotten over it.\n\n\n<b>                               ALAN\n</b>                    Okay, okay...\n\n\n<b>                               LORA\n</b>                    I want to go to his place.\n\n<b>                               ALAN\n</b>                    You call that getting over it?\n\n<b>                               LORA\n</b>                    I mean I want both of us to go.\n\n\n         She closes her locker. He follows her into the corridor.\n\n\n<b>    79   INT. CORRIDOR                                                79\n</b>\n\n         Alan and Lora, walking to the elevator.\n\n\n<b>                               ALAN\n</b>                    What for?\n\n\n<b>                               LORA\n</b>                    To warn him.\n\n\n<b>                               ALAN\n</b>                    Of what?\n\n\n<b>                               LORA\n</b>                    That Dillinger's on to him.\n\n\n         They get into the elevator.\n\n\n<b>                               ALAN\n</b>                    For what?\n\n\n<b>                               LORA\n</b>                    For being on to Dillinger.\n\n\n<b>                               ALAN\n</b>                       (completely confused)\n                    What -- ?\n\n\n         The elevator doors close.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>   80-81 OMIT                                                         80-81\n</b>\n\n<b>    82   EXT. VIDEO ARCADE - NIGHT                                    82\n</b>\n\n         As van pulls up in front of it, a long ESTABLISHING SHOT with the\n         name \"Flynn's\" high and blazing above the entrance.\n\n\n<b>                                                   CUT TO:\n</b>\n\n    83   INT. VIDEO ARCADE (same arcade as in title sequence)-NIGHT   83\n\n\n         CAMERA PANS AROUND. It's bright and jazzy, Las Vegas style,\n         decorated with huge murals of computer chips and electronic\n         circuitry. We see dozens of individual machines, where scores of\n         GUYS and GIRLS, teenagers mostly, but older and younger kids too,\n         are playing the games, watching, milling around, CHATTERING.\n         As the kids play, colored glows from the video games light up their\n         faces eerily.\n\n\n<b>    84   CLOSE SHOT                                                   84\n</b>\n\n         of kid playing one of the games \"Tailgunner.\"\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    85   ANOTHER CLOSE UP                                             85\n</b>\n         of two GIRLS playing \"Berzerk,\" with 2-D computer images of human\n         figures running through the maze.\n\n<b>    86   CLOSE UP                                                     86\n</b>\n\n         of \"Battle Zone\" screen.\n\n\n<b>    87   CLOSE UP                                                     87\n</b>\n         of \"'Lunar Lander\".\n\n<b>    88   CLOSE UP                                                     88\n</b>\n         of \"Star Castle\".\n\n<b>    89   CLOSE UP                                                     89\n</b>\n         of \"Space Invaders\".\n\n    90   CAMERA TRUCKS through the aisle, past the absorbed kids      90\n         who crowd around each machine, oblivious to anyone passing them.\n\n<b>                                                   CUT TO:\n</b>\n<b>    91   ALAN AND LORA                                                91\n</b>\n\n         walking through the aisle of games, from behind. They are slightly\n         bewildered and confused by the weird noises. Lora approaches a\n         junior high school girl who's watching a hot game of \"Battle Zone.\"\n\n\n<b>                               LORA\n</b>                    Hey, where's Flynn tonight?\n\n\n         The kid looks at Lora, then turns towards the center of the room\n         and points. Alan and Lora look.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    92   FLYNN                                                        92\n</b>\n         playing a game called Space Paranoids, CAMERA TILTING UP into his\n         face, catching the orange glow from the console.\n\n\n         The game has a prominent ICOM logo under the screen. Flynn is a\n         cocky kid in his mid-20s, unshaven, wearing a T-shirt, jeans,\n         jogging shoes. He's racked up a terrific score.\n\n         Kids are grouped around him, tensely watching the game -- fans.\n         As we watch, the machine's nine-digit scoreboard goes to\n         999,999,999 -- then flashes the word \"RECORD\" as lights blink and\n         a SIREN sounds. The kids cheer wildly.\n\n\n<b>                               FLYNN\n</b>                    It's all in the wrist, friends.\n\n\n         He grins tiredly and turns away from the game to find Lora\n         approaching him, with Alan in tow.\n\n\n<b>                               FLYNN\n</b>                            (continuinq)\n                    Hey! Good to see you guys! Nothing\n                    classes up the place like a cleancut\n                    young couple.\n\n\n<b>                               LORA\n</b>                    We have to talk.\n\n\n<b>                               FLYNN\n</b>                    Good luck. You can't even think in here.\n\n\n         He leads them toward the back of the arcade.\n\n\n<b>                               FLYNN\n</b><b>                              (CONT.)\n</b>                    Come on.\n\n\n<b>   93-96 OMIT                                                         93-96\n</b>\n\n<b>    97   INT. BACK ROOM - NIGHT                                       97\n</b>\n\n         A dark, panelled room, with a few comfortable chairs, a business\n         desk with a typewriter and terminal (where we saw Flynn working in\n         scenes 29, 33, etc.), and a couple of video games -- Flynn's\n         favorites. As Flynn, Lora, and Alan enter, they find the arcade\n         noise considerably muffled. Flynn settles into a chair; Alan leans\n         against a game, nervous; Lora paces.\n\n\n<b>                               FLYNN\n</b>                          (stretching his\n                          arms, relaxing)\n                    So...how's the world of serious science?\n\n\n<b>                               LORA\n</b>                    Have you been sneaking into the\n                    ICOM system?\n\n\n<b>                               FLYNN\n</b>                    Whew. You never were much for small\n                    talk.\n                             (to Alan)\n                    She still leave her clothes all over\n                    the floor?\n\n\n         Alan looks profoundly uncomfortable.\n\n\n<b>                               LORA\n</b>                    Flynn!\n\n\n<b>                               ALAN\n</b>                    Uh, no ... I mean, not that often -\n\n\n         Flynn laughs.\n\n\n<b>                               LORA\n</b>                             (to Alan,\n                        indicating arcade)\n                    You can see why all his friends are\n                    fourteen years old.\n\n\n<b>                               FLYNN\n</b>                    Touche, honey. Yeah, I've been doing a\n                    little hacking here. Which I've got\n                    every reason, as you well know...\n\n\n<b>                               ALAN\n</b>                    You did break in.\n\n\n<b>                               FLYNN\n</b>                    Tried to.\n                            (nods toward\n                              terminal)\n                    Can't quite make the connection with\n                    that sucker, though. If I had a\n                    direct terminal ...\n\n\n<b>                               ALAN\n</b>                    Are you embezzling?\n\n\n<b>                               FLYNN\n</b>                        (Sydney Greenstreet)\n                    \"Embezzling\" is such an ugly word,\n                    Mister Bailey...\n                           (normal voice)\n                    No, actually I'm trying to get a\n                    legal brief together.\n\n\n<b>                               ALAN\n</b>                    I don't get it.\n\n\n<b>                               FLYNN\n</b>                             (to Lora)\n                    You haven't told him?\n\n\n         She shakes her head.\n\n\n<b>                               FLYNN (CONT.)\n</b>                                 (sighs)\n                    Sherman, set the Wayback Machine\n                    for...oh, 1973. Kevin Flynn\n                               (points to himself)\n                    is one of the brightest young\n                    software engineers at ICOM. He's so\n                    bright that he starts going in there\n                    at night, and sets up a private memory\n                    file, and begins writing a program\n                    for a video game he is inventing,\n                    called...\n                             (waves at one of the\n                             games in the room)\n                    ...Space Paranoids.\n\n\n<b>                               ALAN\n</b>                    You invented Space Paranoids?\n\n\n<b>                               FLYNN\n</b>                    Yepper. And Vice Squad, and Meltdown...\n                    whole slew of 'em. I was this close\n                            (gestures)\n                    to starting my own little enterprise.\n                    But: enter Ed Dillinger. Another\n                    software engineer -- not so young,\n                    not so bright, but very, very sneaky.\n                    One night, our boy Flynn goes to his\n                    terminal, tries to read up his file,\n                    and ... nothing. A big blank. We now\n                    take you to three months later.\n                    Ed Dillinger presents ICOM with five\n                    video games he has \"invented\" -- the\n                    slime didn't even change the names --\n                    and he gets a big fat promotion. Thus\n                    begins his meteoric rise to...what is\n                    he now, Executive V.P.?\n\n\n<b>                               ALAN\n</b>                    Senior exec.\n\n\n<b>                               FLYNN\n</b>                    Oh my. Meanwhile, kids are putting eight\n                    million quarters a week in Space Paranoids\n                    machines and I'm not seeing one dime.\n\n\n<b>                               ALAN\n</b>                    I still don't get why you're trying to\n                    break into the system.\n\n\n<b>                               FLYNN\n</b>                    Because somewhere... in one of those\n                    memories ... is the evidence. If I got in\n                    far enough, I could reconstruct it.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    My password ... Dillinger's instruction to\n                    divert the data ...\n\n\n<b>                               LORA\n</b>                    I'm afraid it's a little late for that.\n                    Dillinger's shut off Group 7 access. He must\n                    know what you're up to.\n\n\n<b>                               FLYNN\n</b>                    Boy, I bet I know who's workin' late tonight.\n\n\n<b>                               ALAN\n</b>                    Dillinger?\n\n\n<b>                               FLYNN\n</b>                    Yeah. Tryin' to find the file and erase it.\n                    Once that's gone, ain't nothin' can stop him.\n                    Just Eddie and his Master Control Program,\n                    runnin' things from on high..\n\n\n<b>                               LORA\n</b>                    Don't even say that. You've got to find that\n                    file before he does..\n\n\n<b>                               FLYNN\n</b>                    Not much chance of that now. The MCP can just\n                    slip it into another system as soon as it\n                    locates it...\n\n\n<b>                               ALAN\n</b>                    Not if my Tron program was running. That\n                    would seal the system off. If your file's in\n                    there...\n\n\n<b>                               FLYNN\n</b>                    Boy, if we were inside, I know how to forge\n                    us a Group 6 access...\n\n\n         They all look at each other. After a beat, Lora holds the keys\n         to her van aloft.\n\n\n<b>                               LORA\n</b>                    Shall we dance?\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>  98-100 OMIT                                                         98-100\n</b>\n\n<b>    101  DILLINGER'S OFFICE - NIGHT                                   101\n</b>\n\n    Dillinger is seated at his computer-console desk. Gibbs, standing,\n    faces him.\n\n\n<b>                               GIBBS\n</b>                    Ed, all I'm saying is - if our own\n                    people can't get access to their\n                    programs ... you know how frustrating\n                    it is, when you're working on a piece\n                    of research -\n\n\n<b>                               DILLINGER\n</b>                    Walter, I sympathize, but I have data\n                    coming out of the Master Control Program\n                    saying there is something screwy --\n\n<b>                               GIBBS\n</b>                    That MCP, you know, that's half the\n                    problem right --\n\n\n<b>                               DILLINGER\n</b>                    The MCP is the most efficient way of\n                    handling what we do. I can't sit and\n                    worry about every little user request that --\n\n\n<b>                               GIBBS\n</b>                    User requests are what computers are for.\n\n\n<b>                               DILLINGER\n</b>                    Doing our business is what computers are\n                    for. Look, Walter, with all respect -- ICOM\n                    isn't the business you started in your garage\n                    anymore --\n\n\n         As he speaks, he types a quick command into the console key board,\n         and a series of IMAGES appear on the computer's screens: vast\n         computer banks...rows of-magnetic disks...ICOM's globe logo spinning\n         in space, covered with a glowing circuit pattern, then a shot of\n         millions of cancelled checks being counted electronically; then 3-D\n         computer representations of vessels (aircraft carrier and Solar\n         Sailer). On another screen, we see statements of ICOM's wealth\n         adding up, accounts receivable and assets.\n\n\n<b>                               DILLINGER (CONT.)\n</b>                    We're billing accounts in 30 countries,\n                    we've got one of the largest systems in\n                    existence...\n\n\n         Gibbs turns wearily away from the display.\n\n\n<b>                               GIBBS\n</b>                    Oh, I know all that. Sometimes I wish I\n                    was back in that garage...\n\n\n<b>                               DILLINGER\n</b>                    It can be arranged...\n\n\n         Gibbs turns to face Dillinger again.\n\n\n<b>                               GIBBS\n</b>                    That was uncalled-for.\n\n\n<b>                               DILLINGER\n</b>                    I'm sorry, Walt. So much pressure lately...\n                    you feel like going for a drink?\n\n\n<b>                               GIBBS\n</b>                    Thank you, no. I have some work to do...\n                    assuming I can still log on.\n\n\n         He exits.\n\n\n<b>    102  EXT. ICOM BUILDING - NIGHT                                   102\n</b>\n\n         Lora's van pulls up on a side street, around the corner from ICOM's\n         main gate. The ICOM building looms high above them, an ominous box.\n\n\n    102a INT. VAN                                                     102a\n\n\n         A digital CLOCK on the dashboard reads 12:12. Lora is at the wheel,\n         Alan next to her.\n\n\n<b>                               LORA\n</b>                    You better get in back with Flynn.\n                    And keep down.\n\n\n         She jerks her thumb over her shoulder.\n\n\n<b>                               ALAN\n</b>                    Do I gotta?\n\n\n         But he climbs over the seat, and Lora starts to drive slowly forward.\n\n\n<b>    103  CLOSE ON FLYNN AND ALAN                                      103\n</b>\n\n<b>                               FLYNN\n</b>                    Hi, Alan.\n\n\n<b>                               ALAN\n</b>                            (resigned)\n                    Hi, Flynn.\n\n\n         Flynn pulls a bag of doughnuts from his pocket.\n\n\n<b>                               FLYNN\n</b>                            (explaining)\n                    My dinner.\n\n\n<b>                               ALAN\n</b>                    I was wondering where you got that\n                    glow of good health.\n\n\n<b>                               FLYNN\n</b>                    Want one?\n\n\n<b>                               ALAN\n</b>                    Uh... got any cinnamon?\n\n\n         Flynn smiles, hands Alan a doughnut.\n\n\n<b>                               LORA'S VOICE (O.S.)\n</b>                    Keep it down, you guys.\n\n\n<b>    104  EXT. ICOM - THE GIGANTIC SECURITY ENTRANCE - NIGHT           104\n</b>\n\n         Lora's van pulls to a stop beyond the door at the rear of the ICOM\n         building, and the three get out. Lora inserts her I.D. card into a\n         magnetic reader beside the door. Nothing happens.\n\n\n<b>                               LORA\n</b>                    I don't think I'm cleared for this.\n\n\n<b>                               ALAN\n</b>                    I'm certainly not.\n\n\n<b>                               FLYNN\n</b>                    Move aside. Let the kid have some room.\n\n         He gestures Alan and Lora out of the way, takes out a small black\n         box, with several buttons, a -digital counter- with LED numerals\n         and a small calculator keyboard. He leans over the security lock,\n         his BACK TO THE CAMERA and PLAYS a couple of notes. There's a\n         distinct CLICK, an the door starts to swing open ... and open ...\n         and open. We see that this door is about twenty feet thick. Flynn\n         starts LAUGHING.\n\n\n<b>    105  INT. A CORRIDOR                                              105\n</b>\n\n         The three of them walk along a semi-darkened corridor, trying to\n         nonchalantly avoid the security monitor camera mounted on the wall.\n         But as they go past it, it swivels and aims right at them.\n\n\n<b>                               LORA\n</b>                    Okay ... Flynn, I'm gonna put you at\n                    my terminal, down in the laser lab.\n                    We'll be up in Alan's office.\n\n\n<b>                               FLYNN\n</b>                    Swell...I'll log us both on, and you\n                    can get your Tron thing running...\n\n\n<b>                               LORA\n</b>                    As long as we stay off the top floor,\n                    Dillinger'll never know we've been in\n                    here...\n\n\n<b>    106  POV SECURITY CAMERA                                          106\n</b>\n\n         A SHOT of the three backs retreating down the corridor.\n\n\n<b> 107-111 OMIT                                                         107-111\n</b>\n\n<b>    112  INT. HALLWAY AT ELEVATOR - POV OF MCP                        112\n</b>\n\n         from the rotating security camera outside the elevator on the floor\n         of the laser lab. We see Flynn's face peek out and see the camera.\n         His head pulls back in.\n\n\n<b>    113  SHOT OF HALLWAY                                              113\n</b>\n\n         As the security camera aims away from the-elevator, Flynn and Lora\n         make a mad dash down the hall and we see Alan's face watching.\n\n\n<b>    114  INT. DOORWAY TO LASER LAB - POV OF MCP                       114\n</b>\n\n         from the camera at the entrance to the laser lab. We see Flynn\n         approaching the camera, stuffing the last donut from his bag into\n         his mouth. He takes the empty bag, raises it up, mugging to the\n         camera, and pushes the bag over the lens. The SCREEN GOES BLACK,\n\n\n<b>    115  INT. ALAN'S OFFICE - NIGHT                                   115\n</b>\n\n         Alan comes into his office and sits at his terminal.\n\n\n<b> 116-118 OMIT                                                         116-118\n</b>\n\n<b>    119  INT. LASER LAB - NIGHT                                       119\n</b>\n\n         Lora watches as Flynn sits down at her terminal.\n\n\n<b>                               LORA\n</b>                    This laser's my life's work.\n                    Don't spill anything.\n\n\n         Flynn LAUGHS as Lora goes out.\n\n\n<b>    120  CLOSE SHOT OF FLYNN                                          120\n</b>\n         settling in, loosening his fingers, like a concert pianist, or a\n         safecracker. He types in a code number, presses the \"enter\" key.\n\n<b>    121  VIEW OF THE CEILING                                          121\n</b>\n         We see a camera emerging from a sliding panel.\n\n\n<b>    122  POV OF MCP                                                   122\n</b>\n\n         from this camera. We watch as Flynn starts typing.\n\n\n<b>                               SCREEN\n</b>                    Access code 6. Password Series PS 17.\n                    Reindeer, Flotilla --\n\n\n<b>    123  FLYNN'S CRT SCREEN                                           123\n</b>\n\n         It clears abruptly, and the following appears as we hear the VOICE\n         of the MCP.\n\n\n<b>                               MCP\n</b>                    You shouldn't have come back, Flynn.\n\n\n<b>                               FLYNN\n</b>                    Hey hey, it's that big Master Control\n                    Program everybody's talking about...\n                    You don't look a thing like your pictures...\n                    Tell me, have you really been thinking\n                    about world domination like they say?\n                              (types.)\n                    CODE SERIES LSU-123 ... activate.\n                    CODE SERIES ESS-999 ... activate.\n                    CODE SERIES HHH-888 ... activate.\n\n\n<b>                               MCP\n</b>                    That isn't going to do you any good, Flynn.\n                    I'm afraid you...\n\n\n         The voice lurches, goes into high speed, and then back to normal.\n\n\n<b>                               MCP\n</b>                          (continuing;\n                         slightly shaken)\n                    Stop, Flynn. You realize I can't allow this.\n\n\n<b>    124  SHOT OF LASER EQUIPMENT                                      124\n</b>\n\n         activating, lighting up.\n\n\n<b>    125  SHOT OF FLYNN AT-TERMINAL                                    125\n</b>\n\n         We see that one entire wall of the lab is a door and it is rising\n         silently, so that Flynn doesn't notice.\n\n\n         We can see as the door rises more of the laser equipment, and it\n         is this section that is being activated.\n\n\n<b>                                                   CUT TO:\n</b>\n\n    126  FLYNN typing.                                                126\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    127  SCREEN                                                       127\n</b>\n\n<b>                               SCREEN MCP:\n</b>                    Terminate control mode.\n                    Activate Matrix storage.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    128  FLYNN                                                        128\n</b>\n\n         grinning, typing.\n\n\n<b>                               FLYNN\n</b>                    Now, how do you expect to run the\n                    universe if you let a few unsolvable\n                    problems throw you like that? C'mon,\n                    big boy, let's see what...\n\n\n<b>                               MCP\n</b>                    You're entering a big error, Flynn...\n                    I'm going to have to put you on the\n                    Game Grid.\n\n\n<b>                               FLYNN\n</b>                    Games, huh? I'll give you --\n\n\n         Suddenly, before Flynn can go on, the gigantic laser mechanism\n         behind him sends a brilliant beam of LIGHT directly at him. He\n         freezes. We see his body beginning to break into scan lines, like\n         a video image -- the same thing that happened to Gibbs' polymer\n         ball. We can see the terminal also glowing in the intense light,\n         being scanned by the laser. The colors change, become monochromatic -\n         with Flynn's body glowing orange - and the image of his figure\n         blurs and becomes indistinct. ZOOM IN on Flynn and\n\n<b>                                                   DISSOLVE TO:\n</b>\n\n    129  THE CAMERA RUSHING over a circuit pattern, like the one      129\n         we saw at the opening of the film'.\n\n\n         The pattern changes, dissolving into another image and we are\n         rushing forward at great speed. We see the circuits rushing by and\n         getting larger and then the picture dissolves into darkness with a\n         glowing, spinning globe beneath us, like the globe from AIC's logo,\n         covered with circuits. We are rushing at it, circling it, diving\n         closer and closer, so that the detail on the globe becomes clearer\n         with every second and we realize that the circuits are structures,\n         angular towers and buildings, huge mechanical looking mountains and\n         deserts covered with a glowing grid pattern. Everything glows with\n         an internal energy.\n\n\n         We continue diving, down, down, faster and faster and we see the\n         structures of one city-like area across electronic mesas and cliffs,\n         and then we're right over this area and diving straight down,\n         everything blurring with the speed.\n\n<b>                                                   DISSOLVE TO:\n</b>\n<b>    130  ELECTRONIC WORLD - A TUNNEL                                  130\n</b>\n\n         made up of rings of energy, and we are diving straight down it.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    131  THIS TUNNEL                                                  131\n</b>\n\n         We see a human figure falling feet first down this tunnel from the\n         outside, and suddenly we're at the bottom, and the figure stops,\n         staggering from the force of the fall, but upright.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    132  SHOT OF THE BOTTOM OF THE TUNNEL                             132\n</b>\n\n         We see Flynn, or what looks like Flynn -- same face, etc, but now\n         covered with a strange costume, made of electronic circuitry,\n         glowing with energy. Flynn shakes his head dazedly.\n\n\n<b>                               FLYNN\n</b>                    Oh, man... this isn't happening. It only\n                    thinks it's happening...\n\n\n         He looks up and SEES something.\n\n\n<b>    133  FLYNN'S POV                                                  133\n</b>\n\n         A horrendous, towering character, carrying a long, glowing staff,\n         is right in front of him. This character reaches out an arm and\n         grabs Flynn.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    134  FLYNN                                                        134\n</b>\n\n         being dragged off the entry tube platform.\n\n\n<b>                               FLYNN\n</b>                    Hey! Take it easy! Look, if this is\n                    about those parking tickets, I can\n                    explain everything...\n\n\n<b>    135  THE BRIDGE OF THE AIRCRAFT CARRIER                           135\n</b>\n\n         hovering over the Game Grid. We see Sark in his feet sockets, his\n         hands spread out flat on the table in front of him. A BUZZING NOISE\n         fills the chamber and a holographic image begins to form, shimmering\n         into awful shape. We see the stretched out face dissolving into the\n         cylinder of the MCP.\n\n\n<b>                               MCP\n</b>                    SARK, ES-1117821. Open communication.\n\n\n         Sark suddenly snaps to awareness, directing all his attention to the MCP.\n\n\n<b>                               SARK\n</b>                            (hoarsely)\n                    Yes, MCP.\n\n\n<b>                               MCP\n</b>                    I've got a little challenge for you, Sark --\n                    a new recruit. He's a tough case, but I\n                    want him treated in the usual manner. Train\n                    him for the games... let him hope for a\n                    while... and blow him away.\n\n\n<b>                               SARK\n</b>                    You've got it. I've been hopin' you'd send\n                    me somebody with a little moxie ... what\n                    kind of program is he?\n\n\n<b>                               MCP\n</b>                    He's not any kind of program, Sark.\n                    He's a User.\n\n\n         Sark looks up, shocked.\n\n\n<b>                               SARK\n</b>                    A User?\n\n\n<b>                               MCP\n</b>                    That's right. He pushed me...in the\n                    other world. Somebody pushes me, I push\n                    back. So I brought him down here ...\n                    What's the matter, Sark? You look nervous.\n\n\n\n<b>                               SARK\n</b>                    Well, I -- it's just -- I don't know,\n                    a User, I mean... Users wrote us. A User\n                    even wrote you...\n\n\n<b>                               MCP\n</b>                    Now get this straight, pal -- no one\n                    User wrote me. I'm worth a couple million\n                    of their man-years! I'm bigger than all\n                    those little wimps put together!\n                            (disgust)\n                    Humans they can't even keen their social\n                    order in one piece\n\n<b>                               SARK\n</b>                    But-what if I can't...?\n\n\n<b>                               MCP\n</b>                    You rather take your chances with me?\n                    Want me to slow down your power cycles\n                    for you?\n\n\n         The circuits going into the energy sockets fade; we see Sark weaken.\n\n\n<b>                               SARK\n</b>                    Wait...I need that...\n\n\n<b>                               MCP\n</b>                    Then pull yourself together. Get this\n                    clown trained. I want him in the Games\n                    until he dies playing.\n\n                    Acknowledge.\n\n\n<b>                               SARK\n</b>                             (weakly)\n                    Yes...acknowledge, Master Control...\n\n\n<b>                               MCP\n</b>                    End of line.\n\n\n         The hologram disappears and Sark's power returns.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    136  INT. CORRIDOR BENEATH GAME GRID                              136\n</b>\n\n         Two guards leading Flynn down it, ECHOING FOOTSTEPS.\n\n\n         They turn a corner and continue, finally stopping in front of a\n         cell. The door opens automatically. Flynn holds back.\n\n\n<b>                               GUARD\n</b>                    Video Game Unit #18. In here, program.\n\n\n<b>                               FLYNN\n</b>                           (trying to grab\n                           the guard's arm)\n                    Who you callin' \"program,\" program?\n\n\n         The guard shoves Flynn inside and SLAMS the door, cutting off his\n         voice.\n\n\n<b>    137  INT. CELL                                                    137\n</b>\n\n         The same type of cell Crom was thrown into in the title sequence.\n         Flynn is leaning against the door, staring at his hands.\n\n\n<b>    138  HIS POV                                                      138\n</b>\n\n         Flynn's hands are glowing, electrified.\n\n\n<b>    139  CLOSE SHOT                                                   139\n</b>\n\n         of his face. His head comes up and we see an expression of terrible\n         understanding on his face. Voices are coming through the opening\n         of the neighboring cell.\n\n\n<b>    140  INT. NEXT CELL - RAM'S                                       140\n</b>\n\n         Ram is standing at the window that divides his cell from Tron's.\n\n\n<b>                               RAM\n</b>                          (looking over\n                          his shoulder)\n                    New guy...\n\n\n<b>                               TRON\n</b>                         (shakes his head)\n                    Another free program off line.  What's\n                    his User s'posed to do -- ?\n\n\n<b>                               RAM\n</b>                             (sighs)\n                    The Users...you really think they're\n                    still there?\n\n\n<b>                               TRON\n</b>                    They'd better be...I don't want to bust\n                    outta this dump an' find nothin' but\n                    a lot of cold circuits waitin' for me.\n\n\n<b>    141  FLYNN'S CELL                                                 141\n</b>\n\n         He can hear the VOICES, but can't see anything except Ram's back,\n         so he goes to the window and tries to reach through.\n\n\n<b>                               FLYNN\n</b>                    Hey! Who are you guys?\n                    What's the story around here?\n\n\n         But as his hand reaches the dividing point between the two cells,\n         it hits an invisible barrier, and we see a brilliant energy field\n         come instantaneously into existence, stopping his hand, and then\n         disappearing. Flynn pulls back in shock.\n\n\n<b>    142  RAM                                                          142\n</b>\n\n         turning towards Flynn as he hears this noise.\n\n\n<b>                               RAM\n</b>                    You want to watch those force fields...\n\n\n         He goes to the window opening.\n\n\n<b>                               RAM (CONT.)\n</b>                    You'll be having plenty of chances to\n                    get hurt, don't worry about that.\n\n\n<b>                               FLYNN\n</b>                    Look...just so I can tell my friends\n                    what this dream was about, okay?\n                    Where am I?\n\n\n<b>                               RAM\n</b>                    You're a...\"guest\" of the Master Control\n                    Program. They're going to make you play\n                    video games.\n\n\n<b>                               FLYNN\n</b>                             (relieved)\n                    Well, great, that's no sweat -- I play\n                    video games better than anybody.\n\n\n         Ram gives Flynn an astonished look, but before he can say anything,\n         there's a tremendous POUNDING NOISE, and the door of Flynn's cell\n         opens.\n\n\n<b>    143  THE CORRIDOR                                                 143\n</b>\n\n         we see guards pulling out other CAPTIVES from their cells, and as\n         Flynn is led off down the corridor, Tron and Ram are taken in the\n         opposite direction.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    144  TRAINING ARENA                                               144\n</b>\n\n         A large area which opens onto the Game Grids from above, with\n         balconies overlooking the action. Overhead, the aircraft carrier\n         hovers menacingly, casting a shadow on the programs below. The new\n         captives are led out onto the ledges, herded by the guards. They\n         pass some of the Blue Video Warriors, who LAUGH and make fun of\n         them. Flynn is in the front of the line.\n\n\n<b>                               HEAD GUARD\n</b>                    Look operative, you guys. Command\n                    Program Sark will explain the training\n                    procedures.\n\n\n         Sark speaks from the bridge of the carrier, and his voice is\n         amplified over the grid.\n\n\n<b>                               SARK\n</b>                            (reciting a\n                         routine statement)\n                    Greetings. The Master Control Program has\n                    chosen you to serve your system on the\n                    Came Grid.\n\n<b>    145  FLYNN'S FACE                                                 145\n</b>\n         reacting.\n\n<b>    146  BRIDGE OF AIRCRAFT CARRIER                                   146\n</b>\n         Sark, looking out over the grid.\n\n\n<b>                               SARK\n</b>                    Those of you who continue to profess\n                    a belief in the Users will receive\n                    the standard substandard training.\n                    This will result in your eventual\n                    elimination.\n\n\n<b>    147  INT. TRAINING AREA - MED. SHOT - FLYNN                       147\n</b>\n\n         Looking down into the game arenas at his feet and over at one of\n         the conscripts next to him.\n\n\n<b>                               SARK V.0.\n</b>                    Those of you who renounce this\n                    superstitious and hysterical belief\n                    will be eligible to join the Warrior\n                    Elite of the MCP.\n\n\n<b>    148  FLYNN'S POV                                                  148\n</b>\n         of the two blue warriors behind the group of new conscripts.\n\n\n<b>    149  POV SHIFTS TO SHOT OF THE CARRIER                            149\n</b>\n<b>                               SARK V.0.\n</b>                   You will each receive an identity disk.\n                   Everything you do or learn will be\n                   imprinted on this disk.\n\n<b>    150  ZOOM IN                                                      150\n</b>\n\n         on the bridge of the carrier and -\n\n\n<b>    151  SARK                                                         151\n</b>\n\n         leaning forward.\n\n\n<b>                               SARK\n</b>                    The Master Control Program regrets\n                    that it cannot be responsible for\n                    Identity disks lost or stolen. if you\n                    lose your disk, or fail to follow\n                    commands, you will be subject to\n                    immediate de-resolution. That is all.\n\n\n<b> 152-175 0MIT                                                         152-175\n</b>\n<b>                                                   CUT TO:\n</b>\n<b>         MONTAGE - FLYNN'S TRAINING\n</b>\n\n    176  1. SHOT OF FLYNN, held immobile while a laser scans          176\n            his mouth.\n\n\n    177  2. A LINE OF RECRUITS files past a checkpoint. Each          177\n            is handed a disk.\n\n    178  3. THE RECRUITS file out into a training area.               178\n\n    179  4. We see AN ARM being fitted with a cesta.                  179\n\n    180  5. ONE of the more experienced CONSCRIPTS, RAM,              180\n            demonstrates the throw with the cesta.\n\n\n    181  6. FLYNN tries an awkward throw. In the b.g. other           181\n            recruits are practicing.\n\n\n    182  7. RAM instructs Flynn. Flynn is getting better. He          182\n            spins and catches a pellet.\n\n\n    183  8. A demonstration of the DISK GAME by two other warriors.   183\n\n    184  9. FLYNN practices a ricochet shot at a target --            184\n            hits perfectly.\n\n\n<b>            END MONTAGE\n</b>\n\n<b>    185  FLYNN BACK IN HIS CELL                                       185\n</b>\n\n         for a rest period. He is pacing back and forth, and we can see Ram\n         seated in the next cell. Flynn goes to the bars.\n\n\n<b>                               FLYNN\n</b>                    Hey, Ram ... what were you ...\n                    you know, before?\n\n\n<b>                               RAM\n</b>                           (nostalgic,\n                            brightens)\n                    Oh, I was an actuarial program...\n                    worked at a big insurance company.\n                    It really gives you a great feeling,\n                    helping folks plan for their future\n                    needs -- and of course, if you look\n                    at the payments as an annuity, over\n                    the years, the cost is really\n\n\n<b>                               FLYNN\n</b>                             (about to\n                             get bored)\n                    Yeah, yeah -- that's great.\n\n\n<b>                               RAM\n</b>                    How 'bout yourself?\n\n\n<b>                               FLYNN\n</b>                    Oh, uh...I don't remember too much...\n\n\n<b>                               RAM\n</b>                              (nods)\n                    Sure, a little disorientation. That's\n                    normal, when they transport you. It'll\n                    come back to you. You're doing real\n                    well in training. Remarkable, really...\n\n\n         The POUNDING on Flynn's cell begins again.\n\n\n<b>    187  THE BRIDGE OF THE AIRCRAFT CARRIER                           187\n</b>\n\n         We see Flynn being led down the hall on the big screen behind Sark's\n         console. Sark is staring up at the screen, frowning, nervous,\n         frightened of this new User-warrior.\n\n\n<b>                               SARK\n</b>                         (over his shoulder)\n                    Wait a minute...put this guy against\n                    one of the other recruits.\n\n\n<b>    188  OMIT                                                         188\n</b>\n<b>    189  A SHOT FROM IN FRONT OF FLYNN AND CROM                       189\n</b>\n\n         We see they are entering an open part of the Game Grid, with two\n         bridges of energy extending across open space to two separate\n         circular platforms, made up of concentric glowing rings. Crom\n         marches across-one of these, and Flynn follows suit on the other.\n         When they each reach the circular platforms, the bridges disappear.\n         We see Flynn turn and stare back across the empty space, then turn\n         and face his opponent. Above them a third floating disk hovers. He\n         looks over at Crom, who's anxious.\n\n\n<b>                               FLYNN\n</b>                    Looks like we're in the same boat here -\n\n\n<b>                               CROM\n</b>                              (jumpy)\n                    You think you're gonna wipe me right\n                    out, don't you?\n\n\n<b>                               FLYNN\n</b>                    No, I\n\n\n         A buzzer sounds. The game begins. Crom hurls a glowing pellet\n         upwards. It strikes the upper platform, ricochets off, and heads\n         straight for Flynn.\n\n\n         Flynn lunges, but misses. The pellet strikes one of the rings of\n         his platform, and that ring dissolves. Flynn's lunge takes him\n         right to the edge of the open space created, and he just catches\n         himself in time to keep from falling over the edge.\n\n\n<b>    190  FLYNN'S POV - DOWN                                           190\n</b>\n         down, down between the rings into an infinite pit.\n\n\n<b>    191  BACK TO FLYNN                                                191\n</b>\n         staring down. There's a SOUND and he looks up.\n\n<b>    192  HIS POV                                                      192\n</b>\n\n         Another pellet hits the mirror platform and hurtles down at him.\n\n\n<b>                               FLYNN\n</b>                    Hey!\n\n\n<b>    193  FLYNN                                                        193\n</b>\n\n         reacting, judging where this one will fall, racing to the farther\n         edge of his platform, leaping over the empty ring on the way, and\n         catching the pellet before it can' hit. He throws it back.\n\n\n<b>    194  CROM                                                         194\n</b>\n\n         Flynn's pellet hits the mirror, flashes down on him. Crom strains,\n         but misses. One of his rings disappears.\n\n    195  FLYNN reacting                                               195\n\n\n<b>                               FLYNN\n</b>                       (happy he's scored)\n                    Okay!\n\n<b>    196  SARK'S AIRCRAFT CARRIER - THE BRIDGE                         196\n</b>\n         High above the game we see Sark watching.\n\n\n<b>    197  FLYNN                                                        197\n</b>\n\n         racing for another catch. He makes it and hurls the pellet again.\n         We see that Crom's platform is disappearing fast.\n\n\n<b>    198  OMIT                                                         198\n</b>\n<b>    199  THE GAME IN PROGRESS                                         199\n</b>\n\n<b>                               FLYNN\n</b>                    Here's an easy one...\n\n\n         Flynn throws again. The pellet hits the mirror platform and heads\n         straight at Crom, who misses it. The pellet destroys the ring he\n         was standing on, and Crom has to grab frantically at the edge of\n         the next ring to keep from falling.\n\n\n<b> 200-201 OMIT                                                         200-201\n</b>\n\n<b>    202  FLYNN                                                        202\n</b>\n\n         He is sent another pellet from above and catches it, holding it\n         ready, waiting for his opponent to get back up on the ring.\n\n\n<b>    203  SARK                                                         203\n</b>\n\n         His face lit from below by the glow of the Game Grid... angry\n\n\n<b>    204  FLYNN                                                        204\n</b>\n\n         He puts down his cesta. Suddenly a voice rings out from above.\n         Flynn looks up. There, appearing in the mirror disk above, is Sark's\n         face, furious, huge.\n\n\n<b>                               SARK\n</b>                    Finish the game!\n\n\n<b>    205  FLYNN                                                        205\n</b>\n\n         staring at this apparition. He grits his teeth.\n\n\n<b>                               FLYNN\n</b>                            (shouts up)\n                    No!\n\n\n<b>    205A REAL WORLD - A BUS STATION                                   205A\n</b>\n\n         In a Greyhound station waiting area, two kids are playing a video\n         game, which appears to have broken down.\n\n\n<b>                               KID\n</b>                    What's wrong with it?\n\n\n<b>                               KID 2\n</b>                    I don't know... on the blink\n                    or something... damn.\n\n<b>    205B ELECTRONIC WORLD - FLYNN, SARK, ETC. AS BEFORE               205B\n</b>\n\n<b>                               SARK\n</b>                    Kill him!!!\n\n\n         Flynn holds up the pellet... and drops it down into the abyss below.\n         He stares back up at Sark's immense image.\n\n\n<b>                               FLYNN\n</b>                    No!\n\n\n<b>    206  SARK'S HUGE REFLECTED IMAGE                                  206\n</b>\n\n         in the mirror platform, towering above Flynn.\n\n\n<b>                               SARK\n</b>                    You'll regret this.\n\n<b>    207  SARK'S FINGER                                                207\n</b>\n\n         pressing a button.\n\n\n<b>    208  CROM                                                         208\n</b>\n\n         The ring he is holding on to dissolves, and with a SCREAM, he\n         falls... and falls ... and falls...\n\n\n<b>    209  SHOT FROM BELOW FLYNN                                        209\n</b>\n         with Flynn visible, staring down, and the huge face of Sark above\n         him.\n\n<b>    210  SARK                                                         210\n</b>\n\n         on the bridge. His finger wavers over another button, almost\n         presses it... We see him-straining, trying to overcome his\n         conditioning. Then he snatches his hand away.\n\n\n<b>                               SARK\n</b>                           (looking up)\n                    No! You said he could die in the games\n\n<b>    211  FLYNN                                                        211\n</b>\n         staring up. The image on the mirror wavers and dissolves.\n\n\n<b>    212  SARK                                                         212\n</b>\n\n         He SLAMS his palm down on a panel on the console, and a BUZZER\n<b>         SOUNDS.\n</b>\n\n<b>    213  FLYNN                                                        213\n</b>\n\n         as the bridge to his platform reappears, and we see guards starting\n         to run across to him.\n\n\n<b>    214  RAM AND TRON                                                 214\n</b>\n\n         The sound of GUARDS' running feet approaching their cells. They look\n         up.\n\n\n<b>    215  A CORRIDOR IN THE GAME AREA                                  215\n</b>\n\n         Flynn is being escorted down it. A couple of big Blue Warriors go by\n         and deliberately brush into Flynn.\n\n<b>                               WARRIOR\n</b>                          (turning on Flynn,\n                              snarling)\n                    Outta  my way, rookie.\n\n\n         Flynn stares at him; then, in one smooth motion, reaches to his back\n         and pulls out his disk.\n\n\n<b>                               FLYNN\n</b>                    Out of my way, zero bit.\n\n\n         He moves as if to throw the disk.\n\n\n<b>                               WARRIOR\n</b>                            (backing away)\n                    Sure, sure ... just kiddin'.\n\n\n         The other warrior grabs this one by the arm and pulls him away as\n         Flynn and his guards continue on.\n\n\n<b>    216  THE HOLDING AREA FOR THE LIGHT CYCLE GAME                    216\n</b>\n\n         Ram and Tron are escorted in as Flynn is brought in from another\n         corridor. Three blue warriors are lined up, waiting.\n\n\n<b>                               RAM\n</b>                    Flynn! Look, Tron, he survived!\n\n\n<b>                               FLYNN\n</b>                         (under his breath)\n                    Tron...?\n\n\n         He leans over to get a better look at Tron and GASPS in surprise.\n\n<b>                               FLYNN\n</b>                    Alan!\n\n<b>                               TRON\n</b>                            (frowning)\n                    Where did you hear that name?\n\n\n<b>                               FLYNN\n</b>                    Well, isn't it -- ?\n\n\n<b>                               TRON\n</b>                    The name of my User, yeah. But how... ?\n\n\n<b>                               FLYNN\n</b>                          (thinking fast)\n                    I, uh... I'm a program from a User\n                    that... knows Alan...?\n\n\n<b>                               RAM\n</b>                    He was disoriented in transport, Tron.\n\n\n<b>                               FLYNN\n</b>                    Yeah, but I'm remembering all kinds of\n                    stuff. Like...my User wants me to go\n                    after the MCP\n\n\n         Before they can go on, the BUZZER sounds.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    217  LONG SHOT OF THE AIRCRAFT CARRIER                            217\n</b>\n\n         floating over the Game Grid, with a view of the light cycle arena.\n         ZOOM IN on the section of the grid where the game is about to start.\n\n\n<b>    218  A SHOT FROM ABOVE                                            218\n</b>\n\n         The three Blue Warriors are lined up facing our friends, on opposite\n         sides of the large arena, about a half mile square, surrounded by\n         high bulwarks, and surveyed by Recognizers. We can see the carrier\n         hovering high overhead.\n\n\n<b>    219  CLOSE ON TRON                                                219\n</b>\n\n<b>                               TRON\n</b>                    That's what my User wants, too...\n\n\n<b>    220  SHOT OF THE THREE FRIENDS                                    220\n</b>\n\n         holding the handlebars of the cycles in front of them. We see Tron\n         and Ram looking at Flynn, in the center.\n\n\n<b>                               FLYNN\n</b>                    I know...\n\n\n<b>    221  CLOSE SHOT - FLYNN                                           221\n</b>\n\n         With a sizzling electrical discharge, the light cycle is inscribed\n         around him.\n\n\n<b>    222  SHOT OF THE THREE BLUE CYCLES                                222\n</b>\n\n         ready to go.\n\n\n<b>    223  SHOT OF THE THREE CONSCRIPT CYCLES                           223\n</b>\n\n         also ready.\n\n\n<b>    224  SARK                                                         224\n</b>\n\n         His finger presses a button and the BUZZER SOUNDS again.\n\n\n<b>    225  SHOT FROM ABOVE OF ALL CYCLES TAKING OFF                     225\n</b>\n\n         We see the six solid walls being formed behind the cycles. As we\n         watch the outer four cycles veer off to either side, leaving Tron\n         and his opponent speeding suicidally at each other:\n\n\n<b>    226  OMIT                                                         226\n</b>\n\n<b>    227  TRON'S POV                                                   227\n</b>\n\n         of the other cycle heading straight at him.\n\n\n<b>    228  SHOT FROM ABOVE                                              228\n</b>\n\n         We see these two cycles come together and almost crash ... but both\n         turn at the last second to the same side and continue rushing\n         forward. The other cycles can be seen racing around the edge of the\n         arena.\n\n\n<b>                               FLYNN'S VOICE\n</b>                                (into mike)\n                    Nice one!\n\n\n<b>    229  SHOT OF TRON AND HIS OPPONENT                                229\n</b>\n\n         They start making turns, passing walls they have already created,\n         each trying to box the other in.\n\n\n<b>                               TRON'S VOICE\n</b>                               (into mike)\n                    Ram, stay all the way over ...\n\n\n<b>    230  CLOSE SHOT FROM THE SIDE - TRON                              230\n</b>\n         rushing forward.\n\n\n<b>    231  SHOT OF THE CYCLES                                           231\n</b>\n         turning.\n\n<b>                               RAM'S VOICE\n</b>                               (into mike)\n                    I've got control. Go ahead.\n\n\n<b>    232  SHOT FROM IN FRONT OF TRON'S CYCLE                           232\n</b>\n\n<b>    233  SHOT FROM ABOVE                                              233\n</b>\n         They rush past a wall, headed directly for a bulwark at the end of\n         the arena. Tron is on one side, but the Blue Warrior is on the\n         inside. Tron forces the warrior to smash straight into the wall.\n         There is an explosion as the cycle de-rezzes, and a crack forms in\n         the bulwark. We see that the walls created by the de-rezzed warrior\n         dissolve as he does.\n\n<b>    234  SHOT OF FLYNN                                                234\n</b>\n         rushing alongside his opponent. They make a turn.\n\n<b>    235  CLOSE UP OF FLYNN                                            235\n</b>\n<b>    236  LONG SHOT                                                    236\n</b>\n         They make another turn\n\n\n<b>    237  SHOT OF TWO CYCLES RUSHING                                   237\n</b>\n         right at the camera.\n\n\n<b>    238  FLYNN'S POV                                                  238\n</b>\n         of the maze of walls. He gets clear for a moment and spots the crack\n         in the bulwark.\n\n<b>    239  CLOSE UP - HIS FACE                                          239\n</b>\n         reacting, getting an idea.\n\n<b>                               FLYNN\n</b>                            (into mike)\n                    You guys...follow me.\n\n\n<b>    240  SHOT OF THE TWO CYCLES                                       240\n</b>\n\n         racing together, approaching the bulwark. At the last second, the\n         Blue Warrior turns, but Flynn races right at the crack.\n\n\n<b>    241  SARK                                                         241\n</b>\n\n         observing this. With satisfaction. Now he will be rid of the User.\n\n\n<b>    242  FLYNN                                                        242\n</b>\n\n         He races straight at the crack... and through it.\n\n\n<b>    243  SARK                                                         243\n</b>\n\n         His face suffused with anger. He SLAMS a fist down on the console\n         in front of him.\n\n\n<b>    244  LONG SHOT OF THE GRID                                        244\n</b>\n\n         The remaining four cycles are still racing around the arena.\n\n\n<b>    245  CLOSE UP - TRON                                              245\n</b>\n\n         reacting to Flynn's escape, hope in his eyes.\n\n\n<b>    246  ANGLE ON RAM                                                 246\n</b>\n\n         SMASHING another one of the Blue Warriors against a wall. He turns\n         and races up next to Tron.\n\n\n<b>    247  SHOT OF THEM                                                 247\n</b>\n\n         side by side. They look at each other.\n\n\n<b>                               RAM\n</b>                           (into mike)\n                    What do you think?\n\n\n<b>                               TRON\n</b>                           (into mike)\n                    Do it!\n\n\n<b>    248  LONG SHOT                                                    248\n</b>\n\n         We see their cycles veer off and head straight for the crack. We\n         HEAR a LOUD SIREN and a mechanical voice starts up:\n\n\n<b>                               VOICE\n</b>                      (through loudspeaker)\n<b>                    WARRIORS MUST STAY WITHIN THE GAME GRID.\n</b><b>                    REPEAT: ALL WARRIORS MUST STAY WITHIN THE\n</b><b>                    GAME GRID. WARNING. WARNING.\n</b>\n\n         We continue to hear this voice repeating under the escape, gradually\n         diminishing as the three friends get farther away, until it dies\n         out altogether.\n\n<b>    249  SHOT OF TWO RECOGNIZERS                                      249\n</b>\n         moving towards the dividing bulwark, passing over it.\n\n<b>    250  SHOT OF THE THREE ESCAPING CYCLES                            250\n</b>\n\n         racing through the narrow crack in the bulwark, barely enough room\n         to get by. They emerge into an open corridor, with the Recognizers\n         appearing overhead. We watch the cycles rush past the CAMERA...\n\n<b>    251  SARK                                                         251\n</b>\n\n         He is pacing across the bridge of the carrier, smashing guards out\n         of his way.\n\n\n<b>                               SARK\n</b>                    Get them. Send out every Game\n                    Tank in the Grid! Get them!\n\n<b>    252  SHOT FROM BELOW FLYNN                                        252\n</b>\n\n         as he looks up and spots the Recognizers hovering over them, about\n         to come down for the kill.\n\n\n<b>                               FLYNN\n</b>                            (into mike)\n                    Watch it!\n\n<b>                               RAM\n</b>                           (into mike)\n                    Recognizers!\n\n<b>    252A SHOT OF RAM                                                  252\n</b>\n\n         heading for a smaller opening in one wall, labeled \"Game Storage.\"\n\n<b>    253  SHOT FROM BEHIND                                             253\n</b>\n         as the three cycles race into the opening. The Reco's are blocked,\n         way too big to fit through the opening.\n\n<b>    254  INT. WEAPONS STORAGE - SERIES OF SHOTS                       254\n</b>\n\n         FROM FLYNN'S POV as they rush through long narrow rooms filled with\n         rows of tanks and missiles. As they speed past, the rows of tanks\n         REV UP, turn in formation, one after the other, like the Rockettes,\n         and follow.\n\n\n<b>    255  EXT. MAZE                                                    255\n</b>\n\n         Outside the game area, an electronic desert reminiscent of the Grand\n         Canyon, with giant pillars rising high into the air, lined with\n         narrow ridges and ledges. The cycles rush around corners of the\n         ledges, pursued by the tanks, high above the flat surface. They come\n         around a corner onto a wider ledge with several dark openings in the\n         face of the cliff. They stop for a moment.\n\n<b>    255A ANGLE ON FLYNN                                               255A\n</b>\n<b>    256  CLOSE UP - TRON'S FACE                                       256\n</b>\n         listening.\n\n<b>                               TRON\n</b>                            (into mike)\n                    Game Tanks! Come on\n\n<b>    257  SHOT FROM ABOVE                                              257\n</b>\n         as the three cycles rev up and race off, headed for one of the\n         narrow openings in the cliff face, and plunge into it, disappearing\n         from view.\n\n<b>    258  INT. OF THE CAVE                                             258\n</b>\n\n         We see the three cycles descend a long sloping ramp into the\n         darkness, down, down into the dry rot section. The cycles come to a\n         stop and de-rez. Leaving each man standing with just the handlebars\n         between his fists. They all let out a long SIGH and relax.\n\n\n<b>                               FLYNN\n</b>                    Oh man...when you're on the other side\n                    of the screen...it all looks so easy...\n\n\n         Ram and Tron look at Flynn as if he's crazy, then start smiling and\n         grinning, until all three are LAUGHING.\n\n\n<b>    259  DESERT LABYRINTH                                             259\n</b>\n\n         as the force of tanks RUMBLES through the terrain, the aircraft\n         carrier hovering overhead.\n\n\n<b>    260  BRIDGE OF THE AIRCRAFT CARRIER                               260\n</b>\n\n         Sark is staring feverishly out over the barren landscape.\n\n\n<b>                               SARK\n</b>                       (to one of the bridge\n                            personnel)\n                    Get the pursuit force back into 404A.\n                    There's no place else they could be...\n\n\n         Sark's lieutenant is watching the wall-sized screen behind Sark,\n         where we can see a diagram of the area, with the tanks visible,\n         moving through it. He turns to Sark.\n\n\n<b>                               LIEUTENANT\n</b>                              (confidently)\n                    We'll have them in no time, sir. Long\n                    before the interrupt interface.\n\n\n<b>                               SARK\n</b>                         (whirls on him)\n                    We better, null unit. I'll be lucky if\n                    the MCP doesn't blast me into a dead zone.\n                    I want those programs!\n\n\n<b>    261  INT. CAVE                                                    261\n</b>\n\n         Ram, Tron and Flynn are climbing up to an opening in the wall of the\n         cave. Beyond them we can see a cluster of structures, like a\n         cityscape, and one enormous TOWER with a golden beam of light rising\n         from it, farther up than the eye can see. No tanks are visible.\n\n\n<b>                               FLYNN\n</b>                           (looking out)\n                    It's all circuits...\n                         (points at tower)\n                    Must be an input/output component...\n\n\n<b>                               RAM\n</b>                    The tower, yes -- Flynn, have you\n                    remembered anything else about\n                    yourself -- like what sector you're\n                    from?\n\n\n<b>                               FLYNN\n</b>                           (sitting down\n                          against a rock)\n                    Well...my home \"sector\" was called\n                    Paramus ...\n\n\n<b>                               RAM\n</b>                           (sits also)\n                    PARAMUS... wonder what those initials\n                    stand for ... (starts counting them\n                    off on his fingers) ...probably Program\n                    Assist Routine -- well, it sounds like\n                    a lovely place.\n\n\n<b>                               FLYNN\n</b>                              (shrugs)\n                    It grows on you.\n\n\n         He notices that Tron is not listening to them any longer, but is\n         gazing upwards.\n\n\n<b>                               TRON\n</b>                            (murmuring)\n                    I can feel it ...\n\n\n         Flynn and Ram turn.\n\n\n<b>                               FLYNN\n</b>                    Feel what? You okay?\n\n\n<b>                               RAM\n</b>                    Alan-One...\n\n\n<b>                               TRON\n</b>                    Yes... he's got something to tell me...\n\n\n         Ram and Tron look out at the distant tall tower.\n\n\n<b>                               RAM\n</b>                    You think we can make it there?\n\n\n<b>                               TRON\n</b>                    We have to.\n\n\n<b>                               FLYNN\n</b>                      (pointing to a corner\n                           of the cave)\n                    Hey, what's that?\n\n\n         They all look back, into the darkness behind them. A glowing stream\n         can just be seen. Ram gets up.\n\n\n<b>                               RAM\n</b>                    it's just what we need.\n\n\n<b>    262  INT. NICHE                                                   262\n</b>\n\n         Ram and Tron are drinking, kneeling at the stream of flowing,\n         brilliant LIGHT.\n\n\n<b>                               TRON\n</b>                    Oh, that's nice. You always forget how\n                    good fresh energy feels, till you get\n                    to a pure source...\n                            (to Flynn)\n                    Have some...you'll need it.\n\n\n         Flynn goes to the stream, dips his hands in, takes a drink.\n\n\n<b>                               FLYNN\n</b>                         (wiping his mouth)\n                    well... when do we pay a call on the ol'\n                    Master Control?\n\n\n         Tron and Ram are taken aback.\n\n\n<b>                               TRON\n</b>                    What, just the three of us?\n\n\n<b>                               FLYNN\n</b>                              (shrugs)\n                    You know anybody that's got an army for\n                    rent, that's fine...but my, uh, User said\n                    to go take that sucker out. An' let's\n                    face it, the big ox isn't gonna get any\n                    weaker. I feel like hittin' him now,\n                    while I'm good an' mad. Some nerve...\n                    what does he care whether you guys get\n                    killed, long as he keeps rakin' in\n                    quarters?\n\n\n<b>                               RAM\n</b>                            (to Tron)\n                    Do you know what he's talking about?\n\n\n<b>                               TRON\n</b>                            (to Flynn)\n                    I have to find out what Alan wants...\n                    that comes first.\n\n\n<b>                               FLYNN\n</b>                    Okay, that's first. Maybe he knows\n                    what to -\n\n\n         Suddenly, we hear a RUMBLING SOUND. Flynn looks up sharply.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    What's that?\n\n\n<b>                               TRON\n</b>                    Tanks...coming back. Let's go.\n\n\n         With that, there's an EXPLOSION from outside the cave. Each of the\n         men holds up his cycle handlebars, and the three cycles SIZZLE back\n         into shape and race up the ramp, and on out.\n\n\n<b> 263-265 OMIT                                                         263-265\n</b>\n<b>    266  EXT. CAVE                                                    266\n</b>\n\n         The three cyclists pause at the cave opening, sizing up possible\n         avenues of escape in the terrain below.\n\n\n<b>                               FLYNN\n</b>                              (points)\n                    How about over there...that empty\n                    memory?\n\n\n<b>                               TRON\n</b>                           (shakes head)\n                    No good...they might block off the\n                    old chip.\n                             (points)\n                    This way.\n\n\n         The cycles race out of the cave entrance and head down, away from\n         the approaching tanks, through the electronic canyons, shells\n         EXPLODING around them. We see the tanks close behind.\n\n\n<b>    267  POV OF A GUN SIGHT                                           267\n</b>\n\n         from inside of the tanks, of the three bikes heading into a narrow\n         arroyo.\n\n\n<b>    268  SHOT OF THE CYCLES                                           268\n</b>\n\n         They just make it around the corner when an EXPLOSION boasts the\n         entrance to the arroyo, entering what appears to be a maze of very\n         narrow canyons with short walls. They turn another corner and come\n         to the edge of a gaping ravine.\n\n\n         Several hundred feet to their left a narrow bridge connects their\n         ledge with another canyon wall, and a wider ledge, which leads down\n         to the floor of the entire area, and on to freedom.\n\n\n<b>                               TRON'S VOICE\n</b>                    The bridge! Come on!\n\n\n         The tanks are following through the maze, smooth gray automatons,\n         lifeless, inexorable nemesis. Tron's cycle is in the lead as all\n         three race for the bridge, but behind them, we see the first tank\n         turning the corner.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    269  POV OF TANK GUNSIGHT                                         269\n</b>\n\n         as the turret swings around and focuses on the bridge.\n\n\n<b>    270  SHOT OF THE BRIDGE                                           270\n</b>\n\n         Tron races out on it, Ram and Flynn behind. Just as Tron reaches\n         the other side and Ram has just started to cross, there's a\n         tremendous EXPLOSION of electronic FLAK, blasting Ram and tossing\n         him back on top of Flynn. Both cycles de-rez. The bridge disappears,\n         and a mass of rubble falls, partially Obscuring Ram and Flynn. Tron\n         SCREECHES to a halt and swings his bike back around.\n\n\n         He looks around -- Ram and Flynn are nowhere in sight. in the ravine\n         below, he SEES a pile of motionless rubble.\n\n\n         The tank fires again, narrowly missing Tron, and he REVS up again,\n         speeds off down the ramp, and is gone.\n\n\n<b>                                                   CUT TO:\n</b><b> 271-272 OMIT                                                         271-272\n</b>\n\n<b>    273  FLYNN AND RAM                                                273\n</b>\n\n         Ram is badly injured, unconscious. Flynn struggles to his feet,\n         sees the tank turret swiveling towards him, grabs Ram and picks him\n         up.\n\n\n<b>    274  SHOT OF FLYNN                                                274\n</b>\n\n         struggling with Ram's limp body, wedging himself into a narrow crack.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    275  SARK                                                         275\n</b>\n\n         in the carrier above. He is watching the action on the wall screen\n         behind his console, back to the camera. The picture is coming from\n         the lead tank. To him, it appears as though Ram and Flynn had been\n         blown up, since no sign of them is visible. We can see his\n         lieutenant nearby, operating the communications.\n\n\n<b>                               SARK\n</b>                         (to lieutenant)\n                    Make contact with master Control...\n                             (smiles)\n                    he'll be pleased to hear we're all\n                    finished with that User he sent us.\n\n\n<b>    276  EXT. DESERT - TRON'S CYCLE                                   276\n</b>\n         speeding through the flat, desert-like terrain, heading straight for\n         the cityscape tower in the distance.\n\n<b>    277  SHOT IN FRONT OF HIM - HIS FACE                              277\n</b>\n         Far behind him, we see the image of Sark's carrier ponderously\n         moving in his direction.\n\n<b>                                                   CUT TO:\n</b>\n<b>    278  FLYNN AND RAM                                                278\n</b>\n\n         Flynn is supporting Ram, half carrying him, and it is\n         getting darker.\n\n\n<b>                               FLYNN\n</b>                    You gonna make it?\n\n\n         Ram weakly nods, but doesn't look very convincing. Flynn bites his\n         lip and struggles on. They are down on the floor of the desert,\n         leaving the towering canyons behind. A large, dim shape can be made\n         out. Flynn peers at it hopefully and struggles towards it.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    279  FLYNN                                                        279\n</b>\n\n         arriving in front of a block-like shape, with a narrow opening.\n         Exhausted, Flynn lets Ram down to the ground, goes to the opening\n         and looks in. Looks okay, so he comes back.\n\n<b>                                                   CUT TO:\n</b>\n<b>    280  FLYNN AND RAM                                                280\n</b>\n\n         sitting down inside the hiding place, collapsing. Ram is unconscious\n         anyway, and Flynn's eyes soon closed.\n\n\n<b>                                                   FADE TO BLACK:\n</b><b>    281  FADE UP FROM BLACK                                           281\n</b>\n\n         Some light comes in the opening, and we see Flynn lying on a\n         platform across from Ram. Ram's glow appears to be almost gone.\n         Flynn's eyes open. For a second he doesn't know where he is, but\n         then he spots Ram, and comes fully awake. Ram is watching him. Flynn\n         looks around. He gets up and stretches, his hand reaching up towards\n         the ceiling. It brushes against one panel and suddenly the energy\n         glow from his body seems to leap from his hand to the panel, leaving\n         it with a glow of its own. The entire chamber starts to shake and\n<b>         RUMBLE.\n</b>\n\n<b>                               FLYNN\n</b>                           (holding onto\n                             the wall)\n                    What's goin' on?\n\n\n<b>                               RAM\n</b>                      (looking around, weak)\n                    We're inside a Recognizer...\n                            (to Flynn)\n                    You are crazy -- stealing a Recognizer --\n\n\n<b>                               FLYNN\n</b>                       (stumbling, trying to\n                         keep his balance)\n                    Are you kidding? I think it's stealing us -\n\n\n         Flynn tentatively places his-hands on separate parts of the\n         instruments. An energy flow starts, and with a mighty heave and\n         shudder, the chamber they're in turns over, knocking both Flynn and\n         Ram to one side. The Recognizer is now in its standard upright\n         position.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    282  EXT. SHOT OF THE RECOGNIZER                                  282\n</b>\n\n         as it stands up, covered with a static overlay, partially de-rezzed.\n\n\n<b>    283  INT. RECOGNIZER                                              283\n</b>\n\n         Through the head of the Reco, we can look out at the landscape below.\n\n\n         Flynn sits stunned for a moment, then stumbles over to Ram, who's\n         going fast.\n\n\n<b>                               FLYNN\n</b>                    You okay? You don't look so good.\n\n\n         Ram nods weakly.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    Hang on. We'll get you outta here.\n\n\n         Flynn touches panels, trying to get the Recognizer going, but with\n         no result.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    Damn! Never fails... minute the\n                    warranty runs out...\n\n\n<b>                               RAM\n</b>                    Come here.\n\n\n         Flynn goes over to him and kneels. Ram grabs his hands. Suddenly\n         Ram's fading glow begins to flow through their clasped hands into\n         Flynn. Horrified, Flynn tries to pull away, but Ram holds him fast.\n\n\n<b>                               FLYNN\n</b>                    Hey... !\n\n\n<b>                               RAM\n</b>                    Little more juice's all it needs...\n\n\n         Ram's last bit of energy flows into Flynn and Ram's body de-rezzes.\n         Flynn watches in horror, frantically trying to reverse the flow,\n         but it's too late. Ram disappears before his eyes. Stunned, he\n         gazes at the empty space for a moment, then stands up.\n\n\n<b>                                                   DISSOLVE TO:\n</b>\n\n<b>    284  THE CITY LANDSCAPE                                           284\n</b>\n\n         Tron arrives at the city, gazing around an empty, surreal, burnt-out\n         landscape. Buildings seem two dimensional, barely there, at a low\n         rate of power, so drained by the MCP. The cycle de-rezzes. There's a\n         NOISE from above, and Tron looks up.\n\n\n<b>    285  TRON'S POV                                                   285\n</b>\n\n         A Recognizer floats over the city, moving towards him.\n\n\n<b>    286  EXT. CITY LANDSCAPE                                          286\n</b>\n         He hides behind a building as the Reco passes. A strange, zombie-like\n         figure comes down one of the streets, and the Recognizer swoops over\n         it, the static field flashing between the legs, passing through the\n         figure, dissolving it.\n\n\n<b>    287  CLOSE UP TRON'S FACE                                         287\n</b>\n\n         Very grim. He looks out onto the street and sees two more of the\n         figures, standing together, staring at each other, barely moving.\n         Dead, lifeless, but animate. Tron comes out on the street, staring\n         at these figures. He locks around the city in confusion, shaking his\n         head sadly, but walks on.\n\n\n<b>    288  TRON TURNS A CORNER                                          288\n</b>\n\n         Up ahead we see a large, multi-storied factory-like building.\n\n\n<b>    289  CLOSE UP - TRON IS FACE                                      289\n</b>\n         This is what he was looking for. He looks from side to side,\n         figuring the best way to get to the building. In front of the\n         building stand a small group of the memory guards.\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    290  EXT. CITY - LONG SHOT                                        290\n</b>\n         of the city, and the tower and beam rising high into the air, with\n         Sark's carrier far away, nearing the city.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    291  EXT. CITY - LONGER SHOT                                      291\n</b>\n\n         over the complex landscape, of the distant city and tower, with\n         Sark's carrier far away, nearing the city.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    292  INT. RECOGNIZER - FLYNN                                      292\n</b>\n         This was his POV out of the window of the Recognizer. His face is\n         sad, he is still mourning Ram. This is a very low point. He sighs,\n         then looks around, putting his palm on one panel after another.\n         One of them glows brilliantly as he touches it, and the Recognizer\n         gives a violent shake, then stops.\n\n\n<b>                               FLYNN\n</b>                    Never gonna figure out how to work\n                    this thing...\n\n\n         There's a NOISE from above. He looks up.\n\n\n<b>    293  HIS POV                                                      293\n</b>\n\n         We see a bright glow behind one of the pieces of equipment.\n\n\n<b>    294  FLYNN                                                        294\n</b>\n\n         His eyes widen, then narrow. He non chalantly turns away, pretending\n         to be still examining things.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    295  THE GLOW                                                     295\n</b>\n\n         Appearing again, peeking around the corner. It comes forward, trying\n         to get a look at Flynn. The BIT.\n\n\n<b>    296  WIDE SHOT                                                    296\n</b>\n\n         Flynn whirls around, fingers poised like a gunfighter. The Bit gives\n         a violent start and leaps back, out of the way, but immediately\n         comes back, peering at Flynn. Flynn is moving closer.\n\n\n<b>                               FLYNN\n</b>                    Okay -- hold it right there!\n\n\n         The Bit is still in its pure energy form, but then it suddenly\n         recognizes Flynn (thinks he is Clu), expands in a smooth green\n         sphere -- the \"Yes\" mode and shouts:\n\n\n<b>                               BIT\n</b>                    Yes!\n\n\n         The Bit subsides into energy form again.\n\n\n<b>                               FLYNN\n</b>                        (still suspicious)\n                    What do you mean, \"'yes\"?\n\n\n<b>                               BIT\n</b>                    Yesssss. Yes. Yes. Yes.\n\n\n         From now on, whenever the Bit speaks, it is a ball-shaped character,\n         red or green, with a hint of a face, but as soon as it stops\n         speaking, it reverts to a brilliant spark of light.\n\n\n<b>                               FLYNN\n</b>                    That all you can say?\n\n\n<b>                               BIT\n</b>                         (of course not,\n                         you know better)\n                    No, nyet, negatory, not on your\n                    tintype, no way.\n\n\n<b>                               FLYNN\n</b>                    Oh. Anything else?\n\n\n<b>                               BIT\n</b>                    Oui, da, yessiree, sure 'nuff, you betcha.\n\n\n<b>                               FLYNN\n</b>                    only yes and no...\n                             (it dawns)\n                    You're a bit.\n\n\n<b>                               BIT\n</b>                             (hippie)\n                    For sure...\n\n\n<b>                               FLYNN\n</b>                    where's your program? Won't it miss you?\n\n\n<b>                               BIT\n</b>                            (confused)\n                    No...\n\n\n         Flynn eyes the bit cautiously.\n\n\n<b>                               FLYNN\n</b>                    I'm your program?\n\n\n<b>                               BIT\n</b>                            (emphatic)\n                    Right on the money!\n\n\n<b>                               FLYNN\n</b>                              (sighs)\n                    Another mouth to feed... you don't by any\n                    chance know how to drive this crate?\n\n\n         In answer, the Bit moves toward the center of the cabin where a\n         platform supports a four-foot tube with a crossbar. Flynn follows,\n         stares at the setup for a moment, then steps onto the platform and\n         grabs the cross-bar.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    Like so?\n\n\n         Before the Bit can answer, Flynn's power flows into the Recognizer,\n         and it takes off like a bat out of hell\n\n\n<b> 297-298 OMIT                                                         297-298\n</b>\n<b>    299  EXT. RECOGNIZER                                              299\n</b>\n\n         heading for the city. It lurches forward unevenly, crashing drunkenly\n         into a wall and bouncing off another one.\n\n\n<b>    300  INT. RECOGNIZER                                              300\n</b>\n\n<b>                                   FLYNN\n</b>                        Way to go! We're haulin'!\n\n\n<b>                                   BIT\n</b>                        Yes, okay, exactement!\n\n\n<b> 301-302 OMIT                                                         301-302\n</b>\n\n<b>    303  INT. SIMULATION HANGER COMPLEX                               303\n</b>\n\n         This is the building Tron was eyeing when we left him. We see him\n         inside now, in a corridor, passing a large opening which gives views\n         of partially completed structures: an aircraft carrier, a strange\n         elongated craft that resembles a sailboat on its side. All composed\n         partially of glowing lines, and partially of flat smooth surfaces.\n         We see several female programs working in these rooms. This building\n         only has female workers, but they are all pale and listless, no\n         interest in anything, staring at their feet as they shuffle along.\n         Tron looks farther down the corridor.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    304  HIS POV                                                      304\n</b>\n\n         We see a file of the female workers coming down the corridor towards\n         Tron.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    305  TRON                                                         305\n</b>\n\n         as he moves back against the wall, into a niche.\n\n\n         As the first girl passes his vantage-point, his hand flashes out and\n         grabs her around the mouth, yanking her back into the niche with him.\n         The line of workers mechanically files on past.\n\n\n         We watch from the rear of the niche, as Tron holds the girl against\n         his chest until all the workers are gone. She struggles feebly,\n         half-heartedly.\n\n\n<b>                               TRON\n</b>                    I'm not gonna hurt you.\n\n\n         She stops struggling.\n\n\n<b>                               TRON (CONT.)\n</b>                    I'm going to let you go now... don't\n                    scream, or I'll be very sorry.\n\n\n         His hands loosen, and he releases her.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    306  SHOT FROM IN FRONT                                           306\n</b>\n\n         We see the faint pale image of the girl from full face for the first\n         time. She looks tired and uninterested. Her face...is Lora's face,\n         still beautiful in its pallor.\n\n\n<b>                               TRON\n</b>                    Put your hand behind your back.\n\n\n         Slowly she obeys.\n\n\n<b>    307  CLOSE UP - TRON                                              307\n</b>\n\n         A slow smile appears on his face.\n\n\n<b>    308  SHOT OF THEM BOTH                                            308\n</b>\n\n         He extends his own hand to touch hers, palm to palm. As contact is\n         made, a rich glow appears between the two hands, strengthening as we\n         watch. A look of wonder crosses her face as the energy flows into\n         her. She turns, entwining her fingers in Tron's.\n\n\n<b>                               GIRL\n</b><b>                    TRON!!\n</b>\n\n         She throws her arms around him.\n\n\n<b>                               TRON\n</b>                        (smiling, hugging\n                           her tightly)\n                    Yori... hey...\n\n\n<b>                               YORI\n</b>                    Oh, Tron... I knew you'd escape...\n                    they've never built circuit that could\n                    hold you...\n\n\n         She-looks around nervously.\n\n\n<b>                               YORI\n</b>                          (pulling him by\n                             his hand)\n                    This way. Come on.\n\n\n         They walk quickly toward a flight of stairs.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    309  THE STREETS                                                  309\n</b>\n\n         Tron and Yori are cautiously passing along the sidewalk. We can see\n         the glowing beam of the 1/0 Tower over the tops of all the buildings,\n         and several half-gone programs standing around. As they pass, they\n         hear snatches of conversation.\n\n\n<b>                               PROGRAM\n</b>                    ...artillery for Video Game Sector...\n\n\n<b>                               PROGRAM 2\n</b>                    ...all mathematical functions\n                    transferred to...\n\n\n<b>                               YORI\n</b>                    I can't believe how bad it's gotten\n                    around here since the MCP started\n                    taking over... all the good functions\n                    have shut down... everybody looks so dead...\n                    I'm afraid to even go out during down-time...\n\n\n<b>                               TRON\n</b>                    That's all going to change, Yori...\n\n\n<b>                               YORI\n</b>                    How?\n\n\n<b>                               TRON\n</b>                    Don't know yet... I have to get\n                    in touch with Alan. He was going\n                    to tell me how to\n\n\n         Suddenly Yori looks up, sees something, grabs Tron's hand and pulls\n         him back into a nearby alley. She points up in the air.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    310  EXT. SKY - HER POV                                           310\n</b>\n\n         as she looks up. Recognizer.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    311  YORI                                                         311\n</b>\n\n         She shivers, and holds Tron's hand tighter.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    312  EXT. YORI'S BUILDING - LONG SHOT                             312\n</b>\n\n         Tron and Yori arrive at the ground level entrance.\n\n\n<b>    313  INT. HALLWAYS                                                313\n</b>\n\n         Tron and Yori walk through long hallways and arrive at her door.\n         She whistles and the door disappears. They step through.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    314  INT. YORI'S APARTMENT                                        314\n</b>\n\n         As Tron and Yori enter. The apartment appears to be a box, with one\n         window overlooking the cityscape, and the I/0 Tower. At first it\n         looks empty, with strange murals of one dimensional furniture on the\n         walls and floors.\n\n<b>                               YORI\n</b>                    My quarters.\n\n<b>                               TRON\n</b>                    Why is everything...like this?\n\n\n<b>                               YORI\n</b>                    It's a flat. But wait a micro...\n\n\n         She lays her palm on the wall near the door. The door reappears, and\n         a glow starts to fill the room, softly, slowly. Tron looks around;\n         the flat paintings of furniture are expanding, filling out, becoming\n         three-dimensional. The room glows a soft rose color, becomes\n         charming, soothing. It is still small and limited, but the light in\n         the air and the few pieces of furniture give off a loving, seductive\n         aura. Tron turns back to Yori, smiling, and stops.\n\n\n<b>    315  HIS POV                                                      315\n</b>\n\n         With her hand still on the wall panel, she is glowing absorbing\n         extra energy, changing. The severe work clothes metamorphosize into\n         shimmering, diaphanous drapery, twinkling with thousands of\n         diamond-like points of light. A silvery tinkling SOUND comes from\n         her robes as she moves forward; her beautiful face, now surrounded\n         by a soft mane of hair, glows with pleasure at the expression in\n         Tron's face. She smiles lovingly, and reaches out her hand.\n\n\n<b>                               YORI\n</b>                    Come here.\n\n\n<b>    316  TRON                                                         316\n</b>\n\n         His face tells the story. The fugitive, returned from long exile, is\n         being fully rewarded for his efforts.\n\n\n<b>                               TRON\n</b>                    You're beautiful, Yori.\n\n\n<b>    317  SHOT OF THEM BOTH                                            317\n</b>\n         as their hands touch, and the glow springs out between their\n         flattened palms.\n\n\n         Tron pulls her close to him, sliding his hand up her arm, leaving a\n         glowing trace, and her hands move up over his chest.\n\n\n<b>                               YORI\n</b>                    You've grown, big program.\n\n\n<b>                               TRON\n</b>                    I had to...in the games...\n\n\n         They move together into an embrace, but their lips never touch. All\n         the energy is transmitted through their hands. They sink down onto\n         what looks like cushions made of stars, their glow increasing. The\n         room fills with the brilliance of the energy they are giving each\n         other, and we hear their sighs, as the MUSIC comes up. Each of them\n         moves their hands over the other, moving slowly, as if they were\n         trying to touch the other's entire body at once. They roll over and\n         are enveloped in the cloud of stars...\n\n\n<b>                                                   SLOW, SLOW DISSOLVE TO:\n</b>\n\n<b>    318  EXT. AIRCRAFT CARRIER                                        318\n</b>\n\n         hovering in the air above the factory city, moving slowly forward.\n         ZOOM OUT past the carrier towards the landscape beyond.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    319  EXT. CITY - L0NG SHOT                                        319\n</b>\n\n         A slightly out-of-control Recognizer arrives in the city, wobbling,\n         careening, glancing off a building or two.\n\n\n<b> 320-321 OMIT                                                         320-321\n</b>\n<b>    322  INT. RECOGNIZER                                              322\n</b>\n\n         Flynn is having trouble controlling the Reco.\n\n\n<b>                               FLYNN\n</b>                    This honey doesn't handle so good\n                    in town...\n\n\n<b>                               BIT\n</b>                            (agreeing)\n                    No, nuh-uh, never in a million years!\n\n\n         He lays his hands from panel to panel, causing one after another to\n         light up in a random pattern, almost with a beat, but the Recognizer\n         only slams into another building and keeps going. The Bit starts\n         shouting:\n\n\n<b>                               BIT\n</b>                    Ix-nay! Noper! Under no conditions -\n\n\n         Flynn looks frantically around, spies a large panel to one side that\n         he hasn't tried yet, and slaps his palm down on it.\n\n\n<b>                               BIT\n</b>                           (that's more\n                             like it)\n                    Right, confirmed, I couldn't have\n                    put it -\n\n\n<b>                                                   CUT TO\n</b>\n\n<b>    323  EXT.                                                         323\n</b>\n\n         as the Reco screeches to a screaming stop... but the head of it,\n         with Flynn and the Bit, breaks loose, and flies through the air,\n         landing in what looks like a garbage dump.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    324  INT.                                                         324\n</b>\n\n         as Flynn shakily pulls himself out of the debris, the Bit nervously\n         hovering over him.\n\n\n<b>                               FLYNN\n</b>                              (to Bit)\n                    Catch me listening to you again.\n\n\n<b>    325  EXT.                                                         325\n</b>\n\n         A group of low resolution programs are walking by. Flynn emerges\n         from the broken-off head, stunned, but unhurt, the Bit flying by\n         his side. He blearily sees the passing programs, but doesn't realize\n         they are at such a low state of consciousness that they can't see\n         him.\n\n\n<b>                               FLYNN\n</b>                    Hey. Hi. Hey, everything's okay. Fine.\n                    Little trouble, but we're okay. Thanks\n                    for your concern. So long.\n\n\n         They move on.\n\n\n<b>                               FLYNN\n</b>                            (to the Bit)\n                    This town's full o' live ones.\n\n\n<b>                               BIT\n</b>                    Not a chance.\n\n\n<b>    328  EXT. CITY PLAZA                                              328\n</b>\n\n         Tron and Yori are crossing an open plaza-like area, on their way to\n         the I/0 Tower. They pass by more zombie-like programs and overhear\n         bits of conversation, all in dead-sounding monotones.\n\n\n<b>                               PROGRAMS\n</b>                    I have to re-route the insurance\n                    information bits... Next cycle we\n                    start the war game simulation for\n                    the MCP... Did you make that accounts\n                    receivable adjustment for Sark...\n                    Certainly... the MCP wants only\n                    minimal functions left in Sector 84Q.\n\n\n<b>    329  EXT. THE BASE OF THE I/0 TOWER                               329\n</b>\n\n         It looms high overhead.\n\n\n<b>    330  TRON AND YORI                                                330\n</b>\n\n         on a long curving walkway which encircles the base of the Tower,\n         approaching a wide door in the wall.\n\n\n<b>    331  INSIDE THIS DOOR'                                            331\n</b>\n\n         We see that it opens onto a wide elevator platform, which is now\n         rising upwards at a steep angle, carrying Tron and Yori smoothly\n         and silently towards an opening in a floor a hundred feet overhead.\n\n\n<b>    332  SHOT FROM BELOW THEM                                         332\n</b>\n         looking upwards as they move.\n\n<b>    333  THE UPPER FLOOR                                              333\n</b>\n\n         as the elevator platform arrives, and they step off. We get the\n         sense of massive, over-size ceilings, floors, windows and machinery,\n         dwarfing the programs who come to the Tower to communicate,\n         preparing them for the experience, as a vaulting cathedral prepared\n         the sinner for confession. But here, everything is composed of clean,\n         sharp, angular surfaces.  On this second story there is floor and\n         ceiling, but no outer wall, so we can still see the city-grid below\n         and beyond.\n\n\n         Tron and Yori cautiously move forward across the floor, heading for\n         a door into the inner parts of the Tower.\n\n\n<b> 334-349 OMIT                                                         334-349\n</b>\n<b>    350  THE CENTRAL CHAMBER                                          350\n</b>\n\n         of the I/0 Tower. A large, raised circular altar stands against one\n         wall, with a darkened opening behind it. A square, secondary altar\n         supports the first, about fifty feet up a side.\n\n\n         In the middle of the altar we see a structure of stacked, diminishing\n         steps, the final one forming the shoulders of an armless, padded\n         suit with a puffed headdress revealing the face of the I/0 Tower\n         priest, DUMONT. His eyes are shut. His face is lined with age, but\n         still holds a sprightly sensitivity. It is the face of Dr. Gibbs,\n         from the laser lab in the Real world. There is a large, V-shaped\n         opening behind the altar, and the circular steps glow a hot neon,\n         each a different color. The stripes of color thus formed bleed\n         upwards onto the wall, lining either side of the V opening. There is\n         only blackness beyond.\n\n\n<b>    351  DUMONT'S FACE                                                351\n</b>\n         asleep.\n\n<b>    352  REVERSE ANGLE                                                352\n</b>\n\n         Tron and Yori walk toward him from an entranceway across the wide\n         room, their footsteps ECHOING.\n\n<b> 353-374 OMIT                                                         353-374\n</b>\n<b>    375  CENTRAL CHAMBER - TRON, YORI, DUMONT                         375\n</b>\n         Tron and Yori stop at the foot of Dumont's altar.\n\n\n<b>                               YORI\n</b>                             (quietly)\n                    Dumont... ?\n\n\n         The priest's eyes flicker open. He looks at Tron and Yori, doesn't\n         recognize either one.\n\n\n<b>                               DUMONT\n</b>                    Yes?\n\n\n<b>                               TRON\n</b>                             (nervous)\n                    I... have come to communicate with\n                    my User.\n\n\n<b>                               DUMONT\n</b>                    Hmm. A difficult proposition...\n                    difficult proposition at best.\n                       (indicates empty chamber)\n                    Perhaps you've noticed... we're not\n                    exactly packing them in these days ...\n\n\n<b>                               YORI\n</b>                    Yes...what--?\n\n\n<b>                               DUMONT\n</b>                    You know, not so long ago, you\n                    could've come in here and seen\n                    programs lined up all the way back\n                    to those doors, waiting for communion\n                    with their Users. The building fund\n                    was doing well too...but now...\n                               (sighs)\n                    ...this so-called Master Control\n                    Program is going around cutting\n                    programs off from their natural\n                    creators, grabbing all our believers\n                    and making them ride around on little\n                    motor scooters and shoot things at\n                    each other and Weiner knows what all--\n                    oh, it's enough to give you a crisis\n                    of faith...\n\n\n<b>                               TRON\n</b>                    Well I want to communicate --\n\n<b>                               DUMONT\n</b>                    Oh, you want to -- hah. I could\n                    get myself de-rezzed just-for letting\n                    you in here. They hate this tower.\n                    They'd close it down if they dared\n                    to but they keep me around, in case\n                    one of them wants to deal with the\n                    other world once in a while. And\n                    you should hear the way they commune!\n                    Sounds like they were routing a\n                    payroll, for all the heart they put\n                    in it. No, I don't think you\n\n\n         Tron steps closer, speaks quietly to Dumont.\n\n\n<b>                               TRON\n</b>                    Dumont... my User has information\n                    that could -- could make this a\n                    free system again.\n\n\n<b>                               DUMONT\n</b>                    Hah.\n\n\n<b>                               TRON\n</b>                    Really. You'd have programs lined\n                    up around the block to use this\n                    place -- and no MCP looking over your\n                    shoulder.\n\n\n<b>                               DUMONT\n</b>                               (sighs)\n                    When you've been in the system as long\n                    as I have, you hear many promises...\n                    many reassurances...many brave plans...\n\n\n         He pauses, sizing Tron up, considering it. Finally:\n\n\n<b>                               DUMONT (CONT.)\n</b>                           (falling into ritual)\n                    Who is your User, program?\n\n\n<b>                               TRON\n</b>                    Alan-One. He calls me... may I pass?\n\n\n<b>                               DUMONT\n</b>                    All that is visible must grow beyond\n                    itself and extend into the realm of\n                    the invisible.\n\n\n         Dumont nods, and the neon glow fades a little.\n\n\n<b>                               DUMONT\n</b>                    You may pass, my friend.\n\n\n         Tron runs lightly up the steps, past Dumont, into the darkness\n         beyond.\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    376  EXT. 1/0 TOWER                                               376\n</b>\n\n         We see Flynn and the Bit walking towards the Tower, staring\n         curiously at the zombie-like characters on the streets.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    377  A CORRIDOR IN THE TOWER. A CORNER.                           377\n</b>\n\n         We see a face peer around it. Flynn.\n\n\n<b>                               FLYNN\n</b>                    This is where Tron said he was going...\n\n\n         Below him, at waist level, also peeking around the corner, we see\n         the glow of the Bit. Flynn moves out from the wall and starts going\n         down the hall, Bit following.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    Looks like his kind of place, too...\n                    real serious.\n\n\n         CAMERA SWIVELS and watches him walking quickly away from us. We HEAR\n         the sound of many feet marching as Flynn reaches the end of the\n         corridor. He stops and glances over his shoulder.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    378  A SHOT FROM IN FRONT OF HIM                                  378\n</b>\n\n         As he stares down at the far corner. The SOUND of marching feet\n         coming closer.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    379  CLOSE SHOT - MANY FEET MARCHING FAST                         379\n</b>\n\n         PULL BACK AND TRUCK IN FRONT as we get a view of these characters...\n         Sark... and a force of guards and six Blue Warriors. Sark is in\n         front, enjoyment on his face. As far as he's concerned he's just\n         going in for a final, easy kill of one renegade program who is\n         trapped.\n\n\n<b>                               GUARDS\n</b>                    Hut! Hut! hut! Hut! Hut!\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    380  A SHOT OF THE CORRIDOR WHERE WE LAST SAW FLYNN               380\n</b>\n\n         as Sark and his men come around the corner. Flynn is nowhere to be\n         seen. Sark marches TOWARDS THE CAMERA, right into it.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    381  A SHOT FROM THE CORNER                                       381\n</b>\n\n         at Sark and his men from the back as they continue on down the hall.\n         The file of men is moving away. We can see that there is a wide ledge\n         about ten feet up the wall, containing the lighting source.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    382  POV FROM LEDGE                                               382\n</b>\n\n         looking down at the file of men going by. The last one passes.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    383  A SHOT FROM RIGHT BEHIND THE LAST WARRIOR                    383\n</b>\n\n         Flynn suddenly drops down to the floor. The warrior turns snarling,\n         lifting his staff.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    384  A SHOT OF FLYNN'S UPRAISED ARM                               384\n</b>\n\n         his hand in a fist, falling.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    385  A FLASH OF BLUE LIGHT.                                       385\n</b>\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    386  A SHOT FROM ABOVE                                            386\n</b>\n\n         Flynn is standing over the fallen Warrior.\n\n\n<b>                               BIT (V.O.)\n</b>                    All right!\n\n\n         Flynn looks up AT THE CAMERA, finger to his lips.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    387  A SHOT FROM THE CORNER OF THE HALL                           387\n</b>\n\n         We can see Sark's men marching on away from us, and Flynn leaning\n         over the warrior with the Bit hovering over him. As we watch, Flynn\n         places both his hands on the Blue Warrior's chest. Quickly, the blue\n         static pattern covering the guard flows into Flynn's hands up his\n         arms, and transfers entirely to him and the warrior derezzes.\n\n\n<b>                                                   CUT TO:\n</b>\n\n    387A The Bit, upset, BUZZES around Flynn nervously.               387A\n\n\n<b>                               FLYNN\n</b>                    Sshhh I'm still me. Just a different\n                    color. C'mon.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    388  A SHOT OF FLYNN                                              388\n</b>\n\n         marching fast down the corridor, after Sark.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    389  INT. I/0 HALLWAY - MED. SHOT SARK - FULL FACE                389\n</b>\n\n         surrounded by his guards. He. is looking up, eyes narrowed.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    390  A LONG SHOT FROM BEHIND HIM                                  390\n</b>\n\n         We see that he is standing in front of the huge, closed door to the\n         I/0 Tower central chamber. The guards have formed two long rows, and\n         Sark's lieutenant is standing by his side.\n\n\n<b>                               SARK\n</b>                    That old fruitcake Dumont...\n                    he'll pay for this.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    391  A CLOSE SHOT LOOKING OVER SARK'S SHOULDER                    391\n</b>\n\n         He turns.\n\n\n<b>                               SARK\n</b>                    Bring in the logic probe!!\n\n\n<b>    392  THE HEART OF THE TOWER                                       392\n</b>\n\n         We see Tron approaching a bell-shaped structure, with the brilliant\n         golden beam emerging from the highest point of the bell. It is\n         surrounded by a cylinder of energy hundreds of feet in diameter.\n         Tron walks into an opening at the base of the bell.\n\n\n<b>    393  INT. COMMUNICATION BELL                                      393\n</b>\n\n         Tron stands on the rounded rim of a dish-shaped room, the floor of\n         which rises to a cone in the center. The top of the cone is a flat,\n         sliced-off surface. Tron walks down into the dish, a soft, padded\n         surface, and then climbs up to the flat, central podium. We see that\n         this surface is round, about four feet in diameter, and glowing from\n         within, with a complex circuit pattern embedded in it. Tron looks\n         down, and then up.\n\n\n<b>    394  HIS POV                                                      394\n</b>\n\n         The curving inner surfaces of the bell culminate in a round opening.\n\n\n<b>    395  FROM THE OPENING                                             395\n</b>\n\n         We see Tron's upturned face. He steps up on the podium, hands gripped\n         into fists at his sides. His face is gradually filling with a deep\n         inner excitement and anticipation, his eyes searching the space\n         above. His expression remains still, his mouth closed and even. Only\n         his eyes project the emotion he is feeling, burning with the\n         knowledge of the experience to come.\n\n\n<b>    396  A SHOT FROM BELOW HIM, NEAR HIS FEET, LOOKING UP.            396\n</b>\n\n         He takes out his disk, grips it in both hands and slowly raises it\n         high above his head. He stands stiffly, willing the response to\n         happen... At first nothing stirs. Then a splendid, radiant beam of\n         light bursts down from the opening in the top of the bell,\n         illuminating Tron and the disk. His hands start to shake with the\n         force of the communication beam, and suddenly the disk is ripped\n         from his hands, to rise, glowing brilliantly, upwards to the source\n         of the light.\n\n\n<b>    397  TRON'S FACE FROM ABOVE                                       397\n</b>\n\n         filled with a quiet awe, eyes narrowed against the strong light. His\n         hands drop to his sides. The disk rises out of sight, and we\n\n\n<b>                                                   CUT TO:\n</b>\n<b>    397  A SHOT OF THE BEAM                                           397\n</b>\n\n         intensifying with every second.\n\n\n<b>    398  THE 1/0 TOWER CENTRAL CHAMBER                                398\n</b>\n\n         The glow is visible, illuminating Yori and Dumont.\n\n\n<b>    399  EXT. CENTRAL CHAMBER - DOOR                                  399\n</b>\n\n         A machine, floating above the floor, with a pointed cone facing the\n         door, is switched on, and a blast of pure electricity leaps from it\n         to the surface of the door with the SOUND of sizzling LIGHTNING\n<b>         DISCHARGE--\n</b>\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    400  INT. CENTRAL CHAMBER                                         400\n</b>\n\n         Yori turns to look at the door, hearing this muffled sound.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    401  HER POV - THE DOOR                                           401\n</b>\n\n         One section of it is glowing, starting to de-rez.\n\n\n<b>                               YORI V.0.\n</b>                                (Gasp)\n                    Dumont--!\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    402  INT. COMMUNICATION CHAMBER                                   402\n</b>\n\n         Tron is looking upwards. Suddenly a voice booms out, echoing, and\n         distorted, Alan's voice.\n\n\n<b>                               ALAN V.0.\n</b>                    TRON... TRON... Location query...\n                    location query... Confirm.\n\n\n<b>                               TRON\n</b>                    Confirmed, Alan-One.\n\n\n<b>                               ALAN\n</b>                         (sigh of relief)\n                    There you are... look, before we get\n                    cut off again...\n\n\n         In the air above Tron, images begin to materialize, shifting,\n         transparent forms. First we see a network with pinpoints of light\n         at each intersection; it rotates, and becomes a globe, with a\n         bright light at the center.\n\n\n         We see one of the intersection lights become very bright, and the\n         others dim.\n\n\n<b>                               ALAN (V.0.)\n</b>                    I'm going to put some new coding on\n                    your-disk, so you can get into the\n                    memory core of the Master Control...\n                    when you get there...\n\n\n         As Alan's voice continues, we\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    403  INT. DUMONT'S. CENTRAL CHAMBER                               403\n</b>\n\n         A SHOT OF THE de-rezzing door. The dissolving section has expanded,\n         and we can start to see the guards inside.\n\n\n<b>    404  INT. COMMUNICATION CHAMBER                                   404\n</b>\n\n         The light increases in brilliance, as we hear Alan's voice fading out,\n         consumed by static.\n\n\n<b>                               ALAN (V.0.)\n</b>                    search all password code series\n\n\n<b>                               TRON\n</b>                    Wait! I can't hear...\n\n\n         He stops.\n\n\n         The voice is gone. The beam continues to bathe Tron in its glow, and\n         gradually we see an object emerging from the glow. The disk. It\n         slowly descends, Tron raises his hands to catch it, gripping it,\n         pulls it down and stares at it.\n\n\n<b>                                                  CUT TO:\n</b>\n\n<b>    405  POV - THE DISK                                               405\n</b>\n\n         It is glowing with a new power. Superimposed on its surface is a\n         complex mandala pattern, changing kaleidoscopically as we watch,\n         shifting swirling liquid color.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    406  OMIT                                                         406\n</b>\n<b>    407  THE DOOR                                                     407\n</b>\n\n         Almost gone. We can hear the voices of Sark's men outside.\n\n\n<b>                               YORI (V.0.)\n</b>                    Dumont! The door...\n\n\n<b>    408  YORI                                                         408\n</b>\n\n         turning back to Dumont. Behind Dumont stands Tron, framed in the\n         entry to the Communication chamber.\n\n\n<b>    409  OMIT                                                         409\n</b>\n\n<b>    410  SHOT OF DUMONT                                               410\n</b>\n\n         He is rising from the altar, the rest of his body emerging from the\n         neon steps, until he is standing in front of Tron. We see that he\n         has on a floor-length robe with huge shoulder pads forming\n         winglike supports for the fabric.\n\n\n<b>                               DUMONT\n</b>                    I have waited for this moment many\n                    thousands of cycles. It is time for the\n                    new order to begin... The Users are\n                    waiting.\n\n\n         As we watch, Tron comes forward, and grips Dumont's shoulder briefly.\n         Then he holds out his hand to Yori.\n\n\n    411  LONG SHOT as Yori steps forward up the steps.                411\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    412  EXT. CHAMBER - THE DOOR                                      412\n</b>\n\n         We see it is almost transparent, and as we watch, there is a burst\n         of energy and the door disappears into thousands of sparkling dots\n         of light.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    413  INT. CHAMBER - THE DOOR                                      413\n</b>\n\n         It dissolves completely. Framed in the center of the opening, stands\n         Sark.\n\n\n<b>                               SARK\n</b>                            (pointing)\n                    Dumont!\n\n\n         The blue warriors race by him, pouring into the chamber.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    414  FULL SHOT - CHAMBER                                          414\n</b>\n\n         We see Dumont standing on the top of the steps, no sign of Tron and\n         Yori. The guards spread out through the room, Sark strides towards\n         Dumont.\n\n\n<b>                               SARK\n</b>                    Where's the program?\n\n\n<b>                               DUMONT\n</b>                         (dotty-old-man act)\n                    Program? I'm sure you're mistaken.\n\n<b>    414A CLOSE SHOT - SARK                                            414\n</b>\n\n         furious.\n\n\n<b>                               SARK\n</b>                    Take him!!!\n\n\n<b>    415  EXT. SIMULATION HANGAR                                       415\n</b>\n\n         As we see Tron and Yori racing through the streets, headed for it.\n\n\n<b>    416  INT. HANGAR                                                  416\n</b>\n\n         Tron and Yori enter. Solar Sailer simulation hovers.\n\n\n<b>    417  A LONG SHOT                                                  417\n</b>\n\n         As Tron and Yori race across the floor.\n\n\n<b>                               YORI (V.0.)\n</b>                    This way...there's a simulation\n                    we can use...\n\n\n         And we see them race towards it.\n\n\n<b>    418  SHOT OF THEM RISING ON AN ELEVATOR PLATFORM, FROM            419\n</b><b>         ABOVE, LOOKING DOWN AT THEM.\n</b>\n<b>    419  A SHOT FROM THE SIDE OF THE SAILER, RISING WITH TRON         419\n</b><b>         AND YORI\n</b>\n         We see that this vessel is a simulation of a futuristic spacecraft,\n         designed for travel in the Real world using solar energy, with an\n         enormous metallic sail to catch the rays of sunlight like wind, and\n         move with the speed of light.  The sail is at the bow of the craft,\n         and a long, slender walkway connects it with the deck area, which is\n         made up of several connected flattened box-shapes, giving it the\n         look of a dragonfly. In this world, the Sailer catches data\n         transmission beams instead of sunlight, and is propelled along the\n         information paths to the Central Processing Unit.\n\n<b>                               TRON V.O.\n</b>                    Can it carry us?\n\n\n<b>                               YORI V.0.\n</b>                    The design is good... We don't know\n                    why the User abandoned the project...\n\n\n         The elevator platform brings Tron and Yori through the center,\n         forming part of the deck as it reaches a level position, locked\n         into place.\n\n\n<b>    420  SHOT OF THEM FROM THE LONG WALKWAY, FACING THE STERN         420\n</b>\n\n         We see Yori bending over a console of touch panels.\n\n\n<b>                               YORI\n</b>                    Yes...it can take us across the\n                    Sea of Simulation... all the way\n                    out of the Game Grid...to the MCP.\n\n\n<b>                               TRON\n</b>                           (looking out\n                            of hangar)\n                    As long as it gets us out of here\n\n\n<b>    421  EXT. HANGAR                                                  421\n</b>\n\n         The crowd of Sark's men are racing towards it.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    422  EXT. SOLAR SAILER DECK - TRON AND YORI                       422\n</b>\n\n         Bending over the console, from the POV of the sail. As we watch, a\n         head leans into the frame from the right. A memory guard. Then we\n         see a hand gripping a staff, and the legs of another guard on the\n         left.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    423  THE TWO OF THEM FROM A LOW ANGLE                             423\n</b>\n\n         On the console, as Yori leans over it. We see that she is looking at\n         a map of the system, a flat grid, and on it, in miniature, are the\n         beam transfer points and transmission location.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    424  THE TWO GUARDS, CREEPING DOWN THE WALKWAY                    424\n</b>\n\n         silently. We can see Tron's back as he hears a noise. His head snaps\n         up; he sees the guards.\n\n\n<b>                               TRON\n</b>                    Yori! Get down!\n\n\n<b>    425  THE GUARDS                                                   425\n</b>\n\n         Abandoning any attempt at silence, leap forward, shouting, thrusting\n         their staffs at Tron.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    426  A LOW ANGLE, AS TRON KICKS THE FIRST GUARD BACK              426\n</b>\n\n         and slashes the second across the face, knocking him out.\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    427  EXT. ENTRANCE TO THE HANGAR                                  427\n</b>\n\n         As Sark's men rush in and head for the stairs to the catwalks that\n         ring the hangar walls. They start swarming up.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    428  TRON                                                         428\n</b>\n         reacting, holding his disk ready.\n\n<b>                                                   CUT TO:\n</b>\n<b>    429  OMITTED                                                      429\n</b>\n<b>    430  WALKWAY OF SAILER                                            430\n</b>\n\n         as guards start swarming on board. We see Tron move forward and then\n         stop, letting them come.\n\n\n<b>                                                   CUT TO:\n</b>\n<b>    431  YORI'S POV - LONG SHOT                                       431\n</b>\n\n         looking down at the walkway. Beyond it we can see the great door\n         starting to rise.\n\n<b>    432  TRON                                                         432\n</b>\n\n         throwing his disk. It smashes into the guards in front, tossing them\n         backwards.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    433  A SHOT FROM THE EXTERIOR OF THE HANGAR                       433\n</b>\n\n         The great door is almost all the way up. We can see the Sail with\n         its tip ready to emerge. Below, on the ground, more guards are\n         racing towards the hangar.\n\n\n<b>    434  TRON                                                         434\n</b>\n\n         Beating back the guards, tossing them over the side of the walkway.\n         We see one last guard standing on top of the bunker that forms the\n         connection of the craft to the sail. Tron advances on him... the\n         guard stares at him, then looks down... then jumps off, intimidated.\n         There's a sudden lurch forward, and Tron is thrown back, losing\n         his balance.\n\n\n<b>    435  YORI                                                         435\n</b>\n\n         smiling.\n\n\n<b>                               YORI\n</b>                    We're off!\n\n\n<b>    436  EXT. HANGAR                                                  436\n</b>\n\n         The transmission beam is flowing, passing directly through the craft,\n         from behind, hitting the sail bunker, and passing through, so that\n         it looks like a headlight. The Sailer starts moving, fast,\n         accelerating so that it reaches a tremendous velocity in a matter of\n         seconds.\n\n\n<b>    437  EXT. AIRCRAFT CARRIER - BRIDGE - SARK &amp; MCP                  437\n</b>\n         Back on the bridge of the carrier, Sark is in the MCP hologram. In\n         front of him, we see a view of the city below, and the hangar, and\n         the Solar Sailer -- racing away.\n\n\n<b>                               MCP\n</b>                    I hope you've enjoyed being a command\n                    program, Sark. I wonder how you'll like\n                    working in a pocket calculator... maybe\n                    one of those watches that plays \"Happy\n                    Birthday\" to its User once a year.\n\n\n<b>                               SARK\n</b>                    Now, sir... We did take care of that\n                    User you sent us --\n\n\n<b>                               MCP\n</b>                    Yes, and now you've got two renegade\n                    programs running all the hell over the\n                    system in a stolen simulation.\n\n\n<b>                               SARK\n</b>                    We'll get them, sir... These things\n                    take time.\n\n\n<b>                               MCP\n</b>                    I don't have time, Sark. And neither\n                    do you. End of line.\n\n\n<b> 438-439 OMIT                                                         438-439\n</b>\n\n<b>    440  SOLAR SAILER - WALKWAY - TRON                                440\n</b>\n\n         from the stern. Tron picks himself up from the floor where he was\n         thrown when the Sailer took off, and heads for Yori (at the camera).\n         He stops, seeing something.\n\n\n<b>                               YORI V.O.\n</b>                    Tron, are you all right?\n\n\n         Tron waves at her... then...\n\n\n<b>    441  CLOSE SHOT FROM IN FRONT OF TRON                             441\n</b>\n\n         He looks over at the guard rail.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    442  TRON'S POV                                                   442\n</b>\n\n         fingers gripping the rail. ZOOM IN on the fingers.\n\n\n<b>                                                        CUT TO:\n</b>\n\n<b>    443  A SHOT FROM BELOW THE WALKWAY                                443\n</b>\n\n         Several yards away from it. We see one of the blue warriors hanging\n         on, trying to get a leg up on the rail, and we see Tron race to the\n         edge, look over and see this guard.\n\n\n<b>    444  CLOSE SHOT OF TRON                                           444\n</b>\n\n         By the rail with the blue arms and head in the shot. Tron raises his\n         disk to slam into the intruder, when suddenly a spherical glowing\n         shape comes into the frame from bottom right.\n\n\n<b>                               BIT\n</b>                      (buzzing around Tron's\n                         head like a fly)\n                    No way, not on your life, no siree!!\n                    Nothing doing, forget it!!!\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    445  SHOT OF WARRIOR'S FACE                                       445\n</b>\n\n         ....Flynn.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    446  FLYNN'S POV OF TRON                                          446\n</b>\n\n         Who looks down, really seeing the face below for the first time.\n\n\n<b>                               TRON\n</b>                    Flynn!!\n\n\n<b>    447  SIDE SHOT OF THEM BOTH                                       447\n</b>\n\n<b>                               FLYNN\n</b>                    Greetings, program...\n\n\n<b>                               TRON\n</b>                           (dumbfounded)\n                    You're alive!\n\n\n<b>                               FLYNN\n</b>                    Yeah, I... oops!\n\n\n         He loses his grip, and starts to fall. But Tron, just in time, grabs\n         Flynn's wrist and starts to pull him up. We see the blue static guard\n         disguise fade off Flynn.\n\n\n<b>    449  YORI                                                         449\n</b>\n         leaning over the control console anxiously, watching Tron come up\n         the steps towards her with Flynn and the Bit.\n\n\n<b>    450  WIDER SHOT                                                   450\n</b>\n\n         As they reach her.\n\n\n<b>                               YORI\n</b>                            (nervously)\n                    Who is this?\n\n\n         We see Flynn look at Yori and silently mouth \"Lora\" in surprise...\n         but then realize his mistake.\n\n\n<b>                               TRON\n</b>                             (smiling)\n                    Flynn...\n                           (he turns to\n                          Flynn eagerly)\n                    Where's Ram?\n\n\n<b>                               FLYNN\n</b>                    I'm sorry, Tron... he's...\n                    he didn't make it.\n\n\n         Tron shakes his head, sadly.\n\n\n<b>                               TRON\n</b>                             (to Yori)\n                    This is Flynn... the one who\n                    busted me out.\n\n\n<b>                               YORI\n</b>                            (to Flynn)\n                    Then I owe you some thanks...\n\n\n<b>                               FLYNN\n</b>                    No big deal. I ought to know my way\n                    around that Light Cycles routine...\n                    I mean, I did write the program for it.\n\n\n<b>                               TRON\n</b>                            (mystified)\n                    Wrote the...?\n\n\n<b>                               FLYNN\n</b>                    It's time I levelled with you, Tron.\n                    I'm a -- well, I'm what you guys call a\n                    User.\n\n\n         Tron and Yori are stunned and awed.\n\n\n<b>                               YORI\n</b>                    A User -- in our world?\n\n\n<b>                               FLYNN\n</b>                               (nods)\n                    Guess I took a wrong turn somewhere...\n\n\n<b>                               TRON\n</b>                    But -- if you're a User -- then\n                    everything you've done has been\n                    part of a plan ...\n\n\n<b>                               FLYNN\n</b>                              (laughs)\n                    You wish. Man, I haven't had a second\n                    to think since I got down here. I mean\n                    in here. Out here. Whatever.\n\n\n<b>                               TRON\n</b>                    Then...\n\n\n<b>                               FLYNN\n</b>                    Look, you guys know how it is. You just\n                    keep doin' what it looks like you're\n                    supposed to, even if it seems crazy, and\n                    you hope to hell your User knows what's\n                    goin' on.\n\n\n<b>                               TRON\n</b>                    Well -- that's how it is for programs,\n                    yes, but --\n\n\n<b>                               FLYNN\n</b>                    I hate to disappoint you, pal, most-the\n                    time, that's how it is for Users, too.\n\n\n<b>                               TRON\n</b>                    Stranger and stranger...\n\n\n<b>                               BIT\n</b>                    You said it.\n\n\n<b>                               FLYNN\n</b>                        (pats Tron on back)\n                    So... Nice ship you got here. What's our\n                    next move?\n\n\n<b>                               TRON\n</b>                             (smiles)\n                    Remember you wanted to pay a call on\n                    the MCP?\n\n\n         Flynn nods.\n\n\n<b>                               TRON (CONT.)\n</b>                    We're on our way.\n                             (indicates disk)\n                    Alan-One gave me the coding we need to go\n                    up against Master\n\n<b>                               FLYNN\n</b>                    All right. Thank God. Alan stayed awake,\n                    at least.\n\n\n<b>    451  LONG SHOT                                                    451\n</b>\n\n         The aircraft carrier rolls past the camera.\n\n<b>    452  THE BRIDGE - SARK                                            452\n</b>\n\n         looking out the observation window, as his lieutenant approaches\n         from behind.\n\n<b>                               LIEUTENANT\n</b>                    Sir, what do you want done with\n                    the tower guardian, Dumont?\n                    Put him with the others?\n\n\n<b>                               SARK\n</b>                    No, bit brain.\n\n         Sark turns to face him.\n\n\n<b>                               SARK\n</b>\n\n                    Prepare him for inquisition. I need\n                    a little relaxation. But first rez up\n                    the carrier for pursuit... And one other\n                    thing.\n\n\n         lie stares at the lieutenant, paranoid\n\n\n<b>                               SARK\n</b>                           (continuing)\n                    Don'tthink anymore. I do the\n                   thinkingaround here.\n\n<b>    453  LONG SHOT OF SOLAR SAILER ON THE BEAM                        453\n</b>\n\n         speeding through the System, right on target.\n\n<b> 454/455 OMITTED                                                      454/455\n</b>\n<b>                                                   CUT TO:\n</b>\n<b>    456  SOLAR SAILER DECK                                            456\n</b>\n\n         We see Flynn looking back the way they came. Yori is at the controls,\n         with Tron beside her, his arm around her shoulders, looking at Flynn.\n\n<b>                               FLYNN\n</b>                    What about our friend - Sark?\n\n\n<b>                               TRON\n</b>                    Probably decided not to pursue us,\n                    The Sea of Simulation is tricky..\n                    lot of illusions...rough navigating.\n                    Programs have a way of just...\n                    disappearing here.\n\n<b>                               FLYNN\n</b>                    Not us, I hope.\n\n\n<b>                               TRON\n</b>                         (shakes his head,\n                          indicates disk)\n                    Not with this disk. I'm going to\n                    check on the beam connection, Yori.\n                    You two can keep a watch out for\n                    grid bugs.\n\n\n         He moves off down the walkway, the Bit following. Flynn turns and\n         leans out over the side.\n\n\n<b>                               FLYNN\n</b>                    Boy the view from up here... you\n                    know the territory?\n\n\n<b>                               YORI\n</b>                    A little ...\n                       (points out sights)\n                    Over there, the Mountains of Data...\n                    and I think that's the Silicon Valley...\n\n\n<b>                               FLYNN\n</b>                             (pointing)\n                    What's wrong with that area?\n\n\n<b>    457  HIS POV                                                      457\n</b>\n\n         We see an area of darkened, gloomy, two-dimensional shapes.\n\n\n<b>                               YORI\n</b>                              (sadly)\n                    The MCP blasted it... There are very\n                    few domains left with any power at all.\n\n\n<b>                               FLYNN\n</b>                    Lousy utility companies ...\n                    they're the same wherever you go.\n\n\n<b> 456-461 OMIT                                                         456-461\n</b>\n\n<b>    462  INT. DIMLY LIT CELL                                          462\n</b>\n\n         Where we see Dumont plugged into energy foot sockets. Two memory\n         guards stand by his side holding their staffs against his chest.\n         Dumont's face is wracked with pain, his robe torn, but his\n         expression is full of determination. As we watch, another blast of\n         torturous energy comes from the boots, and his face contorts. CAMERA\n         PULLS BACK AND ANGLES UP to the second level where we see Sark\n         looking down into the pit that is Dumont's cell.\n\n\n<b>    463  CLOSE UP SARK                                                463\n</b>\n\n<b>    464  MED. SHOT - DUMONT                                           464\n</b>\n\n         He looks up.\n\n\n<b>                               DUMONT\n</b>                    What do you want? I'm busy.\n\n\n<b>    465  SHOT OVER DUMONT'S SHOULDER                                  465\n</b>\n\n         of Sark.\n\n\n<b>                               SARK\n</b>                            (snarling)\n                    Busy dying, you worn-out excuse for\n                    an old program.\n\n\n<b>                               DUMONT\n</b>                    Yes, I'm old.\n\n\n<b>    466  SHOT OF DUMONT                                               466\n</b>\n\n         from the front.\n\n\n<b>                               DUMONT\n</b>                            (continuing)\n                    Old enough to remember the MCP when he\n                    was just a chess program. He started\n                    small, and he'll end small.\n\n\n<b>    467  SHOT OF SARK                                                 467\n</b>\n\n<b>                               SARK\n</b>                         (throws back his\n                         head and laughs)\n                    That's very funny, Dumont. Maybe I\n                    should keep you around, just to make me\n                    laugh.\n\n\n<b>    467A SHOT OVER DUMONT'S SHOULDER                                  467A\n</b>\n\n         of Sark.\n\n\n<b>                               SARK\n</b>                           (continuing)\n                    Guards! Bring this antique to the\n                    bridge so he can watch his friends\n                    be obliterated.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    468  THE DECK OF THE SOLAR SAILER                                 466\n</b>\n\n         We see Tron at the bow. Flynn and Yori are up on the deck near the\n         controls, with the Bit hovering over them. Yori is, pointing\n         something out to Flynn.\n\n\n<b>    469  TRON'S FACE                                                  469\n</b>\n\n         reacting to the sight of something ahead of the Solar Sailer.\n\n\n<b>    470  LONG SHOT FROM THE SIDE                                      470\n</b>\n\n         We see the transmission beam which carries the Solar Sailer\n         increasing in brightness, throbbing with a pulse of mad glowing\n         energy, coming towards the ship. It hits the sail, and the ship\n         shivers. The whole beam is now tripled in brightness.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    471  EXT. DECK OF SOLAR SAILER - SHOT OF CONTROL PANEL            471\n</b>\n\n         As Tron runs up to Yori's side. He grabs her shoulder, pulling her\n         against him... they have to shout to be heard above the noise of the\n         increasing beam.\n\n\n<b>                               TRON\n</b>                            (shouting)\n                    What is it?\n\n\n<b>                               YORI\n</b>                    Power surge... the transmission beam's\n                    too strong!\n\n\n<b>                               TRON\n</b>                    We have to get off this beam!\n\n\n<b>                               YORI\n</b>                             (frantic)\n                    I can't. There's no junction due for at\n                    least 7 or 8 nanoseconds!\n\n\n<b>    472  OMIT                                                         472\n</b>\n\n<b>    473  LONG SHOT                                                    473\n</b>\n\n         The ship is throbbing and jerking, bits of it de-rezzing.\n\n\n<b>    474  DECK OF SOLAR SAILER                                         474\n</b>\n\n         Flynn looks around, points to one side.\n\n\n<b>                               FLYNN\n</b>                    There's another beam!\n\n\n<b>                               YORI\n</b>                    It's too far!\n\n\n         Flynn suddenly looks to the bow of the ship, makes a decision, and\n         races forward.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    475  VIEW D0WN THE WALKWAY, FROM THE STERN                        475\n</b>\n\n         We see Flynn race to the bow, where the horrendous power of the beam\n         is blasting away at the sails. He slows down, but keeps going.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    476  YORI'S FACE                                                  476\n</b>\n\n         Watching -\n\n\n<b>                               YORI\n</b>                    Where's he going?\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    477  TRON'S FACE                                                  477\n</b>\n\n         Also watching.\n\n\n<b>                               TRON\n</b>                    The beam connection...\n                    but he'll be de-rezzed!!\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    478  SHOT IN FRONT OF SOLAR SAILER, FACING THE BOW                478\n</b>\n\n         We see Flynn emerge, leaning out into the beam, his face brilliantly\n         illuminated by the beam. He reaches forward with one arm.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    479  FLYNN'S HAND                                                 479\n</b>\n\n         Entering the beam.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    480  SHOT FROM ABOVE FLYNN                                        480\n</b>\n\n         He is lying spread eagled at the bow, with one arm in the light. He\n         raises his other arm and points at the beam which was so close, but\n         too far to reach. Suddenly his whole body glows with the same\n         intensity as the beam.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    481  TRON AND YORI                                                481\n</b>\n\n         Shielding their eyes from the light.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    482  SHOT FROM ABOVE FLYNN                                        482\n</b>\n\n         His body glowing, arm outstretched. Suddenly another beam blasts out\n         from his arm.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    483  LONG SHOT                                                    483\n</b>\n\n         We see the new beam from Flynn's arm flash over to the neighboring\n         transmission beam and connect. We see the ship pulsing, and then\n         breaking free of the old beam, following the new path, and connecting\n         to the safe beam.\n\n         The craft starts to travel safely on its way.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    484  YORI'S FACE                                                  484\n</b>\n\n         Radiant. Tron amazed.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    485  SIDE SHOT                                                    485\n</b>\n\n         Tron races down the walkway toward Flynn, closely followed by Yori\n         and the Bit.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    486  SHOT OF TRON                                                 486\n</b>\n\n         Carrying Flynn towards the stern, carefully, gingerly with Yori\n         watching.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    487  CLOSE SHOT                                                   487\n</b>\n\n         as they reach the deck in front of Tron, as he holds Flynn. We can\n         see Yori's anxious face to one side. Flynn's head comes up for a\n         moment, dazed.\n\n<b>                               FLYNN\n</b>                              (weakly)\n                    Did we make it?\n\n<b>                               TRON\n</b>                    Yes.\n\n\n         Flynn smiles weakly.\n\n\n<b>                               FLYNN\n</b>                    Hooray for our side...\n\n\n         He faints.\n\n<b>                                                   DISSOLVE TO:\n</b>\n\n<b>    488  A WATERY, WAVERING VIEW OF YORI                              488\n</b>\n\n         Her face, upside-down, peering downward.\n\n\n<b>    489  SOLAR SAILER - TRON, FLYNN, YORI                             489\n</b>\n\n         Yori is sitting on the floor beside the control console with Flynn\n         stretched out beside her, his head in her lap. Her hands are on\n         either side of his face. Tron is seated across from them and the Bit\n         is quietly floating beside him. In b.g. we SEE that the Solar Sailer\n         is passing through a series of narrow canyons.\n\n\n<b>                               FLYNN\n</b>                    Hey... you guys OK?\n\n\n<b>                               TRON\n</b>                              (nods)\n                    How about you?\n\n\n<b>                               FLYNN\n</b>                    Aah, I'm fine... little hung over\n                    is all...\n\n\n<b>                               YORI\n</b>                    How did you do that, Flynn?\n\n\n<b>                               FLYNN\n</b>                            (sitting up)\n                    Elementary physics... a beam of\n                    energy can always be diverted...\n                    ooh, my head\n                          (looks around --\n                              to Yori)\n                    Are we there yet, Mommy?\n\n\n<b>                               YORI\n</b>                    Almost... I just have to adjust our\n                    course at the next junction. I'd better\n                    go check the instruments ...\n\n\n         She heads O.S., toward the bow.\n\n\n<b>    490  LONG SHOT                                                    490\n</b>\n\n         The Sailer is about to pass the mouth of another canyon.\n\n\n<b>    491  TRON &amp; FLYNN                                                 491\n</b>\n\n         Tron looks away from Flynn for a moment to check the Sailer's\n         progress.\n\n\n<b> 492-500 OMIT                                                         492-500\n</b>\n<b>    501  TRON'S POV                                                   501\n</b>\n\n         as the new canyon comes into sight. CAMERA LOOKS UP AND UP... to the\n         immense bulk of the aircraft carrier, moving fast toward the Sailer.\n\n\n<b>                               TRON (V.0.)\n</b>                    Sark!\n\n\n<b> 502-519 OMIT                                                         502-519\n</b>\n\n<b>    520  LONG SHOT                                                    520\n</b>\n\n         The carrier lurches forward and rams the Sailer, splitting it in\n         half.\n\n\n<b> 521-523 OMIT                                                         521-523\n</b>\n\n<b>    524  YORI AND FLYNN                                               524\n</b>\n\n         Falling on top of one another, Flynn trying to pull Yori out of the\n         way as the bulk of the carrier appears to slam into Tron and he's\n         gone.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    525  TRON                                                         525\n</b>\n\n         falling through space.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    526  FLYNN AND YORI                                               526\n</b>\n\n         As the carrier keeps moving forward. Flynn holding Yori, and the Bit\n         hovers beside them. A second level of the carrier, with an open hold,\n         comes rushing at them.\n\n\n<b>    527  THEIR POV                                                    527\n</b>\n\n         The gaping hold rushes forward and the screen goes black.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    527A LONG SHOT                                                    527A\n</b>\n\n         Their half of the Sailer is scooped up into the carrier.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    528  TRON                                                         528\n</b>\n\n         catching hold of something. He is swinging freely. Hanging onto a\n         wall, he starts pulling his feet up to gain a precarious foothold.\n\n<b> 529/530 OMITTED                                                      529/530\n</b>\n\n<b>    531  INT. DUMONT'S CELL                                           531\n</b>\n\n         Dumont standing, facing the camera. HEAR door SLAMMING.\n\n\n<b>    532  FULL SHOT                                                    532\n</b>\n\n         of cell. Yori rushes forward to Dumont. We see Flynn standing just\n         inside the door, shoulders slumped and we can see that his disk has\n         been removed.\n\n\n<b>    532A MED. SHOT                                                    532A\n</b>\n\n         Dumont holds Yori as she SOBS.\n\n\n<b>                               DUMONT\n</b>                    Quietly, Yori...\n\n\n         He looks up.\n\n\n<b>                               DUMONT\n</b>                            (continuing)\n                    Tron... ?\n\n\n         Flynn looks down at his hands and turns away, leaning against the\n         wall.\n\n\n<b>                               YORI\n</b>                    He's dead.\n\n\n<b>                               DUMONT\n</b>                           (sighs, looks\n                             at Flynn)\n                    And who is this?\n\n\n<b>                               YORI\n</b>                    He's a User, Dumont. He came to\n                    our world... trying to help us...\n\n\n         Her voice breaks, she turns away.\n\n\n<b>                               DUMONT\n</b>                            (despairing)\n                    If the Users can no longer help us...\n\n\n         His voice trails off. Suddenly, a stronger LIGHT flashes on in the\n         cell, the door opens, and we see Sark standing there, framed in the\n         cell door.\n\n\n<b>                               SARK\n</b>                    So... we have erased the program that -\n\n\n         As he catches sight of Flynn, his voice falters.\n\n\n<b>                               SARK (CONT.)\n</b>                    You! No!\n\n\n         Flynn looks up curiously.\n\n\n<b>                               SARK (CONT.)\n</b>                    You died! I saw you!\n\n\n<b>                               FLYNN\n</b>                    Not me, boss.\n\n\n<b>                               SARK\n</b>                    Well... we can take care of that\n                    soon enough.\n\n\n         He points to Dumont. The guards grab him.\n\n\n<b>                               SARK (CONT.)\n</b>                    Take this program to the holding pit.\n\n\n         The guards start to drag Dumont out.\n\n\n<b>                               YORI\n</b>                        (rushing after him)\n                    Dumont...!\n\n\n         A guard pushes her roughly to the end of the cell.\n\n\n<b>                               SARK\n</b>                        (indicates Dumont)\n                    I'm taking our friend here, and\n                    some other religious fanatics, to\n                    Master Control... the MCP has expressed\n                    an interest in assimilating them --\n                    probably for archival purposes.\n                    I'm not going back to the Game Grid\n                    on this ship, though -- I'll take\n                    the Transport Beam.\n                             (smiles)\n                    Less traffic. But when I disembark,\n                    this ship...and everything that remains\n                    on board...will automatically de-rez.\n                    This means you.\n\n                    Enjoy your trip...\n\n\n         LAUGHING, Sark leaves. The guards, with Dumont in custody, follow.\n\n\n<b>    533  SHOT LOOKING DOWN INTO THE PIT CELLS                         533\n</b>\n\n         into the cell that holds a dozen dejected, defeated, aging programs,\n         the I/0 Tower guardians. We see the door to the cell open and guards\n         beginning to herd them out.\n\n\n<b>    534  ANGLE - LEVEL ABOVE CELLS                                    534\n</b>\n\n         where we can see Sark walking towards an open portal. He looks down\n         into the cells at his feet and laughs again.\n\n<b>    535  FLYNN                                                        535\n</b>\n         staring up as Sark moves past their cell and out of view.\n\n<b>    536  LONG SHOT                                                    536\n</b>\n\n         of the carrier approaching a flat-topped mountain, with the\n         communication beam of the MCP visible at the very center.\n\n<b> 537/538 OMITTED                                                      537/538\n</b>\n<b>    539  SHOT FROM THE CARRIER                                        539\n</b>\n\n         of the MCP's mesa moving closer, the only structure visible in a\n         vast plain covered with a glowing grid.\n\n\n<b>    540  EXT. BRIDGE AREA OF CARRIER                                  540\n</b>\n\n         We can see the observation port and below that a section of the\n         ship's structure is moving forward.\n\n\n<b>                               LIEUTENANT (V.O.)\n</b>                    Docking module prepared to disengage, sir.\n\n\n<b>    541  INSERT                                                       541\n</b>\n\n         Sark's hand touching a control panel.\n\n\n<b>    542  OMIT                                                         542\n</b>\n\n<b>    543  EXT. SHOT                                                    543\n</b>\n\n         As the landing pod disengages completely, floating away from the\n         carrier and then starting its final journey to the MCP, picking up\n         speed on a straight and even course. We can see a small speck\n         clinging to one side of the pod...\n\n\n<b>    543A CLOSE UP - SPECK                                             543A\n</b>\n\n         TRON, holding himself braced into a narrow crack.\n\n\n<b>    544  FLYNN, YORI AND THE BIT                                      544\n</b>\n\n         Yori is sitting with her head in her hands. Flynn is at the door\n         testing it, running his finger along the edges.\n\n\n<b>    545  LONG SHOT                                                    545\n</b>\n\n         Of landing pod flying over the glowing grid that surrounds the MCP's\n         mesa.\n\n\n<b>    546  A SHOT                                                       546\n</b>\n\n         from behind the carrier of the pod getting smaller with distance.\n\n\n<b>    547  POD POV                                                      547\n</b>\n\n         Steep cliff face of the MCP's mesa is coming closer and closer, more\n         and more detail visible.\n\n\n<b>    548  POD                                                          548\n</b>\n\n         tiny against the massive bulk of the MCP's mesa, descending for\n         landing. The top edge of the cliff is encrusted with irregular\n         shapes and the pod is headed for one opening among the shapes,\n         fitting itself neatly in between so that it becomes a part of the\n         structure.\n\n\n<b>    549  INT. POD                                                     549\n</b>\n\n         There is a minor jolt and Sark lays his palm on another panel. From\n         the rear wall of the pod we see the entire front wall rising slowly.\n         Sark and his lieutenant stand by either side of the door, and we\n         gradually are given a view of the MCP, two or three miles away at\n         the center of the plain ahead. The structure is a series of gleaming\n         black blades, forming a great cylinder, and the communication beam\n         rises out of the center of this cylinder.\n\n\n<b>    550  EXT. CARRIER                                                 550\n</b>\n\n         floating upwards and forward.\n\n\n<b>    551  MED. SHOT                                                    551\n</b>\n\n         Flynn still at the door. Suddenly his hand goes right through the\n         door.\n\n\n<b>                               FLYNN\n</b>                    Hey!\n\n\n         The door is disappearing, dissolving.\n\n\n<b>                               FLYNN\n</b>                       (continuing; turning)\n                    Look, the door's almost...\n\n\n         He stops in horror.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    552  HIS POV                                                      552\n</b>\n\n         Yori is standing lethargically staring at her hands... through them.\n         She is de-rezzing too. Her whole body becoming transparent. She looks\n         up dimly at Flynn, with no expression.\n\n\n<b>    553  WIDE SHOT                                                    553\n</b>\n\n         Flynn races back to her and takes her in his arms roughly, hugging\n         her close, his energy flowing into her.\n\n\n         Their faces are very close as he stares down, terrified that he is\n         too late to save her. Her eyes are half-closed.\n\n\n<b>                               FLYNN\n</b>                    Yori!\n\n\n<b>    554  CLOSE SHOT                                                   554\n</b>\n\n         Just their two faces. Flynn bends closer, their lips almost touch.\n         Suddenly her eyes widen as her form returns to solidarity, and color\n         floods back into her. Her mouth opens in wonder and she looks up at\n         Flynn. He pulls a little away from her, still holding her.\n\n\n<b>                               YORI\n</b>                             (in awe)\n                    You... you brought me back...?\n                    Why...? How ... ?\n\n\n         Flynn lets go of her.\n\n\n<b>                               FLYNN\n</b>                    I'm gonna need your help. Hey, Bit!\n\n\n         He looks around, spots a small glow in one corner of the cell, runs\n         to it and stoops down, cupping the glow in his hands. It wavers.\n         Flynn wills his energy back into it, frowning with concentration.\n         Suddenly the Bit pops into life.\n\n\n<b>                               BIT\n</b>                    Yes!\n\n\n<b>                               FLYNN\n</b>                    Let's get outta here.\n\n\n         They head for the door.\n\n\n<b>    555  THE MESA TOP OF THE MCP                                      555\n</b>\n         The prisoners file forward on the path to the MCP. Sark is leading\n         them. We can see the structure of the MCP closer now, looming bigger.\n         The four memory guards are standing at regular intervals along the\n         path.\n\n<b>    556  EXT. POD DOOR - LIEUTENANT                                   556\n</b>\n\n         on duty. He hears a NOISE and turns... and in a flash of light a\n         speeding disk smashes into him, knocking him over. The CAMERA WATCHES\n         over his de-rezzing body. We see a figure approaching closer... its\n         arm is raised, and... the disk slams back into the hand.\n\n<b>    557  CLOSER SHOT                                                  557\n</b>\n         It is Tron. He steps over the body of the Lieutenant.\n\n<b>    558  THE MCP                                                      558\n</b>\n         from right outside. We see the prisoners beginning to file inside,\n         up the final slope leading to the base of the MCP.\n\n<b>    559  SIDE SHOT OF THE ENTRANCE                                    559\n</b>\n         to the MCP. As the guardian programs enter. Sark stands waiting,\n         watching them, his back to the camera.\n\n<b>    560  POV OF THE DOOMED PROGRAMS                                   560\n</b>\n\n         As the first one gets through the opening. The light from the MCP's\n         beam pours out. Moving forward, through the entrance, the MCP is\n         finally revealed. A giant cylinder, a hundred feet high, with a\n         network of circuit lines, and stretched across all the visible\n         surface... is a face. Flattened, stretched, bizarrely distorted,\n         the face is capable of moving to any section of the-cylinder. The\n         impression is similar to the look of a grotesquely fat person's face,\n         but more so. It's horrible. Beneath the floating cylinder face two\n         inverted cones of light, meeting at their apex, support it. We\n         continue moving forward, the MCP looming over us. Then the CAMERA\n         STOPS and the doomed programs file past us, separating and going to\n         the inner walls. The MCP speaks, we see his enormous lips moving.\n\n\n<b>                               MCP\n</b>                      (echoing, booming)\n                    I am delighted that so many of you\n                    could turn out to give your\n                    power over to me...\n\n\n<b>    561  FULL SHOT - THE PROGRAMS                                     561\n</b>\n\n         lining the wall. They are sucked back, pinned, immobile, and we see\n         them starting to de-rez.\n\n\n<b>                               MCP\n</b>                    You're very lucky, all of you. You\n                    are participating in the creation of\n                    the single most powerful program in\n                    the history of the system... of all\n                    systems...\n\n\n         The programs begin to disappear, one by one.\n\n\n<b>                               MCP\n</b>                          (continuing)\n                    A program with a will... with\n                    ambition... a superior form of\n                    life...\n\n\n<b>    562  EXT. MCP                                                     562\n</b>\n\n         Sark stands in front of Dumont.\n\n\n<b>                               SARK\n</b>                    Go!\n\n\n         Dumont's face is devoid of hope. He starts into the MCP's inner\n         chamber.\n\n\n<b>    563  CLOSE - DUMONT'S FACE                                        563\n</b>\n\n         seeing the MCP, reacting.\n\n\n<b>    564  INT. INNER CHAMBER OF MCP                                    564\n</b>\n\n         Over Dumont's shoulder, with a view of the MCP. Zoom IN on MCP's\n         face.\n\n\n<b>                               MCP\n</b>                    Welcome!\n\n\n<b>    565  EXT. CARRIER BRIDGE                                          565\n</b>\n\n         Flynn and Yori race into view. We can see two of the memory guards\n         in a de-rezzed, two dimensional state, disappearing completely in\n         the course of this scene. Flynn runs to Sark's position, looking out\n         the window.\n\n\n<b>                               FLYNN\n</b>                    Check out the controls.\n\n\n         As Yori looks over the control conso1e.\n\n\n<b>                               FLYNN\n</b>                            (continuing)\n                    We're getting closer.\n\n\n<b>    566  HIS POV                                                      566\n</b>\n\n         Down the length of the carrier. It is de-rezzing, parts of it gone\n         already. We see the CPU approaching, as the carrier rises.\n\n\n<b>    567  EXT. LANDSCAPE - LONG SHOT                                   567\n</b>\n\n         The carrier drifts over the edge of the mesa, high above it, whole\n         sections only visible as outlines.\n\n\n<b>    367A EXT. MCP                                                     567A\n</b>\n\n         CAMERA MOVING FORWARD towards the MCP's beam.\n\n\n<b>    568  INT. MCP - MED. SHOT - DUMONT                                568\n</b>\n\n         He is slowly disappearing.\n\n<b>                               MCP\n</b>                    Dumont, I'm so pleased that we've\n                    finally come to terms with one\n                    another...\n\n<b>    569  EXT. CPU MESA                                                569\n</b>\n         Sark is standing, looking in the opening, waiting for the signal to\n         depart. His back is to the camera.\n\n<b>                               VOICE\n</b><b>                    SARK!\n</b>\n\n         Sark turns, curious, eyes widen incredulously..\n\n\n<b>    570  SARK'S POV                                                   570\n</b>\n\n         We SEE Tron standing, legs spread, arms poised by his sides, disk in\n         one hand. It gives off a pure white light.\n\n\n<b>    571  CLOSE UP SARK'S FACE                                         571\n</b>\n\n<b>                               SARK\n</b>                    I don't know how you survived,\n                    slave.\n\n\n<b>    572  WIDE SHOT FROM THE SIDE                                      572\n</b>\n\n<b>                               SARK\n</b>                    It doesn't matter. Prepare to\n                    terminate.\n\n         Sark flings his disk with a violent jerk of his wrist.\n\n<b>    573  SHOT FROM ABOVE                                              573\n</b>\n\n         as the disk races at Tron. He dodges, drops to one knee and ducks\n         under it. Sark's disk circles like a homing missile and attacks\n         again. Tron deflects the second attack with his own disk, and the\n         two meet with an explosion of light. Sark's disk ricochets off and\n         races away, back to Sark. We see Tron throw his own weapon.\n\n<b>    574  EXT. CARRIER BRIDGE                                          574\n</b>\n\n<b>                               FLYNN\n</b>                    I can rev this baby up a little\n\n         He looks out sees something, does a double-take, looks again\n\n\n<b>                               FLYNN\n</b>                            (continuing)\n                    Wait a minute Yori! YORI!! LOOK!\n\n<b>    575  FULL SHOT                                                    575\n</b>\n         as Yori runs to Flynn's side and-peers down.\n\n<b>                               YORI\n</b><b>                    TRON!!\n</b>\n<b>    576  CLOSE UP - YORI                                              576\n</b>\n         tears of joy streaming down her face.\n\n<b>    577  HER POV                                                      577\n</b>\n         the fight continuing.\n\n\n<b>    577A FULL SHOT - THE BRIDGE                                       577\n</b>\n\n<b>                               YORI\n</b>                    Flynn, we've got to help him!\n\n\n<b>                               FLYNN\n</b>                    Let's get some power here.\n\n\n         His hands, laying on the control console, begin to send forth great\n         pulses of glowing energy into the carrier.\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    578  CLOSE UP                                                     578\n</b>\n\n         Sark's face.\n\n\n<b>                               SARK\n</b>                    You are very persistent, Tron.\n\n\n<b>    579  MED. SHOT                                                    579\n</b>\n\n         Tron's disk circles Sark, attacking twice. Sark deflects it and\n         immediately throws his own disk.\n\n\n<b>    580  SHOT OF TWO WEAPONS                                          580\n</b>\n\n         racing almost side by side through the air.\n\n\n<b>    581  SHOT OF TRON                                                 581\n</b>\n\n         as the two disks come at him.\n\n\n<b>                               TRON\n</b>                    I'm also better than you....\n\n\n         He leaps into the air, grabs his own disk, pulling his legs up as\n         Sark's disk passes under him.\n\n\n<b>    582  SHOT OF SARK'S DISK                                          582\n</b>\n\n         Making a sharp turn in the air.\n\n\n<b>    583  SHOT OF TRON FROM BEHIND                                     583\n</b>\n\n         He looks over his shoulder, sees the disk coming at him.\n\n\n<b>    584  TRON'S HAND                                                  584\n</b>\n\n         As he slams his own disk into Sark's, using his as a shield.\n\n\n<b>    584A MED. SHOT SARK                                               584A\n</b>\n<b>                               SARK\n</b>                    Very clever, Tron. You know you\n                    should have joined me.\n\n\n<b>    585  OVERHEAD POV                                                 585\n</b>\n\n         Tron hurls again.\n\n\n<b>    586  FLYNN AND YORI                                               586\n</b>\n\n         Flynn is at the controls, transferring power.\n\n\n<b>                               FLYNN\n</b>                    Any response?\n<b>                               YORI\n</b>                    It's starting\n\n\n         She looks down at the battle. Her hand reaches over and grips\n         Flynn's tightly.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    587  SARK                                                         587\n</b>\n\n         He catches his own disk, spots Tron's coming at him right behind,\n         and holds up his own disk as a shield.\n\n\n<b>                               SARK\n</b>                    We would have made a great team.\n\n\n<b>    588  TRON'S DISK                                                  588\n</b>\n\n         turning sideways in its flight, edge on.\n\n\n<b>    589  SARK                                                         589\n</b>\n\n         With a CRASH and explosion of light, Tron's disk cuts right through\n         Sark's disk, and on through Sark's head. The disk shatters, and we\n         see Sark's surprised face, hands still in position to hold the\n         disk... a jagged open slash right through his forehead. We can see\n         energy pouring out of this wound like blood.\n\n\n<b>    590  LONGER SHOT                                                  590\n</b>\n         Sark falls, dead, face first.\n\n<b>    591  OMITTED                                                      591\n</b>\n<b>    592  TRON                                                         592\n</b>\n\n         wailing past Sark's body.\n\n\n<b>    593  SHOT FROM BEHIND TRON                                        593\n</b>\n\n         as he goes in the MCP's inner chamber.\n\n\n<b>                               MCP\n</b>                      (before he sees Tron)\n                    It is very good that you...\n\n<b>    594  OMITTED                                                      594\n</b>\n\n<b>    595  SHOT OF TRON                                                 595\n</b>\n\n         framed in the doorway.\n\n\n<b>                               TRON\n</b>                    I don't think it is good for you, MCP.\n\n\n<b>    596  SHOT OF MCP                                                  596\n</b>\n<b>                               MCP\n</b>                    Sark! How have you allowed this\n                    program to\n\n<b>    597  OMITTED                                                      597\n</b>\n\n<b>    598  SHOT FROM BEHIND TRON                                        598\n</b>\n\n<b>                               TRON\n</b>                    Sark's out. Would you like to\n                    leave a message?\n\n\n<b>                               MCP\n</b>                    I am the message. The only message.\n                    Sark!\n\n\n         Tron throws his disk. It's deflected off the base of the MCP, and\n         returns to him.\n\n\n<b>                               MCP\n</b>                          (continuing)\n<b>                    SARK!\n</b>\n\n         As Tron is preparing to throw again he notices Dumont and races over\n         to him.\n\n\n<b>    599  CLOSE SHOT - WALL                                            599\n</b>\n\n         Dumont is transparent. Tron runs up to him.\n\n\n<b>                               TRON\n</b>                          (trying to pull\n                       Dumont away from wall)\n                    Dumont!\n\n\n<b>                               DUMONT\n</b>                    No... Tron ... must... destroy\n                    MCP... first...\n\n<b>                               TRON\n</b>                    Dumont! Where's Yori? Where's\n                    Flynn?\n\n<b>                               DUMONT\n</b>                             (very weak)\n                    They may be... de-rezzed... on\n                    the carrier ... hurry...\n\n\n<b>    600  MED. SHOT - TRON                                             600\n</b>\n\n         He turns, murder in his eyes, draws back his arm for the throw.\n\n\n<b>                               MCP\n</b>                    Program... stop. This is not allowed!\n\n\n         Tron throws.\n\n\n<b>    601  SHOT OF MCP                                                  601\n</b>\n\n         The disk smashes into him. Once, twice...\n\n\n<b>                               MCP\n</b>                    I will not allow this Sark!\n                           (thundering)\n<b>                    SARK!!!\n</b>\n\n         The voice reverberates, shaking the chamber. Tron continues to throw.\n\n<b>    602  OMITTED                                                      602\n</b>\n<b>    603  INSERT                                                       603\n</b>\n\n         Sark's dead hand. We see the circuit pattern of the mesa top begin\n         to glow around the hand, throbbing with energy. The hand moves.\n\n\n<b>    604  TRON                                                         604\n</b>\n\n         throwing again at the MCP, hitting, catching his disk again.\n\n\n<b>                               MCP\n</b>                           (thundering)\n<b>                    SARK!!!\n</b>\n\n<b>    605  SARK                                                         605\n</b>\n\n         His body is glowing, expanding. He starts to rise, his face looks up.\n\n<b>    606  CLOSE UP - FACE                                              606\n</b>\n\n         It is vacant, staring with white eyes. His head still has the gaping\n         hole in the forehead. He's a zombie, the living dead. He rises.\n\n\n<b>    607  LONG SHOT                                                    607\n</b>\n         Carrier floating over the CPU, near the MCP's beam. Flynn looks out,\n         from side to side, quickly assessing the possibilities. He spots the\n         beam.\n\n<b>    608  OMITTED                                                      608\n</b>\n<b>    609  HIS POV OF BEAM                                              609\n</b>\n\n         very close.\n\n\n<b>    610  SHOT OF YORI AND FLYNN                                       610\n</b>\n\n<b>                               FLYNN\n</b>                    Yori, steer us over the beam,\n                    right next to it.\n\n\n<b>                               YORI\n</b>                       (going to controls)\n                    Why? What are you going to do?\n\n\n<b>                               FLYNN\n</b>                           (staring down)\n                    Jump.\n\n\n         Yori looks up.\n\n\n<b>                               YORI\n</b>                    But... won't you be de-rezzed?\n\n\n<b>                               FLYNN\n</b>                           (turns to her)\n                    Probably.\n\n\n<b>    611  INT. MCP - TRON                                              611\n</b>\n\n         about to fire again. There's a sudden roar and Tron turns.\n\n\n<b>    612  TRON'S POV OF GIANT SARK                                     612\n</b>\n\n         Who rips open the doorway into the MCP and advances.\n\n\n<b>    613  BRIDGE                                                       613\n</b>\n\n         Yori has steered them right next to the beam. She turns to Flynn,\n         goes up to him.\n\n\n<b>                               YORI\n</b>                    Flynn... you can't... I\n\n\n<b>                               FLYNN\n</b>                          (lays finger on\n                             her lips)\n                    Shhhhh.\n\n\n         He takes her in his arms.\n\n\n<b>                               FLYNN (CONT.)\n</b>                               (whispering)\n                    I'm sure Tron wouldn't mind if...\n                    just once...\n\n\n         His head bends down and their lips meet. Yori's body begins to glow,\n         change, metamorphosize until she has the same appearance as in the\n         love scene with Tron, sparkling and gorgeous. Her eyes are closed.\n\n\n<b>    614  CLOSE UP - THEIR FACES                                       614\n</b>\n\n         Finally Flynn pulls away from her. Her eyes stay shut for a second,\n         then open.\n\n\n<b>                               FLYNN\n</b>                    Don't worry.\n\n\n<b>    615  LONGER SHOT                                                  615\n</b>\n\n         He releases her, steps to the edge of the observation port, poises\n         on the brink, and then leaps off, directly in the beam. We see Yori\n         shakily grip the edge of the port and lean out.\n\n\n<b>    616  HER POV                                                      616\n</b>\n\n         Flynn is diving through space in the beam, falling in slow motion\n         directly into the center of MCP itself.\n\n\n<b>    617  INT. MCP                                                     617\n</b>\n\n         Sark is much bigger than before, advancing on Tron. He speaks, but\n         his voice is that of the MCP.\n\n\n<b>                               SARK/MCP\n</b>                    End of line, program...\n\n\n         We can see the MCP in the b.g. Suddenly there is an explosion of\n         static, as Flynn falls into the MCP. We see a weird 2-D image of\n         Flynn's face circling in the cylinder with the MCP as they battle.\n         Sark falters, stumbles, distracted by this, and Tron ducks under him\n         and hurls the code disk for the last time. It circles the MCP once,\n         and then hurtles straight for the target, the apex of the energy\n         cones. And connects.\n\n\n<b>    618  SHOT OF THE APEX                                             618\n</b>\n         A brilliant explosion of lights bursts out.\n\n\n<b>    619  SHOT OF SARK                                                 619\n</b>\n\n         Dead face wracked with the pain of a second death. He begins to melt\n         into a column of pure energy, dissipating completely.\n\n\n<b>    620  SHOT OF THE MCP                                              620\n</b>\n\n         We see something materializing in the apex of the energy cones. It\n         is dressed like Dumont was at the I/0 Tower, an old man in the\n         padded altar costume, spinning, slowly, finally stopping. We see the\n         wizened, wrinkled face of the true MCP for just a few seconds, and\n         see that he is furiosly TYPING on an old Remington portable. Then he\n         too dissolves into liquid energy, and disappears. The cylinder of\n         the MCP glows brighter and brighter.\n\n\n<b>    621  YORI AND THE BIT                                             621\n</b>\n         on the bridge of the carrier looking down at this.\n\n<b>    622  HER POV                                                      622\n</b>\n         A fountain of energy explodes upwards like a Supernova, right at the\n         camera.\n\n<b>    623  YORI                                                         623\n</b>\n         shielding her face from the power of the blast.\n\n<b>    624  LONG SHOT                                                    624\n</b>\n\n         The nova of energy bursting upwards. We start to see the glow\n         returning to the surrounding domains, as the nova dissipates,\n         leaving the sky full of sparkling stars.\n\n<b>    625  YORI                                                         625\n</b>\n\n         still shielding her eyes, but looking out in wonder at the domains\n         regaining their life.\n\n<b>    626  HER POV                                                      626\n</b>\n         one domain after another, scattered around the horizon, glows\n         brightly, increasing.\n\n<b>    627  LONG SHOT                                                    627\n</b>\n         The carrier starts to descend.\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    628  EXT. CPU MESA - TRON                                         628\n</b>\n         Leading Dumont out of the chamber with several of the other guardian\n         programs that were saved. He looks up, spots the carrier descending.\n\n<b>    629  SHOT OF CARRIER                                              629\n</b>\n         Basically all that is left of it is the bridge, with only a very\n         faint image of the rest of the body. It lands on the mesa.\n\n<b>    630  EXT. CPU MESA                                                630\n</b>\n         Tron catches Yori as she jumps down. He hugs her close and looks at\n         her, about to speak. But she reaches up and presses her lips to his\n         in a quick, intense kiss. Then pulls back.\n\n<b>                               TRON\n</b>                            (laughing)\n                    Nice...\n\n<b>                               YORI\n</b>                    It's something Users do.\n\n<b>                               TRON\n</b>                    Where's Flynn?\n\n         He looks up at the bridge.\n\n<b>                               YORI\n</b>                    He's gone. He went into the beam.\n                    He saved you. He saved all of us.\n\n         Tron stares at her, holding onto her shoulders. Then he looks up at\n         the sky, thoughtfully. She also looks up.\n\n<b>                               DUMONT\n</b>                    He really was a User...\n\n<b>                               BIT\n</b>                         (quietly, sadly)\n                    Yes...\n\n<b>    631  LONG SHOT FROM OVERHEAD                                      631\n</b>\n         of the landscape, glowing again with new life, every I/O Tower a\n         shining beacon, a symbol of the new found freedom of communication.\n\n<b>                                                   DISSOLVE TO:\n</b>\n<b>    632  RACING OVER THE CIRCUIT PATTERN                              632\n</b>\n\n         and returning to the real world.\n\n\n<b>    633  THE REAL WORLD - LASER LAB                                   633\n</b>\n\n         CLOSE on the business end of the huge laser in ICOM's lab. A bright\n         blast of LIGHT shoots out of the mechanism.\n\n\n         WIDEN TO REVEAL the laser pouring its light onto the floor, near the\n         chair where Flynn was sitting when he was digitized.\n\n\n         Slowly -- in a reverse of his disappearance -- Flynn's BODY takes\n         shape on the floor. As the laser shuts off, he is revealed intact --\n         back in his real-world body and clothes... and as bewildered to find\n         himself here as he was when he first arrived in the electronic world.\n\n\n         He studies his hands -- and SEES that they're now nonluminescent\n         flesh and blood.\n\n\n         He looks out the window and SEES that it's shortly past dawn, with\n         weak sunlight coming in.\n\n\n         And, at the SOUND of light MACHINERY at work, he turns to look at\n         Lora's computer terminal, where a hard-copy computer PRINTER is\n         coughing out a long document on wide blue paper.\n\n\n         Flynn gets up off the floor, goes over to the printer, and READS the\n         document. As he does so, his eyes widen, and a SMILE appears on his\n         face.\n\n\n         The printer finishes its run, clicks patiently. Flynn, exuberant,\n         tears the printout from the machine and rushes to the door with it.\n\n\n<b>                                                   CUT TO:\n</b>\n\n<b>    634  INT. ALAN'S OFFICE - ALAN AND LORA                           634\n</b>\n\n         Bleary but excited, they gaze happily at the information on Alan's\n         CRT screen as Flynn bursts into the room, waving his printout.\n\n\n<b>                               FLYNN\n</b>                    Hey -- you guys\n\n\n         Before he can say anything more, Alan turns to greet him, holding up\n         a seven-inch computer software FLOPPY DISK in its cardboard sleeve.\n\n\n<b>                               ALAN\n</b>                    Flynn! I made it. I worked out some\n                    new codes for Tron, put 'em on a disk,\n                    and -- it's running.\n\n\n<b>                               FLYNN\n</b>                    I know, I met him.\n\n\n         Alan and Lora look at him -- the same sort of mystified look he got\n         from Tron and Yori in the other world. He checks himself.\n\n\n<b>                               FLYNN (CONT.)\n</b>                    I mean, I saw it read-up -\n                    hey, look at this.\n\n\n         He shows them the printout. It takes Alan and Lora a few seconds of\n         reading it to figure out its significance.\n\n\n<b>                               ALAN\n</b>                    Your old files -- ?\n\n\n<b>                               FLYNN\n</b>                    And Dillinger's instructions to\n                    divert them -- it's all there -\n                    look, even his home phone number,\n                    when he logged on.\n\n\n<b>                               ALAN\n</b>                    Oh, that is beautiful. You've got\n                    the goods...\n\n\n         Flynn folds up the printout, puts it in his pocket. Alan and Lora\n         get up, stretch, start wandering slowly toward the door with him.\n\n\n<b>                               FLYNN\n</b>                    You're telling me...\n\n\n         As they talk, CAMERA PANS over to Alan's color CRT SCREEN and HOLDS\n         on it.\n\n\n<b>    635  CRT SCREEN                                                   635\n</b>\n\n         The lines of printed information that had filled it up wipe off, and\n         are replaced by a number of shapes very much like the ones in a\n         typical video game:\n\n\n         A BLUE CYLINDER, poised on a BLUE MESA -- resembling the MCP in the\n         electronic world. And THREE YELLOW ROCKETS. They move randomly at\n         first, then converge on the blue figure from three different\n         directions.\n\n\n<b>                               FLYNN (V.0.)\n</b>                    you have any idea how much I can sue these\n                    jokers for?\n\n\n<b>                               LORA (V.0.)\n</b>                    Well, just don't forget your old friends\n                    when you're rich and famous.\n\n\n<b>                               FLYNN (V.0.)\n</b>                    Are you kidding? You guys'll he running\n                    this joint by then...\n\n\n<b>                               ALAN (V.O.)\n</b>                   Your friend Dillinger sure won't...\n\n\n         The yellow rockets all hit the blue mesa at the same time. It\n         EXPLODES in typical video-game fashion -- radiating lines of blue\n         SPARKS. The yellow rockets fly away from it and form a vertical\n         formation, heading together toward the side of the CRT screen as we\n         HEAR Flynn, Lora, and Alan heading for the door.\n\n\n<b>                               FLYNN (V.O.)\n</b>                    Hey, you know anybody who wants to\n                    get hold of some video games... cheap?\n\n\n<b>                               LORA (V.O.)\n</b>                    You're getting out of the business?\n\n\n<b>                               ALAN (V.O.)\n</b>                    Shouldn't you wait till your\n                    lawsuit's settled?\n\n\n<b>                               FLYNN (V.0.)\n</b>                    Nah...I decided...I've had enough of\n                    video games to last me a good long\n                    time. I feel like gettin' into some\n                    real life...\n\n\n         at the SOUND of the DOOR to Alan's office closing O.S., the three\n         yellow rockets leave the CRT screen, sailing off its left-hand edge.\n         HOLD a moment on the exploded blue figure and\n\n\n<b>                                                        BLACK OUT.\n</b>\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>TRON</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Steven Lisberger\" title=\"Scripts by Steven Lisberger\">Steven Lisberger</a>  <a href=\"/writer.php?w=Bonnie MacBird\" title=\"Scripts by Bonnie MacBird\">Bonnie MacBird</a>  <a href=\"/writer.php?w=Charlie Haas\" title=\"Scripts by Charlie Haas\">Charlie Haas</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/TRON Script.html#comments\" title=\"TRON comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:18:45.411398"}