{"title": "True Grit", "film_link": "/Movie Scripts/True Grit Script.html", "script_link": "/scripts/True-Grit.html", "info_raw": "\n\nTrue Grit Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Joel Cohen  Ethan Coen  Charles Portis\nGenres  Adventure  Drama  Western\nScript Date : June 2009\nMovie Release Date : December 2010\n\nRead \"True Grit\" Script\n\n\n", "script": "\n      \r\n      \r\n                                           TRUE GRIT\r\n      \r\n      \r\n      \r\n                                         Adaptation by\r\n      \r\n                                      Joel and Ethan Coen\r\n      \r\n      \r\n                              Based on the Novel by Charles Portis\r\n      \r\n      \r\n      \r\n      \r\n                                                                    June 12, 2009\r\n      \r\n      White letters on a black screen:\r\n      \r\n      The wicked flee when none pursueth.\r\n      \r\n      The quotation fades.\r\n      \r\n      A woman's voice:\r\n      \r\n                                             Voice-Over\r\n                     People do not give it credence that a young girl could leave\r\n                     home and go off in the wintertime to avenge her father's\r\n                     blood, but it did happen.\r\n      \r\n      The street of a western town, night. The street is deserted. Snow falls.\r\n      \r\n      We track slowly forward.\r\n      \r\n                     I was just fourteen years of age when a coward by the name\r\n                     of Tom Chaney shot my father down in Fort Smith,\r\n                     Arkansas, and robbed him of his life and his horse and two\r\n                     California gold pieces that he carried in his trouser band.\r\n      \r\n      A shape lies in the street below the busted-out porch railing of a two-story building. A\r\n      sign identifies the building as the Monarch Boarding House.\r\n      \r\n                     Papa was a Cumberland Presbyterian and a Mason. He'd\r\n                     hired Chaney--for paid wages, not on shares--when Chaney\r\n                     was \"down on his luck.\" If Papa had a failing it was his\r\n                     kindly disposition; I did not get my mean streak from him.\r\n      \r\n      The crumpled shape is a body. We hear the thunder of approaching hooves.\r\n      \r\n                     He had taken Chaney up to Fort Smith to help lead back a\r\n                     string of mustang ponies he'd just bought from a stock trader\r\n                     named Stonehill. In town, Chaney had fallen to drink and\r\n                     cards, and lost all his money. He got it into his head he'd\r\n                     been cheated and went back to the boarding house for his\r\n                     Henry rifle. Papa remonstrated, and Chaney shot him in the\r\n                     breast.\r\n      \r\n      A galloping horse enters frame and recedes, whipped on by a bareback rider. A long-\r\n      barreled rifle is tied across the rider's back with a sash cord.\r\n                                                                                                2\r\n      \r\n      He disappears into the falling snow.\r\n      \r\n                    Chaney fled. He could have taken the time to saddle the\r\n                    horse--or hitched up three spans of mules to a Concord\r\n                    stagecoach and smoked a pipe, as it seems that no one in that\r\n                    city was inclined to give chase. Chaney had mistaken its\r\n                    citizens for men.\r\n      \r\n      \r\n      DAY\r\n      \r\n      We are looking into the window of a moving train.\r\n      \r\n      Looking out past us is a fourteen-year-old girl, Mattie Ross. Next to her is Yarnell, a\r\n      middle-aged black man. Reading backward in the mirror of the window we see a station\r\n      sign easing in as the train slows: FORT SMITH.\r\n      \r\n      The voice-over continues:\r\n      \r\n                                          Voice-Over\r\n                    You might say, what business was it of my father's to\r\n                    meddle? My answer is this: he was trying to do that short\r\n                    devil a good turn. He was his brother's keeper. Does that\r\n                    answer your question?\r\n      \r\n      \r\n      DEAD MAN'S FACE\r\n      \r\n      Candlelight flickers over the man's waxy features.\r\n      \r\n                                                   Voice\r\n                                             (Irish-accented)\r\n                    Is that the man?\r\n      \r\n      The body, wrapped in a shroud, lies in a pine coffin. Mattie and Yarnell stand looking\r\n      down at it. An undertaker, grizzled and severely dressed, holds the candle.\r\n      \r\n                                                 Yarnell\r\n                    Lord lord.\r\n      \r\n                                                 Mattie\r\n                    That is my father.\r\n                                                                        3\r\n                              Undertaker\r\n      If you would loik to kiss him it would be all roight.\r\n      \r\n                             Yarnell\r\n      He has gone home. Praise the lord.\r\n      \r\n                                 Mattie\r\n      Put the lid on. Why is it so much?\r\n      \r\n                              Undertaker\r\n      The quality of the casket and of the embalming. The loifloik\r\n      appearance requires time and art. And the chemicals come\r\n      dear. The particulars are in your bill. If you would loik to\r\n      kiss him it would be all roight.\r\n      \r\n                             Mattie\r\n      No. Thank you. The spirit has flown. Your wire said fifty\r\n      dollars.\r\n      \r\n                             Undertaker\r\n      You did not specify he was to be shipped.\r\n      \r\n                                 Mattie\r\n      Well sixty dollars is every cent we have. It leaves nothing\r\n      for our board. Yarnell, you can see to the body's transport to\r\n      the train station and accompany it home, and I will have to\r\n      sleep here tonight.\r\n      \r\n                              Yarnell\r\n      I don't think your mama'd want you to stay in this town by\r\n      yourself.\r\n      \r\n                                   Mattie\r\n      It can't be helped. I still have to collect father's things and\r\n      see to some other business.\r\n      \r\n                               Yarnell\r\n      But I's your chap-a-rone! Your mama didn't say for you to\r\n      see to no business here!\r\n      \r\n                               Mattie\r\n      It is business Mama doesn't know about. It's all right,\r\n      Yarnell, I dismiss you.\r\n                                                                                            4\r\n                                              Yarnell\r\n                    Well I'm not sure I--\r\n      \r\n                                               Mattie\r\n                    Tell mama not to sign anything until I return home and see\r\n                    that Papa is buried in his mason's apron.\r\n      \r\n      To the undertaker:\r\n      \r\n                    . . .Your terms are agreeable if I may pass the night here.\r\n      \r\n                                        Undertaker\r\n                    Here? Among these people?\r\n      \r\n      Mattie looks around the empty room.\r\n      \r\n                                              Mattie\r\n                    These people?\r\n      \r\n                                          Undertaker\r\n                    I am expecting three more souls. Sullivan, Smith, and His\r\n                    Tongue In The Rain.\r\n      \r\n                                             Mattie\r\n                    How is it that you know in advance?\r\n      \r\n      \r\n      GALLOWS\r\n      \r\n      Three men stand upon a rough-hewn three-banger gallows. The condemned are two white\r\n      men and an Indian. They wear new jeans and flannel shirts buttoned to the neck. Each has\r\n      a noose around his neck. One of the white men is addressing the crowd:\r\n      \r\n                                               Man\r\n                    Ladies and gentlemen beware and train up your children in\r\n                    the way that they should go! You see what has become of\r\n                    me because of drink. I killed a man in a trifling quarrel over\r\n                    a pocketknife.\r\n      \r\n      Mattie is pushing her way through the spectators thronging the town square.\r\n      \r\n      Up on the gallows the condemned speaker starts to weep.\r\n                                                                                                5\r\n                                                Man\r\n                    If I had received good instruction as a child I would be with\r\n                    my wife and children today, away out on the Cimarron\r\n                    River. I don't know what is to become of them. I hope and\r\n                    pray that you will not slight them and compel them to go into\r\n                    low company.\r\n      \r\n      His blubbering will not let him go on. He steps back. A man standing by slips a black\r\n      hood over his head which continues to bob with sobbing.\r\n      \r\n      Mattie hisses to a woman nearby:\r\n      \r\n                                             Mattie\r\n                    Can you point out the sheriff?\r\n      \r\n      The woman indicates a figure among the officiators on the scaffold:\r\n      \r\n                                              Woman\r\n                    Him with the mustaches.\r\n      \r\n      The second condemned man is speaking:\r\n      \r\n                                              Man\r\n                    Well, I killed the wrong man is the which-of-why I'm here.\r\n                    Had I killed the man I meant to I don't believe I would a\r\n                    been convicted. I see men out there in that crowd is worse\r\n                    than me.\r\n      \r\n      A thinking pause. He nods, shrugging.\r\n      \r\n                    . . . Okay.\r\n      \r\n      He steps back and is hooded.\r\n      \r\n      The third man steps forward.\r\n      \r\n                                              Indian\r\n                    I would like to say--\r\n      \r\n      He is hooded, speech cut short. The hangman, hand to his elbow, helps him step back.\r\n      \r\n      The executioner pulls a lever on the scaffold. Three trapdoors swing open and three men\r\n      drop. They hit the end of their ropes with a crack.\r\n                                                                                                 6\r\n                                               Crowd\r\n                     Oh!\r\n      \r\n      Two of the men have their heads snapped to an angle and are limp and twist slowly. One,\r\n      though, writhes and kicks, jackknifing his legs.\r\n      \r\n                                                Man\r\n                     Oh, Sullivan must'er lost weight in prison! His neck ain't\r\n                     broke!\r\n      \r\n      Sullivan continues to writhe and kick.\r\n      \r\n                                                Voice\r\n                     Hot tamales?\r\n      \r\n      Mattie looks down at a boy selling hot tamales out of a bucket.\r\n      \r\n                     . . . Ten cents?\r\n      \r\n      \r\n      LATER\r\n      \r\n      Mattie is talking to the sheriff whom we saw officiating on the scaffold. The square is\r\n      emptying and, in the background, all three men twist slowly, the last man having finally\r\n      given up the ghost. The Mexican boy still hawks tamales to stragglers.\r\n      \r\n                                               Sheriff\r\n                     No, we ain't arrested him. Ain't caught up to him, he lit out\r\n                     for the Territory. I would think he has throwed in with\r\n                     Lucky Ned Pepper, whose gang robbed a mail hack\r\n                     yesterday on the Poteau River.\r\n      \r\n                                             Mattie\r\n                     Why are you not looking for him?\r\n      \r\n                                                Sheriff\r\n                     I have no authority in the Indian Nation. Tom Chaney is the\r\n                     business of the U.S. marshals now.\r\n      \r\n                                              Mattie\r\n                     When will they arrest him?\r\n      \r\n                                                Sheriff\r\n                     Not soon I am afraid. The marshals are not well staffed and,\r\n                     I will tell you frankly, Chaney is at the end of a long list of\r\n                                                                                     7\r\n                     fugitives and malefactors.\r\n      \r\n                                               Mattie\r\n                     Could I hire a marshal to pursue Tom Chaney?\r\n      \r\n      The sheriff looks at the girl and chuckles.\r\n      \r\n                                              Sheriff\r\n                     You have a lot of experience with bounty hunters?\r\n      \r\n                                                 Mattie\r\n                     My answer is this: That is a silly question. I am here to\r\n                     settle my father's affairs.\r\n      \r\n                                                Sheriff\r\n                     All alone?\r\n      \r\n                                               Mattie\r\n                     I am the person for it. Mama was never any good at sums\r\n                     and she can hardly spell cat. I intend to see papa's killer\r\n                     hanged.\r\n      \r\n                                              Sheriff\r\n                     I see. Well. Nothing prevents you from offering a reward,\r\n                     or from so informing a marshal. It would have to be real\r\n                     money, though, to be persuasive. Chaney is across the river\r\n                     in the Choctaw Nation--lawless country. It will not be a\r\n                     daisy-picking expedition. Upwards of three-score US\r\n                     marshals have been slaughtered in the Territory.\r\n      \r\n                                               Mattie\r\n                     I will see to the money. Who's the best marshal?\r\n      \r\n                                                 Sheriff\r\n                     I would have to weigh that proposition. I reckon William\r\n                     Waters is the best tracker. He is half Comanche and it is\r\n                     something to see him cut for sign. The meanest one is\r\n                     Rooster Cogburn. He is a pitiless man, double tough and\r\n                     fear don't enter into his thinking. He loves to pull a cork.\r\n                     The best is probably L.T. Quinn, he brings his prisoners in\r\n                     alive. He may let one get by now and again but he believes\r\n                     even the worst of men is entitled to a fair shake. Quinn is a\r\n                     good peace officer and a lay preacher to boot. He will not\r\n                     plant evidence or abuse a prisoner. He is as straight as\r\n                     string. Yes, I will say Quinn is about the best they have.\r\n                                                                                     8\r\n      \r\n                                              Mattie\r\n                     Where can I find this Rooster?\r\n      \r\n      \r\n      MATTIE'S HAND\r\n      \r\n      Rapping at a door of rough plank.\r\n      \r\n      After a beat, a voice--rasping and slurred:\r\n      \r\n                                               Voice\r\n                     The jakes is occupied.\r\n      \r\n      Wider. We see that Mattie stands before an outhouse.\r\n      \r\n                                               Mattie\r\n                     I know it is occupied Mr. Cogburn. As I said, I have\r\n                     business with you.\r\n      \r\n      Beat.\r\n      \r\n                                               Voice\r\n                     I have prior business.\r\n      \r\n                                               Mattie\r\n                     You have been at it for quite some time, Mr. Cogburn.\r\n      \r\n                                               Voice\r\n                                          (roaring drunk)\r\n                     There is no clock on my business! To hell with you! To hell\r\n                     with you! How did you stalk me here?!\r\n      \r\n                                               Mattie\r\n                     The sheriff told me to look in the saloon. In the saloon they\r\n                     referred me here. We must talk.\r\n      \r\n                                              Voice\r\n                                           (outraged)\r\n                     Women ain't allowed in the saloon!\r\n      \r\n                                               Mattie\r\n                     I was not there as a customer. I am fourteen years old.\r\n      \r\n      No response. Mattie reaches up and raps again, vigorously.\r\n                                                                                                   9\r\n      \r\n      Beat.\r\n      \r\n                                              Voice\r\n                                             (sullen)\r\n                     The jakes is occupied. And will be for some time.\r\n      \r\n      \r\n      PLANK FLOOR\r\n      \r\n      A coffin is dropped heavily into frame and we see, chalked onto the freshly milled wood of\r\n      its top:\r\n      \r\n                                                  Ross\r\n                                              Yell County\r\n                                             Hold at station\r\n      \r\n      After a resting beat, during which the coffin's handlers presumably adjust their grip, the\r\n      coffin is shoved away over the straw-littered planking of a rail freight car. Once it has\r\n      been pushed fully in, the upright planking of the boxcar door blurs through frame in the\r\n      extreme foreground til the door slams to rest.\r\n      \r\n      We hear the steam engine start to chug, and the foreground door moves slowly off with the\r\n      grinding motion of the train.\r\n      \r\n      \r\n      SHOP DOOR\r\n      \r\n      Swinging open. It is the barnlike door to the mortician's workroom; the Irish undertaker\r\n      holds it open for Mattie. She carries a bedroll.\r\n      \r\n                                             Undertaker\r\n                     You can sleep in a coffin if you loik.\r\n      \r\n      Three bodies lay under shrouds on a high work table. The arm of the nearest sticks out,\r\n      rope burns on its wrist. Three coffins are in various stages of assembly.\r\n      \r\n      Mattie unwinds the bedroll onto the floor.\r\n      \r\n                                               Mattie\r\n                     Not. . . yet.\r\n      \r\n      \r\n      STREET\r\n                                                                                                  10\r\n      Mattie strides along, looking at facades. She stops, looking at the signage on a barnlike\r\n      building:\r\n      \r\n                        Col. G. Stonehill. Licensed Auctioneer. Cotton Factor.\r\n      \r\n      \r\n      INSIDE\r\n      \r\n      Mattie steps to the doorway of an office set in a corner of the stable.\r\n      \r\n                                            Mattie\r\n                     How much are you paying for cotton?\r\n      \r\n      Stonehill looks up from his desk. He eyes the girl up and down.\r\n      \r\n                                             Stonehill\r\n                     Nine and a half for low middling and ten for ordinary.\r\n      \r\n                                               Mattie\r\n                     We got most of ours out early and sold it to Woodson\r\n                     Brothers in Little Rock for eleven cents.\r\n      \r\n                                             Stonehill\r\n                     Then I suggest you take the balance of it to the Woodson\r\n                     Brothers.\r\n      \r\n                                             Mattie\r\n                     We took the balance to Woodson. We got ten and a half.\r\n      \r\n                                           Stonehill\r\n                     Why did you come here to tell me this?\r\n      \r\n                                                Mattie\r\n                     I thought we might shop around up here next year but I guess\r\n                     we are doing all right in Little Rock. I am Mattie Ross,\r\n                     daughter of Frank Ross.\r\n      \r\n      Stonehill sets his pen down and leans back.\r\n      \r\n                                             Stonehill\r\n                     A tragic thing. May I say your father impressed me with his\r\n                     manly qualities. He was a close trader but he acted the\r\n                     gentleman.\r\n                                                                                     11\r\n                                               Mattie\r\n                    I propose to sell those ponies back to you that my father\r\n                    bought.\r\n      \r\n                                                Stonehill\r\n                    That, I fear, is out of the question. I will see that they are\r\n                    shipped to you at my earliest convenience.\r\n      \r\n                                            Mattie\r\n                    We don't want the ponies now. We don't need them.\r\n      \r\n                                            Stonehill\r\n                    Well that hardly concerns me. Your father bought those five\r\n                    ponies and paid for them and there is an end of it. I have the\r\n                    bill of sale.\r\n      \r\n      Beat.\r\n      \r\n                                             Mattie\r\n                    And I want three hundred dollars for Papa's saddle horse that\r\n                    was stolen from your stable.\r\n      \r\n                                             Stonehill\r\n                    You will have to take that up with the man who stole the\r\n                    horse.\r\n      \r\n                                            Mattie\r\n                    Tom Chaney stole the horse while it was in your care. You\r\n                    are responsible.\r\n      \r\n      Stonehill chuckles.\r\n      \r\n                                             Stonehill\r\n                    I admire your sand but I believe you will find that I am not\r\n                    liable for such claims.\r\n      \r\n                                              Mattie\r\n                    You were custodian. If you were a bank and were robbed\r\n                    you could not simply tell the depositors to go hang.\r\n      \r\n                                             Stonehill\r\n                    I do not entertain hypotheticals, the world as it is is vexing\r\n                    enough. Secondly, your valuation of the horse is high by\r\n                    about two hundred dollars. How old are you?\r\n                                                                                     12\r\n                                                Mattie\r\n                     If anything my price is low. Judy is a fine racing mare. She\r\n                     has won purses of twenty-five dollars; I have seen her jump\r\n                     an eight-rail fence with a heavy rider. I am fourteen.\r\n      \r\n                                               Stonehill\r\n                     Hmm. Well, that's all very interesting. The ponies are\r\n                     yours, take them. Your father's horse was stolen by a\r\n                     murderous criminal. I had provided reasonable protection\r\n                     for the creature as per our implicit agreement. My watchman\r\n                     had his teeth knocked out and can take only soup. We must\r\n                     each bear his own misfortunes.\r\n      \r\n                                               Mattie\r\n                     I will take it to law.\r\n      \r\n                                              Stonehill\r\n                     You have no case.\r\n      \r\n                                              Mattie\r\n                     Lawyer J. Noble Daggett of Dardanelle, Arkansas may think\r\n                     otherwise--as might a jury, petitioned by a widow and three\r\n                     small children.\r\n      \r\n                                              Stonehill\r\n                     Where is your mother?\r\n      \r\n                                              Mattie\r\n                     She is at home in Yell County looking after my sister\r\n                     Victoria and my brother Little Frank.\r\n      \r\n                                            Stonehill\r\n                     I cannot make an agreement with a minor child. You are not\r\n                     accountable.\r\n      \r\n                                               Mattie\r\n                     Lawyer Dagget will back up any decision I make, you may\r\n                     rest easy on that score. You can confirm any agreement by\r\n                     telegraph.\r\n      \r\n      Stonehill stares.\r\n      \r\n                                              Stonehill\r\n                     I will pay two hundred dollars to your father's estate when I\r\n                     have in my hand a letter from your lawyer absolving me of\r\n                                                                       13\r\n      all liability from the beginning of the world to date. The\r\n      offer is more than liberal and I make it only to avoid the\r\n      possibility of troublesome litigation.\r\n      \r\n                                Mattie\r\n      I will take two hundred dollars for Judy, plus one hundred\r\n      for the ponies and twenty-five dollars for the gray horse that\r\n      Tom Chaney left. He is easily worth forty. That is three\r\n      hundred twenty-five dollars total.\r\n      \r\n                              Stonehill\r\n      The ponies have no part of this. I will not buy them.\r\n      \r\n                                Mattie\r\n      Then the price for Judy is three hundred twenty-five dollars.\r\n      \r\n                              Stonehill\r\n      I would not pay three hundred and twenty-five dollars for\r\n      winged Pegasus! As for the gray horse, it does not belong to\r\n      you! And you are a snip!\r\n      \r\n                               Mattie\r\n      The gray was lent to Tom Chaney by my father. Chaney\r\n      only had the use of him. Your other points are beneath\r\n      comment.\r\n      \r\n                              Stonehill\r\n      I will pay two hundred and twenty-five dollars and keep the\r\n      gray horse. I don't want the ponies.\r\n      \r\n                                  Mattie\r\n      I cannot accept that. (she stands) There can be no\r\n      settlement after I leave this office. It will go to law.\r\n      \r\n                                 Stonehill\r\n      This is my last offer. Two hundred and fifty dollars. For\r\n      that I get the release previously discussed and I keep your\r\n      father's saddle. I am also writing off a feed and stabling\r\n      charge. The gray horse is not yours to sell. You are an\r\n      unnatural child.\r\n      \r\n                                 Mattie\r\n      The saddle is not for sale. I will keep it. Lawyer Dagget can\r\n      prove ownership of the gray horse. He will come after you\r\n      with a writ of replevin.\r\n                                                                                             14\r\n      \r\n                                              Stonehill\r\n                    A what? All right, now listen very carefully as I will not\r\n                    bargain further. I will take the ponies back and keep the gray\r\n                    horse which is mine and settle for three hundred dollars.\r\n                    Now you must take that or leave it and I do not much care\r\n                    which it is.\r\n      \r\n                                             Mattie\r\n                    Lawyer Daggett would not wish me to consider anything\r\n                    under three hundred twenty-five dollars. But I will settle for\r\n                    three hundred and twenty if I am given the twenty in\r\n                    advance. And here is what I have to say about the saddle--\r\n      \r\n      \r\n      STREET\r\n      \r\n      We are tracking down the street we toward the Monarch Boarding House.\r\n      \r\n      Mattie is humping a saddle up the street. She stops before the boarding house. She looks\r\n      at its sign. She looks at its busted-out porch railing.\r\n      \r\n      \r\n      INSIDE THE PARLOR\r\n      \r\n      A Marjorie Main-like woman crushes Mattie to her bosom.\r\n      \r\n                                          Mrs. Floyd\r\n                    Frank Ross's daughter. My poor child. My poor child.\r\n      \r\n      Mattie grimaces, arms pinned to her sides.\r\n      \r\n                                             Mattie\r\n                    You have my father's traps?\r\n      \r\n                                            Mrs. Floyd\r\n                    Oh yes we do. My poor child. Are you gawna be stayin\r\n                    with us or are you hurrying home to your mother?\r\n      \r\n                                              Mattie\r\n                    I am staying briefly. I have business with Marshal Rooster\r\n                    Cogburn. I found him in his cups today but I understand\r\n                    he's to be in court tomorrow, testifying. I mean to engage\r\n                    him to hunt down Tom Chaney.\r\n                                                                                               15\r\n                                            Mrs. Floyd\r\n                     Well god bless him for that. The tariff here is seventy-five\r\n                     cents for room and supper. That does not include your\r\n                     daytime eats.\r\n      \r\n                                                Mattie\r\n                     Very well.\r\n      \r\n                                            Mrs. Floyd\r\n                     Your father owed for two days, god bless him.\r\n      \r\n                                                Mattie\r\n                     Oh. Well.\r\n      \r\n                                            Mrs. Floyd\r\n                     You'll share a room with Grandma Turner. We've had to\r\n                     double up, what with all the people in town come to see the\r\n                     hanging Judge Parker's put on for us.\r\n      \r\n                                              Mattie\r\n                     Yes, I witnessed the hanging myself.\r\n      \r\n                                              Mrs. Floyd\r\n                     Was it a good'n?\r\n      \r\n      \r\n      BEDROOM\r\n      \r\n      A blanket is unrolled to reveal a watch, a cheap knife, and a long-barreled Colt's dragoon\r\n      revolver. Voice off:\r\n      \r\n                                               Mrs. Floyd\r\n                     This was in the poor man's room. This is everything, there\r\n                     are no light fingers in this house. If you need something for\r\n                     to tote the gun around I will give you an empty flour sack for\r\n                     a nickel.\r\n      \r\n      \r\n      DARK ROOM\r\n      \r\n      We hear wind whistling through cracks in the floorboards and walls.\r\n      \r\n      We hear snoring.\r\n      \r\n      There is one bed, not large, with two shapes in it.\r\n                                                                                                 16\r\n      \r\n      We cut in closer to find Mattie lying on her back, staring. She shivers, shoulders hunched.\r\n      The thin blanket barely covers her.\r\n      \r\n      She pulls the blanket gently, slowly, so that it covers her exposed side.\r\n      \r\n      A beat of snoring, a snorfle, and then, as we hold on Mattie, the crackle of mattress ticking\r\n      under a shifting body--and the blanket is pulled away toward the unseen snorer.\r\n      \r\n      \r\n      COURT HALLWAY\r\n      \r\n      Voices echo from inside the courtroom. Mattie cracks a heavy oak door and slips in.\r\n      \r\n      \r\n      COURTROOM\r\n      \r\n      The gallery is crowded. Mattie is at the back of a press of standees.\r\n      \r\n      Her point-of-view, semi-obstructed: on the witness stand is Rooster Cogburn, a rough-\r\n      hewn man going to middle-aged fat. He has a patch over one eye.\r\n      \r\n                                               Cogburn\r\n                     The woman was out in the yard dead with blowflies on her\r\n                     face and the old man was inside with his breast blowed open\r\n                     by a scatter-gun and his feet burned. He was still alive but\r\n                     just was. He said them two Wharton boys had done it, rode\r\n                     up drunk--\r\n      \r\n                                             Mr. Goudy\r\n                     Objection. Hearsay.\r\n      \r\n                                           Mr. Barlow\r\n                     Dying declaration, your honor.\r\n      \r\n                                             Judge\r\n                     Overruled. Procede, Mr. Cogburn.\r\n      \r\n                                                Cogburn\r\n                     Them two Wharton boys--that'd be Odus and C.C.--\r\n                     throwed down on him, asked him where his money was,\r\n                     when he wouldn't talk lit pine knots and held 'em to his feet.\r\n                     He told 'em in a fruit jar under a gray rock at one corner of\r\n                     the smokehouse.\r\n                                                                      17\r\n                              Mr. Barlow\r\n      And then?\r\n      \r\n                              Cogburn\r\n      Well he died on us. Passed away in considerable pain.\r\n      \r\n                              Mr. Barlow\r\n      What did you do then?\r\n      \r\n                             Cogburn\r\n      Me and Marshal Potter went out to the smokehouse and that\r\n      rock had been moved and that jar was gone.\r\n      \r\n                            Mr. Goudy\r\n      Objection. Speculative.\r\n      \r\n                                 Judge\r\n      Sustained.\r\n      \r\n                             Mr. Barlow\r\n      You found a flat gray rock at the corner of the smokehouse\r\n      with a hollowed-out space under it?\r\n      \r\n                               Mr. Goudy\r\n      If the prosecutor is going to give evidence I suggest that he\r\n      be sworn.\r\n      \r\n                            Mr. Barlow\r\n      Marshal Cogburn, what did you find, if anything, at the\r\n      corner of the smokehouse?\r\n      \r\n                              Cogburn\r\n      We found a flat gray rock with a hollowed-out space under\r\n      it. Nothin there.\r\n      \r\n                              Mr. Barlow\r\n      And what did--\r\n      \r\n                               Cogburn\r\n      No jar or nothin.\r\n      \r\n                              Mr. Barlow\r\n      What did you do then?\r\n                                                                     18\r\n                              Cogburn\r\n      Well we rode up to the Whartons', near where the North\r\n      Fork strikes the Canadian, branch of the Canadian.\r\n      \r\n                            Mr. Barlow\r\n      And what did you find?\r\n      \r\n                               Cogburn\r\n      I had my glass and we spotted the two boys and their old\r\n      daddy, Aaron Wharton, down there on the creek bank with\r\n      some hogs. They'd killed a shoat and was butchering it.\r\n      They'd built a fire under a wash pot for scalding water.\r\n      \r\n                              Mr. Barlow\r\n      What did you do?\r\n      \r\n                               Cogburn\r\n      Crept down. I announced that we was U.S. marshals and\r\n      hollered to Aaron that we needed to talk to his boys. He\r\n      picked up a axe and commenced to cussing us and\r\n      blackguarding this court.\r\n      \r\n                              Mr. Barlow\r\n      What did you do then?\r\n      \r\n                               Cogburn\r\n      Backed away trying to talk some sense into him. But C.C.\r\n      edges over by the wash pot and picks up a shotgun. Potter\r\n      seen him but it was too late. C.C. Wharton pulled down on\r\n      Potter with one barrel and then turned to do the same for me\r\n      with the other. I shot him and when the old man swung the\r\n      axe I shot him. Odus lit out and I shot him. Aaron Wharton\r\n      and C.C. Wharton was dead when they hit the ground but\r\n      Odus was just winged.\r\n      \r\n                              Mr. Barlow\r\n      Did you find the jar with the hundred and twenty dollars in\r\n      it?\r\n      \r\n                              Mr. Goudy\r\n      Leading.\r\n      \r\n                                Judge\r\n      Sustained.\r\n                                                                   19\r\n                                Mr. Barlow\r\n      What happened then?\r\n      \r\n                                Cogburn\r\n      I found the jar with a hundred and twenty dollars in it.\r\n      \r\n                           Mr. Barlow\r\n      And what happened to Marshal Potter?\r\n      \r\n                             Cogburn\r\n      Died. Leaves a wife and six babies.\r\n      \r\n                                Mr. Goudy\r\n      Objection.\r\n      \r\n                                  Judge\r\n      Strike the comment.\r\n      \r\n                          Mr. Barlow\r\n      And what became of Odus Wharton?\r\n      \r\n                                 Cogburn\r\n      There he sets.\r\n      \r\n                          Mr. Barlow\r\n      Okay. You may ask, Mr. Goudy.\r\n      \r\n                           Mr. Goudy\r\n      Thank you, Mr. Barlow. In your four years as U.S. marshal,\r\n      Mr. Cogburn, how many men have you shot?\r\n      \r\n                                Mr. Barlow\r\n      Objection.\r\n      \r\n                               Mr. Goudy\r\n      There is more to this shooting than meets the eye, Judge\r\n      Parker. I will establish the bias of this witness.\r\n      \r\n                                  Judge\r\n      Objection is overruled.\r\n      \r\n                         Mr. Goudy\r\n      How many, Mr. Cogburn?\r\n                                                                            20\r\n                                       Cogburn\r\n              I never shot nobody I didn't have to.\r\n      \r\n                                     Mr. Goudy\r\n              That was not the question. How many?\r\n      \r\n                                        Cogburn\r\n              . . . Shot or killed?\r\n      \r\n                                         Mr. Goudy\r\n              Let us restrict it to \"killed\" so that we may have a\r\n              manageable figure.\r\n      \r\n                                      Cogburn\r\n              Around twelve or fifteen. Stopping men in flight, defending\r\n              myself, et cetera.\r\n      \r\n                                     Mr. Goudy\r\n              Around twelve or fifteen. So many that you cannot keep a\r\n              precise count. Remember, you are under oath. I have\r\n              examined the records and can supply the accurate figure.\r\n      \r\n      Beat.\r\n      \r\n                                     Cogburn\r\n              I believe them two Whartons make twenty-three.\r\n      \r\n                                   Mr. Goudy\r\n              Twenty-three dead men in four years.\r\n      \r\n                                       Cogburn\r\n              It is a dangerous business.\r\n      \r\n                                 Mr. Goudy\r\n              How many members of this one family, the Wharton family,\r\n              have you killed?\r\n      \r\n                                        Cogburn\r\n              Immediate, or--\r\n      \r\n                                      Mr. Barlow\r\n              Your honor, perhaps counsel should be advised that the\r\n              marshal is not the defendant in this action.\r\n                                                                     21\r\n                              Mr. Barlow\r\n      The history is relevant your honor. Goes to Cogburn's\r\n      methods and animosities.\r\n      \r\n                                 Judge\r\n      Okay.\r\n      \r\n                             Mr. Barlow\r\n      Did you also shoot Dub Wharton, brother, and Clete\r\n      Wharton, half-brother?\r\n      \r\n                               Cogburn\r\n      Clete was selling ardent spirits to the Cherokee. He come at\r\n      me with a king bolt.\r\n      \r\n                            Mr. Goudy\r\n      You were armed and he advanced upon you with nothing but\r\n      a king bolt? From a wagon tongue?\r\n      \r\n                              Cogburn\r\n      I've seen men badly tore up with things no bigger than a\r\n      king bolt. I defended myself.\r\n      \r\n                              Mr. Goudy\r\n      And, returning to the encounter with Aaron and his two\r\n      remaining sons, you sprang from cover with your revolver in\r\n      hand?\r\n      \r\n                                Cogburn\r\n      I did.\r\n      \r\n                              Mr. Goudy\r\n      Loaded and cocked?\r\n      \r\n                                Cogburn\r\n      If it ain't loaded and cocked it don't shoot.\r\n      \r\n                             Mr. Goudy\r\n      And like his son, Aaron Wharton advanced against an armed\r\n      man?\r\n      \r\n                            Cogburn\r\n      He was armed. He had that axe raised.\r\n                                                                     22\r\n                              Mr. Goudy\r\n      Yes. I believe you testified that you backed away from\r\n      Aaron Wharton?\r\n      \r\n                              Cogburn\r\n      That is right.\r\n      \r\n                            Mr. Goudy\r\n      Which direction were you going?\r\n      \r\n                             Cogburn\r\n      I always go backwards when I'm backing up.\r\n      \r\n                            Mr. Goudy\r\n      Very amusing I suppose--for all of us except Aaron\r\n      Wharton. Now, he advanced upon you much in the manner\r\n      of Clete Wharton menacing you with that king bolt or rolled-\r\n      up newspaper or whatever it was.\r\n      \r\n                            Cogburn\r\n      Yes sir. He commenced to cussing and laying about with\r\n      threats.\r\n      \r\n                           Mr. Goudy\r\n      And you were backing away? How many steps before the\r\n      shooting started?\r\n      \r\n                              Cogburn\r\n      Seven, eight steps?\r\n      \r\n                            Mr. Goudy\r\n      Aaron Wharton keeping pace, advancing, away from the fire\r\n      seven eight steps--what would that be, fifteen, twenty feet?\r\n      \r\n                              Cogburn\r\n      I suppose.\r\n      \r\n                               Mr. Goudy\r\n      Will you explain to the jury, Mr. Cogburn, why Mr. Wharton\r\n      was found immediately by the wash pot with one arm in the\r\n      fire, his sleeve and hand smoldering?\r\n      \r\n                              Cogburn\r\n      Well.\r\n                                                                                             23\r\n                                         Mr. Goudy\r\n                    Did you move the body after you shot him?\r\n      \r\n                                              Cogburn\r\n                    Why would I do that?\r\n      \r\n                                           Mr. Goudy\r\n                    You did not drag his body over to the fire? Fling his arm in?\r\n      \r\n                                              Cogburn\r\n                    No sir.\r\n      \r\n                                           Mr. Goudy\r\n                    Two witnesses who arrived on the scene will testify to the\r\n                    location of the body. You do not remember moving the\r\n                    body? So it was a bushwack, as he tended his campfire?\r\n      \r\n                                           Mr. Barlow\r\n                    Objection.\r\n      \r\n                                              Cogburn\r\n                    I, if that was where the body was I might have moved him. I\r\n                    do not remember.\r\n      \r\n                                        Mr. Goudy\r\n                    Why would you move the body, Mr. Cogburn?\r\n      \r\n                                           Cogburn\r\n                    Them hogs rooting around might have moved him. I do not\r\n                    remember.\r\n      \r\n      \r\n      COURTHOUSE PORCH\r\n      \r\n      Mattie waits as people file out. She pushes forward to meet Cogburn when he emerges,\r\n      muttering.\r\n      \r\n                                              Cogburn\r\n                    Son of a goddamn bitch.\r\n      \r\n                                              Mattie\r\n                    Rooster Cogburn?\r\n      \r\n                                              Cogburn\r\n                    What is it.\r\n                                                                                            24\r\n      \r\n      He does not look up from the cigarette he is trying to roll. His hands are shaking.\r\n      \r\n                                                Mattie\r\n                     I would like to talk with you a minute.\r\n      \r\n                                                Cogburn\r\n                     What is it.\r\n      \r\n                                              Mattie\r\n                     They tell me you are a man with true grit.\r\n      \r\n                                             Cogburn\r\n                     What do you want, girl? Speak up. It is suppertime.\r\n      \r\n                                                 Mattie\r\n                     Let me do that.\r\n      \r\n      She takes the fixings and rolls, licks, and twists the cigarette.\r\n      \r\n                     . . . Your makings are too dry. I am looking for the man who\r\n                     shot and killed my father, Frank Ross, in front of the\r\n                     Monarch boarding house. The man's name is Tom Chaney.\r\n                     They say he is over in Indian Territory and I need somebody\r\n                     to go after him.\r\n      \r\n                                                Cogburn\r\n                     What is your name, girl?\r\n      \r\n                                              Mattie\r\n                     My name is Mattie Ross. We are located in Yell County.\r\n                     My mother is at home looking after my sister Victoria and\r\n                     my brother Little Frank.\r\n      \r\n                                            Cogburn\r\n                     You had best go home to them. They will need help with the\r\n                     churning.\r\n      \r\n                                               Mattie\r\n                     There is a fugitive warrant out for Chaney. The government\r\n                     will pay you two dollars for bringing him in plus ten cents a\r\n                     mile for each of you. On top of that I will pay you a fifty-\r\n                     dollar reward.\r\n      \r\n      Cogburn gazes at her.\r\n                                                                                                    25\r\n      \r\n                                              Cogburn\r\n                     What are you? (looks at the flour sack she holds) What've\r\n                     you got there in your poke?\r\n      \r\n      She opens it. Cogburn smiles.\r\n      \r\n                     . . . By God! A Colt's dragoon! Why, you're no bigger than\r\n                     a corn nubbin, what're you doing with a pistol like that?\r\n      \r\n                                              Mattie\r\n                     I intend to kill Tom Chaney with it if the law fails to do so.\r\n      \r\n                                               Cogburn\r\n                     Well, that piece will do the job--if you can find a high\r\n                     stump to rest it on and a wall to put behind you.\r\n      \r\n                                               Mattie\r\n                     Nobody here knew my father and I am afraid nothing much\r\n                     is going to be done about Chaney except I do it. My brother\r\n                     is a child and my mother is indecisive and hobbled by grief.\r\n      \r\n                                              Cogburn\r\n                     I don't believe you have fifty dollars.\r\n      \r\n                                                Mattie\r\n                     I will shortly. I have a contract with Colonel Stonehill which\r\n                     he will make payment on tomorrow or the next day, once a\r\n                     lawyer countersigns.\r\n      \r\n                                                Cogburn\r\n                     I don't believe fairy tales or sermons or stories about money,\r\n                     baby sister. But thank you for the cigarette.\r\n      \r\n      \r\n      EVENING--BOARDING HOUSE PORCH\r\n      \r\n      Mattie climbs the few steps from the street. Her attention is drawn by:\r\n      \r\n      A man sitting on a chair to one side enjoying the quiet of the evening. He is dressed for\r\n      riding, with perhaps a bit too much panache. It is almost dark and he is hard to see but it\r\n      seems he is watching Mattie, amused.\r\n      \r\n      He raises a pipe to his mouth and pulls at it. The glow from the excited bowl kicks on his\r\n      eyes, which are indeed tracking her.\r\n                                                                                                  26\r\n      \r\n      Mattie, discomfited by his look, turns hastily forward and pushes open the door. A\r\n      jingling sound prompts one more glance to the side.\r\n      \r\n      The man's face is now hidden by his hat. Just before Mattie's point of view, now a lateral\r\n      track, starts to lose him behind the door jamb, he raises a spurred boot to push against the\r\n      porch rail and tip his chair back. He raises his other foot, spur jingling, and drapes it over\r\n      the first.\r\n      \r\n      \r\n      INSIDE\r\n      \r\n      We are pushing in on the landlady.\r\n      \r\n                                                Landlady\r\n                       Isn't your mother expecting you home, dear? I did not think\r\n                       to see you this evening.\r\n      \r\n                                                 Mattie\r\n                       My business is not yet finished. Mrs. Floyd, have any rooms\r\n                       opened up? Grandma Turner. . . the bed is quite narrow.\r\n      \r\n                                                Landlady\r\n                       The second-floor back did open up but the gentleman on the\r\n                       porch has just taken it. But don't worry yourself, dear--you\r\n                       are not disturbing Grandma Turner.\r\n      \r\n      \r\n      DARK BEDROOM\r\n      \r\n      As before, unseen Grandma Turner snores loudly as wind whistles and Mattie shivers.\r\n      \r\n      Fade to black.\r\n      \r\n      Very quiet.\r\n      \r\n      In the quiet, a faint crickle-crackle of flame. It is followed by a lip-pop and a deep inhale.\r\n      \r\n      Mattie opens her eyes. She is beaded with sweat. She looks blearily up.\r\n      \r\n      The room is dim. A man sits facing her in a straghtback chair, faintly backlit by the\r\n      daylight leaking through the curtained window behind him. He exhales pipesmoke.\r\n      \r\n                                               Cowboy\r\n                       You are sleeping the day away.\r\n                                                                                               27\r\n      \r\n                                               Mattie\r\n                     I am not well.\r\n      \r\n      The man rises and, spurs jingling, crosses to the window, and throws open the curtain.\r\n      \r\n      Mattie squints at him against the daylight:\r\n      \r\n      The man has a cowlick and barndoor ears and is once again well-accoutered for riding. He\r\n      steps away from the window and reseats himself.\r\n      \r\n                                            Cowboy\r\n                     You do not look well. My name is LeBoeuf. I have just\r\n                     come from Yell County.\r\n      \r\n                                            Mattie\r\n                     We have no rodeo clowns in Yell County.\r\n      \r\n                                               LeBoeuf\r\n                     A saucy line will not get you far with me. I saw your mother\r\n                     yesterday morning. She says for you to come right on home.\r\n      \r\n                                           Mattie\r\n                     Hm. What was your business there?\r\n      \r\n      LeBoeuf takes a small photograph from his coat.\r\n      \r\n                                              LeBoeuf\r\n                     This is a man I think you know.\r\n      \r\n      Mattie looks at the picture through red-rimmed eyes.\r\n      \r\n                     . . . You called him Tom Chaney, I believe. . .\r\n      \r\n      Mattie declines to contradict. LeBoeuf continues:\r\n      \r\n                     . . . though in the months I have been tracking him he has\r\n                     used the names Theron Chelmsford, John Todd Andersen,\r\n                     and others. He dallied in Monroe, Louisiana, and Pine Bluff,\r\n                     Arkansas before turning up at your father's place.\r\n      \r\n                                             Mattie\r\n                     Why did you not catch him in Monroe, Louisiana or Pine\r\n                     Bluff, Arkansas?\r\n                                                                                               28\r\n                                               LeBoeuf\r\n                     He is a crafty one.\r\n      \r\n                                              Mattie\r\n                     I thought him slow-witted myself.\r\n      \r\n                                               LeBoeuf\r\n                     That was his act.\r\n      \r\n                                              Mattie\r\n                     It was a good one. Are you some kind of law?\r\n      \r\n      LeBoeuf tips back in his chair and draws back his coat to display a star. A smug look.\r\n      \r\n                                             LeBoeuf\r\n                     That's right. I am a Texas Ranger.\r\n      \r\n                                              Mattie\r\n                     That may make you a big noise in that state; in Arkansas you\r\n                     should mind that your Texas trappings and title do not make\r\n                     you an object of fun. Why have you been ineffectually\r\n                     pursuing Chaney?\r\n      \r\n      LeBoeuf's smile stays in place with effort.\r\n      \r\n                                               LeBoeuf\r\n                     He shot and killed a state senator named Bibbs down in\r\n                     Waco, Texas. The Bibbs family have put out a reward.\r\n      \r\n                                           Mattie\r\n                     How came Chaney to shoot a state senator?\r\n      \r\n                                             LeBoeuf\r\n                     My understanding is there was an argument about a dog. Do\r\n                     you know anything about where Chaney has gone?\r\n      \r\n                                                Mattie\r\n                     He is in the Territory, and I hold out little hope for you\r\n                     earning your bounty.\r\n      \r\n                                               LeBoeuf\r\n                     Why is that?\r\n      \r\n                                              Mattie\r\n                     My man will beat you to it. I have hired a deputy marshal,\r\n                                                                                                29\r\n                     the toughest one they have, and he is familiar with the Lucky Ned Pepper\r\n                     gang that they say Chaney has tied up with.\r\n      \r\n                                              LeBoeuf\r\n                     Well, I will throw in with you and your marshal.\r\n      \r\n                                           Mattie\r\n                     No. Marshal Cogburn and I are fine.\r\n      \r\n                                               LeBoeuf\r\n                     It'll be to our mutual advantage. Your marshal I presume\r\n                     knows the Territory; I know Chaney. It is at least a two-man\r\n                     job taking him alive.\r\n      \r\n                                             Mattie\r\n                     When Chaney is taken he is coming back to Fort Smith to\r\n                     hang. I am not having him go to Texas to hang for shooting\r\n                     some senator.\r\n      \r\n                                            LeBoeuf\r\n                     Haw-haw! It is not important where he hangs, is it?\r\n      \r\n                                                  Mattie\r\n                     It is to me. Is it to you?\r\n      \r\n                                              LeBoeuf\r\n                     It means a great deal of money to me. It's been many\r\n                     months' work.\r\n      \r\n                                               Mattie\r\n                     I'm sorry that you are paid piecework not on wages, and that\r\n                     you have been eluded the winter long by a halfwit. Marshal\r\n                     Cogburn and I are fine.\r\n      \r\n      LeBoeuf stands.\r\n      \r\n                                               LeBoeuf\r\n                     You give out very little sugar with your pronouncements.\r\n                     While I sat there watching you I gave some thought to\r\n                     stealing a kiss, though you are very young and sick and\r\n                     unattractive to boot, but now I have a mind to give you five\r\n                     or six good licks with my belt.\r\n      \r\n      Mattie rolls away onto her side.\r\n                                                                                               30\r\n                                               Mattie\r\n                     One would be as unpleasant as the other. If you wet your\r\n                     comb, it might tame that cowlick.\r\n      \r\n      Her eyelids droop.\r\n      \r\n      Spurs jingle and fade away.\r\n      \r\n      Distant voices from the street. Clanging church bell. Very close, the clink of bottle\r\n      against cup.\r\n      \r\n      Mattie looks blearily over. The room is now filled with long shadows.\r\n      \r\n      The landlady has materialized at the side of the bed. She is pouring something from a\r\n      bottle into a ceramic cup.\r\n      \r\n                                              Landlady\r\n                     Try some Dr. Underwood's. You may feel giddy but do not\r\n                     be alarmed as that is only the medicine working.\r\n      \r\n      Mattie obediently rises to an elbow, drinks, then drops back onto the pillow. A clunk:\r\n      \r\n      The landlady has set the bottle down on the nightstand.\r\n      \r\n      Mattie squints at the bottle:\r\n      \r\n                                    Dr. Underwood's Bile Activator\r\n                                 Approved by Physicians and Clergymen\r\n      \r\n      The room's shadows grow longer still and crawl up the bottle.\r\n      \r\n      The voice of the unseen landlady echoes and trails away:\r\n      \r\n                                                Landlady\r\n                     I will charge you ten cents. It probably means a loss for me,\r\n                     but it is hard to figure the exact proportion of the bottle. . .\r\n      \r\n      From outside, the sound of a horse approaching at a gallop.\r\n      \r\n      We cut outside. It is snowing, and night again.\r\n      \r\n      Frank Ross's body is once again in the street before the boarding house.\r\n      \r\n      The bareback horseman enters frame and recedes, rifle tied to his back.\r\n                                                                                                 31\r\n      A saddled horse stands in the middle of the street, pointed at the receding Tom Chaney.\r\n      \r\n      Chaney disappears down the dark street into the falling snow.\r\n      \r\n      Small hands reach up and wrap the saddlehorn on the waiting horse.\r\n      \r\n      Mattie's face appears over the saddle as she tries to pull herself up.\r\n      \r\n      Close on her feet rising from the ground, then pedaling, seeking purchase. There are no\r\n      stirrups.\r\n      \r\n      Close on Mattie again. Sweating, she succeeds in chinning and elbowing herself onto the\r\n      horse's back. The sound of the fleeing horseman has receded almost to nothing.\r\n      \r\n      She gets herself arranged in the saddle. She looks down for the reins.\r\n      \r\n      The reins hang down from the bit.\r\n      \r\n      She lies forward onto the horse's neck, a fistful of mane in one hand, reaching with the\r\n      other. . . reaching down. . . her fingers curl around the reins. . . she pulls.\r\n      \r\n      The horse tosses its head and rears.\r\n      \r\n      Mattie's legs squeeze the horses flanks.\r\n      \r\n      Her fingers tighten on the horses mane but she is slipping, falling. . .\r\n      \r\n      In the boarding house bedroom Mattie's hands clutch at pillow.\r\n      \r\n      It is dark.\r\n      \r\n      A phlegm-hawking sound.\r\n      \r\n      A woman in a nightgown, face obscured by sleeping bonnet, approaches the bed and\r\n      disappears around its far side.\r\n      \r\n      The sound of the old woman climbing into bed and settling.\r\n      \r\n      After a beat, the covers are yanked from Mattie.\r\n      \r\n      After another beat--snoring.\r\n      \r\n      \r\n      POST OFFICE\r\n                                                                                            32\r\n      The door bangs open at the cut and Mattie emerges with an envelope.\r\n      \r\n      It is day.\r\n      \r\n      \r\n      STREET\r\n      \r\n      Mattie walks down the street holding the ripped-open envelope in one hand and some\r\n      unfolded papers in the other, the topmost of which she reads as she walks.\r\n      \r\n      We hear the letter's contents in a gruff male voice-over:\r\n      \r\n                                                Letter\r\n                     Mattie. I wish you would leave these matters entirely to me,\r\n                     or at the very least do me the courtesy of consulting me\r\n                     before entering such agreements. I am not scolding you, but\r\n                     I am saying your headstrong ways will lead you into a tight\r\n                     corner one day. I trust the enclosed document will let you\r\n                     conclude your business and return to Dardanelle. Your\r\n                     mother is in a panic and begging me to fetch you back home.\r\n                     Yours, J. Noble Dagget.\r\n      \r\n      \r\n      PAPERS\r\n      \r\n      Thrust onto a desk.\r\n      \r\n      Wider shows that we are once again in the office of Stonehill, the stock trader. He\r\n      examines the release through bleary eyes, displaying none of his former vinegar.\r\n      \r\n                                               Mattie\r\n                     I was as bad yesterday as you look today. I was forced to\r\n                     share a bed with Grandma Turner.\r\n      \r\n      The trader's eyes are still on the paper:\r\n      \r\n                                                Stonehill\r\n                     I am not acquainted with Grandma Turner. If she is a\r\n                     resident of this city it does not surprise me that she carries\r\n                     disease. I was told this malarial place was to be the Chicago\r\n                     of the Southwest. Well, my little friend, it is not the Chicago\r\n                     of the Southwest. I cannot rightly say what it is, but it has\r\n                     ruined my health as it has my finances.\r\n      \r\n      He drops the paper.\r\n                                                                                        33\r\n      \r\n                    . . . I owe you money.\r\n      \r\n      He works a key in a drawer and takes out money and counts during the following.\r\n      \r\n                                             Mattie\r\n                    You have not traded poorly.\r\n      \r\n                                            Stonehill\r\n                    Certainly not. I am paying you for a horse I do not possess\r\n                    and have bought back a string of useless ponies I cannot sell\r\n                    again.\r\n      \r\n                                              Mattie\r\n                    You are forgetting the gray horse.\r\n      \r\n                                              Stonehill\r\n                    Crowbait.\r\n      \r\n                                              Mattie\r\n                    You are looking at the thing in the wrong light.\r\n      \r\n                                               Stonehill\r\n                    I am looking at it in the light of God's eternal truth.\r\n      \r\n      He hands the money across and Mattie counts to confirm.\r\n      \r\n                                               Mattie\r\n                    Your illness is putting you \"down in the dumps.\" You will\r\n                    soon find a buyer for the ponies.\r\n      \r\n                                              Stonehill\r\n                    I have a tentative offer of ten dollars per head from the\r\n                    Pfitzer Soap Works of Little Rock.\r\n      \r\n                                             Mattie\r\n                    It would be a shame to destroy such spirited horseflesh.\r\n      \r\n                                            Stonehill\r\n                    So it would. I am confident the deal will fall through.\r\n      \r\n                                             Mattie\r\n                    Look here. I need a pony. I will pay ten dollars for one of\r\n                    them.\r\n                                                                                                 34\r\n                                                Stonehill\r\n                     No. That was lot price. No no. Wait a minute. Are we\r\n                     trading again? I just handed you twenty dollars each for\r\n                     those ponies and you now propose to buy one back for ten?\r\n                     Little girl: I will give you ten dollars to refrain from doing\r\n                     any more business here. It would be the most astute deal I\r\n                     have struck in Arkansas.\r\n      \r\n      \r\n      STABLE\r\n      \r\n      We are tracking along a line of stalls toward a small corral holding a black mustang,\r\n      among other ponies.\r\n      \r\n      Mattie is approaching the horse. A black stablehand has been trailing her, humping her\r\n      father's saddle.\r\n      \r\n                                                 Mattie\r\n                     This one is beautiful.\r\n      \r\n      She rubs the muzzle of the black horse.\r\n      \r\n      She takes the saddle from the stablehand and tries to throw it over the horse. She is not tall\r\n      or strong enough.\r\n      \r\n      The stableboy helps, then helps her up.\r\n      \r\n      The horse does not move for a long beat.\r\n      \r\n      The stableboy is laughing.\r\n      \r\n                                            Stableboy\r\n                     He don't know they's a person up there. You too light.\r\n      \r\n      She kicks lightly and the horse abruptly pitches once or twice and then starts prancing.\r\n      \r\n      The stableboy, still laughing, stands in the middle of a circle defined by the prancing horse.\r\n      \r\n                                             Stableboy\r\n                     He thinks he got a horsefly on him.\r\n      \r\n      Mattie leans forward to calm the horse, rubbing the muzzle and shushing him.\r\n      \r\n      She straightens.\r\n                                                                                              35\r\n                                                 Mattie\r\n                     He is very spirited. I will call him \"Little Blackie.\"\r\n      \r\n                                              Stableboy\r\n                     Das a good name.\r\n      \r\n                                               Mattie\r\n                     What does he like for a treat?\r\n      \r\n                                             Stableboy\r\n                     Ma'am, he is a horse, so he likes apples.\r\n      \r\n      She reins the horse around and heads for the door, calling back:\r\n      \r\n                                              Mattie\r\n                     Thank Mr. Stonehill for me.\r\n      \r\n      The receding stableboy is uncomfortable.\r\n      \r\n                                              Stableboy\r\n                     No ma'am. . . I ain't s'posed to utter your name.\r\n      \r\n      \r\n      CANVAS FLAP\r\n      \r\n      Whipped up at the cut.\r\n      \r\n      Peering in is Mattie; holding the makeshift curtain open is an elderly Chinese.\r\n      \r\n      Behind them we can see the shelves of a modest grocery store and in the deep background\r\n      its bright street-facing window.\r\n      \r\n                                               Chinese\r\n                     See. Sleep.\r\n      \r\n      Reverse: a squalid living area crowded with effects. It is dim. There is snoring. Rooster\r\n      Cogburn is in a Chinese rope bed, his weight bowing it almost to the ground.\r\n      \r\n      Mattie steps in.\r\n      \r\n                                                Mattie\r\n                     That is fine. I will wake him.\r\n      \r\n                                               Chinese\r\n                     Won't like.\r\n                                                                                               36\r\n      \r\n      Mattie ignores him, poking at Rooster as the grocer withdraws, letting the canvas drop\r\n      behind him.\r\n      \r\n                                               Mattie\r\n                     Mr. Cogburn, it is I. Mattie Ross, your employer.\r\n      \r\n                                               Rooster\r\n                     Whuh.\r\n      \r\n                                              Mattie\r\n                     How long til you are ready to go?\r\n      \r\n      Rooster opens his eyes, blinks.\r\n      \r\n                                               Rooster\r\n                     Go whar?\r\n      \r\n                                                Mattie\r\n                     Into the Indian Territory. In pursuit of Tom Chaney.\r\n      \r\n                                               Rooster\r\n                     Whah. . .\r\n      \r\n      He focuses on Mattie, swings his legs out, rumbles, and spits on the floor.\r\n      \r\n                     . . . Oh.\r\n      \r\n      He reaches over a pouch of tobacco and begins fumbling with cigarette makings.\r\n      \r\n                     . . . Chaney. You are the bereaved girl with stories of El\r\n                     Dorado. Mr. Lee! Why are you admitting callers!\r\n      \r\n      A voice from the front of the store:\r\n      \r\n                                               Grocer\r\n                     Toad her no good!\r\n      \r\n      Mattie takes out some cash.\r\n      \r\n                                                   Mattie\r\n                     I said fifty dollars to retrieve Chaney. You did not believe\r\n                     me?\r\n      \r\n      Rooster is sobered by the sight of the currency.\r\n                                                                                                  37\r\n      \r\n                                                Rooster\r\n                        Well, I did not know. You are a hard one to figure.\r\n      \r\n                                                Mattie\r\n                        How long for you to make ready to depart?\r\n      \r\n      Mattie takes the cigarette fixings at which Rooster is fumbling and works on a cigarette.\r\n      \r\n                                                 Rooster\r\n                        Well now wait now, sis. I remember your offer but do not\r\n                        remember agreeing to it. If I'm going up against Ned\r\n                        Pepper I will need a hundred dollars. I can tell you that\r\n                        much. Hundred dollars! I am not pursuing his gang through\r\n                        Arkansas, where there is law, and the criminal is out of his\r\n                        element. They are in the Territory, in their element, where\r\n                        there is no law and the marshal stands alone.\r\n      \r\n      He spits again.\r\n      \r\n                        . . . Hundred dollars is the right amount. I will take those\r\n                        fifty dollars in advance. There will be expenses.\r\n      \r\n                                                  Mattie\r\n                        You are trying to take advantage of me.\r\n      \r\n                                                 Rooster\r\n                        I am giving you the children's rate. I am not a sharper, I am\r\n                        an old man sleeping in a rope bed in a room behind a\r\n                        Chinese grocery. I should burn this damn thing. It is no\r\n                        good for my back, sister. I have nothing.\r\n      \r\n      She hands him the finished cigarette.\r\n      \r\n                                                 Mattie\r\n                        You want to be kept in whiskey.\r\n      \r\n      Rooster is patting at his chest.\r\n      \r\n                                                   Rooster\r\n                        I don't have to buy that, I confiscate it. I am an officer of the\r\n                        court.\r\n      \r\n      She lights his cigarette.\r\n                                                                                     38\r\n                    . . . Thank you. Hundred dollars. That is the rate.\r\n      \r\n                                              Mattie\r\n                    I shall not niggle. Can we depart this afternoon?\r\n      \r\n                                               Rooster\r\n                    We?!\r\n      \r\n      The word detonates a fit of coughing.\r\n      \r\n                    . . . You are not going. That is no part of it.\r\n      \r\n                                              Mattie\r\n                    You misjudge me if you think I am silly enough to give you\r\n                    fifty dollars and simply watch you ride off.\r\n      \r\n                                           Rooster\r\n                    I am a bonded U.S. marshal!\r\n      \r\n                                               Mattie\r\n                    That weighs but little with me. I will see the thing done.\r\n      \r\n                                            Rooster\r\n                    You never said anything about this. I cannot go up against\r\n                    Ned Pepper and a band of hard men and look after a baby at\r\n                    the same time.\r\n      \r\n                                               Mattie\r\n                    I am not a baby.\r\n      \r\n                                               Rooster\r\n                    I will not be stopping at boarding houses with warm beds\r\n                    and plates of hot grub on the table. It will be traveling fast\r\n                    and eating light. What little sleeping is done will take place\r\n                    on the ground.\r\n      \r\n                                               Mattie\r\n                    I have slept out at night. Papa took me and Little Frank coon\r\n                    hunting last summer on the Petit Jean. We were in the\r\n                    woods all night. We sat around a big fire and Yarnell told\r\n                    ghost stories. We had a good time.\r\n      \r\n                                              Rooster\r\n                    Coon hunting! This ain't no coon hunt, it don't come within\r\n                    forty miles of being a coon hunt!\r\n                                                                                                39\r\n      \r\n                                                Mattie\r\n                     It is the same idea as a coon hunt. You are just trying to\r\n                     make your work sound harder than it is. Here is the money.\r\n                     I aim to get Tom Chaney and if you are not game I will find\r\n                     somebody who is game. All I have heard out of you so far is\r\n                     talk. I know you can drink whiskey and snore and spit and\r\n                     wallow in filth and bemoan your station. The rest has been\r\n                     braggadocio. They told me you had grit and that is why I\r\n                     came to you. I am not paying for talk. I can get all the talk I\r\n                     need and more at the Monarch Boarding House.\r\n      \r\n      Rooster stares, nonplussed.\r\n      \r\n      He drops back into the rope bed, which sets it swaying. As he stares up at the ceiling:\r\n      \r\n                                              Rooster\r\n                     Leave the money. Meet me here tomorrow morning at seven\r\n                     o'clock and we will begin our coon hunt.\r\n      \r\n      \r\n      GRANDMA TURNER'S ROOM\r\n      \r\n      Mattie makes early-morning preparations to leave as Grandma Turner snores. She unrolls\r\n      her father's traps and takes out a big-brimmed fisherman's hat and puts it on: too big. She\r\n      lines it with newspaper, experimenting with the amount until it fits. She puts on his coat,\r\n      gives the sleeves a big cuff. She examines the Colt's dragoon. She drops apples into a\r\n      sack.\r\n      \r\n      She finishes by folding a letter she has written and putting it into an envelope.\r\n      Throughout, we have been hearing its contents in voice-over:\r\n      \r\n                                                 Mattie\r\n                     Dearest Mother. I am about to embark on a great adventure.\r\n                     Or dare I call it a mission, for shall any of us rest easy ere\r\n                     Papa's death is avenged? My investigations in Fort Smith\r\n                     lead me to believe that Tom Chaney can be found and\r\n                     brought to justice, and I have made arrangements to that end.\r\n                     I will return to you once I have seen them properly carried\r\n                     through. . .\r\n      \r\n      \r\n      EXTERIOR BOARDING HOUSE\r\n      \r\n      Mattie is cinching her gear onto Little Blackie. She mounts and rides off as the letter ends:\r\n                                                                                                40\r\n      \r\n                                               Mattie\r\n                     But do not worry on my account. Though I walk through the\r\n                     valley of the shadow of death, I shall fear no evil. The\r\n                     author of all things watches over me. And I have a fine\r\n                     horse. Kiss Little Frankie for me and pinch Violet's cheek.\r\n                     I am off for the Choctaw Nation.\r\n      \r\n      \r\n      INTERIOR GROCERY\r\n      \r\n      Tracking toward Rooster's rope bed. A hat is pulled down over the face of the figure\r\n      reclining in it. Smoke sifts up from somewhere.\r\n      \r\n      Mattie draws up to the figure with mounting concern. She pulls the hat off. It is the\r\n      elderly Chinese grocer.\r\n      \r\n                                            Mattie\r\n                     Where is Marshal Cogburn!\r\n      \r\n      The grocer reaches a pipe and pulls on it. His manner is dreamy.\r\n      \r\n                                               Grocer\r\n                     Went away. . .\r\n      \r\n                                               Mattie\r\n                     Away! Where?\r\n      \r\n      The grocer pulls an envelope from underneath his robe and hands it to Mattie. He closes\r\n      his eyes and drifts away.\r\n      \r\n      Mattie pulls a scrap of paper from the envelope and reads:\r\n      \r\n                                                 Mattie\r\n                     Here inside is a train ticket for your return home. Use it. By\r\n                     the time you read this I will be across the river in the Indian\r\n                     nation. Pursuit would be futile. I will return with your man\r\n                     Chaney. Leave me to my work. Reuben Cogburn.\r\n      \r\n      Mattie's jaw tightens. She abruptly crumples the paper.\r\n      \r\n      \r\n      RIVER\r\n      \r\n      Mattie gallops down an embankment to a river of some width. At the near-side ferry\r\n                                                                                                  41\r\n      station a raft enclosed by railing waits, its guide rope strung across the river. A pilot\r\n      idles on the near shore.\r\n      \r\n      On the far shore two small figures, mounted, ascend the opposite bank. Mattie draws up in\r\n      front of the ferryman at the edge of the river.\r\n      \r\n                                                 Mattie\r\n                     Is that Marshal Cogburn?\r\n      \r\n                                               Ferryman\r\n                     That is the man.\r\n      \r\n                                                 Mattie\r\n                     Who's he with?\r\n      \r\n                                               Ferryman\r\n                     I do not know.\r\n      \r\n                                                 Mattie\r\n                     Take me across.\r\n      \r\n      He reaches for the reins of her horse.\r\n      \r\n                                              Ferryman\r\n                     So you're the runaway. Marshal told me you'd show up.\r\n                     I'm to present you to the sheriff.\r\n      \r\n                                               Mattie\r\n                     That is a story. Let go my horse. I have business across the\r\n                     river.\r\n      \r\n      The ferryman is leading Little Blackie back up the hill toward the town. Mattie cranes\r\n      around to look at the two small figures across the river. They have twisted in their saddles\r\n      to look back.\r\n      \r\n                     . . . Look Slim, if you don't turn around and take me across\r\n                     you may find yourself in court where you don't want to be. I\r\n                     have a good lawyer.\r\n      \r\n                                               Ferryman\r\n                     Name ain't Slim.\r\n      \r\n      She looks at the dull man's unresponsive back. She twists to look across the river.\r\n      \r\n      The two mounted figures are breaking their look back and resuming their climb up the\r\n                                                                                                   42\r\n      bank.\r\n      \r\n      Mattie draws an apple from the bag slung round the saddlehorn and pegs it, hard as she\r\n      can, at the ferryman.\r\n      \r\n      It hits him square in the back of the head. He reacts, reaching to his head and dropping the\r\n      reins.\r\n      \r\n      Mattie has already leaned forward for the reins and sweeps them back. She saws Little\r\n      Blackie around and sends him galloping for the river.\r\n      \r\n                                                 Mattie\r\n                     Run, Little Blackie!\r\n      \r\n                                               Ferryman\r\n                     Hey!\r\n      \r\n      She urges the horse, at the gallop, into the river.\r\n      \r\n      The splashing and shouts have again drawn the attention of the two men across the river.\r\n      \r\n      As the horse goes further into the river its up-and-down gait slows, the water offering\r\n      resistance.\r\n      \r\n      The ferryman has run down to the bank. He stoops for a rock and throws it. It misses by a\r\n      mile.\r\n      \r\n      Little Blackie leaves riverbottom and starts swimming.\r\n      \r\n      The two men across the river, having twisted to look, now rein their horses round to face\r\n      the action. But they do not advance. They rest forearms on pommels and watch.\r\n      \r\n      Little Blackie is being carried downstream as he swims against a swift current.\r\n      \r\n                                                 Mattie\r\n                     Good, Little Blackie!\r\n      \r\n      Little Blackie's head dips as he finds his feet again. He slogs laboriously to what is now\r\n      the nearer shore.\r\n      \r\n      The two men up the bank impassively watch.\r\n      \r\n      The horse and Mattie emerge fully from the river, dripping.\r\n      \r\n      Mattie taps heels against Little Blackie's flanks and walks him slowly up the bank. She\r\n                                                                                                  43\r\n      stops many yards short of the two men--Rooster and LeBoeuf.\r\n      \r\n      A silent standoff as Little Blackie breathes heavily. The two expressionless men still have\r\n      not stirred.\r\n      \r\n      At length:\r\n      \r\n                                                 Rooster\r\n                      That's quite a horse.\r\n      \r\n      A long pause.\r\n      \r\n                      . . . I will give you ten dollars for him.\r\n      \r\n                                              Mattie\r\n                      From the money you stole from me?\r\n      \r\n                                               Rooster\r\n                      That was not stolen. I'm out for your man.\r\n      \r\n                                              Mattie\r\n                      I was to accompany you. If I do not, there is no agreement\r\n                      and my money was stolen.\r\n      \r\n      Rooster licks his lips, thinking.\r\n      \r\n                                               LeBoeuf\r\n                      Marshal, put this child back on the ferry. We have a long\r\n                      road, and time is a-wasting.\r\n      \r\n                                                    Mattie\r\n                      If I go back, it is to the office of the U.S. marshals to report\r\n                      the theft of my money. And futile, Marshal Cogburn--\r\n                      \"Pursuit would be futile\"?--is not spelt f-u-d-e-l.\r\n      \r\n      A heavy silence as Cogburn stares at her.\r\n      \r\n      LeBoeuf looks between the two, waiting for Rooster to take action. Gathering that he will\r\n      not, LeBoeuf slides off his horse.\r\n      \r\n      Mattie watches as he walks to Little Blackie, holding up a gentling hand for the horse to\r\n      sniff at and nuzzle.\r\n      \r\n      He abruptly swipes the reins with one hand and with the other grabs Mattie's ankle. He\r\n      pushes momentarily to unstirrup the foot and then pulls hard, tumbling Mattie to the\r\n                                                                                                   44\r\n      ground.\r\n      \r\n                                                  LeBoeuf\r\n                     Little sister, it is time for your spanking.\r\n      \r\n      He begins to spank her.\r\n      \r\n                                                 Mattie\r\n                     Help me, Marshal!\r\n      \r\n      Rooster sits impassively on his horse.\r\n      \r\n                                               LeBoeuf\r\n                                           (still spanking)\r\n                     Now you do as the grown-ups say! Or I will get myself a\r\n                     birch switch and stripe your leg!\r\n      \r\n      Mattie is struggling and in spite of herself starts to weep. LeBoeuf drags her through the\r\n      dirt to a mesquite bush and snaps off a switch.\r\n      \r\n                                            LeBoeuf\r\n                     Now we will see what tune you sing!\r\n      \r\n      Mattie, wet and filthy, tries vainly to swat back. Rooster still watches without expression\r\n      as LeBoeuf whips the girl.\r\n      \r\n                                               Mattie\r\n                     Are you going to let him do this, Marshal?\r\n      \r\n      Finally, quietly:\r\n      \r\n                                                Rooster\r\n                     No, I don't believe I will. Put your switch away, LeBoeuf.\r\n                     She has got the best of us.\r\n      \r\n      LeBoeuf looks back, for a moment too surprised to speak. He then regains his resolve:\r\n      \r\n                                              LeBoeuf\r\n                     She has not got the best of me!\r\n      \r\n      He returns to the beating.\r\n      \r\n                                            Rooster\r\n                                            (evenly)\r\n                     Did you not hear me? That will do, I said.\r\n                                                                                                45\r\n      \r\n                                                LeBoeuf\r\n                     I aim to finish what I started.\r\n      \r\n                                               Rooster\r\n                     That will be the biggest mistake you ever made, you Texas\r\n                     brush-popper.\r\n      \r\n      The sound of a gun being cocked.\r\n      \r\n      LeBoeuf leaves off the beating to stare at Rooster--whose gun is drawn, cocked, and\r\n      pointed at him.\r\n      \r\n      LeBoeuf flings the switch aside and stalks to his horse. He mutters, but loud enough to be\r\n      heard:\r\n      \r\n                                              LeBoeuf\r\n                     Hoorawed by a little girl.\r\n      \r\n      \r\n      CAMPFIRE\r\n      \r\n      Mattie sits looking into the fire, hands clasped around her knees.\r\n      \r\n      LeBoeuf sits feet to the fire, smoking a pipe that, with his boyish face, makes him look as\r\n      if he is playing at professor. He gazes into the fire, musing as he pulls at the pipe.\r\n      \r\n                                                LeBoeuf\r\n                     I am not accustomed to so large a fire. In Texas, we will\r\n                     make do with a fire of little more than twigs or buffalo chips\r\n                     to heat the night's ration of beans.\r\n      \r\n      Rooster enters the circle of light with an armload of wood.\r\n      \r\n                     . . . And, it is Ranger policy never to make your camp in the\r\n                     same place as your cookfire. Very imprudent to make your\r\n                     presence known in unsettled country.\r\n      \r\n      Rooster gazes at LeBoeuf for a beat, then dumps the wood onto the fire.\r\n      \r\n      He leaves the circle of light.\r\n      \r\n      LeBoeuf addresses the darkness that Rooster has disappeared into:\r\n      \r\n                     . . . How do you know that Bagby will have intelligence?\r\n                                                                                                    46\r\n      \r\n                                               Rooster\r\n                     He has a store.\r\n      \r\n      He reenters with a length of rope, and a robe which he unrolls onto the ground.\r\n      \r\n                                            LeBoeuf\r\n                     A store. That makes him an authority on movements in the\r\n                     Territory?\r\n      \r\n      Rooster plays out one end of the rope to just touch the ground, then starts playing out the\r\n      rest as he paces.\r\n      \r\n                                              Rooster\r\n                     We have entered a wild place. Anyone coming in, wanting\r\n                     any kind of supply, cannot pick and choose his portal.\r\n      \r\n      He has finished making a loop around his sleeping robe. Seeing this, LeBoeuf laughs.\r\n      \r\n                                               LeBoeuf\r\n                     That is a piece of foolishness. All the snakes are asleep this\r\n                     time of year.\r\n      \r\n      As he leaves the circle of light:\r\n      \r\n                                            Rooster\r\n                     They have been known to wake up.\r\n      \r\n                                               Mattie\r\n                     Let me have a rope too.\r\n      \r\n                                            Rooster\r\n                     A snake would not bother you.\r\n      \r\n      He reenters with a bottle and settles down on his robe.\r\n      \r\n                     . . . You are too little and bony. Before you sleep you should\r\n                     fetch water for the morning and put it by the fire. The\r\n                     creek'll ice over tonight.\r\n      \r\n                                               Mattie\r\n                     I am not going down there again. If you want any more\r\n                     water you can fetch it yourself.\r\n                                                                                         47\r\n                                            Rooster\r\n                     Everyone in my party must do his job.\r\n      \r\n                                              LeBoeuf\r\n                     You are lucky to be traveling in a place where a spring is so\r\n                     handy. In my country you can ride for days and see no\r\n                     ground water. I have lapped filthy water from a hoofprint\r\n                     and was glad to have it.\r\n      \r\n                                               Rooster\r\n                     If I ever meet one of you Texas waddies that says he never\r\n                     drank water from a horse track I think I will shake his hand\r\n                     and give him a Daniel Webster cigar.\r\n      \r\n                                               LeBoeuf\r\n                     You don't believe it?\r\n      \r\n                                                 Rooster\r\n                     I believed it the first twenty-five times I heard it. Maybe it is\r\n                     true. Maybe lapping water off the ground is Ranger policy.\r\n      \r\n                                                LeBoeuf\r\n                     You are getting ready to show your ignorance now, Cogburn.\r\n                     I don't mind a little personal chaffing but I won't hear\r\n                     anything against the Ranger troop from a man like you.\r\n      \r\n                                            Rooster\r\n                     How long have you boys been mounted on sheep down\r\n                     there?\r\n      \r\n      LeBoeuf leaps angrily to his feet.\r\n      \r\n                                              LeBoeuf\r\n                     My shaggy horse will be galloping when that big American\r\n                     stud of yours is winded and collapsed. Now make another\r\n                     joke about it. You are only trying to put on a show for this\r\n                     girl Mattie with what you must think is a keen tongue.\r\n      \r\n                                              Rooster\r\n                     This is like women talking.\r\n      \r\n                                             LeBoeuf\r\n                     Yes, that is the way! Make me out foolish in this girl's eyes.\r\n                                                                                         48\r\n                                                Rooster\r\n                      I think she has got you pretty well figured.\r\n      \r\n      Silence. Crackling fire.\r\n      \r\n                                                Mattie\r\n                      Would you two like to hear the story of \"The Midnight\r\n                      Caller\"? One of you will have to be \"The Caller.\" I will tell\r\n                      you what to say. I will do all the other parts myself.\r\n      \r\n      LeBoeuf continues to glare at Rooster, breathing heavily.\r\n      \r\n      Rooster, with a loud flap, whips the robe over himself.\r\n      \r\n      \r\n      DAWN\r\n      \r\n      We are close on Mattie's upturned face. Snowflakes are drifting down onto it and\r\n      melting. Mattie's eyes blink open.\r\n      \r\n      Rooster is already at his horse, packing it. LeBoeuf is not in evidence.\r\n      \r\n      Mattie rises.\r\n      \r\n                                                Mattie\r\n                      Good morning, Marshal.\r\n      \r\n                                               Rooster\r\n                                          (eyes on his work)\r\n                      Morning.\r\n      \r\n                                                Mattie\r\n                      Where is Mr. LeBoeuf?\r\n      \r\n      A toss of his head:\r\n      \r\n                                              Rooster\r\n                      Down the hill. Performing his necessaries.\r\n      \r\n                                                Mattie\r\n                      Marshal Cogburn, I welcome the chance for a private parley.\r\n                      I gather that you and Mr. LeBoeuf have come to some sort of\r\n                      agreement. As your employer I believe I have a right to\r\n                      know the particulars.\r\n                                                                                           49\r\n                                               Rooster\r\n                     The particulars is that we bring Chaney in to the magistrate\r\n                     in San Saba Texas where they have a considerable reward on\r\n                     offer. Which we split.\r\n      \r\n                                              Mattie\r\n                     I did not want him brought to Texas, to have Texas\r\n                     punishment administered for a Texas crime. That was not\r\n                     our agreement.\r\n      \r\n      Rooster gives a vicious tug on the cinchrope.\r\n      \r\n                                             Rooster\r\n                     What you want is to have him caught and punished.\r\n      \r\n                                              Mattie\r\n                     I want him to know he is being punished for killing my\r\n                     father.\r\n      \r\n      Rooster turns to her.\r\n      \r\n                                                Rooster\r\n                     You can let him know that. You can tell him to his face.\r\n                     You can spit on him and make him eat sand out of the road.\r\n                     I will hold him down. If you want I will flay the flesh off the\r\n                     soles of his feet and find you an Indian pepper to rub into the\r\n                     wound. Isn't that a hundred dollars' value?\r\n      \r\n                                              Mattie\r\n                     It is not. When I have bought and paid for something I will\r\n                     have my way. Why do you think I am paying you if not to\r\n                     have my way?\r\n      \r\n                                                 Rooster\r\n                     It is time for you to learn you cannot have your way in every\r\n                     little particular. Other people have their interests.\r\n      \r\n      We hear spurs jingling.\r\n      \r\n                     . . . I am a free agent. If you find I fail to satisfy your terms I\r\n                     will return your money at the end of this expedition.\r\n      \r\n                                                 Mattie\r\n                     Little Blackie and I are riding back to the U.S. marshals'\r\n                     office. This is fraud.\r\n                                                                                  50\r\n      \r\n                                              Rooster\r\n                   God damn it!\r\n      \r\n      LeBoeuf has appeared.\r\n      \r\n                                             LeBoeuf\r\n                   What's going on?\r\n      \r\n                                            Rooster\r\n                                             (testy)\r\n                   This is a business conversation.\r\n      \r\n                                              LeBoeuf\r\n                   Is that what you call it. It sounds to me like you are still\r\n                   being hoorawed by a little girl.\r\n      \r\n                                              Rooster\r\n                   Did you say hooraw!\r\n      \r\n                                             LeBoeuf\r\n                   That was the word.\r\n      \r\n                                              Rooster\r\n                   I will show you hooraw!\r\n      \r\n                                             Mattie\r\n                   There is no hoorawing in it. My agreement with the Marshal\r\n                   antedates yours. It has the force of law.\r\n      \r\n                                            LeBoeuf\r\n                                            (amused)\r\n                   The force of law! This man is a notorious thumper! He rode\r\n                   by the light of the moon with Quantrill and Bloody Bill\r\n                   Anderson!\r\n      \r\n                                           Rooster\r\n                   Those men was patriots, Texas trash!\r\n      \r\n                                        LeBoeuf\r\n                   They murdered women and children in Lawrence, Kansas.\r\n      \r\n                                              Rooster\r\n                   I have heard that too. It is a damned lie! What army was\r\n                   you in, mister?\r\n                                                                                            51\r\n      \r\n                                               LeBoeuf\r\n                     I was at Shreveport first with Kirby-Smith--\r\n      \r\n                                              Rooster\r\n                     What side was you on?\r\n      \r\n                                             LeBoeuf\r\n                     I was in the army of Northern Virginia, Cogburn, and I don't\r\n                     have to hang my head when I say it!\r\n      \r\n                                              Rooster\r\n                     If you had served with Captain Quantrill--\r\n      \r\n                                             LeBoeuf\r\n                     Captain Quantrill indeed!\r\n      \r\n                                               Rooster\r\n                     You had best let this go, LeBoeuf!\r\n      \r\n                                              LeBoeuf\r\n                     Captain of what!\r\n      \r\n                                             Rooster\r\n                     Good, then! There are not sufficient dollars in the state of\r\n                     Texas to make it worth my while to listen to your opinions,\r\n                     day and night. Our agreement is nullified--it's each man for\r\n                     himself!\r\n      \r\n      LeBoeuf is already mounting his shaggy horse.\r\n      \r\n                                              LeBoeuf\r\n                     That suits me!\r\n      \r\n      He saws the horse around.\r\n      \r\n                     . . . Congratulations, Cogburn. You have graduated from\r\n                     marauder to wetnurse. Adios!\r\n      \r\n      LeBoeuf gallops off with the thunder of hoofs and the jingle of spurs, and Rooster,\r\n      seething, turns back to his work.\r\n      \r\n      As the hoofbeats recede, Mattie sounds a note of regret:\r\n                                                                                                    52\r\n                                            Mattie\r\n                     We don't need him, do we Marshal?\r\n      \r\n                                              Rooster\r\n                                            (muttering)\r\n                     We'll miss his Sharp's carbine. It's apt to get lively out\r\n                     here.\r\n      \r\n      \r\n      EXTERIOR BAGBY'S STORE\r\n      \r\n      A mule is pulling back on a cotton rope round his neck that is tied off to the porch of the\r\n      ramshackle store. The beast is strangling as the rope is too tight, and he is being poked\r\n      with sticks by two motley-dressed Indian boys up on the porch.\r\n      \r\n      Rooster enters and cuts the rope. The mule brays and canters off, shaking its head, rope\r\n      dangling.\r\n      \r\n                                               Indian Youth\r\n                     Hey.\r\n      \r\n      Rooster is already mounting the steps to the porch.\r\n      \r\n                                                 Rooster\r\n                     Call that sport, do ya?\r\n      \r\n      He kicks the first youth hard in the ass, sending him sprawling off the porch into the dirt.\r\n      The second backs against the railing and Rooster shoves him in the chest so that he flips\r\n      backward to also land in the dirt.\r\n      \r\n                                                Rooster\r\n                     Stay here sister. I will see Bagby.\r\n      \r\n      Mattie, astride Little Blackie, holds the reins of Cogburn's horse. As he disappears inside\r\n      the two youths climb back onto the porch. They sit at the lip, feet dangling, and stare\r\n      sullenly at Mattie. She stares back.\r\n      \r\n      \r\n      MINUTES LATER\r\n      \r\n      The youths have not moved. The door bangs open and Rooster emerges.\r\n      \r\n                                                  Mattie\r\n                     Has Chaney been here?\r\n                                                                                                    53\r\n                                               Rooster\r\n                     No.\r\n      \r\n      Crossing back he kicks one of the boys off the porch into the dirt again. The other youth\r\n      scampers out of footreach. Rooster starts down the stairs.\r\n      \r\n                                            Rooster\r\n                     But Coke Hayes was, two days ago. Coke runs with Lucky\r\n                     Ned. He bought supplies, with this.\r\n      \r\n      With a ching he flips a coin to Mattie. She inspects it: gold, square, with a +-shaped cut-\r\n      out in the middle.\r\n      \r\n                                               Mattie\r\n                     This is Papa's gold piece! Tom Chaney, here we come!\r\n      \r\n                                                Rooster\r\n                     It is not the world's only California gold piece.\r\n      \r\n                                                Mattie\r\n                     They are rare, here.\r\n      \r\n                                                Rooster\r\n                     They are rare. But if it is Chaney's, it could just as easily\r\n                     mean that Lucky Ned and his gang fell upon him, as that he\r\n                     fell in with them. Chaney could be a corpse. These are a\r\n                     rough lot.\r\n      \r\n                                               Mattie\r\n                     That would be a bitter disappointment, Marshal. What do\r\n                     we do?\r\n      \r\n      Rooster mounts up.\r\n      \r\n                                              Rooster\r\n                     We pursue. Ned is unfinished business for the marshals\r\n                     anyhow, and when we have him we will also have Chaney\r\n                     --or we can learn the whereabouts of his body. Bagby\r\n                     doesn't know which way they went, but now we know they\r\n                     come through here, they couldn't be going but one of two\r\n                     ways: north toward the Winding Stair Mountains, or pushing\r\n                     on further west. I suspect north. There is more to rob.\r\n      \r\n      The youth who was kicked into the dirt is dusting himself off. He has been listening\r\n      without interest.\r\n                                                                                     54\r\n      \r\n                                               Youth\r\n                     Mr. Ferrington will want to know who cut loose his mule.\r\n      \r\n      Rooster reins his horse around to go.\r\n      \r\n                                             Rooster\r\n                     Tell him it was Mr. James, a bank examiner from Clay\r\n                     County, Missouri.\r\n      \r\n                                               Youth\r\n                     The James boys is said to be slight, Frank and Jesse both.\r\n      \r\n                                               Rooster\r\n                     One of them has grown fat. The mule will not range far.\r\n                     You boys mend your ways or I will return some dark night\r\n                     and cut off one of your heads--I do not say which--and\r\n                     leave it on the stomach of the other as a warning.\r\n      \r\n      \r\n      RIDING\r\n      \r\n      Rooster and Mattie ride abreast along a barely defined road.\r\n      \r\n                                                  Rooster\r\n                     Potter and I served with him at Elkhorn Tavern. Even\r\n                     latterly our activities was by and large martial. We did\r\n                     though, one time, run across a Yankee paymaster and relieve\r\n                     him of four thousand dollars in gold coin. Squealed like it\r\n                     was his own money. Well, since hostilities was officially\r\n                     ended it was technically criminal so Potter rode down to\r\n                     Arkansas and I went to Cairo Illinois with my share, started\r\n                     calling myself Burroughs and opened an eating place called\r\n                     The Green Frog. I married a grass widow but my drinking\r\n                     picked up and my wife did not like the company of my river\r\n                     friends. She decided to go back to her first husband, a clerk\r\n                     in a hardware store. She said, \"Goodbye, Reuben, a love for\r\n                     decency does not abide in you.\" I told her, \"Goodbye, Nola,\r\n                     I hope that little nail-selling bastard will make you happy\r\n                     this time.\" She took my boy with her too. He never did like\r\n                     me anyhow. I guess I did speak awful rough to him but I did\r\n                     not mean nothing by it. You would not want to see a\r\n                     clumsier child than Horace. I bet he broke forty cups. . .\r\n      \r\n      He frowns and draws up, looking at something. Mattie follows his look.\r\n                                                                                                 55\r\n      \r\n      A man is hanging in a tree--very high, perhaps thirty feet off the ground. The body slowly\r\n      twists. The head seems unnaturally large.\r\n      \r\n                                               Rooster\r\n                     Hey!\r\n      \r\n      At Rooster's shout something separates from the head: we have been looking at not just the\r\n      corpse's silhouette but that of a large carrion-eating bird as well, perched on the corpse's\r\n      shoulder and feeding at the corpse's face. The bird flaps clumsily off.\r\n      \r\n      Rooster gazes at the strung-up body.\r\n      \r\n                                               Rooster\r\n                     Is it Chaney?\r\n      \r\n                                               Mattie\r\n                     I would not recognize the soles of his feet.\r\n      \r\n      Rooster gets off his horse, pulls a knife from his gear, and ambles to the tree. Mattie\r\n      follows.\r\n      \r\n      When she arrives Rooster has started sawing at the rope that ties the body off, wrapped\r\n      around a chest-high branch stump. Mattie looks up.\r\n      \r\n      She is looking mostly at soles of feet as the foreshortened body twists slowly, high above.\r\n      \r\n                                               Rooster\r\n                     Step back now.\r\n      \r\n      She does. Rooster steps back as well as the almost-cut-through rope starts to unravel by\r\n      itself, crazily twisting under the pressure and gently spinning the body above.\r\n      \r\n      The rope snaps. It yanks violently upward, slapping branches.\r\n      \r\n      The body drops--perhaps four feet--and jerks to a stop, jacknifing and dancing.\r\n      \r\n                                               Rooster\r\n                     God damn it.\r\n      \r\n      They both gaze up at the body.\r\n      \r\n                                               Rooster\r\n                     Snagged. Well you are going to have to clamber on up with\r\n                     this knife. I am too old and too fat.\r\n                                                                                                  56\r\n      \r\n      \r\n      UP IN THE TREE\r\n      \r\n      Mattie is well up.\r\n      \r\n      We hear Rooster's voice from below:\r\n      \r\n                                                 Rooster\r\n                     It had one billiard table, served ladies and men both but\r\n                     mostly men. I tried to run it myself a while but I couldn't\r\n                     keep good help and I never did learn how to buy meat. I was\r\n                     like a man fighting bees. Finally I give up and solt it and\r\n                     went out to see the country.\r\n      \r\n      Mattie pauses, looking down.\r\n      \r\n      We are over her. Rooster is foreshortened, a long way down, looking up, smoking a\r\n      cigarette. He reacts to her look down:\r\n      \r\n                                               Rooster\r\n                     You are doing well.\r\n      \r\n      She looks up, down again, and then proceeds. Rooster continues as well:\r\n      \r\n                     . . . That was when I went out to the staked plains of Texas\r\n                     and shot buffalo with Vernon Shaftoe and a Flathead Indian\r\n                     called Olly.\r\n      \r\n      Mattie stretches onto tiptoes, reaches, just gets fingers around a branch. She secures it\r\n      enough with the one hand to dare to reach with the other. She hauls herself up.\r\n      \r\n                     . . . The Mormons had run Shaftoe out of Great Salt Lake\r\n                     City but don't ask me what it was for. Call it a misunder-\r\n                     standing and let it go at that. There is no use in you asking\r\n                     me questions about it, for I will not answer them.\r\n      \r\n      Mattie looks out, at waist-height to the corpse, which twists maybe eight feet away over\r\n      the void. Rooster notes her look:\r\n      \r\n                     . . . Is it our man?\r\n      \r\n      The face is half-eaten and eyeless.\r\n                                                                                             57\r\n                                                Mattie\r\n                     I believe not.\r\n      \r\n      She moves to start back down, but Rooster calls:\r\n      \r\n                                               Rooster\r\n                     No! Cut him down!\r\n      \r\n                                                Mattie\r\n                     Why?\r\n      \r\n                                               Rooster\r\n                     I might know him.\r\n      \r\n      She climbs one more branch to arrive at the hanging branch. She shimmies out onto it and\r\n      pulls the knife from Rooster's belt now around her waist.\r\n      \r\n                     . . . You see, Olly and me both taken a solemn oath to keep\r\n                     silent. Well sir, the big shaggies is about all gone. It is a\r\n                     damned shame.\r\n      \r\n      Mattie looks down, over the shoulder of the close-by foreshortened corpse to the far\r\n      foreshortened Rooster.\r\n      \r\n                     . . . I would give three dollars right now for a pickled buffalo\r\n                     tongue.\r\n      \r\n      She calls out as she starts sawing:\r\n      \r\n                                             Mattie\r\n                     Why did they hang him so high?\r\n      \r\n                                              Rooster\r\n                     I don't know. Possibly in the belief it would make him more\r\n                     dead.\r\n      \r\n      The sawing continues.\r\n      \r\n      Rooster takes one step back.\r\n      \r\n      The rope snaps. At once:\r\n      \r\n      The body drops.\r\n      \r\n      The branch, unburdened, bucks with Mattie atop it.\r\n                                                                                                  58\r\n      \r\n      She gasps, hugging at the branch, getting swung halfway around it but then righting\r\n      herself.\r\n      \r\n      The body hits the ground with a smack.\r\n      \r\n      Mattie looks.\r\n      \r\n      The body is spread out on the ground below, many bones now broken, its posture absurd.\r\n      \r\n      Rooster steps forward. He toes the upper body to get a view of the face. Barely audible:\r\n      \r\n                                                Rooster\r\n                      I do not know this man.\r\n      \r\n      He reacts to something, looking up the road in the direction of their heading.\r\n      \r\n      Mattie looks out. Partly obscured by intervening foliage, an oncoming rider. His pace is\r\n      unhurried.\r\n      \r\n      Down on the ground Rooster turns to face the rider--an Indian with a long-bore rifle\r\n      balanced sideways across the pommel of his saddle. He wears a tattered Union Army\r\n      jacket, crossed bandoliers of rifle shells and a black homburg hat with a feather in its brim.\r\n      \r\n      Rooster drops his hand to his gun as the rider approaches.\r\n      \r\n      Mattie looks down at the foreshortened rider pulling up under the tree. She hears a\r\n      greeting and a mostly inaudible exchange.\r\n      \r\n      After some back-and-forth the Indian dismounts. The men stoop at either end of the\r\n      corpse. Rooster grabs wrists, the Indian, ankles. They lift.\r\n      \r\n      Mattie frowns. She starts to move.\r\n      \r\n      \r\n      A MINUTE LATER\r\n      \r\n      Mattie finishes climbing down.\r\n      \r\n      Rooster is just returning from the road to their two horses by the tree. The Indian, with the\r\n      corpse slung over the rump of his horse, is resuming his trip in the direction from which\r\n      Rooster and Mattie came.\r\n      \r\n                                            Mattie\r\n                      He knew the hanged man?\r\n                                                                                     59\r\n      \r\n      Rooster mounts.\r\n      \r\n                                               Rooster\r\n                     He did not. But it is a dead body, possibly worth something\r\n                     in trade.\r\n      \r\n      He looks up at the sky as snowflakes start to sift down.\r\n      \r\n      \r\n      RIDING\r\n      \r\n      It is snowing lightly. Rooster and Mattie are clomping through a stream.\r\n      \r\n                                               Rooster\r\n                     She had taken a notion she wanted me to be a lawyer.\r\n                     Bought a heavy book called Daniels on Negotiable\r\n                     Instruments and set me to reading it. Never could get a grip\r\n                     on it and I was happy enough to set it aside and leave Texas.\r\n                     There ain't but about six trees between there and Canada,\r\n                     and nothing else grows but has stickers on it. I went to--\r\n      \r\n      A distant gunshot.\r\n      \r\n      Rooster stops. He twists to look behind.\r\n      \r\n      A listening beat. At length:\r\n      \r\n                                               Rooster\r\n                     I knew it.\r\n      \r\n                                                 Mattie\r\n                     Knew what?\r\n      \r\n                                             Rooster\r\n                     We're being followed. I asked the Indian to signal with a\r\n                     shot if there was someone on our trail.\r\n      \r\n                                             Mattie\r\n                     Should we be concerned, Marshal?\r\n      \r\n                                               Rooster\r\n                     No. It's Mr. LeBoeuf, using us as bird dogs in hopes of\r\n                     cutting in once we've flushed the prey. Our Texas friend has\r\n                     got just enough sense to recognize he can't outtrack me.\r\n                                                                                               60\r\n      \r\n      Mattie thinks.\r\n      \r\n                                                  Mattie\r\n                       Perhaps we could double back over our tracks, and confuse\r\n                       the trail in a clever way.\r\n      \r\n                                                Rooster\r\n                       No, we will wait right here and offer our friend a warm\r\n                       hello, and ask him where he is going.\r\n      \r\n      \r\n      MINUTES LATER\r\n      \r\n      Rooster waits, sitting casually astride his horse in the middle of the road. Snow continues\r\n      to fall.\r\n      \r\n      A jingling noise up the road.\r\n      \r\n      Movement: an advancing rider seen through the foliage that masks a bend in the road.\r\n      \r\n      Rooster straightens.\r\n      \r\n      The oncoming rider rounds the bend.\r\n      \r\n      He approaches: a white man with big whiskers, his horse leading a packhorse loaded with\r\n      clinking and jangling sundries. Draped on his own horse's rump is the hanged man's\r\n      body.\r\n      \r\n      The stranger wears a fierce bear head as hat. The rest of the bearskin trails down his body\r\n      as robe.\r\n      \r\n      He advances unhurriedly towards Rooster. At a few yards' distance he draws up, content\r\n      to sit his horse and solemnly return Rooster's stare.\r\n      \r\n      At length:\r\n      \r\n                                                Rooster\r\n                       You are not LeBoeuf.\r\n      \r\n                                              Bear Man\r\n                       My name is Forster. I practice dentistry in the Nation. Also,\r\n                       veterinary arts. And medicine, on those humans that will sit\r\n                       still for it.\r\n                                                                                              61\r\n                                            Rooster\r\n                                      (indicating corpse)\r\n                     You have your work cut out for you there.\r\n      \r\n                                             Bear Man\r\n                     Traded for him with an Indian, who said he came by him\r\n                     honestly. I gave up two dental mirrors and a bottle of\r\n                     expectorant. (beat) Do either of you need medical\r\n                     attention?\r\n      \r\n                                                Rooster\r\n                     No.\r\n      \r\n      Rooster straightens as if to rein his horse around but stops with a thought:\r\n      \r\n                     . . . It is fixing to get cold. Do you know of any place to take\r\n                     shelter?\r\n      \r\n                                              Bear Man\r\n                     I have my bearskin. You might want to head to the Original\r\n                     Greaser Bob's. He notched a dugout into a hollow along the\r\n                     Carrillon River. If you ride the river you won't fail to see it.\r\n                     Greaser Bob--Original Greaser Bob--is hunting north of the\r\n                     picket wire and would not begrudge its use.\r\n      \r\n      A pause.\r\n      \r\n      The Bear Man tilts his head to indicate the corpse behind him.\r\n      \r\n                                              Bear Man\r\n                     I have taken his teeth. I will entertain an offer for the rest of\r\n                     him.\r\n      \r\n      \r\n      NIGHT\r\n      \r\n      A point-of-view looking down on a thrown-together cabin dug into the flanks of a ravine.\r\n      Its roof meets hillside at the rear. Smoke is coming out of a rough chimney.\r\n      \r\n      Rooster and Mattie have paused at the crest of the rise above the dugout to look. Rooster\r\n      shrugs out of his coat.\r\n      \r\n                                                Rooster\r\n                     Take my jacket. Creep onto the roof. If they are not friendly\r\n                     I will give you a sign to damp the chimney.\r\n                                                                                                 62\r\n      \r\n      As Mattie descends to where hillside meets structure Rooster takes his rifle and walks\r\n      around to the front door--crude planking hung on leather-strap hinges. His footsteps\r\n      crunch in the snow.\r\n      \r\n      The door is yanked open, inches, and a backlit face appears over a hand holding a revolver.\r\n      Rooster halts.\r\n      \r\n                                                  Man\r\n                     Who is out there?\r\n      \r\n                                              Rooster\r\n                     We are looking for shelter.\r\n      \r\n                                              Man\r\n                     No room for you here! Ride on!\r\n      \r\n      The door slams.\r\n      \r\n      After a moment the light inside goes out.\r\n      \r\n      Mattie, arriving on the roof, looks steeply down on Rooster. He glances up, thinking. He\r\n      does not sign. He looks back at the door.\r\n      \r\n                                                Rooster\r\n                     Who all is in there?\r\n      \r\n                                                  Voice\r\n                     Ride on!\r\n      \r\n      Rooster looks up at Mattie. He nods.\r\n      \r\n      She balls the jacket and stuffs it into the chimney.\r\n      \r\n      Rooster takes ten paces to one side of the door and then kneels in the snow, raising his\r\n      rifle.\r\n      \r\n      Long beat.\r\n      \r\n      Muffled coughs from inside the house--more than one person.\r\n      \r\n      Activity inside--yelling--the hiss of fire being doused. Suddenly:\r\n      \r\n      The door flies open and--BANG! BANG!--two shotgun blasts.\r\n                                                                                             63\r\n      Slightest beat as Mattie peers into the yard, and then--BANG!--shot rips through the\r\n      roof just at her feet.\r\n      \r\n      A rifle blast--from Rooster. A yelp of pain from inside.\r\n      \r\n                                                Rooster\r\n                       I am a Federal officer! Who is in there? Speak up and be\r\n                       quick about it.\r\n      \r\n                                             New Voice\r\n                       A Methodist and a son-of-a-bitch!\r\n      \r\n      Rooster cocks his head.\r\n      \r\n                                                  Rooster\r\n                       Is that Emmett Quincy?\r\n      \r\n                                           New Voice\r\n                       I don't know any Emmett Quincy.\r\n      \r\n                                               Rooster\r\n                       Listen here, Emmett Quincy. I know it is you! This is\r\n                       Rooster Cogburn. Columbus Potter and five other marshals\r\n                       is out here with me. We have got a bucket of coal oil. In\r\n                       one minute we will burn you out from both ends! Chuck\r\n                       your arms clear and come out with your hands locked on\r\n                       your head and you will not be harmed. Oncet that coal oil\r\n                       goes down the chimney we are killing everything that comes\r\n                       out the door!\r\n      \r\n      Thinking beat.\r\n      \r\n                                                  Quincy\r\n                       There's only two of you!\r\n      \r\n                                              Rooster\r\n                       You go ahead and bet your life on it! How many of you is in\r\n                       there?\r\n      \r\n                                               Quincy\r\n                       Me and Moon, but he is hit! He can't walk!\r\n      \r\n                                               Rooster\r\n                       Drag him out! Light that lamp!\r\n                                                                                                  64\r\n      Thinking beat.\r\n      \r\n                                                 Quincy\r\n                       Tell them other officers to be careful with their guns! We\r\n                       are coming out!\r\n      \r\n      The door opens again. From the smoky black a shotgun and two revolvers are tossed out.\r\n      Then, orange light: a lamp is lit. Two men emerge, one limping and holding onto the\r\n      other, who holds high the lamp.\r\n      \r\n                                               Rooster\r\n                       Down in the snow! Lie still while I cuff you! We is only\r\n                       two, but my man on the roof will shoot you if you get feisty.\r\n      \r\n      \r\n      INSIDE\r\n      \r\n      Rooster has coaxed the fire back to life. He peers into the large pot hanging over it.\r\n      \r\n      The cuffed men sit side-by-side on a plank bench behind a plank table, staring at Mattie.\r\n      Moon's leg is bound with a large blue handkerchief.\r\n      \r\n      Quincy sounds resentful:\r\n      \r\n                                               Quincy\r\n                       You said it was a man on the roof. I thought it was Potter.\r\n      \r\n                                             Rooster\r\n                       You was always dumb, Quincy, and remain true to form.\r\n      \r\n      He stirs the pot with a wooden spoon.\r\n      \r\n                       . . .This here's an awful lot of sofky. Was you boys looking\r\n                       for company?\r\n      \r\n                                                Quincy\r\n                       That is our supper and breakfast both. I like a big breakfast.\r\n      \r\n      Moon nods agreement, but has a different thought:\r\n      \r\n                                               Moon\r\n                       Sofky always cooks up bigger than you think.\r\n      \r\n      Rooster, continuing to nose around, pushes the canvas cover off a crate of bottles.\r\n                                                                                      65\r\n                                              Rooster\r\n                     And a good store of whiskey as well. What are you boys up\r\n                     to, outside of cooking banquets? You are way too jumpy.\r\n      \r\n                                            Quincy\r\n                     We didn't know who was out there weather like this. It\r\n                     might have been some crazy man. Anyone can say he is a\r\n                     marshal.\r\n      \r\n                                                Moon\r\n                     My leg hurts.\r\n      \r\n                                                Rooster\r\n                     I'll bet it does. When is the last time you seen your old pard\r\n                     Ned Pepper?\r\n      \r\n                                            Quincy\r\n                     Ned Pepper? I don't know him. Who is he?\r\n      \r\n      Rooster spoons sofky from the pot into a bowl\r\n      \r\n                                              Rooster\r\n                     I'm surprised you don't remember him. He is a little fellow,\r\n                     nervous and quick. His lip is all messed up.\r\n      \r\n                                             Quincy\r\n                     That don't bring anybody to mind.\r\n      \r\n      Rooster sits across from the men with his bowlful of sofky and starts eating.\r\n      \r\n                                              Rooster\r\n                     There is a new boy that might be running with Ned. He is\r\n                     short himself and he has got a powder mark on his face, a\r\n                     black place. He calls himself Chaney, or Chelmsford\r\n                     sometimes. Carries a Henry rifle.\r\n      \r\n                                             Quincy\r\n                     That don't bring anybody to mind. Black mark, I would\r\n                     remember that.\r\n      \r\n                                            Rooster\r\n                     You don't remember anything I want to know, do you\r\n                     Quincy? I hope you don't mind. . .\r\n      \r\n      Raises a spoonful.\r\n                                                                                     66\r\n      \r\n                    . . . There seems to be ample. What do you know, Moon?\r\n      \r\n      Moon looks at Quincy, who gives a hard look back.\r\n      \r\n                                             Moon\r\n                    I don't know those boys. I always try to help out the law.\r\n      \r\n                                              Rooster\r\n                    By the time we get back to Fort Smith that leg will be\r\n                    swelled up tight as Dick's hatband. It will be mortified and\r\n                    they will cut it off. Then if you live I will get you two or\r\n                    three years in the Federal house up in Detroit.\r\n      \r\n                                              Moon\r\n                    You are trying to get at me.\r\n      \r\n                                             Rooster\r\n                    They will teach you to read and write up there but the rest of\r\n                    it won't be so good. Them boys can be hard on a gimp.\r\n      \r\n                                              Moon\r\n                    You are trying to get at me.\r\n      \r\n                                             Rooster\r\n                    You give me some good information on Ned and I will take\r\n                    you to McAlester's store tomorrow get that ball taken out of\r\n                    your leg. Then I will give you three days to clear the\r\n                    Territory.\r\n      \r\n                                           Quincy\r\n                    We don't know those boys you are looking for.\r\n      \r\n      Rooster shrugs at Moon.\r\n      \r\n                                             Rooster\r\n                    It ain't his leg.\r\n      \r\n                                             Quincy\r\n                    Don't go to flapping your mouth, Moon. It is best to let me\r\n                    do the talking.\r\n      \r\n                                                 Moon\r\n                    I would say if I knew. . .\r\n                                                                                    67\r\n                                                 Quincy\r\n                     We are weary trappers.\r\n      \r\n      He reacts to Mattie, staring at him.\r\n      \r\n                     . . . Who worked you over with the ugly stick?\r\n      \r\n      Mattie's look shifts to Moon.\r\n      \r\n                                               Mattie\r\n                     The man Chaney with the marked face killed my father. He\r\n                     was a whiskey drinker like you and it led to killing in the\r\n                     end. If you answer the marshal's questions he will help you.\r\n                     I have a good lawyer at home and he will help you too.\r\n      \r\n      Beat.\r\n      \r\n                                               Moon\r\n                     I am puzzled by this. (to Rooster) Why is she here?\r\n      \r\n                                             Quincy\r\n                     Don't go jawing with these people, Moon. Don't go jawing\r\n                     with that runt.\r\n      \r\n                                                Mattie\r\n                                             (to Quincy)\r\n                     I don't like you. I hope you go to jail. My lawyer will not\r\n                     help you.\r\n      \r\n                                                 Moon\r\n                     My leg is giving me fits.\r\n      \r\n                                              Rooster\r\n                     Yes, a young fellow like you don't want to loose his leg.\r\n                     You are too young to be getting about on a willow peg. You\r\n                     love dancing and sport, carrying on.\r\n      \r\n                                              Quincy\r\n                     Easy now. He is trying to get at you.\r\n      \r\n                                               Rooster\r\n                     I am getting at you with the truth.\r\n      \r\n                                            Moon\r\n                     We seen Ned and Haze two days ago. We's supposed--\r\n                                                                                                    68\r\n      \r\n                                               Quincy\r\n                     Don't act the fool! If you blow I will kill you!\r\n      \r\n                                              Moon\r\n                     I am played out. I must have a doctor. We's supposed--\r\n      \r\n      Quincy jerks up one knee, banging the bottom of the table and sloshing Rooster's sofky as\r\n      he grabs something from his boot: a knife.\r\n      \r\n      He slams it down on Moon's cuffed hand, chopping off four fingers. They fly like chips\r\n      from a log.\r\n      \r\n      As Moon screams Rooster mutters:\r\n      \r\n                                               Rooster\r\n                     God damn it!\r\n      \r\n      Quincy flips the knife lightly in the air and regrabs it with blade pointing opposite-wise.\r\n      He twists and rears with cuffed hands to plunge the knife into Moon's chest.\r\n      \r\n      Rooster has his gun out now and fires.\r\n      \r\n      Quincy jerks back, hit in the face. Blood spatters Mattie. Quincy, still seated, slides\r\n      awkwardly down the wall.\r\n      \r\n      Moon has fallen to the floor, knife in chest.\r\n      \r\n                                                Moon\r\n                     Oh lord, I am dying!\r\n      \r\n      Rooster and Mattie stand over him.\r\n      \r\n                     . . . Do something! Help me!\r\n      \r\n                                               Rooster\r\n                     I can do nothing for you, son. Your pard has killed you and I\r\n                     have done for him.\r\n      \r\n                                              Moon\r\n                     Don't leave me lying here! Don't let the wolves rip me up!\r\n      \r\n                                                Rooster\r\n                     I'll see you are buried right. You tell me about Ned. Where\r\n                     did you see him?\r\n                                                                                              69\r\n      \r\n                                                Moon\r\n                     Two days ago at McAlester's store. They are coming here\r\n                     tonight to get remounts, and sofky. They just robbed the\r\n                     Katy Flyer at Wagoner's Switch if the snow didn't stop 'em.\r\n      \r\n      Eyes wide, he gazes down his body.\r\n      \r\n                     . . . I am bleeding buckets! I am gone. Send the news to my\r\n                     brother, George Garrett. He is a Methodist circuit rider in\r\n                     South Texas. You can write care of the district supervisor in\r\n                     Austin.\r\n      \r\n                                              Rooster\r\n                     Should I tell him you was outlawed up?\r\n      \r\n                                                 Moon\r\n                     It don't matter, he knows I am on the scout. I will meet him\r\n                     later walking the streets of Glory!\r\n      \r\n                                             Rooster\r\n                     Don't be looking for Quincy.\r\n      \r\n      \r\n      OUTSIDE\r\n      \r\n      Mattie's point-of-view: the dark shoulders of the wooded hills, funneling down to the\r\n      ravine. It is all very still except for falling snow.\r\n      \r\n      Mattie stands outside the cabin door, hugging herself, keeping watch.\r\n      \r\n      The door opens and Rooster emerges.\r\n      \r\n                                             Rooster\r\n                     Hobble our mounts in the corral out back. We don't know\r\n                     when they's coming.\r\n      \r\n      From the threshold he surveys the inside of the cabin.\r\n      \r\n                                               Mattie\r\n                     Is he dead?\r\n      \r\n                                              Rooster\r\n                     He is. I stowed the bodies under the blanket there. Just\r\n                     needs to look right enough to get 'em in the door.\r\n                                                                                             70\r\n      \r\n      Something he sees inside prompts Rooster to quickly reenter the cabin. He reemerges, fist\r\n      closed on something.\r\n      \r\n                     . . . We'll climb that ridge there, fort up somewhere gives us\r\n                     a clear shot.\r\n      \r\n      He flings, and whatever he was holding lands faintly pit-a-pat in the woods.\r\n      \r\n                                                Mattie\r\n                     What was that?\r\n      \r\n                                               Rooster\r\n                     Fingers.\r\n      \r\n      \r\n      RIDGE\r\n      \r\n      Rooster finishes hunkering down.\r\n      \r\n      He takes out his revolver and put a cartridge into the one empty chamber, under the\r\n      hammer. He places the revolver on a log and puts the sack of cartridges next to the\r\n      revolver. He leans his rifle against the log. He looks out.\r\n      \r\n      His point-of-view of the cabin below, peaceful, smoke drifting from the chimney.\r\n      \r\n                                                Mattie\r\n                     What do we do now?\r\n      \r\n      Rooster takes out a sack of corn dodgers and starts to eat.\r\n      \r\n                                                Rooster\r\n                     We wait. They ride up, what we want is to get them all in\r\n                     the dugout. I will kill the last one to go in and then we will\r\n                     have them in a barrel.\r\n      \r\n                                               Mattie\r\n                     You will shoot him in the back?\r\n      \r\n                                                Rooster\r\n                     It will give them to know our intentions is serious. Then I\r\n                     will call down and see if they will be taken alive. If they\r\n                     won't I will shoot them as they come out. I am hopeful that\r\n                     three of their party being dead will take the starch out of\r\n                     them.\r\n                                                                                       71\r\n      \r\n      Chewing beat.\r\n      \r\n                                                 Mattie\r\n                      You display great poise.\r\n      \r\n                                                 Rooster\r\n                      It is just a turkey shoot. There was one time in New Mexico,\r\n                      when Bo was a strong colt and I myself had less tarnish, we\r\n                      was being pursued by seven men. I turned Bo around and\r\n                      taken the reins in my teeth and rode right at them boys firing\r\n                      them two navy sixes I carry on my saddle. Well I guess they\r\n                      was all married men who loved their families as they\r\n                      scattered and run for home.\r\n      \r\n                                                 Mattie\r\n                      That is hard to believe.\r\n      \r\n                                                 Rooster\r\n                      What is?\r\n      \r\n                                                 Mattie\r\n                      One man riding at seven.\r\n      \r\n                                                 Rooster\r\n                      It is true enough. You go for a man hard enough and fast\r\n                      enough and he don't have time to think about how many is\r\n                      with him--he thinks about himself and how he may get clear\r\n                      of the wrath that is about to set down on him.\r\n      \r\n                                              Mattie\r\n                      Why were they pursuing you?\r\n      \r\n                                               Rooster\r\n                      They was in the nature of a posse.\r\n      \r\n                                              Mattie\r\n                      You were particeps criminis in something other than the case\r\n                      of the Yankee paymaster?\r\n      \r\n                                                Rooster\r\n                      I robbed a high-interest bank. You can't rob a thief, can\r\n                      you? I never robbed a citizen. Never took a man's watch.\r\n                                                                                              72\r\n                                                  Mattie\r\n                     It is all stealing.\r\n      \r\n                                                Rooster\r\n                     That is the position they took in New Mexico.\r\n      \r\n      He is suddenly alert, and raises a hand for quiet.\r\n      \r\n      There is the sound of a rider, approaching slowly.\r\n      \r\n      Rooster is puzzled:\r\n      \r\n                     . . . One man. I didn't figure them to send a scout.\r\n      \r\n      Their high point-of-view: a mounted figure has entered the ravine.\r\n      \r\n      He travels its length and stops his horse before the cabin and dismounts. We hear the\r\n      jingle of spurs.\r\n      \r\n                     . . . Damn. It is LeBoeuf.\r\n      \r\n      Distant, calling toward the cabin:\r\n      \r\n                                               LeBoeuf\r\n                     Hello?\r\n      \r\n      LeBoeuf unholsters a gun. He walks to the cabin, opens the door and peers in.\r\n      \r\n      Rooster starts to rise, about to call out, as LeBoeuf enters and closes the door.\r\n      \r\n      We hear hoofbeats. Many horses.\r\n      \r\n                                            Mattie\r\n                     We have to warn him, Marshal!\r\n      \r\n      Rooster is looking to the mouth of the ravine.\r\n      \r\n                                                Rooster\r\n                     Too late.\r\n      \r\n      Mattie follows his look.\r\n      \r\n      Their high point-of-view: four riders just entering the ravine.\r\n      \r\n      They look back to the cabin.\r\n                                                                                              73\r\n      \r\n      From inside, faintly:\r\n      \r\n                                               LeBoeuf\r\n                     Oh!\r\n      \r\n      The door opens and LeBoeuf stumbles out, wide-eyed.\r\n      \r\n      He sees the approaching riders. They see him.\r\n      \r\n      They slow, approaching with caution.\r\n      \r\n      LeBoeuf looks at them, glances back over his shoulder, looks forward again.\r\n      \r\n                                                Mattie\r\n                     What do we do, Marshal?\r\n      \r\n                                            Rooster\r\n                     We sit. What does he do?\r\n      \r\n      The riders stop several paces from LeBoeuf. They spread in a line facing him. Words are\r\n      exchanged; we cannot make them out.\r\n      \r\n      LeBoeuf unholsters a gun and points it at the four men.\r\n      \r\n                                                Rooster\r\n                     He is a fine one for not drawing attention to himself.\r\n      \r\n      The four men, slouched astride their horses, are not impressed by LeBoeuf's gun. There is\r\n      more talking.\r\n      \r\n                                             Rooster\r\n                     Him in the woolly chaps is Lucky Ned.\r\n      \r\n      He refers to the mounted man who does most of the talking. Lucky Ned now speaks to the\r\n      men on either side and the two corners advance, closing a circle around LeBoeuf.\r\n      \r\n      LeBoeuf looks warily from side side, swinging his gun to cover the group. None of the\r\n      riders bothers to unholster a gun.\r\n      \r\n      The man to LeBoeuf's right lifts a rope off his saddle and casually twirls it.\r\n      \r\n      The man to his left says something: LeBoeuf looks left and the man to his right drops the\r\n      rope around LeBoeuf and pulls it tight. LeBoeuf is jerked off his feet, gun dropping. The\r\n      mounted man backs his horse, taking the play from the rope. He dallies the free end round\r\n                                                                                                 74\r\n      his saddlehorn.\r\n      \r\n      Two of the men slide off their horses.\r\n      \r\n      One of them heads for the cabin door.\r\n      \r\n                                                Rooster\r\n                     Well, that's that.\r\n      \r\n      BANG!--the rifleshot, just at Mattie's ear, is deafening.\r\n      \r\n      The man heading to the cabin drops, shot in the back.\r\n      \r\n      The two horses that are now riderless rear and mill, panicked.\r\n      \r\n      The horse towing LeBoeuf also skitters, spooked, as its rider looks wildly about and starts\r\n      shooting.\r\n      \r\n      Lucky Ned looks toward our vantage point and also begins firing.\r\n      \r\n      Rooster is methodically aiming and firing but in the commotion below his first couple of\r\n      shots don't tell. His third drops Lucky Ned's horse.\r\n      \r\n      The other unmounted man is frantically trying to snatch up the reins of one of the loose\r\n      horses.\r\n      \r\n      The man towing LeBoeuf spurs his horse toward one of the free horses, trying to grab it.\r\n      LeBoeuf is dragged past plunging horses' hooves.\r\n      \r\n      A cacaphony of screaming horses, crackling gunfire from the basin, and the boom of\r\n      Rooster's rifle.\r\n      \r\n      The unmounted man has managed to grab a halter. He climbs with difficulty aboard the\r\n      skittish horse.\r\n      \r\n      The rider towing LeBoeuf cuts loose the towline. He gallops toward Ned Pepper with an\r\n      arm outstretched to help him aboard.\r\n      \r\n      Rooster is tracking him with his rifle.\r\n      \r\n      Lucky Ned grabs the extended arm. As he begins to swing up there is the BOOM of\r\n      Rooster's rifle. The rider pitches off the horse but Lucky Ned manages to stay on, and\r\n      swipes up the reins. He gallops off.\r\n      \r\n      The one other surviving horseman follows him.\r\n                                                                                               75\r\n      \r\n      There is one dead horse in the basin, a live unmounted horse racing crazy circles, and three\r\n      still bodies. One is LeBoeuf's.\r\n      \r\n      Rooster rises.\r\n      \r\n                                                   Rooster\r\n                       Well that didn't pan out.\r\n      \r\n      \r\n      IN THE BASIN\r\n      \r\n      LeBoeuf is moaning.\r\n      \r\n      Rooster walks toward him trailed by Mattie, glancing along the way at the two dead men.\r\n      \r\n                                               Rooster\r\n                       You managed to put a kink in my rope, pardner.\r\n      \r\n                                                   LeBoeuf\r\n                       I am theverely injured.\r\n      \r\n      Something is wrong with LeBoeuf's speech. Bloody saliva bubbles copiously from his\r\n      mouth.\r\n      \r\n                                                   Rooster\r\n                       Yes you got drug some.\r\n      \r\n                                                   LeBoeuf\r\n                       Altho shshot. By a rifle.\r\n      \r\n      Rooster stoops to examine.\r\n      \r\n                                                 Rooster\r\n                       That is quite possible. The scheme did not develop as I had\r\n                       planned. You have been shot in the shoulder but the ball\r\n                       passed through. It will pain you in the years to come. What\r\n                       happened to your mouth?\r\n      \r\n                                                   LeBoeuf\r\n                       I believe I beh mythelf.\r\n      \r\n      Rooster slaps lightly down at LeBoeuf's chin, signaling that he should open up.\r\n      \r\n      LeBoeuf does, and Rooster digs in with two dirty fingers, dipping his head to peer in as he\r\n                                                                                             76\r\n      pokes this way and that.\r\n      \r\n                                             Rooster\r\n                    Couple of teeth missing and yes, the tongue is bit almost\r\n                    through. Do you want to see if it will knit or should I just\r\n                    yank it free? I know a teamster who bit his tongue off being\r\n                    thrown from a horse. After a time he learned to make\r\n                    himself more or less understood.\r\n      \r\n                                              LeBoeuf\r\n                    Hngnickh.\r\n      \r\n      Bloody saliva bubbles out with the word. Rooster withdraws his fingers.\r\n      \r\n                                               Rooster\r\n                    What's that now?\r\n      \r\n                                              LeBoeuf\r\n                    Knit.\r\n      \r\n                                              Rooster\r\n                    Very well. It is impossible to bind a tongue wound. The\r\n                    shoulder we will kit out.\r\n      \r\n      Mattie goes to inspect the two outlaws' corpses as Rooster pokes back LeBoeuf's shirt to\r\n      look at the wound.\r\n      \r\n                    . . . It's too bad. We just ran across a doctor of sorts but I do\r\n                    not know where he was headed.\r\n      \r\n                                            LeBoeuf\r\n                    I thaw him too. Ith how I came to be here.\r\n      \r\n                                             Mattie\r\n                    Neither of these men are Chaney, Marshal.\r\n      \r\n                                               Rooster\r\n                    I know it. I know them both. The ugly one is Coke Hayes.\r\n                    Him uglier still is Clement Parmalee. Parmalee and his\r\n                    brothers have a silver claim in the Winding Stair Mountains\r\n                    and I will bet you that's where Lucky Ned's gang is waiting.\r\n                    We'll sleep here, follow in the morning.\r\n      \r\n                                            Mattie\r\n                    We promised to bury the poor soul inside.\r\n                                                                                                     77\r\n      \r\n                                              Rooster\r\n                     Ground is too hard. If these men wanted a decent burial they\r\n                     should have got themselves kilt in summer.\r\n      \r\n      \r\n      SNOW\r\n      \r\n      Falling straight down: a windless night.\r\n      \r\n      We hear a murmuring male voice from inside the cabin.\r\n      \r\n      Mattie is finishing rubbing down her horse.\r\n      \r\n                                                Mattie\r\n                     Sleep well, Little Blackie. . .\r\n      \r\n      She puts up the brush and pulls an apple from her apple bag.\r\n      \r\n                     . . . I have a notion that tomorrow we will reach our object.\r\n                     We are \"hot on the trail\". . .\r\n      \r\n      The horse chomps up the apple and she rubs its muzzle as it chews.\r\n      \r\n                     . . . It seems that we will overtake Tom Chaney in the\r\n                     Winding Stair Mountains. I would not want to be in his\r\n                     shoes.\r\n      \r\n      The horse huffs and blows.\r\n      \r\n      \r\n      FRONT OF THE CABIN\r\n      \r\n      We are raking the four dead men who have been carelessly propped against the outside\r\n      wall to sit in an irregular row. Mattie passes them, with a brief look, and opens the door,\r\n      and the murmuring voice from inside fans up louder.\r\n      \r\n      \r\n      INSIDE\r\n      \r\n      As Mattie enters. We see LeBoeuf musing before the fire as he cleans his Sharp's carbine\r\n      --an awkward operation given the injury to his shoulder, now bandaged.\r\n      \r\n      All we see of Rooster, seated further from the fire, is a pair of boots, and legs stretching\r\n      into darkness.\r\n                                                                                               78\r\n      \r\n      Mattie goes to the pot of food on the fire.\r\n      \r\n                                              LeBoeuf\r\n                     Azh I understand it, Chaney--or Chelmzhford, azh he called\r\n                     himshelf in Texas--shot the shenator'zh dog. When the\r\n                     shenator remonshtrated Chelmzhford shot him azh well.\r\n                     You could argue that the shooting of the dog wazh merely an\r\n                     inshtansh of malum prohibitum, but the shooting of a\r\n                     shenator izh indubitably an inshtansh of malum in shay.\r\n      \r\n      Rooster is a voice in the darkness:\r\n      \r\n                                                Rooster\r\n                     Malla-men what?\r\n      \r\n                                                  Mattie\r\n                     Malum in se. The distinction is between an act that is wrong\r\n                     in itself, and an act that is wrong only according to our laws\r\n                     and mores. It is Latin.\r\n      \r\n      We hear the pthoonk of a bottle yielding its cork, followed by the pthwa of the cork's\r\n      being spit out.\r\n      \r\n                                              Rooster\r\n                     I am struck that LeBoeuf is shot, trampled, and nearly severs\r\n                     his tongue and not only does not cease to talk but spills the\r\n                     banks of English.\r\n      \r\n      We hear liquid slosh as the bottle is tipped back.\r\n      \r\n                                               LeBoeuf\r\n                                              (placidly)\r\n                     I wuzh within three hundred yardzh of Chelmzhford once.\r\n                     The closhesht I have been. With the Sharp'sh carbine, that\r\n                     izh within range. But I wuzh mounted, and had the choish of\r\n                     firing off-hand, or dishmounting to shoot from resht--which\r\n                     would allow Chelmzhford to augment the dishtansh. I fired\r\n                     mounted--and fired wide.\r\n      \r\n      We hear the smack of lips releasing bottleneck, and a wet breath.\r\n      \r\n                                                Rooster\r\n                     . . . You could not hit a man at three hundred yards if the gun\r\n                     was resting on Gibraltar.\r\n                                                                                                79\r\n      \r\n                                             LeBoeuf\r\n                     The Sharp'sh carbine izh an inshtrument of uncanny power\r\n                     and precizhun.\r\n      \r\n                                               Rooster\r\n                     I have no doubt that the gun is sound.\r\n      \r\n      Silence.\r\n      \r\n      LeBoeuf shrugs.\r\n      \r\n      \r\n      MORNING\r\n      \r\n      Wide: three riders leave the cabin single-file.\r\n      \r\n      Jump in: pushing Mattie, who rides last in line. LeBoeuf is in front of her. Rooster leads,\r\n      head tipping momentarily back to swig from a bottle.\r\n      \r\n      He then half-hums, half-scats a tune.\r\n      \r\n      Mattie twists to look behind.\r\n      \r\n      Her point-of-view: pulling away from the cabin, against the wall of which the four dead\r\n      men are now semi-drifted over with snow. Rooster's humming has stopped and we hear\r\n      his voice:\r\n      \r\n                                               Rooster\r\n                     That was \"Johnny in the Low Ground.\" There are very few\r\n                     fiddle tunes I have not heard. Once heard they are locked in\r\n                     my mind forever. It is a sadness to me that I have sausage\r\n                     fingers that cannot crowd onto a fretboard--little fat girls at\r\n                     a cotillion. \"Soldier's Joy\"!\r\n      \r\n      He launches into another song, interrupted by the slosh of liquid as he takes a drink.\r\n      Mattie looks forward again and LeBoeuf turns to look back at her. He keeps his voice low:\r\n      \r\n                                                  LeBoeuf\r\n                     I don't believe he shlept.\r\n      \r\n      Still without looking back, Rooster projects:\r\n      \r\n                                               Rooster\r\n                     Fort Smith is a healthy distance, LeBoeuf, but I would\r\n                                                                                                  80\r\n                     encourage the creature you ride to try to make it in a day. Out here a\r\n                     one-armed man looks like easy prey.\r\n      \r\n                                            LeBoeuf\r\n                     And a one-eyed man--who can't shshoodt? Why don't you\r\n                     tshurn back, Khoghburn?\r\n      \r\n                                               Rooster\r\n                     I will do fine.\r\n      \r\n      He twists around to gaily hector LeBoeuf:\r\n      \r\n                     . . . I know where the Parmalee's claim is. I am uninjured, I\r\n                     am provisioned--and we agreed to separate.\r\n      \r\n                                             LeBoeuf\r\n                     In conscschiensh you cannot shite our agreement. You are\r\n                     the pershon who shshot me.\r\n      \r\n                                              Mattie\r\n                     Mr. LeBoeuf has a point, Marshal. It is an unfair leg-up in\r\n                     any competition to shoot your opposite number.\r\n      \r\n                                             Rooster\r\n                     God damn it! I don't accept it as a given that I did shoot\r\n                     LeBoeuf. There was plenty of guns going off.\r\n      \r\n                                                LeBoeuf\r\n                     I heard a rifle and felt the ball. You mishshed your shshodt,\r\n                     Khoghburn, admit it. You are more handicapped without the\r\n                     eye than I without the arm.\r\n      \r\n                                             Rooster\r\n                     Missed my shot! I can hit a gnat's eye at ninety yards!\r\n      \r\n      He reins his horse up, hastily tips the bottle to his mouth to make sure it is empty, and then\r\n      hurls it high.\r\n      \r\n      He pulls out a navy six-gun and fires.\r\n      \r\n      The bottle reaches the height of its arc untouched, and drops.\r\n      \r\n      Rooster cocks his head at the landed bottle several paces distant. He shoots again and\r\n      misses.\r\n                                                                                                81\r\n      He shoots a third time and the bottle shatters.\r\n      \r\n                                             Rooster\r\n                     The chinaman is running them cheap shells on me again.\r\n      \r\n                                              LeBoeuf\r\n                     I tdhought you were going to shay the shun was in your\r\n                     eyezh. That izh to shay, your eye.\r\n      \r\n      Rooster starts to dismount, finishing in a semi-controlled fall. He dusts one knee and\r\n      reaches into his saddlebag. He pulls out a corn dodger and heaves it up.\r\n      \r\n      He fires. The corn dodger is obliterated.\r\n      \r\n      He reaches two corn dodgers from the saddlebag.\r\n      \r\n                                               Rooster\r\n                     Two at one time!\r\n      \r\n      He hurls them and quickly fires twice. Nothing happens; he quickly fires three times at the\r\n      falling corn dodgers, missing.\r\n      \r\n      Scowling, he throws a single corn dodger and is just raising his gun when another gun goes\r\n      off, making him jump.\r\n      \r\n      LeBoeuf has fired with a gun in his left hand, missing.\r\n      \r\n                                             Rooster\r\n                     I will chunk one high. Hold fire.\r\n      \r\n      He reaches into the saddlebag and hurls it high. Both he and Leboeuf fire. It explodes.\r\n      \r\n                                               LeBoeuf\r\n                     There.\r\n      \r\n                                               Rooster\r\n                     There?! My bullet!\r\n      \r\n                                              LeBoeuf\r\n                     Your bullet? If you hit what you aim at, eckshplain my\r\n                     shoulder!\r\n      \r\n                                                Mattie\r\n                     Gentlemen, shooting cornbread out here on the prairie is\r\n                     getting us no closer to the Ned Pepper gang.\r\n                                                                                                  82\r\n      \r\n                                                Rooster\r\n                       One more, this will prove it. Hold fire!\r\n      \r\n      He tosses a corn dodger and fires. It holds to its arc and falls. LeBoeuf is smug.\r\n      \r\n                                                LeBoeuf\r\n                       Azh I shed, Khoghburn.\r\n      \r\n      Rooster roars:\r\n      \r\n                                                Rooster\r\n                       Did you not see the piece fly off?!\r\n      \r\n      \r\n      RIDING\r\n      \r\n      Some time later.\r\n      \r\n      Rooster sways in the saddle, holding a bottle, humming.\r\n      \r\n      He tips his head up and tilts the bottle all the way back, confirming that this one too is now\r\n      empty.\r\n      \r\n      Riding forward, he leans out of the saddle, stretching low to one side, his hand extended\r\n      with the bottle. Wavering, he places it upon a large rock as he passes.\r\n      \r\n      His arm waves for balance as he straightens but he keeps his place on the horse. He half-\r\n      turns, propping himself with one hand on his saddle-back, to address Mattie and LeBoeuf:\r\n      \r\n                                                Rooster\r\n                       Find our way back!\r\n      \r\n      \r\n      SKY\r\n      \r\n      Framed by a mine entrance.\r\n      \r\n      Rooster steps into the square, wood-beam frame of the entrance, looking in.\r\n      \r\n      A beat, and he pulls out his six-gun and fires in.\r\n      \r\n      Echoing ricochets.\r\n      \r\n      Wide outside: Rooster before the entrance; Mattie and LeBoeuf standing close by. Very\r\n                                                                                                  83\r\n      still.\r\n      \r\n      The little camp is deserted.\r\n      \r\n      Rooster turns to pan the hills.\r\n      \r\n      At length:\r\n      \r\n                                                Rooster\r\n                       Lucky Ned!\r\n      \r\n      Very faint echo.\r\n      \r\n      Faintly, from our distant perspective:\r\n      \r\n                                             LeBoeuf\r\n                       Very good, Khoghburn. Now what.\r\n      \r\n      \r\n      CRACKLING CAMPFIRE\r\n      \r\n      It is raining.\r\n      \r\n      The campfire is roughly canopied by a hide draped at a cant over a pair of tree branches.\r\n      \r\n      Mattie pours hot water from a kettle into a large tin cup holding a corn dodger. She takes a\r\n      fork and starts mashing the dodger into mush.\r\n      \r\n      LeBoeuf sits before the fire, coat over his head, one hand on his jaw, which is swollen.\r\n      \r\n                                             LeBoeuf\r\n                       Cogburn does not want me eating out of his store.\r\n      \r\n                                                 Mattie\r\n                       That is silly. You have not eaten the whole day, and it is my\r\n                       store not his.\r\n      \r\n                                                Rooster\r\n                       Let him starve!\r\n      \r\n      Rooster, bellicose, stumbles to the fire with a few thin branches. As he leans in toward the\r\n      fire the water draining off the low edge of the canopy drums onto his neck. He waves a\r\n      hand back at it like a man swatting flies.\r\n                                                                                                84\r\n                                             Rooster\r\n                     He does not track! He does not shoot--except at foodstuffs!--\r\n      \r\n                                                  LeBoeuf\r\n                     That wazh your idea.\r\n      \r\n                                             Rooster\r\n                     --He does not contribute! He is a millstone, with opinions!\r\n                     He is a man who walks in front of bullets!\r\n      \r\n      Rooster sits heavily, a stretching leg kicking away an empty bottle. Rain patters on his hat.\r\n      \r\n                     . . . He is a drag-brake for horses!\r\n      \r\n                                             Mattie\r\n                     Mr. LeBoeuf drew single-handed upon the Lucky Ned\r\n                     Pepper Gang while we fired safely from cover, like a band of\r\n                     sly Injuns!\r\n      \r\n                                                  Rooster\r\n                     We?\r\n      \r\n                                                 Mattie\r\n                     It is unfair to indict a man when his jaw is swollen and\r\n                     tongue mangled and who is therefore unable to rise to his\r\n                     own defense!\r\n      \r\n                                              LeBoeuf\r\n                     I can thpeak for mythelf. I am hardly obliged to anther the\r\n                     ravingth of a drunkard. It ith beneath me.\r\n      \r\n      He rises and starts gathering his things.\r\n      \r\n                     . . . I shall make my own camp elthwhere. It ith you who\r\n                     have nothing to offer, Khoghburn. A shad picture indeed.\r\n                     Thish izh no longer a manhunt, it izh a debauch. The Texath\r\n                     Ranger preththeth on alone.\r\n      \r\n                                                  Rooster\r\n                     Take the girl! I bow out!\r\n      \r\n                                              LeBoeuf\r\n                     A fine thing to deshide once you have brought her into the\r\n                     middle of the Choctaw Nation.\r\n                                                                                               85\r\n                                            Rooster\r\n                     I bow out! I wash my hands!\r\n      \r\n                                             Mattie\r\n                     Gentlemen, we cannot fall out in this fashion, so close to our\r\n                     goal, with Tom Chaney nearly in hand!\r\n      \r\n      Rooster erupts:\r\n      \r\n                                                Rooster\r\n                     In hand?! If he is not in a shallow grave, somewhere\r\n                     between here and Fort Smith, he is gone! Long gone!\r\n                     Thanks to Mr. LeBoeuf, we missed our shot! We have\r\n                     barked, and the birds have flown! Gone gone gone! Lucky\r\n                     Ned and his cohort, gone! Your fifty dollars, gone! Gone\r\n                     the whiskey seized in evidence! The trail is cold, if ever\r\n                     there was one! I am a foolish old man who has been drawn\r\n                     into a wild goose chase by a harpy in trousers--and a\r\n                     nincompoop! Well, Mr. LeBoeuf can wander the Choctaw\r\n                     Nation for as long as he likes; perhaps the local Indians will\r\n                     take him in and honor his gibberings by making him Chief!\r\n                     You, sister, may go where you like! I return home! Our\r\n                     engagement is terminated! I bow out!\r\n      \r\n      He whips his robe over himself.\r\n      \r\n      \r\n      MINUTES LATER\r\n      \r\n      Wide on Mattie, staggering toward us carrying a saddle. We boom down to bring Little\r\n      Blackie into the foreground as Mattie takes the last few stumbling steps forward, almost at\r\n      a run so as to let her inertia help her heave the saddle up onto the horse's back.\r\n      \r\n                                               Mattie\r\n                     I am going with you.\r\n      \r\n      LeBoeuf, cinching a saddle onto his woolly horse, looks around.\r\n      \r\n                                              LeBoeuf\r\n                     Oh, that izh not poshible.\r\n      \r\n                                               Mattie\r\n                     Have I held you back? I have a Colt's dragoon revolver\r\n                     which I know how to use, and I would be no more of a\r\n                     burden to you than I was to the marshal.\r\n                                                                                              86\r\n      \r\n                                              LeBoeuf\r\n                     That izh not my worry. You have earned your shpurzh, that\r\n                     izh clear enough--you have been a regular \"old hand\" on the\r\n                     trail. But Cogburn izh right, even if I would not give him the\r\n                     shatishfaction of consheding it. The trail izh cold, and I am\r\n                     conshiderably diminished.\r\n      \r\n                                              Mattie\r\n                     How can you give up now, after the many months you've\r\n                     dedicated to finding Chaney? You have shown great\r\n                     determination. I misjudged you. I picked the wrong man.\r\n      \r\n                                              LeBoeuf\r\n                     I would go on in your company if there were clear way to go.\r\n                     But we would be shtriking out blindly. Chelmshford izh\r\n                     gone--we have chaished him right off the map. There izh\r\n                     nothing for it. I am bound for Texash, and it izh time for you\r\n                     to go home too.\r\n      \r\n      He swings himself up onto the horse.\r\n      \r\n                     . . . The marshal, when he shoberzh, izh your way back.\r\n      \r\n                                              Mattie\r\n                     I will not go back. Not without Chaney, dead or alive.\r\n      \r\n                                             LeBoeuf\r\n                     I misjudged you as well. I eckshtend my hand.\r\n      \r\n      He does, dropping a hand gloved in rough suede. She refuses to take it.\r\n      \r\n                                               Mattie\r\n                     Mr. LeBoeuf! Please!\r\n      \r\n      He remains with hand extended. She hesitates, sees there is no give, and reaches for up for\r\n      the hand. They shake.\r\n      \r\n                                              LeBoeuf\r\n                     Adiosh!\r\n      \r\n      He saws the horse around and sets it to a prancing walk, his spurs jingling.\r\n      \r\n      The sound recedes, leaving behind Rooster's snoring from the campfire.\r\n                                                                                                  87\r\n      \r\n      CAMPFIRE\r\n      \r\n      Rooster's snores bump up at the cut.\r\n      \r\n      Mattie enters, gazes down for a thinking beat at the passed-out lawman, then lies down on\r\n      her robe.\r\n      \r\n      She lies still, gazing up.\r\n      \r\n      After a long beat she abruptly rises.\r\n      \r\n      She recedes toward the horses. As she reaches them we hear Little Blackie snort and blow.\r\n      \r\n      Mattie returns with a length of coiled rope. She plays it out in a loop around her robe. She\r\n      lies down again. She closes her eyes.\r\n      \r\n      Fade out.\r\n      \r\n      \r\n      EARY MORNING\r\n      \r\n      We are high and close on Rooster, asleep. Face mottled red, he looks like hell. He emits a\r\n      symphony of respiratory noises as breath fights through layers of phlegm.\r\n      \r\n      Reverse on Mattie, looking down at him.\r\n      \r\n      Wider on the forlorn campsite--Mattie standing, Rooster awkwardly sprawled sleeping,\r\n      LeBoeuf gone.\r\n      \r\n      Close on a bucket: Mattie's hand enters to grab it.\r\n      \r\n      \r\n      EMBANKMENT\r\n      \r\n      We hear rushing water.\r\n      \r\n      Mattie descends, carefully stiff-legged, down a steep slope thick with trees and brush.\r\n      \r\n      She emerges onto the bank of a fast-flowing stream, shallow at this point and loud.\r\n      \r\n      Mattie takes a couple of steps into the water to dip the bucket. Soft, behind her, we see\r\n      four horses watering at the opposite bank, just downstream.\r\n      \r\n      Mattie stoops to fill the bucket. Turning as she straightens, she sees the four horses.\r\n                                                                                                  88\r\n      \r\n      Surprised, she drops the bucket and stares.\r\n      \r\n      The horses huff and blow in the water. They are not wild--they wear tack--but there is no\r\n      rider in sight, until:\r\n      \r\n      A man straightens and emerges from behind one of the horses. The first thing we notice\r\n      about him is the silhouette of the rifle projecting over one shoulder, slung to the man's\r\n      back with a piece of sash cord.\r\n      \r\n      He looks at something floating by in the stream: Mattie's bucket. He looks up. We jump\r\n      closer:\r\n      \r\n      The man has a black mark on his forehead.\r\n      \r\n      Seeing Mattie, who still gapes at him, he hastily swings his rifle round and trains it on her.\r\n      He takes cautious, splashing steps forward.\r\n      \r\n                                             Chaney\r\n                     Well now I know you. Your name is Mattie. You are little\r\n                     Mattie the bookkeeper. Isn't this something.\r\n      \r\n      He grins, relaxing. He slings the rifle back over his shoulder.\r\n      \r\n                                             Mattie\r\n                     Yes, and I know you, Tom Chaney.\r\n      \r\n                                             Chaney\r\n                     What are you doing here?\r\n      \r\n                                                Mattie\r\n                     I came to fetch water.\r\n      \r\n      Mattie pulls the flour sack from her coat pocket and works carefully at the cord that\r\n      cinches it shut. Chaney watches.\r\n      \r\n                                             Chaney\r\n                     I mean what are you doing here in these mountains?\r\n      \r\n                                               Mattie\r\n                     I have not been formally deputized but I am acting as an\r\n                     agent for Marshal Reuben Cogburn and Judge Parker's court.\r\n      \r\n      Mattie has the cinch loose. She reaches the Colt's Dragoon out of the sack and points it at\r\n      Chaney.\r\n                                                                                              89\r\n      \r\n                    . . . I have come to take you back to Fort Smith.\r\n      \r\n      Chaney looks at the gun. He grins and puts hands on hips.\r\n      \r\n                                            Chaney\r\n                    Well I will not go. How do you like that?\r\n      \r\n                                               Mattie\r\n                    There is a posse of officers up on the hill who will force you\r\n                    to go.\r\n      \r\n                                              Chaney\r\n                    That is interesting news. How many is up there?\r\n      \r\n                                              Mattie\r\n                    Right around fifty. They are all well armed and they mean\r\n                    business. What I want you to do now is come on across the\r\n                    creek and walk in front of me up the hill.\r\n      \r\n                                               Chaney\r\n                    I think I will oblige the officers to come after me.\r\n      \r\n                                                Mattie\r\n                    If you refuse to go I will have to shoot you.\r\n      \r\n                                           Chaney\r\n                    Oh? Then you had better cock your piece.\r\n      \r\n      Mattie gives a dismayed look at the gun and tries to pull the hammer back. It has a heavy\r\n      pull: she struggles, using two thumbs.\r\n      \r\n      Chaney watches, smiling.\r\n      \r\n                    . . . All the way back til it locks.\r\n      \r\n                                                 Mattie\r\n                    I know how to do it.\r\n      \r\n      She pulls the hammer back further and we hear it notch. She looks up.\r\n      \r\n                    . . . You will not go with me?\r\n      \r\n                                                 Chaney\r\n                    I think not. It is just the other way around. You are going\r\n                                                                                               90\r\n                      with me. I will--\r\n      \r\n      Mattie fires.\r\n      \r\n      Chaney, shocked, takes a staggering step back.\r\n      \r\n      Mattie stumbles and falls back under the recoil, into the stream but careful to hold the gun\r\n      high and dry. She awkwardly reclaims her footing and retrains the gun. Chaney is looking\r\n      down at his bleeding side.\r\n      \r\n                                               Chaney\r\n                      I did not think you would do it.\r\n      \r\n                                                Mattie\r\n                      What do you think now?\r\n      \r\n                                                Chaney\r\n                      One of my short ribs is broken. It hurts jiggers every breath\r\n                      I take.\r\n      \r\n                                                Mattie\r\n                      You killed my father when he was trying to help you. I have\r\n                      one of the gold pieces you took from him. Now give me the\r\n                      other.\r\n      \r\n      She is struck by a worrying thought. She hastily recocks the gun.\r\n      \r\n                                                Chaney\r\n                      I regret that shooting. Mr. Ross was decent to me but he\r\n                      ought not to have meddled in my business.\r\n      \r\n      Crashing from the brush up the hill, and a voice:\r\n      \r\n                                               Rooster\r\n                      Mattie!\r\n      \r\n                                             Mattie\r\n                      I am down here! Chaney is taken into custody!\r\n      \r\n                                               Chaney\r\n                      I was drinking and I was mad through and through. Nothing\r\n                      has gone right for me.\r\n      \r\n      There is yelling from the other bank now too.\r\n                                                                                               91\r\n                                                Mattie\r\n                     No, you are just a piece of trash, that is all.\r\n      \r\n                                              Chaney\r\n                     Everything is against me. Now I am shot by a child.\r\n      \r\n      He sloshes suddenly forward, water kicking up before him.\r\n      \r\n                                                 Mattie\r\n                     Stop!\r\n      \r\n      She squeezes the trigger, but the gun dry fires.\r\n      \r\n      Chaney grabs the gun and flings it away, then holds on to Mattie and slaps her.\r\n      \r\n                                          Mattie\r\n                     Help me! Down here! Hurry up!\r\n      \r\n      Two men burst through the brush from Chaney's side of the river. One is in woolly chaps\r\n      --Lucky Ned Pepper. The other is taller and dressed almost formally in a linen suit and\r\n      string tie and a bear coat. Both men bear Winchester repeating rifles.\r\n      \r\n      Chaney is dragging Mattie to their bank, slapping at her along the way.\r\n      \r\n      Rooster emerges from his side of the riverbank carrying a side arm.\r\n      \r\n      The men exchange fire.\r\n      \r\n                                           Lucky Ned\r\n                                          (to Chaney)\r\n                     Take them horses you got and move!\r\n      \r\n      He grabs Mattie from Chaney and keeps her between himself and the far bank as he fires\r\n      again.\r\n      \r\n      One hand to his bleeding side, Chaney lunges for the horses' leads.\r\n      \r\n      Rooster has retreated back to the tree cover, as has the well dressed man on our side.\r\n      Intermittent gunshots and the panicked neighing of horses. Lucky Ned falls back into the\r\n      trees with Mattie and starts pulling her up the steep hill.\r\n      \r\n      Chaney follows pulling the string of horses. He is breathing hard and blood stains the front\r\n      of his shirt.\r\n                                                                                                   92\r\n                                            Lucky Ned\r\n                                            (to Chaney)\r\n                     Get on up that hill! Don't you stop.\r\n      \r\n      He twists Mattie around to face him and we see him clearly for the first time. Part of his\r\n      upper lip and three of his front teeth are missing.\r\n      \r\n                     . . . Who all is down there?\r\n      \r\n                                             Mattie\r\n                     Marshal Cogburn and fifty more officers.\r\n      \r\n      Lucky Ned throws Mattie to the ground. He puts a muddy boot on her neck.\r\n      \r\n                                             Lucky Ned\r\n                     Tell me another lie and I will stove your head in!\r\n      \r\n      Mattie manages to choke out:\r\n      \r\n                                                  Mattie\r\n                     Just the marshal.\r\n      \r\n                                          Lucky Ned\r\n                     Cogburn! Do you hear me?\r\n      \r\n      Silence.\r\n      \r\n                     . . . You answer me, Rooster! I will kill this girl! You know\r\n                     I will do it!\r\n      \r\n                                           Rooster's Voice\r\n                     The girl is nothing to me! She is a runaway from Arkansas!\r\n      \r\n                                            Lucky Ned\r\n                     That is very well! Do you advise me to kill her?\r\n      \r\n                                         Rooster's Voice\r\n                     Do what you think is best, Ned! She is nothing to me but a\r\n                     lost child!\r\n      \r\n      A short beat, through which we hear only the rush of riverwater. Then, Rooster's voice\r\n      again:\r\n      \r\n                     . . . Think it over first.\r\n                                                                                               93\r\n                                              Lucky Ned\r\n                     I have already thought it over! You get mounted double fast!\r\n                     If I see you riding over that bald ridge to the northwest I will\r\n                     spare the girl. You have five minutes!\r\n      \r\n      He breaks open his rifle and starts to reload.\r\n      \r\n                                              Rooster\r\n                     I will need more than five minutes!\r\n      \r\n                                            Lucky Ned\r\n                     I will not give you more time.\r\n      \r\n                                               Rooster\r\n                     There will be a party of marshals in here soon, Ned! Let me\r\n                     have Chaney and the girl and I will mislead them for six\r\n                     hours!\r\n      \r\n                                           Lucky Ned\r\n                     Too thin, Rooster! Too thin! Your five minutes is running!\r\n                     No more talk!\r\n      \r\n      He pulls Mattie to her feet. Rooster's voice trails away:\r\n      \r\n                                          Rooster's Voice\r\n                     I am leaving but you must give me time!\r\n      \r\n      Lucky Ned gives Mattie a rough push.\r\n      \r\n                                              Lucky Ned\r\n                     Up that hill!\r\n      \r\n      Mattie advances, Lucky Ned giving periodic shoves from behind.\r\n      \r\n      A stout young man with a shotgun leaps out from behind a slab of limestone in front of\r\n      them. He has a round face and idiot eyes.\r\n      \r\n      He makes loud turkey-gobbling noises at Mattie.\r\n      \r\n      Though Mattie is startled Lucky Ned does not immediately react, but he does finally tire of\r\n      the turkey noises:\r\n      \r\n                                              Lucky Ned\r\n                     Quiet there!\r\n                                                                                             94\r\n      The idiot makes a pig-squealing sound in acknowledgment and then falls quiet, loping\r\n      alongside Mattie and Lucky Ned.\r\n      \r\n                                              Mattie\r\n                    You will not shoot me.\r\n      \r\n      Lucky Ned is grim:\r\n      \r\n                                            Lucky Ned\r\n                    I will do what I have to do.\r\n      \r\n      They are ascending out of the trees onto a bare rock ledge not quite at the crest of the\r\n      mountain. The rock floor is uneven and broken by fissures and holes. A cave-like setback\r\n      at the far end of the rock shelf is half-curtained with a hide. A rough camp.\r\n      \r\n      A cookfire burns on the open rock. Two coffeepots warm leaning against the inside of the\r\n      fire's piled-stone perimeter. A skillet holds bacon.\r\n      \r\n      A man squats at the fire, holding a piece of bacon, turned to watch Lucky Ned and Mattie's\r\n      approach. He wears a filthy Union army uniform with officer's boards. His mouth is an 0\r\n      of surprise.\r\n      \r\n                                             Mattie\r\n                    Can I have some of that bacon?\r\n      \r\n                                          Lucky Ned\r\n                    Help yourself. Have some of the coffee.\r\n      \r\n                                              Mattie\r\n                    I do not drink coffee. I am fourteen.\r\n      \r\n                                          Lucky Ned\r\n                    We do not have buttermilk. And we do not have bread. We\r\n                    are poorly supplied. What are you doing here?\r\n      \r\n      Tom Chaney has reached the rock ledge and he charges Mattie with a yell.\r\n      \r\n                                             Chaney\r\n                    I will wring your scrawny neck!\r\n      \r\n      Lucky Ned knocks him aside.\r\n      \r\n                                             Lucky Ned\r\n                    Let that go! Farrell, see to his wound. What happened?\r\n                    What are you doing here?\r\n                                                                                                95\r\n      \r\n                                               Mattie\r\n                    I will tell you what and you will see that I am in the right.\r\n                    Tom Chaney there shot my father to death in Fort Smith and\r\n                    robbed him of two gold pieces and stole his mare. Her name\r\n                    is Judy but I did not see her down at the river. I was\r\n                    informed Rooster Cogburn had grit and I hired him out to\r\n                    find the murderer. A few minutes ago I came upon Chaney\r\n                    watering the horses. He would not be taken in charge and I\r\n                    shot him. If I had killed him I would not be now in this fix.\r\n                    My revolver misfired.\r\n      \r\n                                              Lucky Ned\r\n                    They will do it. It will embarrass you every time. Most girls\r\n                    like to play pretties, but you like guns do you?\r\n      \r\n                                                Mattie\r\n                    I do not care a thing in the world about guns. If I did I would\r\n                    have one that worked.\r\n      \r\n                                             Chaney\r\n                    I was shot from ambush, Ned. The horses was blowing and\r\n                    making noise. It was that officer that got me.\r\n      \r\n                                             Mattie\r\n                    How can you sit there and tell such a big story?\r\n      \r\n      Chaney, squatting with his shirt pulled up for the ex-soldier to work on his wound, now\r\n      rises.\r\n      \r\n                                               Chaney\r\n                    That pit is a hundred feet deep and I will throw you into it\r\n                    and leave you to scream and rot! How do you like that?\r\n      \r\n                                             Mattie\r\n                    No you won't. This man will not let you have your way. He\r\n                    is your boss and you must do as he tells you.\r\n      \r\n      Chaney turns to Lucky Ned who has a spyglass to his eye, scanning a ridge across the\r\n      river.\r\n      \r\n                                               Chaney\r\n                    Five minutes is well up!\r\n      \r\n      Lucky Ned speaks quietly, without lowering the glass:\r\n                                                                                             96\r\n      \r\n                                               Lucky Ned\r\n                     I will give him a little more time.\r\n      \r\n      From somewhere in the woods below we hear the idiot's gobbling noises.\r\n      \r\n                                               Chaney\r\n                     How much more?\r\n      \r\n                                             Lucky Ned\r\n                     Til I think he has had enough.\r\n      \r\n      The voice of the well dressed man floats up from the woods:\r\n      \r\n                                        Well Dressed Man\r\n                     He is gone, Ned! I can see nothing! We had best make a\r\n                     move!\r\n      \r\n                                             Lucky Ned\r\n                     Hold fast a while there, Doctor!\r\n      \r\n      Mattie looks at Chaney moaning in pain as the ex-soldier works on his side.\r\n      \r\n                                             Mattie\r\n                     Why doesn't the Doctor do that?\r\n      \r\n      Lucky Ned replies absently, still gazing out:\r\n      \r\n                                            Lucky Ned\r\n                     He is not a medical doctor. Was that Rooster waylaid us\r\n                     night before last?\r\n      \r\n                                             Mattie\r\n                     It was Marshal Cogburn and myself.\r\n      \r\n                                           Lucky Ned\r\n                     Yourself, eh? You and Cogburn, quite the posse.\r\n      \r\n      He sees something and hastily raises the glass.\r\n      \r\n      A horseman is ascending the treeless ridge across the river with a riderless horse--Little\r\n      Blackie--in tow. At the top he pauses and turns, and draws a revolver from his saddle and\r\n      points it skyward. We see the gun kick and breathe gunsmoke. A second later we hear the\r\n      shot.\r\n                                                                                            97\r\n      Lucky Ned lowers the glass and takes a gun and shoots skyward. He raises the glass\r\n      again.\r\n      \r\n      The horseman turns away and proceeds on over the crest. He is gone.\r\n      \r\n      Lucky Ned turns to Mattie. He comes and squats at the fire.\r\n      \r\n                                          Lucky Ned\r\n                    Your friend is gone. You are alone.\r\n      \r\n      The well dressed man and the idiot trudge up from the woods onto the rock ledge.\r\n      \r\n      The man in the dirty uniform continues to perform crude field surgery on Chaney, digging\r\n      into his side with a knife to extract the bullet. As Chaney moans the idiot makes calf-\r\n      bawling noises in imitation.\r\n      \r\n                                    Well Dressed Man\r\n                    We must move, Ned.\r\n      \r\n                                          Lucky Ned\r\n                    You are too nervous, Doctor. It will be hours before he is\r\n                    back with help.\r\n      \r\n      Lucky Ned turns back to Mattie.\r\n      \r\n                    . . . What happened to Quincy, and The Kid?\r\n      \r\n                                               Mattie\r\n                    They are both dead. I was in the very middle of it. It was a\r\n                    terrible thing to see. Do you need a good lawyer?\r\n      \r\n                                            Lucky Ned\r\n                    I need a good judge. What about Coke Hayes--the old\r\n                    fellow shot off his horse?\r\n      \r\n                                            Mattie\r\n                    Dead as well. His depredations have come to an end.\r\n      \r\n                                           Lucky Ned\r\n                    Poor Coke. He rode back for me. Coke Hayes had spine,\r\n                    and could keep his wits in a tight spot. Dead now, but he\r\n                    should have been dead ten times afore now. Your friend\r\n                    Rooster does not collect many prisoners.\r\n                                                                                                98\r\n                                              Mattie\r\n                     He is not my friend. He has abandoned me to a congress of\r\n                     louts.\r\n      \r\n                                           Lucky Ned\r\n                     You do not varnish your opinions.\r\n      \r\n                                        Well Dressed Man\r\n                     Are we staying here for chat?\r\n      \r\n      The idiot is still bawling. Chaney grabs a stone and flings it at him and the idiot scampers\r\n      back, making goat noises. Chaney grabs, moaning, at the wound aggravated by this fresh\r\n      exertion.\r\n      \r\n      The man in officer's boards laughs.\r\n      \r\n                                               Soldier\r\n                     Do an owl, Harold!\r\n      \r\n                                                Idiot\r\n                     Hoo! Hoo! Hoo!\r\n      \r\n                                              Chaney\r\n                     Let us cut up the winnings from the Katie Flyer.\r\n      \r\n      Lucky Ned straightens from the fire and begins to collect his meager belongings. The\r\n      other men follow suit.\r\n      \r\n                                             Lucky Ned\r\n                     There will be time for that at The Old Place.\r\n      \r\n                                               Chaney\r\n                     I will saddle the grey.\r\n      \r\n                                             Lucky Ned\r\n                     I have other plans for you.\r\n      \r\n                                            Chaney\r\n                     Must I double-mount with the Doctor?\r\n      \r\n                                          Well Dressed Man\r\n                     No!\r\n      \r\n                                             Lucky Ned\r\n                     No, it will be too chancy with two men up if it comes to a\r\n                                                                                              99\r\n                    race. You will wait here with the girl. When we reach Ma's house I will\r\n                    send Carroll back with a fresh mount. You will be out by\r\n                    dark and we will wait for you at The Old Place.\r\n      \r\n                                               Chaney\r\n                    I don't like that. Let me ride with you, Ned, just out of here\r\n                    anyway.\r\n      \r\n                                          Lucky Ned\r\n                    No. We are short a horse. It can't be helped.\r\n      \r\n                                           Chaney\r\n                    Marshals will come swarming.\r\n      \r\n                                           Lucky Ned\r\n                    Hours, if they come here at all. They will guess we are all\r\n                    gone.\r\n      \r\n                                              Mattie\r\n                    I am not staying here by myself with Tom Chaney.\r\n      \r\n                                            Lucky Ned\r\n                    That is the way I will have it.\r\n      \r\n                                            Mattie\r\n                    He will kill me. You have heard him say it. He has killed\r\n                    my father and now you will let him kill me.\r\n      \r\n                                           Lucky Ned\r\n                    He will do no such thing. Tom, you know the crossing at\r\n                    Cypress Forks, near the log meetinghouse? When you are\r\n                    mounted you will take the girl there and leave her. Do you\r\n                    understand that, Tom? If any harm comes to this child you\r\n                    do not get paid.\r\n      \r\n      Chaney stares at Lucky Ned. His gaze then swings to the idiot.\r\n      \r\n                                             Chaney\r\n                    Harold, let me ride up with you.\r\n      \r\n                                               Idiot\r\n                    Baaaaa! Baaaaa!\r\n      \r\n                                               Chaney\r\n                    Farrel, I will pay you fifty dollars out of my winnings! I am\r\n                                                                                            100\r\n                       not heavy!\r\n      \r\n                                                Soldier\r\n                       Ha ha! Do the calf again, Harold!\r\n      \r\n      The men, clanking with gear, cross the rock ledge and descend into the woods.\r\n      \r\n      In the quiet, Chaney is disconsolate.\r\n      \r\n                                                   Chaney\r\n                       Everything is against me.\r\n      \r\n                                                Mattie\r\n                       You have no reason to whine. If you act as the bandit chief\r\n                       instructed, and no harm comes to me, you will get your\r\n                       winnings at The Old Place.\r\n      \r\n      We faintly hear the rest of his party mount up and gallop off. Chaney drops heavily before\r\n      the fire to sit staring.\r\n      \r\n                                                Chaney\r\n                       They will not wait for me at The Old Place. Lucky Ned has\r\n                       left me, knowing I am sure to be caught when I leave on\r\n                       foot.\r\n      \r\n                                                   Mattie\r\n                       He is sending a mount.\r\n      \r\n                                               Chaney\r\n                       That was a story. Keep still now. I must think over my\r\n                       position and how I may improve it.\r\n      \r\n      A silent beat.\r\n      \r\n                                                Mattie\r\n                       Where is the second California gold piece?\r\n      \r\n      Chaney continues to stare silently into the fire.\r\n      \r\n                                              Mattie\r\n                       What have you done with Papa's mare?\r\n      \r\n                                                  Chaney\r\n                       Keep still, you little busybody.\r\n                                                                                                101\r\n      More brooding silence.\r\n      \r\n                                                 Mattie\r\n                     Are you thinking about The Old Place? If you will let me\r\n                     go, I will swear to it in an affidavit and once you are brought\r\n                     to justice it may go easier on you.\r\n      \r\n      Chaney rises, glaring at her.\r\n      \r\n                                                 Chaney\r\n                     I tell you I can do better than that. I do not intend to be\r\n                     caught. I need no affidavit.\r\n      \r\n      He is striding toward her. She backs toward the ledge.\r\n      \r\n                     . . . All I need is your silence. And I will have it.\r\n      \r\n      Without breaking stride he plows into her, good hand raised to catch her by the throat.\r\n      \r\n      She tumbles backward, Chaney on top of her sweating and snarling.\r\n      \r\n                     . . . Your father was a busybody like you. There are always\r\n                     people who will tell you what's right.\r\n      \r\n      On her back Mattie struggles, but Chaney, straddling her, has her pinned. His good hand is\r\n      still on her throat. She claws at it.\r\n      \r\n      He swats her with his free hand. Her clawing stops.\r\n      \r\n      Chaney is wincing from the swing of his own arm. As he leans over her his opened wound\r\n      dribbles blood onto Mattie along with his sweat.\r\n      \r\n                     . . . In honesty, I do not regret shooting him. He thought\r\n                     Tom Chaney was small. Lucky Ned thinks the same. And\r\n                     you would give me an affidavit.\r\n      \r\n      He reaches back awkwardly toward his calf with his bad hand, groaning with the stretch.\r\n      We hear the schlick of steel and his hand reappears holding a knife taken from a leg sheath.\r\n      \r\n                     . . . You are all against me. Everything is against me.\r\n      \r\n      He pushes against the underside of Mattie's chin, stretching her neck.\r\n      \r\n      Her eyes roll down in their sockets to watch as Chaney regrips the knife and lowers it to\r\n      her throat, his knuckles whitening with tension.\r\n                                                                                                102\r\n      \r\n                     . . . But here at least I have matters in hand, and once I have\r\n                     done for you--\r\n      \r\n      Whack--a rifle stock swings into frame, connecting with Chaney's head. His head snaps\r\n      to one side and then lolls back as he slowly straightens, ropey drool and blood pouring\r\n      from his mouth. He sways briefly and then collapses onto Mattie.\r\n      \r\n      A hand enters to pull him off. Mattie blearily props herself on her elbows.\r\n      \r\n      LeBoeuf is panting and sweating from his climb. He gazes down at Chaney. Once he has\r\n      breath:\r\n      \r\n                                             LeBoeuf\r\n                     Sho that ish Chelmthford. Shtrange to be sho closhe at lasht.\r\n      \r\n                                                Mattie\r\n                     How is it you are here?\r\n      \r\n      LeBoeuf's look breaks from Chaney. He pulls his pipe from his pocket and lights it.\r\n      \r\n                                             LeBoeuf\r\n                     I heard the shotsh and went down to the river. . .\r\n      \r\n      He crosses the rock ledge.\r\n      \r\n                     . . . Cogburn outlined a plan. Hizh part, I fear, izh rash.\r\n                     (reacts to hole) But that izh a pit there! Mind your footing.\r\n      \r\n      He skirts the large hole and reaches the shelf's far lip and gazes out. Before him is a steep\r\n      drop-off. We see the very crowns of near pines and then, four hundred yards away, the\r\n      land flattening to an open meadow.\r\n      \r\n      Mattie, also gazing out, comes up beside LeBoeuf.\r\n      \r\n                                                Mattie\r\n                     A plan?\r\n      \r\n      LeBoeuf points with his pipe.\r\n      \r\n                                            LeBoeuf\r\n                     He returnzh for Lucky Ned.\r\n      \r\n      Lucky Ned, the Parmalees, and the Doctor are just entering the low meadow, riding away.\r\n      As they do so Rooster enters at the far side, facing. He draws one of his navy sixes as he\r\n                                                                                           103\r\n      advances.\r\n      \r\n                                                  Mattie\r\n                      One against four. It is ill advised.\r\n      \r\n      Leboeuf shrugs.\r\n      \r\n                                             LeBoeuf\r\n                      He would not be dishuaded.\r\n      \r\n      He and Mattie both watch as, below, the parties advance on each other at a walk. Eighty\r\n      yards separating them, they halt.\r\n      \r\n      \r\n      THE MEADOW\r\n      \r\n      Rooster and Lucky Ned eye each other. After a beat:\r\n      \r\n                                             Lucky Ned\r\n                      Well, Rooster, will you give us the road?\r\n      \r\n                                                  Idiot\r\n                      Moo! Moo!\r\n      \r\n                                           Rooster\r\n                      Hello, Ned. How many men are with the girl?\r\n      \r\n                                              Lucky Ned\r\n                      Just Chaney. Our agreement is in force: she was in excellent\r\n                      health when last I saw her.\r\n      \r\n      Rooster nods.\r\n      \r\n      A beat.\r\n      \r\n                                               Rooster\r\n                      Farrel, I want you and your brother to stand clear. You as\r\n                      well, Doctor. I have no interest in you today.\r\n      \r\n                                              Lucky Ned\r\n                      What is your intention, Rooster? Do you think one on four is\r\n                      a dogfall?\r\n      \r\n                                                Rooster\r\n                      I mean to kill you in one minute, Ned. Or see you hanged in\r\n                                                                                                104\r\n                     Fort Smith at Judge Parker's convenience. Which will you\r\n                     have?\r\n      \r\n      Ned Pepper laughs.\r\n      \r\n                                               Lucky Ned\r\n                     I call that bold talk for a one-eyed fat man!\r\n      \r\n                                                 Idiot\r\n                     Koo koo roo! Blawk!\r\n      \r\n                                              Rooster\r\n                     Fill your hand, you son of a bitch!\r\n      \r\n      He puts the reins in his teeth, grabs his other revolver with the hand now free, and spurs his\r\n      horse.\r\n      \r\n      \r\n      ROCK LEDGE\r\n      \r\n      Mattie watches him charge.\r\n      \r\n      The facing four charge to meet him.\r\n      \r\n                                            Mattie\r\n                     Shoot them, Mr. LeBoeuf!\r\n      \r\n                                             LeBoeuf\r\n                     Too far, moving too fasht.\r\n      \r\n      Over the distant laughter of the idiot, the crackle of gunfire commences.\r\n      \r\n      \r\n      THE MEADOW\r\n      \r\n      Rooster turns his head to either side as he fires, bringing his good eye into play.\r\n      \r\n      The idiot is gaily waving a revolver over his head, not firing, squawking like a chicken as\r\n      he charges.\r\n      \r\n      A shot from Rooster kills him and swipes him neatly off his horse.\r\n      \r\n      Farrel Parmalee has a shotgun. It roars.\r\n      \r\n      Shot peppers Rooster. He returns fire.\r\n                                                                                                105\r\n      \r\n      Farrel Parmalee's horse is hit. It stumbles, and Farrel is dashed forward, snapping his\r\n      neck.\r\n      \r\n      The Doctor Indian-rides past, sliding down and hooking an ankle on his saddle so that he\r\n      may ride in the cover of his horse's body. He makes for the treeline on the far side of the\r\n      meadow.\r\n      \r\n      Rooster and Lucky Ned are charging each other, both firing.\r\n      \r\n      They pass each other--both still mounted--but Rooster's horse has been hit and it falls,\r\n      pinning Rooster's leg. His guns are gone, lost in the fall.\r\n      \r\n      Rooster, bleeding from sprayed shot in neck, face, and shoulder, struggles and unpins his\r\n      leg.\r\n      \r\n      \r\n      ROCK LEDGE\r\n      \r\n      LeBoeuf sits cross-legged and brings the butt of his Sharp's carbine to rest against his\r\n      injured shoulder. He nudges the gunstock back and forth, looking for the anchor that will\r\n      cause him the least pain. He cocks his head to sight, puffing pipesmoke.\r\n      \r\n      \r\n      MEADOW\r\n      \r\n      Lucky Ned is reining his horse around with his left hand. His right arm dangles. He walks\r\n      his horse toward Rooster, who is getting to his feet.\r\n      \r\n                                            Lucky Ned\r\n                     Well Rooster, I am shot to pieces. It seems neither of us is to\r\n                     see Judge Parker.\r\n      \r\n      He drops the reins to reach out a gun with his one working arm.\r\n      \r\n      \r\n      ROCK LEDGE\r\n      \r\n      LeBoeuf, sighting.\r\n      \r\n                                              LeBoeuf\r\n                     Oh lord.\r\n      \r\n      He squeezes the trigger.\r\n                                                                                               106\r\n      He screams as the gun roars and bucks back into his shoulder.\r\n      \r\n      \r\n      THE MEADOW\r\n      \r\n      Rooster is facing Lucky Ned.\r\n      \r\n      Lucky Ned raises his gun at Rooster and--is shot in the chest.\r\n      \r\n      As we hear the weakly distant guncrack Ned flops backward, slides halfway down one side\r\n      of the saddle, and dangles, briefly, foot tangled in a stirrup, horse standing unperturbed.\r\n      \r\n      Then, he drops.\r\n      \r\n      \r\n      ROCK LEDGE\r\n      \r\n      Mattie whoops as LeBoeuf groans.\r\n      \r\n                                             Mattie\r\n                     Some bully shot! Four hundred yards, at least!\r\n      \r\n      LeBoeuf sets the rifle down and gropes at his shoulder.\r\n      \r\n                                              LeBoeuf\r\n                     I am afraid I have--\r\n      \r\n      A rock is brought down on his head by Tom Chaney.\r\n      \r\n      Mattie screams.\r\n      \r\n      LeBoeuf has collapsed and is motionless. Chaney drops the rock and stoops for the rifle.\r\n      \r\n      Mattie is already dragging it away. She grabs it up.\r\n      \r\n                                               Mattie\r\n                     Stand up, Tom Chaney!\r\n      \r\n      Chaney stands nearly straight--as much as his injuries will allow, and--\r\n      \r\n      Boom!--the blast catches Chaney in the chest and he is blown back off the ledge, looking\r\n      surprised. He falls to oblivion.\r\n      \r\n      But the carbine recoil pushes Mattie stumbling back and this, with the bad footing at the lip\r\n      of the pit behind her, sends her falling.\r\n                                                                                                107\r\n      \r\n      \r\n      PIT\r\n      \r\n      Mattie is tumbling. She bounces down a very steep slope, disturbed earth tumbling with\r\n      her, protruding roots and slender upgrowing foliage slapping at her on her descent.\r\n      \r\n      As she descends more or less feet-first something snags an ankle and her inertia sends her\r\n      upper body on down past the pinned leg. She jerks to a halt head-downmost on the steep\r\n      slope.\r\n      \r\n      The patter of falling dirt subsides. Silence. Heavy breathing.\r\n      \r\n      Mattie, lying face-up, does a painful half sit-up to look around.\r\n      \r\n      Above her, her left foot is snarled through some roots. Well beyond, very high, weak light\r\n      defines the mouth of the pit.\r\n      \r\n      Using her elbows she pivots, scooting her upper body uphill so that she is no longer below\r\n      her foot. She reaches the cuff of her pants on the trapped leg and pulls it up to expose the\r\n      shin.\r\n      \r\n      A splinter of broken bone has punctured the skin.\r\n      \r\n      She pulls the cuff back down.\r\n      \r\n      She stretches to slip fingers between her boot and the roots in which it is fouled. She just\r\n      manages to work in two fingers; in wrenching around, the root has cinched tight. She tugs\r\n      feebly at the root, which shows no signs of give.\r\n      \r\n      She looks back up.\r\n      \r\n      The small hole of weak daylight, dust drifting up toward it.\r\n      \r\n                                            Mattie\r\n                     Mr. LeBoeuf! Are you alive!\r\n      \r\n      No answer.\r\n      \r\n                     . . . Mr. LeBoeuf!\r\n      \r\n      Arms tiring, she lays back again against earth. She looks around.\r\n      \r\n      Partway round the pit, just at her level, something difficult to discern in the semi-dark: two\r\n      mirroring shapes, close to each other: is it the soles of a pair of boots?\r\n                                                                                                   108\r\n      \r\n      Mattie squints. She props herself partway up.\r\n      \r\n      Higher view: they are boots--worn by a corpse--stretching away from us, foreshortened.\r\n      The man's skull has been partly shattered by the protruding rock against which it rests.\r\n      \r\n      Mattie surveys the body. Her attention is caught by something:\r\n      \r\n      The skeletal remains are still clothed and there seems to be something held by a bandolier\r\n      strapped across the chest, over the body's decomposing blue shirt but beneath a tattered\r\n      vest. A sheath is just visible high on the strap, near the corpse's shoulder. The butt-end of\r\n      a knife juts out.\r\n      \r\n      Mattie stretches, reaching.\r\n      \r\n      She can just get to a boot.\r\n      \r\n      She pulls.\r\n      \r\n      The man's remains seem to be fairly light. They drag across earth, raising dust, tending to\r\n      slide away with the grade of the pit.\r\n      \r\n      Mattie reels the body in, careful not to let go and lose it down the hill. She pulls shoe,\r\n      pants cuff, pants knee, belt. The bandolier is close.\r\n      \r\n      Her fingers curl around shirt, and pull.\r\n      \r\n      The shirt's buttons softly pop and fiber dust drifts up as the fabric falls to pieces. Rib cage\r\n      is exposed beneath.\r\n      \r\n      Mattie hastily reaches and curls fingers around ribs. She pulls. She is about to get the\r\n      knife when--\r\n      \r\n      A glistening something inside the rib cage--guts?--starts to slowly move. But it can't be\r\n      guts: it is gliding, coiling, under its own power.\r\n      \r\n      A faint rattle.\r\n      \r\n      Mattie screams as the ball of waking snakes quickens. One snake starts to slowly emerge,\r\n      and she bats the body away.\r\n      \r\n      She pushes and kicks with her free leg, as much as her pinned attitude will allow. The\r\n      body, coming to pieces, slides dustily down into the dark. It disappears. Fiber and bone\r\n      dust float up toward us. We hear rattles.\r\n                                                                                              109\r\n      Mattie hastily reaches for the root that pins her and in a panic pulls, looking back\r\n      toward the body. The root holds fast.\r\n      \r\n      A snake is sluggishly and sinuously weaving up the earth toward her. She muscles her\r\n      body upward so that once again her pinned leg is bottom-most.\r\n      \r\n                                                Mattie\r\n                     Mr. LeBoeuf!\r\n      \r\n      Another snake is behind the first. . . several more behind that.\r\n      \r\n      As the snakes advance to the level of her pinned leg Mattie freezes. The first snake\r\n      continues climbing, weaving up the slope alongside Mattie's body. She watches it come\r\n      on, its blunted head with its flicking tongue inches from her face. The head passes, the\r\n      body goes coiling by.\r\n      \r\n      Another snake undulates onto her pinned leg.\r\n      \r\n                                           Rooster's Voice\r\n                     Are you there?\r\n      \r\n      Careful to keep still, eyes on the advancing snakes:\r\n      \r\n                                                Mattie\r\n                     I am here!\r\n      \r\n      More snakes climb onto her.\r\n      \r\n                                        Rooster's Voice\r\n                     Can you clamber out?\r\n      \r\n                                                Mattie\r\n                     I cannot!\r\n      \r\n      A large snake is winding onto her shoulder. She gingerly places a hand for it to coil onto;\r\n      it does; she holds it at arms length and gently shakes it off.\r\n      \r\n                     . . . There are snakes!\r\n      \r\n                                               Rooster\r\n                     Awake?\r\n      \r\n                                                Mattie\r\n                     Yes!\r\n                                                                                              110\r\n      Rooster appears in the mouth of the pit. He has a rope wrapped round his waist and he\r\n      starts to descend, half walking, half hopping against the pit wall.\r\n      \r\n      Mattie winces and looks down at one hand.\r\n      \r\n      A small snake wrapped round her wrist has its fangs in the meat of the hand.\r\n      \r\n                                                 Mattie\r\n                     Ahh!\r\n      \r\n                                                 Rooster\r\n                     What is that?\r\n      \r\n      She flaps her hand and the snake plops off.\r\n      \r\n                                                 Mattie\r\n                     I am bit!\r\n      \r\n      BAM!--a burst of orange as Rooster, descended to the level of the lead snakes, starts firing\r\n      his revolver.\r\n      \r\n      BAM! BAM! More orange lightning flashes.\r\n      \r\n      Lively rattling.\r\n      \r\n      The pit fills with roiling gunsmoke.\r\n      \r\n      Rooster starts to stomp as well as fire. He kicks the more sluggish specimens toward the\r\n      bottom of the pit.\r\n      \r\n      He reaches Mattie and takes out a knife.\r\n      \r\n                                            Mattie\r\n                     Does Mr. LeBoeuf survive?\r\n      \r\n                                             Rooster\r\n                     He does--even a blow to the head could silence him for only\r\n                     a few short minutes. Where are you bit?\r\n      \r\n      She shows her hand and he makes two slices in the flesh and squeezes out blood. As he\r\n      does so:\r\n      \r\n                     . . . He is in mild distress, having swallowed a good piece of\r\n                     his pipestem. Can you move?\r\n                                                                                                111\r\n      \r\n                                              Mattie\r\n                     My foot is pinned and leg broken.\r\n      \r\n      Rooster stoops with the knife and one slice frees the booted foot. He wraps one arm\r\n      around Mattie's waist and tips his head back and bellows:\r\n      \r\n                                                Rooster\r\n                     I have her! Up with us!\r\n      \r\n      The rope tautens and starts pulling, Rooster helping with his feet.\r\n      \r\n      \r\n      THE LEDGE\r\n      \r\n      Little Blackie, led by a wobbly LeBoeuf, finishes pulling Rooster and Mattie from the pit.\r\n      \r\n      Rooster is already unwrapping the rope from his waist and talking to LeBoeuf as he and\r\n      Mattie emerge:\r\n      \r\n                                               Rooster\r\n                     I will send help for you as soon as I can. Don't wander off.\r\n      \r\n                                                 Mattie\r\n                     We are not leaving him!\r\n      \r\n      Rooster heaves her up onto the back of Little Blackie, LeBoeuf helping though blood still\r\n      flows down one side of his face.\r\n      \r\n                                               Rooster\r\n                     I must get you to a doctor, sis, or you are not going to make\r\n                     it. (to LeBoeuf) The girl is snakebit. We are off.\r\n      \r\n      He swings up behind her and nods down to LeBoeuf.\r\n      \r\n                     . . . I am in your debt for that shot, pard.\r\n      \r\n                                            LeBoeuf\r\n                     Never doubt the Texash Ranger.\r\n      \r\n      Rooster reins the horse around and spurs it. LeBouef shouts after:\r\n      \r\n                     . . . Ever shtalwart!\r\n      \r\n      The horse takes to the steep slope reluctantly, with stiff legs, Rooster kicking it on. Tree\r\n                                                                                                112\r\n      branches slap at him and take his hat. His face, already peppered with shot, gets new\r\n      scratches.\r\n      \r\n      \r\n      THE MEADOW\r\n      \r\n      Mattie is woozy. As Little Blackie crosses the field at full gallop Mattie looks blearily at\r\n      the littering bodies of horses and men.\r\n      \r\n      Next to Lucky Ned's body his horse, saddled and riderless, swings its head to watch as\r\n      Rooster and Mattie pass.\r\n      \r\n      Mattie's eyes are closing.\r\n      \r\n      \r\n      LATE DAY\r\n      \r\n      Mattie's eyes half-open.\r\n      \r\n      Little Blackie plunges on, through a rough road in woods, but slower now, his mouth\r\n      foaming.\r\n      \r\n                                               Rooster\r\n                     Come on, you!\r\n      \r\n                                              Mattie\r\n                     We must stop. Little Blackie is played out.\r\n      \r\n      Horrible noises are indeed coming from the horse, but Rooster is grim:\r\n      \r\n                                               Rooster\r\n                     We have miles yet.\r\n      \r\n      He leaves off whipping the horse and takes out his knife. He leans back and slashes at the\r\n      horse's whithers. Little Blackie surges.\r\n      \r\n      Mattie screams.\r\n      \r\n                                                Mattie\r\n                     No!\r\n      \r\n      A locked-down shot as horse and riders enter at a gallop and recede.\r\n      \r\n      \r\n      NIGHT\r\n                                                                                                113\r\n      \r\n      It has started to snow.\r\n      \r\n      Mattie is flushed and soaked with sweat.\r\n      \r\n      The horse is laboring for breath.\r\n      \r\n      Rooster gives inarticulate curses as he kicks it on.\r\n      \r\n      Mattie looks ahead:\r\n      \r\n      Barely visible in the moonlight a man mounted bareback rides on ahead. A sash cord\r\n      holds a rifle to his back.\r\n      \r\n      He recedes, outpacing us, disappearing into the darkness and the falling snow.\r\n      \r\n                                                 Mattie\r\n                     He is getting away.\r\n      \r\n                                                Rooster\r\n                     Who is getting away?\r\n      \r\n                                                 Mattie\r\n                     Chaney.\r\n      \r\n                                                Rooster\r\n                     Hold on, sis.\r\n      \r\n      Mattie is falling. It is unclear why.\r\n      \r\n      Her legs squeeze the horses flanks.\r\n      \r\n      Her hand tightens on the horses mane.\r\n      \r\n      Rooster's arm reaches around to hold her.\r\n      \r\n      Little Blackie is giving out, going to his knees and then all the way down.\r\n      \r\n      Rooster hangs on to Mattie as the horse sinks. He pulls her clear, lays her on the ground,\r\n      and then steps away from her, taking out a gun.\r\n      \r\n      The horrible noises coming from the horse end with a gunshot. Rooster reenters to pick up\r\n      Mattie but she screams at him and claws at his face, opening fresh gashes.\r\n      \r\n      He ducks his head as best he can to avoid the claws but that is the extent of his reaction.\r\n                                                                                                   114\r\n      \r\n                                            Rooster\r\n                     Put your arms around my neck, I will carry.\r\n      \r\n      He presents his back and she relents, clasping her arms. He rises with a pained wheeze and\r\n      he starts jogging with Mattie piggie-back.\r\n      \r\n      Bouncing at his shoulder, she twists to look back.\r\n      \r\n      In the dark, the darker shape of the dead horse, growing smaller.\r\n      \r\n      Mattie turns forward again, eyes drooping.\r\n      \r\n      \r\n      LATER\r\n      \r\n      Rooster is loudly wheezing as he carries Mattie before him now, his jog slowed to an\r\n      unsteady walk. Her eyes are opening again.\r\n      \r\n      They are now on a proper dirt road. Rooster staggers around a turn and does a barely\r\n      controlled stumble to his knees, and then sits heavily back, Mattie in his lap.\r\n      \r\n      Up ahead is the front porch of Bagby's store, the building dark.\r\n      \r\n      Rooster sits gasping.\r\n      \r\n      Mattie's voice is thick:\r\n      \r\n                                                Mattie\r\n                     Where are we?\r\n      \r\n      Rooster takes out his gun, weakly raises his arm, and fires into the air. He sits panting.\r\n      \r\n                                               Rooster\r\n                      I have grown old.\r\n      \r\n      The door of the distant store opens and someone emerges, holding a lamp, peering out into\r\n      the dark.\r\n      \r\n      FADE OUT\r\n      \r\n      \r\n      TRAIN\r\n      \r\n      We are looking into the window of a moving train. Looking out past us is a thin forty-\r\n                                                                                               115\r\n      year-old woman.\r\n      \r\n      Reflected in the window is a sizable railyard and then, as the train slows, a station.\r\n      Reading backward in the mirror of the window is the station stop: MEMPHIS.\r\n      \r\n      We hear the voice, familiar from the opening of the movie, of the grown Mattie Ross:\r\n      \r\n                                             Voice-Over\r\n                     A quarter of a century is a long time.\r\n      \r\n      \r\n      TRAIN DOOR\r\n      \r\n      As the train eases to a stop the woman, Mattie, steps down. One sleeve of her dress is\r\n      pinned up.\r\n      \r\n                                               Voice-Over\r\n                     I had written a letter of thanks to Marshal Cogburn, with an\r\n                     invitation to visit, along with the fifty dollars I owed him.\r\n                     In his reply he promised he would try to call next time he\r\n                     came to Fort Smith with prisoners. Brief though his note\r\n                     was, it was rife with misspellings.\r\n      \r\n      Mattie goes along the platform, holding a small bag in one hand and, crushed against its\r\n      handle, a flier.\r\n      \r\n                     . . . The marshal did not visit, nor did he communicate\r\n                     further. I had not been conscious during his leavetaking: by\r\n                     the time Bagby rode us to Fort Smith my hand had turned\r\n                     black. I was not awake when I lost the arm. I later learned\r\n                     that Mr. LeBoeuf recovered fully. When the marshals found\r\n                     him he was searching the pines below the rock ledge for\r\n                     Tom Chaney's body. He found it and took it back to San\r\n                     Saba for the reward. It was well earned.\r\n      \r\n      In the scene, Mattie calls peremptorily to a young boy on the platform:\r\n      \r\n                                                Mattie\r\n                     Boy.\r\n      \r\n      She shows him the flier:\r\n      \r\n                                 The Cole Younger and Frank James\r\n                                          Wild West Show\r\n                                 Riding! Shooting! Lariat \"Tricks\" !\r\n                                                                                               116\r\n                      Don't Leave the Ladies and the Little Ones Behind!\r\n                                         Also Featuring\r\n                                       Rooster Cogburn!\r\n                            He will amaze you with his skill and dash!\r\n                                     Memphis Fairgrounds\r\n                                          July 18, 1908\r\n      \r\n      The boy looks up and points.\r\n      \r\n      Mattie crosses the platform and further along, descends to the railyard.\r\n      \r\n      The cars of the Wild West Show are parked along a siding. They display gaudily painted\r\n      scenes of men on rearing horses firing six-guns, of conestoga wagons, war-bonneted\r\n      Indians, bandana-wearing bad men. Three featured performers have their own vignetted\r\n      scenes, each depicted as a youngish man engaged in Wild West hell-raising, each with his\r\n      name painted beneath: Cole Younger, Frank James, and (unrecognizable but for the\r\n      eyepatch) Rooster Cogburn. Below Rooster's name is the sublegend \"He rode with\r\n      Quantrill! He rode for Parker!\"\r\n      \r\n      Around the rail cars cowboys--and some Indians--mill, more wobegone than their painted\r\n      representations.\r\n      \r\n      Mattie asks someone along the way for directions and is pointed toward the rear of the\r\n      train.\r\n      \r\n                                              Voice-Over\r\n                     Little Frank had sent me the flier. He had chaffed me\r\n                     through the years over the fact that I had not married, calling\r\n                     the marshal my \"secret sweetheart,\" and he sent a note with\r\n                     the advertisement: \"Skill and dash--it's not too late,\r\n                     Mattie!\" Little Frank and Victoria have always liked jokes\r\n                     and they are all right in their place. I have never held it\r\n                     against either one of them for leaving me at home to look\r\n                     after Mama, and they know it, for I have told them.\r\n      \r\n      Mattie speaks to two men who sit on the rear platform of the rear car. They are old men\r\n      drinking Coca-Colas. One doffs his hat and rises when Mattie addresses the pair; the other\r\n      stays seated, slurping from his bottle.\r\n      \r\n                                            Standing Man\r\n                     Yes'm, I am Cole Younger. This is Mr. James. It grieves\r\n                     me to tell you that you have missed Rooster. He passed\r\n                     away, what, three days ago, when the show was in Jonesboro\r\n                     Arkansas. Buried him there in the confederate cemetery.\r\n                     Reuben had a complaint what he referred to as \"night hoss\"\r\n                                                                                         117\r\n                     and I believe the warm weather was too much for him. We\r\n                     had some lively times. What was the nature of your\r\n                     acquaintance?\r\n      \r\n                                              Mattie\r\n                     I knew the marshal long ago. We too had lively times.\r\n                     Thank you, Mr. Younger.\r\n      \r\n      As she turns to go she addresses Frank James, who has been staring at her:\r\n      \r\n                     . . . Keep your seat, trash.\r\n      \r\n      \r\n      A BOXCAR\r\n      \r\n      Elsewhere; later.\r\n      \r\n      Men load in a muddy pine coffin. Chalked on the coffin top:\r\n      \r\n                                              Cogburn\r\n                                             Yell County\r\n                                            Hold at station\r\n      \r\n                                              Voice-Over\r\n                     I had the marshal's body removed to Dardanelle. The\r\n                     railroads do not like to carry disinterred bodies in the\r\n                     summertime, but I had my way.\r\n      \r\n      The boxcar door is slammed and the train starts to move off.\r\n      \r\n                     . . . People love to talk. They love to slander you if you\r\n                     have any substance. They said, Well, she hardly knew that\r\n                     man. . .\r\n      \r\n      \r\n      CEMETERY\r\n      \r\n      Mattie stands with a prayer book. There is a light, lazy fall of snow.\r\n      \r\n                                                 Voice-Over\r\n                     . . . It's just like a cranky old maid to pull a stunt like that,\r\n                     burying him in the family plot. They say I love nothing but\r\n                     money and the Presbyterian Church and that is why I never\r\n                     married. It is true that I love my church and my bank. I will\r\n                     tell you a secret. Those same people talk mighty nice when\r\n                                                                                    118\r\n                     they come in for a crop loan or a mortgage extension. I care\r\n                     nothing for what they say. I would have married a baboon if\r\n                     I had wanted and fetched it its newspaper and slippers every\r\n                     morning but I never had time to fool with it.\r\n      \r\n      She leaves, striding purposefully past the headstone.\r\n      \r\n      We show the headstone and, beyond, her receding figure.\r\n      \r\n                                          Reuben Cogburn\r\n                                              1835-1908\r\n                                          A Resolute Officer\r\n                                          Of Parker's Court\r\n      \r\n      Her figure softens as it recedes.\r\n      \r\n                                              Voice-Over\r\n                     Anyway, a woman with brains and a frank tongue and one\r\n                     sleeve pinned up and an invalid mother to care for is not\r\n                     widely sought after. I never did see Mr. LeBoeuf again but\r\n                     if he is yet alive I would be pleased to hear from him. I\r\n                     judge he would be in his seventies now and nearer eighty\r\n                     than seventy. I expect some of the starch has gone out of\r\n                     that cowlick. Time just gets away from us.\r\n\r\n\r\n\r\n                                              THE END\r\n\r\n\n\n\n\nTrue Grit\nWriters :   Joel Cohen  Ethan Coen  Charles Portis\nGenres :   Adventure  Drama  Western\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:38.673352"}