{"title": "True Romance", "film_link": "/Movie Scripts/True Romance Script.html", "script_link": "/scripts/True-Romance.html", "info_raw": "\n\nTrue Romance Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.88 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Quentin Tarantino\nGenres  Action  Crime  Romance  Thriller\n\nRead \"True Romance\" Script\n\n\n", "script": "\n\n        TRUE ROMANCE\n\n\n\n\n\nBODY { background-color: \"#FFFFFF\"; font-family: Courier New, Helvetica, sans-serif; font-size:10.0pt }\n\nDIV { position:absolute; left:5px; top:20px; width:734px; height:500px;  }\n\n#loc { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.2in; margin-bottom:0in;\nmargin-left:0.8in;text-transform:uppercase } \n\n#slug {\n\tfont-family:Courier New;\n\tfont-weight: normal;\n\tmargin-top:0in;\n\tmargin-right:1.2in;\n\tmargin-bottom:0in;\n\tmargin-left:0.8in;\n\ttext-transform:uppercase;\n<b>\t\n</b><b>} \n</b>\n#act { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.8in; margin-bottom:0in;\nmargin-left:0.8in } \n\n\n#speaker { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.in; margin-bottom:0in;\nmargin-left:2.8in;text-transform:uppercase }\n\n#spkdir { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:2.7in; margin-bottom:0in;\nmargin-left:2.2in }\n\n#dia { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:2.6in; margin-bottom:0in;\nmargin-left:1.6in }\n\n#pg { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:1.75in; margin-bottom:0in;\nmargin-left:6.5in }\n\n#right { font-family:Courier New; font-weight: normal;margin-top:0in; margin-right:0.75in; margin-bottom:0in;\nmargin-left:5.0in }\n\n\n\n\n\n\n\n\n\n\nTrue Romance\nby Quentin Tarantino\n\nWhen you are tired of relationships, try a romance.\n\n\n\nINT. BAR - NIGHT\n\nA smoky cocktail bar downtown Detroit.\n\nCLARENCE WORLEY, a young hipster hepcat, is trying to pick up an older lady named LUCY. She isn't bothered by him, in fact, she's alittle charmed. But, you can tell, that she isn't going to leave her barstool.\n\nCLARENCE\nIn \"Jailhouse Rock\" he's everything rockabilly's about. I mean he is \nrockabilly: mean, surly, nasty, rude. In that movie he couldn't give a fuck \nabout anything except rockin' and rollin', livin' fast, dyin' young, and \nleaving a good-looking corpse. I love that scene where after he's made it \nbig he's throwing a big cocktail party, and all these highbrows are there, \nand he's singing, \"Baby You're So Square... Baby, I Don't Care\". Now, they \ngot him dressed like a dick. He's wearing these stupid-lookin' pants, this \nhorrible sweater. Elvis ain't no sweater boy. I even think they got him \nwearin' penny loafers. Despite all that shit, all the highbrows at the \nparty, big house, the stupid clothes, he's still a rude-lookin' \nmotherfucker. I'd watch that hillbilly and I'd want to be him so bad. Elvis \nlooked good. I'm no fag, but Elvis was good-lookin'. He was fuckin' \nprettier than most women. I always said if I ever had to fuck a guy... I \nmean had too 'cause my life depended on it... I'd fuck Elvis.\n\nLucy takes a drag from her cigarette.\n\nLUCY\nI'd fuck Elvis.\n\nCLARENCE\nReally?\n\nLUCY\nWhen he was alive. I wouldn't fuck him now.\n\nCLARENCE\nI don't blame you.\n(they laugh)\nSo we'd both fuck Elvis. It's nice to meet people with common interests, \nisn't it?\n\nLucy laughs.\n\nCLARENCE\nWell, enough about the King, how 'bout you?\n\nLUCY\nHow 'bout me what?\n\nCLARENCE\nHow 'bout you go to the movies with me tonight?\n\nLUCY\nWhat are we gonna see?\n\nCLARENCE\nA Donny Chiba triple feature. \"The Streetfighter\", \"Return of the \nStreetfighter\", and \"Sister Streetfighter\".\n\nLUCY\nWho's Sonny Chiba?\n\nCLARENCE\nHe is, bar none, the greatest actor working in martial arts movies ever.\n\nLUCY\n(not believing this)\nYou wanna take me to a kung fu movie?\n\nCLARENCE\n(holding up three fingers)\nThree kung fu movies.\n\nLucy takes a drag from her cigarette.\n\nLUCY\n(laughing)\nI don't think so, not my cup of tea.\n\n\nINT. DINGY HOTEL ROOM - DAY\n\nThe sounds of the city flow in through an open window: car horns, gun shots and violence. Paint is peeling off the walls and the once green carpet is stained black.\n\nOn the bed nearby is a huge open suitcase filled with clear plastic bags of cocaine. Shotguns and pistols have been dropped carelessly around the suitcase. On the far end of the room, against the wall, is a TV. \"Bewitched\" is playing.\n\nAt the opposite end of the room, by the front, is a table. DREXL SPIVEY and FLOYD DIXON sit around. Cocaine is on the table as well as little plastic bags and a weigher. Floyd is black, Drexl is a white boy, though you wouldn't know it listen to him.\n\nDREXL\nNigger, get outta my face with that bullshit.\n\nFLOYD\nNaw man, I don't be eatin' that shit.\n\nDREXL\nThat's bullshit.\n\nBIG DON WATTS, a stout, mean-looking black man who's older than Drexl and Floyd. Walks through the door carrying hamburgers and french fries in two greasy brown-paper bags.\n\nFLOYD\nNaw man, that's some serious shit.\n\nDREXL\nNigger, you lie like a big dog.\n\nBIG D\nWhat the fuck are you talkin' about?\n\nDREXL\nFloyd say he don't be eatin' pussy.\n\nBIG D\nShit, any nigger say he don't eat pussy is lyin' his ass off.\n\nDREXL\nI heard that.\n\nFLOYD\nHold on a second, Big D. You sayin' you eat pussy?\n\nBIG D\nNigger, I eat everything. I eat pussy. I eat the butt. I eat every \nmotherfuckin' thang.\n\nDREXL\nPreach on, Big D.\n\nFLOYD\nLook here. If I ever did eat some pussy - I would never eat any pussy - \nbut, if I did eat some pussy, I sure as hell wouldn't tell no goddamn body. \nI'd be ashamed as a motherfucker.\n\nBIG D\nShit! Nigger you smoke enough sherm your dumb ass'll do a lot a crazy ass \nthings. So you won't eat pussy? Motherfucker, you be up there suckin' \nniggers' dicks.\n\nDREXL\nHeard that.\n\nDrexl and Big D bump fists.\n\nFLOYD\nYeah, that's right, laugh. It's so funny, oh it's so funny.\n(he takes a hit off of a joint)\nThere used to be a time when sisters didn't know shit about gettin' their \npussy licked. Then the sixties came an' they started fuckin' around with \nwhite boys. And white boys are freaks for that shit -\n\nDREXL\n- Because it's good!\n\nFLOYD\nThen, after a while sisters use to gettin' their little pussy eat. And \nbecause you white boys had to make pigs out of yourselves, you fucked it up \nfor every nigger in the world everywhere.\n\nBIG D\nDrexl. On behalf of me and all the brothers who aren't here, I'd like to \nexpress our gratitude -\n\nDrexl and Big D bust up.\n\nFLOYD\nGo on pussy-eaters... laugh. You look like you be eatin' pussy. You got \npussy-eatin' mugs. Now if a nigger wants to get his dick sucked he's got to \ndo a bunch of fucked-up shit.\n\nBIG D\nSo you do eat pussy!\n\nFLOYD\nNaw naw!\n\nBIG D\nYou don't like it, but you eat that shit.\n(to Drexl)\nHe eats it.\n\nDREXL\nDamn skippy. He like it, too.\n\nBIG D\n(mock English accent)\nMe thinketh he doth protest too much.\n\nFLOYD\nWell fuck you guys then! You guys are fucked up!\n\nDREXL\nWhy you trippin'? We jus' fuckin' with ya. But I wanna ask you a question. \nYou with some fine bitch, I mean a brick shithouse bitch - you're with \nJayne Kennedy. You're with Jayne Kennedy and you say \"Bitch, suck my dick!\" \nand then Jayne Kennedy says, \"First things first, nigger, I ain't suckin' \nshit till you bring your ass over here and lick my bush!\" Now, what do you \nsay?\n\nFLOYD\nI tell Jayne Kennedy, \"Suck my dick or I'll beat your ass!\"\n\nBIG D\nNigger, get real. You touch Jayne Kennedy she'll have you ass in Wayne \nCounty so fast -\n\nDREXL\nNigger, back off, you ain't beatin' shit. Now what would you do.\n\nFLOYD\nI'd say fuck it!\n\nDrexl and Big D get up from the table disgusted and walk away, leaving Floyd sitting all alone.\n\nBig D sits on the bed, his back turned to Floyd, watching \"Bewitched\".\n\nFLOYD\n(yelling after them)\nAin't no man have to eat pussy!\n\nBIG D\n(not even looking)\nTake that shit somewhere else.\n\nDREXL\n(marching back)\nYou tell Jayne Kennedy to fuck it?\n\nFLOYD\nIf it came down to who eats who, damn skippy.\n\nDREXL\nWith that terrible mug of yours if Jayne Kennedy told you to eat her pussy, \nkiss her ass, lick her feet, chow on her shit, and suck her dog's dick, \nnigger, you'd aim to please.\n\nBIG D\n(glued on TV)\nI'm hip.\n\nDREXL\nIn fact, I'm gonna show you what I mean with a little demonstration. Big D, \ntoss me that shotgun.\n\nWithout turning away from \"Bewitched\" he picks up the shotgun and tosses it to Drexl.\n\nDREXL\n(to Floyd)\nAll right, check this out.\n(referring to shotgun)\nNow, pretend this is Jayne Kennedy. And you're you.\n\nThen, in a blink, he points the shotgun at Floyd and blows him away.\n\nBig D leaps off the bed and spins toward Drexl.\n\nDrexl, waiting for him, fires from across the room.\n\nThe blast hits the big man in the right arm and shoulder, spinning him around.\n\nDrexl makes a beeline for his victim and fires again.\n\nBig D is hit with a blast, full in the back. He slams into the wall and drops.\n\nDrexl collects the suitcase full of cocaine and leaves. As he gets to the front door he surveys the carnage, spits and walks out.\n\n\nEXT. CLIFF'S MOVING CAR - MORNING\n\nA big white Chevy Nova is driving down the road with a sunrise sky as a backdrop. The song \"Little Bitty Tear\" is heard a capella.\n\n\nINT. CLIFF'S MOVING CAR - MORNING\n\nCliff  Worley is driving his car home from work, singing this song gently to the sunrise. He's a forty-five-years-old ex-cop, at present a security guard. In between singing he takes sips from a cup of take-out coffee. He's dressed in a security guard uniform.\n\n\nEXT. TRAILER PARK - MORNING\n\nCliff's Nova pulls in as he continues crooning. He pulls up to his trailer to see something that stops him short.\n\n\nCliff's POV Through windshield\n\nClarence and a nice-looking YOUNG WOMAN are watching for him in front of his trailer.\n\n\nCLOSEUP - CLIFF\n\nUpon seeing Clarence, a little bitty tear rolls down Cliff's cheek.\n\nBACK TO:\n\n\nCLIFF'S POV\n\nClarence and the Young Woman walk over to the car. Clarence sticks his face through the driver's side window.\n\nCLARENCE\nGood Morning, Daddy. Long time no see.\n\n\nINT. TRAILER HOME - MORNING\n\nAll three enter the trailer home.\n\nCLIFF\nExcuse the place, I haven't been entertaining company as of late. Sorry if \nI'm acting a little dense, but you're the last person in the world I \nexpected to see this morning.\n\nClarence and the Young Girl walk into the living room.\n\nCLARENCE\nYeah, well, tha's OK, Daddy, I tend to have that effect on people. I'm \ndyin' on thirst, you got anything to drink?\n\nHe moves past Cliff and heads straight for his refridgerator.\n\nCLIFF\nI think there's a Seven-Up in there.\n\nCLARENCE\n(rumaging around the fridge)\nAnything stronger?\n(pause)\nOh, probably not. Beer? You can drink beer, can't you?\n\nCLIFF\nI can, but I don't.\n\nCLARENCE\n(closing the fridge)\nThat's about all I ever eat.\n\nCliff looks at the Girl. She smiles sweetly at him.\n\nCLIFF\n(to Girl)\nI'm sorry... I'm his father.\n\nYOUNG GIRL\n(sticking her hand out)\nThat's OK, I'm his wife.\n(shaking his hand vigorously)\nAlabama Worley, pleased to meetcha.\n\nShe is really pumping his arm, just like a used-car salesman. However, that's where the similarities end; Alabama's totally sincere.\n\nClarence steps back into the living room, holding a bunch of little ceramic fruit magnets in his hand. He throws his other arm around Alabama.\n\nCLARENCE\nOh yeah, we got married.\n(referring to the magnets)\nYou still have these.\n(to Alabama)\nThis isn't a complete set; when I was five I swallowed the pomegranate one. \nI never shit it out, so I guess it's still there. Loverdoll, why don't you \nbe a sport and go get us some beer. I want some beer.\n(to Cliff)\nDo you want some beer? Well, if you want some it's here.\n\nHe hands her some money and his car keys.\n\nCLARENCE\nGo to the liquor store -\n(to Cliff)\nWhere is there a liquor store around here?\n\nCLIFF\nUh, yeah... there's a party store down 54th.\n\nCLARENCE\n(to Alabama)\nGet a six-pack of something imported. It's hard to tell you what to get \n'cause different places have different things. If they got Fosters, get \nthat, if not, ask the guy at the thing what the strongest imported beer he \nhas. Look, since you're making a beer run, would you mind too terribly if \nyou did a foot run as well. I'm fuckin' starvin' to death. Are you hungry \ntoo?\n\nALABAMA\nI'm pretty hungry. When I went to the store I was gonna get some \nDing-Dongs.\n\nCLARENCE\nWell, fuck that shit, we'll get some real food. What would taste good.\n(to Cliff)\nWhat do you think would taste good?\n\nCLIFF\nI'm really not very -\n\nCLARENCE\nYou know what would taste good? Chicken. I haven't had chicken in a while. \nChicken would really hit the spot about now. Chicken and beer, definitly, \nabsolutely, without a doubt.\n(to Cliff)\nWhere's a good chicken place around here?\n\nCLIFF\nI really don't know.\n\nCLARENCE\nYou don't know the chicken places around where you live?\n(to Alabama)\nAsk the guy at the place where a chicken place is.\n\nHe gives her some more money.\n\nCLARENCE\nThis should cover it, Auggie-Doggie.\n\nALABAMA\nOkee-dokee, Doggie-Daddy.\n\nShe opens the door and starts out. Clarence turns to his dad as the door shuts.\n\nCLARENCE\nIsn't she the sweetest goddamned girl you ever saw in your whole life? Is \nshe a four alarm fire, or what?\n\nCLIFF\nShe seems very nice.\n\nCLARENCE\nDaddy. Nice isn't the word. Nice is an insult. She's a peach. That's the \nonly word for it, she's a peach. She even tastes like a peach. You can tell \nI'm in love with her. You can tell by my face, can't ya? It's a dead \ngiveaway. It's written all over it. Ya know what? She loves me back. Take a \nseat, Pop, we gotta talk -\n\nCLIFF\nClarence, just shut up, you're giving me a headache! I can't believe how \nmuch like your mother you are. You're your fuckin' mother through and \nthrough. I haven't heard from ya in three years. Then ya show up all of a \nsudden at eight o'clock in the morning. You walk in like a goddamn \nbulldozer... don't get me wrong, I'm happy to see you... just slow it down. \nNow, when did you get married?\n\nCLARENCE\nDaddy, I'm in big fuckin' trouble and I really need your help.\n\nBLACK TITLE CARD: \"HOLLYWOOD\"\n\n\nINT. OUTSIDE OF CASTING DIRECTOR'S OFFICER - DAY\n\nFOUR YOUNG ACTORS are sitting on a couch with sheets of paper in their hands silently mouthing lines. One of the actors is DICK RITCHIE. The casting director, MARY LOUISE RAVENCROFT, steps into the waiting room, clip board in hand.\n\nRAVENCROFT\nDick Ritchie?\n\nDick pops up from the pack.\n\nDICK\nI'm me... I mean, that's me.\n\nRAVENCROFT\nStep inside.\n\n\nINT.  CASTING DIRECTOR'S OFFICE - DAY\n\nShe sits behind a large desk. Her name-plate rests on the desktop. Several posters advertising \"The Return of T.J. Hooker\" hang on the wall.\n\nDick sits in a chair, holding his sheets in his hands.\n\nRAVENCROFT\nWell, the part you're reading for is one of the bad guys. There's Brian and \nMarty. Peter Breck's already been cast as Brian. And you're reading for the \npart of Marty. Now in this scene you're both in a car and Bill Shatner's \nhanging on the hood.  And what you're trying to do is get him off.\n(she picks a up a copy of the script)\nWhenever you're ready.\n\nDICK\n(reading and miming driving)\nWhere'd you come from?\n\nRAVENCROFT\n(reading from the script lifelessly)\nI don't know. He just appeared as magic.\n\nDICK\n(reading from script)\nWell, don't just sit there, shoot him.\n\nShe puts her script down, and smiles at him.\n\nRAVENCROFT\nThat was very good.\n\nDICK\nThank you.\n\nRAVENCROFT\nIf we decided on making him a New York type, could you do that?\n\nDICK\nSure. No problem.\n\nRAVENCROFT\nCould we try it now?\n\nDICK\nAbsolutely.\n\nDick picks up the script and begins, but this time with a Brooklyn accent.\n\nDICK\nWhere'd he come from?\n\nRAVENCROFT\n(monotone, as before)\nI don't know. He just appeared as magic.\n\nDICK\nWell, don't just sit there, shoot him.\n\nRavencroft puts her script down.\n\nRAVENCROFT\nWell, Mr. Ritchie, I'm impressed. You're a very fine actor.\n\nDick smiles.\n\n\nINT. TRAILER HOME - DAY\n\nCliff's completely aghast. He just stares, unable to come to grips with what Clarence has told him. \n\nCLARENCE\nLook, I don't know this is pretty heavy-duty, so if you wanna explode, feel \nfree.\n\nCLIFF\nYou're always making jokes. That's what you do, isn't it? Make jokes. \nMaking jokes is the one thing you're good at, isn't it? But if you make a \njoke about this -\n(raising his voice)\n- I'm gonna go completely out of my fuckin' head!\n\nCliff pauses and collects himself.\n\nCLIFF\nWhat do you want from me?\n\nCLARENCE\nWhat?\n\nCLIFF\nStop acting like an infant. You're here because you want me to help you in \nsome way. What do you need from me? You need money?\n\nCLARENCE\nDo you still have friends on the force?\n\nCLIFF\nYes, I still have friends on the force.\n\nCLARENCE\nCould you find out if they know anythin'? I don't know they know shit about \nus. But I don't wanna think, I wanna know. You could find out for sure \nwhat's goin' on.\n(pause)\nDaddy?\n\nCLIFF\nWhat makes you think I could do that?\n\nCLARENCE\nYou were a cop.\n\nCLIFF\nWhat makes you think I would do that?\n\nCLARENCE\nI'm your son.\n\nCLIFF\nYou got it all worked out, don't you?\n\nCLARENCE\nLook, goddamnit, I never asked you for a goddamn thing! I've tried to make \nyour parental obligation as easy as possible. After Mom divorced you, did I \nask you for anything? When I wouldn't see ya for six months to a year at a \ntime, did you ever get your shit about it? No, it was always \"OK\", \"No \nproblem\", \"You're a busy guy, I understand\". The whole time you were a \ndrunk, did I ever point my finger at you and talk shit? No! Everybody else \ndid. I never did. You see, I know that you're just a bad parent. You're not \nreally very good at it. But I know you love me. I'm basically a pretty \nresourceful guy. If I didn't really need it I wouldn't ask. And if you say \nno, don't worry about it. I'm gone. No problems.\n\nAlabama walks in through the door carrying a shopping bag.\n\nALABAMA\nThe forager's back.\n\nCLARENCE\nThank God. I could eat a horse if you slap enough catsup on it.\n\nALABAMA\nI didn't get any chicken.\n\nCLARENCE\nHow come?\n\nALABAMA\nIt's nine o'clock in the morning. Nothing's open.\n\n\nINT. TRAILER HOME - BEDROOM - DAY\n\nCliff's on the telephone in his bedroom, pacing as he talks. The living room od the trailer can be seen from his doorway, where Clarence and Alabama are horsing around. They giggle and cut up throughout the scene. As Cliff talks, all the noise and hubbub of a police station comes through over the line. He's talking to DETECTIVE WILSON, an old friend of his from the force.\n\nWe see both inside the conversation.\n\nCLIFF\nIt's about that pimp that was shot a couple of days ago, Drexl Spivey.\n\nWILSON\nWhat about him?\n\nCLIFF\nWell, Ted, to tell you the truth, I found out through the grapevine that it \nmight be, and I only said might be, the Drexl Spivey that was responsible \nfor that restaurant break-in on Riverdale. \n\nWILSON\nAre you still working security for Foster & Langley?\n\nCLIFF\nYeah, and the restaurant's on my route. And you know, I stuck my nose in \nfor the company to try to put a stop to some of these break-ins. Now, while \nI have no proof, the name Drexl Spivey kept comin' up Who's case is it?\n\nWILSON\nMcTeague.\n\nCLIFF\nI don't know him. Is he a nice guy? You think he'll help me out?\n\nWILSON\nI don't see why not. When you gonna come round and see my new place?\n\nCLIFF\nYou and Robin moved?\n\nWILSON\nShit, are you behind. Me and Robin got a divorce six months ago. Got myself \na new place - mirrors all over the bedroom, ceiling fans above the bed. \nGuy'd have to look as ugly as King Kong not to get laid in this place. I'm \nserious, a guy'd have to look like a gorilla.\n\nCUT TO:\n\n\nEXT. TRAILER HOME - DAY\n\nClarence and Cliff stand by Clarence's 1965 red Mustang. Alabama's amusing herself by doing cartwheels and handstands in the background.\n\nCLIFF\nThey have nothing. In fact, they think it's drug related.\n\nCLARENCE\nDo tell. Why drug related?\n\nCLIFF\nApparently, Drexl had a big toe stuck in shit like that.\n\nCLARENCE\nNo shit?\n\nCLIFF\nYeah. Drexl had an association with a fella named Blue Lou Boyle. Name mean \nanything to you?\n\nCLARENCE\nNope.\n\nCLIFF\nIf you don't hang around in this circle, no reason it should.\n\nCLARENCE\nWho is he?\n\nCLIFF\nGangster. Drug Dealer. Somebody you don't want on your ass. Look, Clarence, \nthe more I hear about this Drexl fucker, the more I think you did the right \nthing. That guy wasn't just some wild flake.\n\nCLARENCE\nThat's what I've been tellin' ya. The guy was like a mad dog. So the cops \naren't looking for me?\n\nCLIFF\nNaw, until they hear something better they'll assume Drexl and Blue Lou had \na falling out. So, once you leave twon, I wouldn't worry about it.\n\nClarence sticks his hand out to shake. Cliff takes it.\n\nCLARENCE\nThanks a lot, Daddy. You really came through for me.\n\nCLIFF\nI got some money I can give you -\n\nCLARENCE\nKeep it.\n\nCLIFF\nWell, son, I want you to know I hope everything works out with you and \nAlabama. I like her. I think you make a cute couple.\n\nCLARENCE\nWe do make a cute couple, don't we?\n\nCLIFF\nYeah, well, just stay outta trouble. Remeber, you got a wife to think \nabout. Quit fuckin' around.\n(pause)\nI love you son.\n\nThey hug each other,\n\nClarence takes a pice of paper out and puts it into Cliff's hand.\n\nCLARENCE\nThis is Dick's number in Hollywood. We don't know where we'll be, but you \ncan get a hold of me through him.\n\nClarence turns toward Alabama and yells to her.\n\nCLARENCE\nBama, we're outta here. Kiss Pops goodbye,\n\nAlabama runs across from where she was and throws her arms around Cliff and gives him a big smackeroo on the lips. Cliff's a little startled. Alabama's bubbling like a Fresca.\n\nALABAMA\nBye, Daddy! Hope to see you again real soon.\n\nCLARENCE\n(mock anger)\nWhat kind of daughterly smackeroo was that?\n\nALABAMA\nOh, hush up.\n\nThe two get into the Mustang.\n\nCLARENCE\n(to Cliff)\nWe'll send you a postcard as soon as we get to Hollywood.\n\nClarence starts the engine. The convertible roof opens as they talk.\n\nCLIFF\nBama, you take care of that one for me. Keep him out of trouble.\n\nALABAMA\nDon't worry, Daddy, I'm keepin' this fella on a short leash.\n\nClarence, slowly, starts driving away.\n\nCLARENCE\n(to Cliff)\nAs the sun sets slowly in the west we bid a fond farewell to all the \nfriends we've made... and, with a touch of melancholy, we look forward to \nthe time when we will all be together again.\n\nClarence peels out, shooting a shower of gravel up in the air.\n\nAs the Mustang disappears Cliff runs his tongue over his lips.\n\nCLIFF\n\nThe-son-of-a-bitch was right... she does taste like a peach.\n\n\nINT. DICK'S APARTMENT - DAY\n\nDick's apartment is standard issue for a young actor. Things are pretty neat and clean. A nice stereo unit sits on the shelf. A framed picture of a ballet dancer's feet hangs on the wall.\n\nThe phone rings, Dick answers.\n\nDICK\nHi, Dick here.\n\n\nINT. HOTEL SUITE - LAS VEGAS - SUNSET\n\nTop floor, Las Vegas, Nevada hotel room with a huge picture window overlooking the neon-filled strip and the flaming red and orange sunset sky.\n\nClarence paces up and down with the telephone in his hand.\n\nCLARENCE\n(big bopper voice)\nHeeeellllloooo baaaabbbbbyyyy!!!\n\nNote: We intercut both sides of the conversation.\n\nDICK\n(unsure)\nClarence?\n\nCLARENCE\nYou got it.\n\nDICK\nIt's great to hear from you.\n\nCLARENCE\nWell, you're gonna be seein' me shortly.\n\nDICK\nYou comin' to L.A.? When?\n\nCLARENCE\nTomorrow.\n\nDICK\nWhat's up? Why're leavin' Detroit?\n\nClarence sits down on the hotel room bed. Alabama, wearing only a long T-shirt with a big picture of Bullwinkle on it, crawls behind him.\n\nCLARENCE\nWell, there's a story behind all that. I'll tell you when I see you. By the \nway, I won't be alone. I'm bringing my wife with me.\n\nDICK\nGet the fuck outta here!\n\nCLARENCE\nI'm a married man.\n\nDICK\nGet the fuck outta here!\n\nCLARENCE\nBelieve it or not, I actually tricked a girl into falling in love with me. \nI'm not quite sure how I did it. I'd hate to have to do it again. But I did \nit. Wanna say hi to my better half?\n\nBefore Dick can respond Clarence puts Alabama on the phone.\n\nALABAMA\nHi, Dick. I'm Alabama Worley.\n\nDICK\nHello, Alabama.\n\nALABAMA\nI can't wait to meet you. Clarence told me all about you. He said you were \nhis best friend. So, I guess that makes you my best friend, too.\n\nClarence start dictating to her what to say.\n\nCLARENCE\nTell him we gotta go.\n\nALABAMA\nClarence says we gotta be hittin' it.\n\nDICK\nWhat?\n\nCLARENCE\nTell him we'll be hittin' his area some time tomorrow.\n\nALABAMA\nHe said don't go nowhere. We'll be there some time tomorrow.\n\nDICK\nWait a minute - \n\nCLARENCE\nTell him not to eat anything. We're gonna scarf when we get there.\n\nALABAMA\nDon't eat anything.\n\nDICK\nAlabama, could you tell Clar -\n\nCLARENCE\nAsk him if he got the letter.\n\nALABAMA\nDid you get the letter?\n\nDICK\nWhat letter?\n\nALABAMA\n(to Clarence)\nWhat letter?\n\nCLARENCE\nThe letter I sent.\n\nALABAMA\n(to Dick)\nThe letter he sent.\n\nDICK\nClarence sent a letter?\n\nCLARENCE\nHas he gotten his mail today?\n\nALABAMA\nGotten your mail yet?\n\nDICK\nYeah, my room-mate leaves it on the TV.\n\nALABAMA\n(to Clarence)\nYes.\n\nCLARENCE\nHas he looked through it yet?\n\nALABAMA\n(to Dick)\nYa looked through it?\n\nDICK\nNot yet.\n\nALABAMA\n(to Clarence)\nNope.\n\nCLARENCE\nTell him to look through it.\n\nALABAMA\n(to Dick)\nGet it.\n\nDICK\nLet me speak to Clarence.\n\nALABAMA\n(to Clarence)\nHe wants to speak with you.\n\nCLARENCE\nNo time. Gotta go. Just tell him to read the letter, the letter explains \nall. Tell him I love him. And tell him, as of tomorrow, all his money \nproblems are over.\n\nALABAMA\n(to Dick)\nHe can't. We gotta go, but he wants you to read the letter. The letter \nexplains it all. He wants you to know he loves you. And he wants you to \nknow that as of tomorrow, all of your money problems are over.\n\nDICK\nMoney problems?\n\nCLARENCE\nNow tell him goodbye.\n\nALABAMA\nBye-bye.\n\nCLARENCE\nNow hang up.\n\nShe hangs up the phone.\n\n\nINT. DICK'S APARTMENT - DAY\n\nDick hears the click on the other end.\n\nDICK\nHello, hello, Clarence? Clarence's wife?... I mean Alabama... hello?\n\nExtremely confused, Dick jangs up the phone. He goes over to the TV and picks up the day's mail. He goes through it.\n\nBILL: Southern California Gas Company.\n\nBILL: Group W.\n\nBILL: Fossenkemp Photography.\n\nBILL: Columbia Record and Tape Club.\n\nLETTER: It's obviously from Clarence. Addressed to Dick. Dick opens it.\n\n\nEXT. TRAILER - DAY\n\nA lower-middle-class trailer park named Astro World, which has a neon sign in front of it in the shape of a planet. \n\nA big, white Chevy Nova pulls into the park. It parks by a trailer that's slightly less kept up than the others. Cliff gets out of the Chevy. He's drinking out of a fast-food soda cup as he opens the door to his trailer.\n\n\nINT. TRAILER - DAY\n\nHe steps inside the doorway and then, before he knows it, a gun is pressed to his temple and a big hand grabs his shoulder.\n\nGUN CARRIER (DARIO)\nWelcome home, alchy. We're havin' a party.\n\nCliff is roughly shoved into his living room. Waiting for him are four men, standing: VIRGIL, FRANKIE (young Wise-guy) LENNY (an old Wise-guy), and Tooth-pick Vic (a fireplug pitbull type).\n\nSitting in Cliff's recliner is VINCENZO COCCOTTI, the Frank Nitti to Detroid mob leader Blue Lou Boyle.\n\nCliff is knocked to his knees. He looks up and sees the sitting Coccotti. Dario and Lenny pick him up and roughly drop him in a chair.\n\nCOCCOTTI\n(to Frankie)\nTell Tooth-pick Vic to go outside and do you-know-what.\n\nIn Italian Frankie tells Tooth-pick Vic what Coccotti said. He nods and exits.\n\nCliff's chair is moved closer to Coccotti's. Dario stands on one side of Cliff. Frankie and Lenny ransack the trailer. Virgil has a bottle of Chivas Regal in his hand, but he has yet to touch a drop.\n\nCOCCOTTI\nDo you know who I am, Mr. Worley?\n\nCLIFF\nI give up. Who are you?\n\nCOCCOTTI\nI'm the Anti-Christ. You get me in a vendetta kind of mood, you will tell \nthe angels in heaven that you had never seen pure evil so singularly \npersonified as you did in the face of the man who killed you. My name is \nVincenzo Coccotti. I work as a counsel for Mr. Blue Lou Boyle, the man your \nson stole from. I hear you were once a cop so I assume you've heard od us \nbefore. Am I correct?\n\nCLIFF\nI've heard of Blue Lou Boyle.\n\nCOCCOTTI\nI'm glad. Hopefully that will clear up the how-full-of-shit-I-am question \nyou've been asking yourself. Now, we're gonna have a little Q and A, and, \nat the risk of sounding redundant, please make your answers genuine.\n(taking out a pack of Chesterfields)\nWant a Chesterfield?\n\nCLIFF\nNo.\n\nCOCCOTTI\n(as he lights up)\nI have a son of my own. About you boy's age. I can imagine how painful this \nmust be for you. But Clarence and that bitch-whore girlfriend of his \nbrought this all on themselves. And I implore you not to go down the road \nwith 'em. You can always take comfort in the fact that you never had a \nchoice.\n\nCLIFF\nLook, I'd help ya if I could, but I haven't seen Clarence -\n\nBefore Cliff can finish his sentence, Coccotti slams him hard in the nose with his fist.\n\nCOCCOTTI\nSmarts, don't it? Gettin' slammed in the nose fucks you all up. You got \nthat pain shootin' through your brain. Your eyes fill up with water. It \nain't any kind of fun. But what I have to offer you. That's as good as it's \never gonna get, and it won't ever get that good again. We talked to your \nneighbors. They saw a Mustang, a red Mustang, Clarence's red Mustang, \nparked in front of your trailer yesterday. Mr. Worley, have you seen your \nson?\n\nCliff's defeated.\n\nCLIFF\nI've seen him.\n\nCOCCOTTI\nNow I can't be sure of how much of what he told you. So in the chance \nyou're in the dark about some of this, let me shed some light. That whore \nyour boy hangs around with, her pimp is an associate of mine, and I don't \njust mean pimpin', in other affairs he works for me in a courier capacity. \nWell, apparently, that dirty little whore found out when we're gonna do \nsome business, 'cause your son, the cowboy and his flame, came in the room \nblastin' and didn't stop till they were pretty sure everybody was dead.\n\nCLIFF\nWhat are you talkin' about?\n\nCOCCOTTI\nI'm talkin' about a massacre. They snatched my narcotics and hightailed it \noutta there. Wouldda gotten away with it, but your son, fuckhead that he \nis, left his driver's license in a dead guy's hand. A whore hiding in the \ncommode filled in all the blanks.\n\nCLIFF\nI don't believe you.\n\nCOCCOTTI\nThat's of minor importance. But what's of major fuckin' importance is that \nI believe you. Where did they go?\n\nCLIFF\nOn their honeymoon.\n\nCOCCOTTI\nI'm gettin' angry askin' the same question a second time. Where did they \ngo?\n\nCLIFF\nThey didn't tell me.\n\nCoccotti looks at him.\n\nCLIFF\nNow, wait a minute and listen. I haven't seen Clarence in three years. \nYesterday he shows up here with a girl, sayin' he got married. He told me \nhe needed some quick cash for a honeymoon, so he asked if he could borrow \nfive hundred dollars. I wanted to help him out so I wrote out a check. We \nwent to breakfast and that's the last I saw of him. So help me God. They \nnever thought to tell me where they were goin'. And I never thought to ask.\n\nCoccotti looks at him for a long moment. He then gives Virgil a look. Virgil, quick as greased lightning, grabs Cliff's hand and turns it palm up. He then whips out a butterfly knife and slices Cliff's palm open and pours Chivas Regal on the wound. Cliff screams.\n\nCoccotti puffs on a Chesterfield.\n\nTooth-pic Vic returns to the trailer, and reports in Italian that there's nothing in the car.\n\nVirgil walks into the kitchen and gets a dishtowel. Cliff holds his bleeding palm in agony. Virgil hands him the dishtowel. Cliff uses it to wrap up his hand.\n\nCOCCOTTI\nSicilians are great liars. The best in the world. I'm a Sicilian. And my \nold man was the world heavyweight champion of Sicilian liars. And from \ngrowin' up with him I learned the pantomime. Now there are seventeen \ndifferent things a guy can do when he lies to give him away. A guy has \nseventeen pantomimes. A woman's got twenty, but a guy's got seventeen. And \nif you know 'em like ya know your own face, they beat lie detectors to \nhell. What we got here is a little game of show and tell. You don't wanna \nshow me nothin'. But you're tellin' me everything. Now I know you know \nwhere they are. So tell me, before I do some damage you won't walk away \nfrom.\n\nThe awful pain in Cliff's hand is being replaced by the awful pain in his heart. He looks deep into Coccotti's eyes. \n\nCLIFF\nCould I have one of those Chesterfields now?\n\nCOCCOTTI\nSure.\n\nCoccotti leans over and hands him a smoke.\n\nCLIFF\nGot a match?\n\nCliff reaches into his pocket and pulls out a lighter.\n\nCLIFF\nOh, don't bother. I got one.\n(he lights the cigarette)\nSo you're a Sicilian, huh?\n\nCOCCOTTI\n(intensly)\nUh-huh.\n\nCLIFF\nYou know I read a lot. Especially things that have to do with history. I \nfind that shit fascinating. In fact, I don't know if you know this or not, \nSicilians were spawned by niggers.\n\nAll the men stop what they were doing and look at Cliff, except for Tooth-pic Vic who doesn't speak English and so isn't insulted. Coccotti can't believe what he's hearing.\n\nCOCCOTTI\nCome again?\n\nCLIFF\nIt's a fact. Sicilians have nigger blood pumpin' through their hearts. If \nyou don't believe me, look it up. You see, hundreds and hundreds of years \nago the Moors conquered Sicily. And Moors are niggers. Way back then, \nSicilians were like the wops in northern Italy. Blond hair, blue eyes. But, \nonce the Moors moved in there, they changed the whole country. They did so \nmuch fuckin' with the Sicilian women, they changed the blood-line for ever, \nfrom blond hair and blue eyes to black hair and dark skin. I find it \nabsolutely amazing to think that to this day, hundreds of years later, \nSicilians still carry that nigger gene. I'm just quotin' history. It's a \nfact. It's written. Your ancestors were niggers. Your great, great, great, \ngreat, great-grandmother was fucked by a nigger, and had a half-nigger kid. \nThat is a fact. Now tell me, am I lyin'?\n\nCoccotti looks at him for a moment then jumps up, whips out an automatic, grabs hold of Cliff's hair, puts the barrel to his temple, and pumps three bullets through Cliff's head.\n\nHe pushes the body violently aside. Coccotti pauses. Unable to express his feelings and frustrated by the blood in his hands, he simply drops his weapon, and turns to his men.\n\nCOCCOTTI\nI haven't killed anybody since 1974. Goddamn his soul to burn for eternity \nin fuckin' hell for makin' me spill blood on my hands! Go to this \ncomedian's son's apartment and come back with somethin' that tells me where \nthat asshole went so I can wipe this egg off of my face and fix this \nfucked-up family for good.\n\nTooth-pick Vic taps Frankie's shoulder and, in Italianm asks him what that was all about.\n\nLenny, who has been going through Cliff's refridgerator, has found a beer. When he closes the refridgerator door he finds a note held on by a ceramic banana magnet that says: \"Clarence in L.A.: Dick Ritchie (number and address)\".\n\nLENNY\nBoss, get ready to get happy.\n\nTITLE CARD: \"CLARENCE AND ALABAMA HIT L.A.\"\n\n\nINT. DICK'S APARTMENT- MORNING\n\nDick's asleep in a recliner. He's wearing his clothes from the night before. His room-mate FLOYD is lying on the sofa watching TV.\n\nThe sound of our hands knocking on his door wakes Dick up. He shakes the bats out of his belfry, opens the door, and finds the cutest couple in Los Angeles standing in his doorway.\n\nClarence and Alabama immediately start singing \"Hello My Baby\" like the frog in the old Chuck Jones cartoon.\n\nCLARENCE/ALABAMA\nHello my baby,\nHello my honey,\nHello my ragtime gal -\n\nDICK\nHi guys.\n\nAlabama throws her arms around Dick, and gives him a quick kiss. After she breaks, Clarence does the same. Clarence and Alabama walk right past Dick and into his apartment.\n\nCLARENCE\nWow. Neat place.\n\n\nINT. PINK'S HOT-DOG STAND - DAY\n\nThe Pink's employees work like skilled Benihana chefs as they assemble the ultimate masterpiece hot-dog.\n\n\nEXT. PINK'S HOT-DOG STAND - PATIO - DAY\n\nClarence, Alabama, and Dick are sitting at an outdoor table chowing down on chili dogs. Alabama is in the middle of a story.\n\nALABAMA\n... when my mom went into labor, my dad panicked. He never had a kid \nbefore, and crashed the car. Now, picture this: their car's demolished, \ncrowd is starting to gather, my mom is yelling, going into contractions, \nand my dad, who was losing it before, is now completely screaming yellow \nzonkers. Then, out of nowhere, as if from thin air, this big giant bus \nappears, and the bus-driver says, \"Get her in here.\". He forgot all about \nhis route and just drove straight to the hospital. So, because he was such \na nice guy, they wanted to name the baby after him, as a sign of gratitude. \nWell, his name was Waldo, and no matter how grateful they were, even if \nI'da been a boy, they would't call me Waldo. So they asked Waldo where he \nwas from. And, so there you go.\n\nCLARENCE\nAnd here we are.\n\nDICK\nThat's a pretty amazing story.\n\nCLARENCE\nWell, she's a pretty amazing girl. What are women like out here?\n\nDICK\nJust like in Detroit, only skinnier.\n\nCLARENCE\nYou goin' out?\n\nDICK\nWell, for the past couple of years I've been goin' out with girls from my \nacting class.\n\nCLARENCE\nGood for you.\n\nDICK\nWhat's so fuckin' good about it? Actresses are the most fucked-in-the-head \nbunch of women in the world. It's like they gotta pass a test of emotional \ninstability before they can get their SAG card. Oh, guess what? I had a \nreally good reading for \"T.J. Hooker\" the other day.\n\nALABAMA\nYou're gonna be on \"T.J. Hooker\"?\n\nDICK\nKnock wood.\n\nHe knocks the table and then looks at it.\n\nDICK\n... formica. I did real well. I think she liked me.\n\nCLARENCE\nDid you meet Captain Kirk?\n\nDICK\nYou don't meet him in the audition. That comes later. Hope, hope.\n\nALABAMA\n(finishing her hot-dog)\nThat was so good I am gonna have another.\n\nDICK\nYou can't have just one.\n\nAlabama leaves to get another hot-dog. Clarence never takes his eyes off her.\n\nDICK\nHow much of that letter was on the up and up?\n\nCLARENCE\nEvery word of it.\n\nDick sees where Clarence's attention is.\n\nDICK\nYou're really in love, aren't you?\n\nCLARENCE\nFor the very first time in my life.\n(pause)\nDo you know what that's like?\n\nClarence is so intense Dick doesn't know how to answer.\n\nDICK\n(regretfully)\nNo, I don't\n(he looks at Alabama)\nHow did you two meet?\n\nClarence leans back thoughtfully and takes a sip from his Hebrew cream soda.\n\nCLARENCE\nDo you remember The Lyric?\n\n\nINT. THE LYRIC THEATER - NIGHT\n\nSonny Chiba, as \"Streetfighter\" Terry Surki, drives into a group of guys, fists and feet flying and whips ass on the silver screen.\n\nClarence sits, legs over the back of the chair in front of him, nibbling on popcorn, eyes big as sourcers, and a big smile on his face.\n\n\nEXT. THE LYRIC THEATER - NIGHT\n\nA cab pulls up to the outside of The Lyric. The marquee carries the names of the triple feature: \"The Streetfighter\", \"Return of the Streetfighter\" and \"Sister Streetfighter\". Alabama steps out of the taxi cab and walks up to the box office.\n\nA box office girl reading comic looks at her.\n\nALABAMA\nOne please.\n\nBOX OFFICE GIRL\nNinety-nine cents.\n\nALABAMA\nWhich one is on now?\n\nBOX OFFICE GIRL\n\"Return of the Streetfighter\". It's been on about forty-five minutes.\n\n\nINT. THE LYRIC THEATER - LOBBY - NIGHT\n\nAlabama walks into the lobby and goes over to the concession stand. A young usher takes care of her.\n\nALABAMA\nCan I have a medium popcorn? A super-large Mr. Pibb, and a box of Goobers.\n\n\nINT.  THE LYRIC THEATER - NIGHT\n\nIt's still assholes and elbows on the screen with Sonny Chiba taking on all-comers.\n\nAlabama walks through the doors with her bounty of food. She makes a quick scan of the theater. Not many people are there. She makes a beeline for the front whick happens to be Clarence's area of choice. She picks the row of seats just behind Clarence and starts asking her way down it.\n\nClarence turns and sees this beautiful girl all alone moving towards him. He turns his attention back to the screen, trying not to be so obvious.\n\nWhen Alabama gets right behind Clarence, her foot thunks a discarded wine bottle, causing her to trip and spill her popcorn over Clarence.\n\nALABAMA\nOh, look what happened. Oh god, I'm so sorry. Are you OK?\n\nCLARENCE\nYeah. I'm fine. It didn't hurt.\n\nALABAMA\nI'm the clumsiest person in the world.\n\nCLARENCE\n(picking popcorn out of his hair)\nIt's OK. Don't worry about it. Accidents happen.\n\nALABAMA\n(picking popcorn out of his hair)\nWhat a wonderful philosophy. Thanks for being such a sweetheart. You could \nhave been a real dick.\n\nAlabama sits back in her seat to watch the movie.\n\nClarence tries to wipe her out of his mind, which isn't easy, and get back into the movie.\n\nThey both watch the screen for a moment. Then, Alabama leans forward and taps Clarence on the shoulder.\n\nALABAMA\nExcuse me... I hate to bother you again. Would you mind too terribly \nfilling me in on what I missed?\n\nJumping on this opportunity.\n\nCLARENCE\nNot at all. I, this guy here, he's Sonny Chiba.\n\nALABAMA\nThe oriental.\n\nCLARENCE\nThe oriental in black. He's an assasin. Now, at the beginning he was hired \nto kill this guy the cops had. So he got himself arrested. They take him \ninto the police station. And he starts kickin' all the cops' asses. Now, \nwhile keepin' them at bay, he finds the guy he was supposed to kill. Does a \nnumber on him. Kicks the cops' asses some more. Kicks the bars out of the \nwindow. And jumps out into a getaway car that was waiting for him.\n\nALABAMA\nWant some Goobers?\n\nCLARENCE\nThanks a lot.\n\nALABAMA\nI thought Sonny was the good guy.\n\nCLARENCE\nHe ain't so much good guy as he's just a bad motherfucker. Sonny don't be \nbullshittin'. He fucks dudes up for life. Hold on, a fight scene's coming \nup.\n\nThey both watch, eyes wide, as Sonny Chiba kicks asses.\n\n\nTIME CUT:\n\nOn the screen, Sonny Chiba's all jacked up. Dead bodies lie all around him. THE END (in Japanese) flashes on the screen.\n\nThe theater light go up. Alabama's now sitting in the next seat to Clarence. They're both applauding.\n\nALABAMA\nGreat movie. Action-packed!\n\nCLARENCE\nDoes Sonny kick ass or does Sonny kick ass?\n\nALABAMA\nSonny kicks ass.\n\nCLARENCE\nYou shoulda saw the first original uncut version of the \"Streetfighter\". It \nwas the only movie up to that time rated X for violence. But we just saw \nthe R.\n\nALABAMA\nIf that was the R, I'd love to see the X.\n\nCLARENCE\nMy name is Clarence, and what is yours?\n\nALABAMA\nAlabama Whitman. Pleased to meet ya.\n\nCLARENCE\nIs that your real name? Really?\n\nALABAMA\nThat's my real name, really. I got proof. See.\n\nShe shows Clarence her driver's license.\n\nCLARENCE\nWell, cut my legs off and call me Shorty. That's a pretty original moniker \nthere, Alabama. Sounds like a Pam Grier movie.\n(announcer voice)\nShe's a sixteen-calibre kitten, equally equipped for killin' an' lovin'! \nShe carried a sawed-off shotgun in her purse, a black belt around her \nwaist, and the white-hot fire of hate in her eyes! Alabama Whitman is Pam \nGrier! Pray for forgiveness, Rated R... for Ruthless Revenge!\n\n\nEXT. THE LYRIC THEATER - NIGHT\n\nClarence and Alabama are outside the theater. With the marquee lit up in the background they both perform unskilled martial arts moves. Clarence and Alabama break up laughing.\n\nCLARENCE\nWhere's your car? I'll walk you to it.\n\nALABAMA\nI took a cab.\n\nCLARENCE\nYou took a cab to see three kung fu movies?\n\nALABAMA\nSure. Why not?\n\nCLARENCE\nNothing. It's just you're a girl after my own heart.\n\nALABAMA\nWhat time is it?\n\nCLARENCE\n'Bout twelve.\n\nALABAMA\nI suppose you gotta get up early, huh?\n\nCLARENCE\nNo. Not particularly.\n(pause)\nHow come?\n\nALABAMA\nWell, it's just when I see a really good movie I really like to go out and \nget some pie, and talk about it. It's sort of tradition. Do you like to eat \npie after you've seen a good movie?\n\nCLARENCE\nI love to get pie after a movie.\n\nALABAMA\nWould you like to get some pie?\n\nCLARENCE\nI'd love some pie.\n\n\nINT. DENNY'S RESTAURANT - NIGHT\n\nClarence and Alabama are sitting in a booth at an all-night Denny's. It's about 12:40 a.m. Clarence is having a piece of chocolate cream pie and a coke. Alabama's nibbling on a peace of heated apple pie and sipping on a large Tab.\n\nCLARENCE\nWell, enough about the King. How about you?\n\nALABAMA\nHow 'bout me what?\n\nCLARENCE\nTell me about yourself.\n\nALABAMA\nThere's nothing to tell.\n\nCLARENCE\nC'mon. What're ya tryin' to be? The Phantom Lady?\n\nALABAMA\nWhat do you want to know?\n\nCLARENCE\nWell, for starters, what do you do? Where're ya from? What's your favorite \ncolor? Who's your favorite movie star? What kinda music do you like? What \nare your turn-ons and turn-offs? Do you have a fella? What's the story \nbehind you takin' a cab to the most dangerous part of town alone? And, in a \ntheater full of empty seats, why did you sit by me?\n\nAlabama takes a bite of pie, puts down her fork, and looks at Clarence.\n\nALABAMA\nAsk me them again. One by one.\n\nCLARENCE\nWhat do you do?\n\nALABAMA\nI don't remember.\n\nCLARENCE\nWhere are you from.\n\nALABAMA\nMight be from Tallahassee. But I'm not sure yet.\n\nCLARENCE\nWhat's your favorite color?\n\nALABAMA\nI don't remember. But off the top of my head, I'd say black.\n\nCLARENCE\nWhat's your favorite movie star?\n\nALABAMA\nBurt Reynolds.\n\nCLARENCE\nWould you like a bite of my pie?\n\nALABAMA\nYes, I would.\n\nClarence scoops up a piece on his fork and Alabama bites it off.\n\nCLARENCE\nLike it?\n\nALABAMA\nVery much. Now, where were we?\n\nCLARENCE\nWhat kinda music do you like?\n\nALABAMA\nPhil Spector. Girl group stuff. You know, like \"He's a Rebel\".\n\nCLARENCE\nWhat are your turn-ons?\n\nALABAMA\nMickey Rourke, somebody who can appreciate the finer things in life, like \nElvis's voice, good kung fu, and a tasty piece of pie.\n\nCLARENCE\nTurn-offs?\n\nALABAMA\nI'm sure there must be something, but I don't really remember. The only \nthing that comes to mind are Persians.\n\nCLARENCE\nDo you have a fella?\n\nShe looks at Clarence and smiles.\n\nALABAMA\nI'm not sure yet. Ask me again later.\n\nCLARENCE\nWhat's the story behind you takin' a cab to the most dangerous part of town \nalone?\n\nALABAMA\nApparently, I was hit on the head with something really heavy, giving me a \nform of amnesia. When I came to, I didn't know who I was, where I was, or \nwhere I came from. Luckily, I had my driver's license or I wouldn't even \nknow my name. I hoped it would tell me where I lived but it had a \nTallahassee address on it, and I stopped somebody on the street and they \ntold me I was in Detroit. So that was no help. But I did have some money on \nme, so I hopped in a cab until I saw somethin' that looked familiar. For \nsome reason, and don't ask me why, that theater looked familiar. So I told \nhim to stop and I got out.\n\nCLARENCE\nAnd in a theater full of empty seats, why did you sit by me?\n\nALABAMA\nBecause you looked like a nice guy, and I was a little scared. And I sure \ncouldda used a nice guy about that time, so I spilled my popcorn on you.\n\nClarence looks at her closely. He picks up his soda and sucks on the straw until it makes that slurping sound. He puts it aside and stares into her soul.\n\nA smile cracks on her face and develops into a big wide grin.\n\nALABAMA\nAren't you just dazzled by my imagination, lover boy?\n(eats her last piece of pie)\nWhere to next?\n\n\nINT. COMIC BOOK STORE - NIGHT\n\nIt's about 1:30 a.m. Clarence has taken Alabama to where he works. It's a comic book store called Heroes For Sale. Alabama thinks this place is super-cool.\n\nALABAMA\nWow. What a swell place to work.\n\nCLARENCE\nYeah, I got the key, so I come here at night, hang out, read comic books, \nplay music.\n\nALABAMA\nHow long have you worked here?\n\nCLARENCE\nAlmost four years.\n\nALABAMA\nThat's a long time.\n\nCLARENCE\nI'm hip. But you know, I'm comfortable here. It's easy work. I know what \nI'm doing. Everybody who works here is my buddy. I'm friendly with most of \nthe customers. I just hang around and talk about comic books all day.\n\nALABAMA\nDo you get paid a lot?\n\nCLARENCE\nThat's where trouble comes into paradise. But the boss let's you borrow \nsome money if you need it. Wanna see what \"Spiderman\" number one looks \nlike?\n\nALABAMA\nYou bet. How much is that worth?\n\nClarence gets a box off the shelf.\n\nCLARENCE\nFour hundred bucks.\n\nALABAMA\nI didn't even know they had stores that just sold comic books.\n\nCLARENCE\nWell, we sell other things too. Cool stuff. \"Man from U.N.C.L.E.\" Lunch \nboxes. \"Green Hornet\" board games. Shit like that. But comic books are main \nbusiness. There's a lot of collectors around here.\n\nShe holds up a little GI Joe sized action figure of a black policeman.\n\nALABAMA\nWhat's that?\n\nCLARENCE\nThat's a \"Rookies\" doll. George Sanford Brown. We gotta lotta dolls. \nThey're real cool. Did you know they came out with dolls for all the actors \nin \"The Black Hole\"? I always found it funny somewhere there's a kid \nplayin' with a little figure of Earnest Borgnine.\n\nHe pulls a plastic-cased \"Spiderman\" comic form the box.\n\nCLARENCE\n\"Spiderman\", number one. The one that started it all.\n\nClarence shows the comic book to Alabama.\n\nALABAMA\nGod, Spiderman looks different.\n\nCLARENCE\nHe was just born, remember? This is the first one. You know that guy, Dr. \nGene Scott? He said that the story of Spiderman is the story of Christ, \njust disguised. Well, I thought about that even before I heard him say it. \nHold on, let me show you my favorite comic book cover of all time.\n\nHe pulls out another comic.\n\nCLARENCE\n\"Sgt. Fury and His Howling Commandos\". One of the coolest series known to \nman. They're completely worthless. You can get number one for about four \nbucks. But that's one of the cool things about them, they're so cheap.\n(he opens one up)\nJust look at that artwork, will ya. Great stories. Great Characters. Look \nat this one.\n\nWe see the \"Sgt. Fury\" panels.\n\nCLARENCE\nNick's gotten a ring from his sweetheart and he wears it around his neck on \na chain. OK, later in the story he gets into a fight with a Nazi bastard on \na ship. He knocks the guy overboard, but the Kraut grabs ahold of his chain \nand the ring goes overboard too. So, Nick dives into the ocean to get it. \nIsn't that cool?\n\nShe's looking into Clarence's eyes. He turns and meets her gaze.\n\nCLARENCE\nAlabama, I'd like you to have this.\n\nClarence hands her the \"Sgt. Fury and His Howling Commandos\" comic book that he loves so much.\n\n\nINT. CLARENCE'S APARTMENT - BEDROOM - NIGHT\n\nClarence's bedroom is a pop culture explosion. Movie posters, pictures of Elvis, anything you can imagine. The two walk through the door.\n\nALABAMA\nWhat a cool room!\n\nShe runs and does a jumping somersault into his bed.\n\nLater. Alabama's sitting Indian-style going through Clarence's photo album. Clarence is behind her planting little kisses on her neck and shoulders.\n\nALABAMA\nOooooh, you look so cute in your little cowboy outfit. How old were you \nthen?\n\nCLARENCE\nFive.\n\nShe turns the page.\n\nALABAMA\nOh, you look so cute as little Elvis.\n\nCLARENCE\nI finally knew what I wanted when I grew up.\n\n\nLATER - LIVING ROOM\n\nClarence and Alabama slow dance in the middle of his room to Janis Joplin's \"Piece of My Heart\".\n\nCLARENCE\nYou know when you sat behind me?\n\nALABAMA\nAt the movies?\n\nCLARENCE\nUh-huh, I was tryin' to think of somethin' to say to you, then I thought, \nshe doesn't want me bothering her.\n\nALABAMA\nWhat would make you think that?\n\nCLARENCE\nI dunno. I guess I'm just stupid.\n\nALABAMA\nYou're not stupid. Just wrong.\n\nThey move to the music. Alabama softly, quietly sings some of the words to the song.\n\nALABAMA\nI love Janis.\n\nCLARENCE\nYou know, a lot of people have misconceptions of how she died.\n\nALABAMA\nShe OD'd, didn't she?\n\nCLARENCE\nYeah, she OD'd. But wasn't on her last legs or anythin'. She didn't take \ntoo much. It shouldn't have killed her. There was somethin' wrong with what \nshe took.\n\nALABAMA\nYou mean she got a bad batch?\n\nCLARENCE\nThat's what happened. In fact, when she died, it was considered to be the \nhappiest time of her life. She'd been fucked over so much by men she didn't \ntrust them. She was havin' this relationship with this guy and he asked her \nto marry him. Now, other people had asked to marry her before, but she \ncouldn't be sure whether they really loved her or were just after her \nmoney. So, she said no. And the guy says, \"Look, I really love you, and I \nwanna prove it. So have your lawyers draw up a paper that says no matter \nwhat happens, I can never get any of your money, and I'll sign it.\" So she \ndid, and he asked her, and she said yes. And once they were engaged he told \nher a secret about himself that she never knew: he was a millionaire.\n\nALABAMA\nSo he really loved her?\n\nCLARENCE\nUh-huh.\n\nThey kiss.\n\n\nINT. CLARENCE'S APARTMENT - BEDROOM - DAY\n\nIt's the next day, around 1 p.m. Clarence wakes up in his bed, alone. He looks around, and no Alabama. Then he hears crying in the distance. He puts on a robe and investigates.\n\n\nINT. CLARENCE'S APARTMENT - LIVING ROOM - DAY\n\nAlabama's wearing one of Clarence's old shirts. She's curled up in a chair crying. Clarence approaches her. She tries to compose herself.\n\nCLARENCE\nWhat's wrong, sweetheart? Did I do something? What did I do?\n\nALABAMA\nYou didn't do nothing.\n\nCLARENCE\nDid you hurt yourself?\n(he takes her foot)\nWhatd'ya do? Step on a thumbtack?\n\nALABAMA\nClarence, I've got something to tell you. I didn't just happen to be at the \ntheater. I was paid to be there.\n\nCLARENCE\nWhat are you, a theater checker? You check up on the box office girls. Make \nsure they're not rippin' the place off.\n\nALABAMA\nI'm not a theater checker. I'm a call girl.\n\nPause.\n\nCLARENCE\nYou're a whore?\n\nALABAMA\nI'm a call girl. There's a difference, ya know.\n(pause)\nI don't know. Maybe there's not. That place you took me to last night, that \ncomic book place.\n\nCLARENCE\n\"Heroes For Sale\"?\n\nALABAMA\nYeah, that one. Somebody who works there arranged to have me meet you.\n\nCLARENCE\nWho?\n\nALABAMA\nI don't know. I didn't talk with them. The plan was for me to bump into \nyou, pick you up, spend the night, and skip out after you fell asleep. I \nwas gonna write you a note and say that this was my last day in America. \nThat I was leaving on a plane this morning up to Ukraine to marry a rich \nmillionaire, and thank you for making my last day in America my best day.\n\nCLARENCE\nThat dazzling imagination.\n\nALABAMA\nIt's over on the TV. All it says is: \"Dear Clarence.\" I couldn't write \nanymore. I didn't not want to ever see you again. In fact, it's stupid not \nto ever see you again. Las night... I don't know... I felt... I hadn't had \nthat much fun since Girl Scouts. So I just said, \"Alabama, come clean, Let \nhim know what's what, and if he tells you to go fuck yourself then go back \nto Drexl and fuck yourself.\"\n\nCLARENCE\nWho and what is a Drexl?\n\nALABAMA\nMy pimp.\n\nCLARENCE\nYou have a pimp?\n\nALABAMA\nUh-huh.\n\nCLARENCE\nA real live pimp?\n\nALABAMA\nUh-huh.\n\nCLARENCE\nIs he black?\n\nALABAMA\nHe thinks he is. He says his mother was Apache, but I suspect he's lying.\n\nCLARENCE\nIs he nice?\n\nALABAMA\nWell, I wouldn't go so far as to call him nice, but he's treated me pretty \ndecent. But I've only been there about four days. He got a little rough \nwith Arlene the other day.\n\nCLARENCE\nWhat did he do to Arlene?\n\nALABAMA\nSlapped her around a little. Punched her in the stomch. It was pretty \nscary.\n\nCLARENCE\nThis motherfucker sounds charming!\n\nClarence is on his feet, furious.\n\nCLARENCE\nGoddamn it, Alabama, you gotta get the fuck outta there! How much longer \nbefore he's slappin' you around? Punchin' you in the stomach? How the fuck \ndid you get hooked up with a douche-bag like this in the first place?\n\nALABAMA\nAt the bus station. He said I'd be a perfect call girl. And that he knew an \nagency in California that, on his recommendation, would handle me. They \nhave a very exclusive clientele: movie stars, big businessmen, total \nwhite-collar. And all the girls in the agency get a grand a night. At least \nfive hundred. They drive Porsches, live in condos, have stockbrokers, carry \nbeepers, you know, like Nancy Allen in \"Dressed to Kill\". And when I was \nready he'd call 'em, give me a plane ticket, and send me on my way. He says \nhe makes a nice finder's fee for finding them hot prospects. But no one's \ngonna pay a grand a night for a girl who doesn't know whether to shit or \nwind her watch. So what I'm doin' for Drexl now is just sorta learnin' the \nropes. It seemed like a lotta fun, but I don't really like it much, till \nlast night. You were only my third trick, but you didn't feel like a trick. \nSince it was a secret, I just pretended I was on a date. An, um, I guess I \nwant a second date.\n\nCLARENCE\nThank you. I wanna see you again too. And again, and again, and again. \nBama, I know we haven't known each other long, but my parents went together \nall throughout high school, and they still got a divorce. So, fuck it, you \nwanna marry me?\n\nALABAMA\nWhat?\n\nCLARENCE\nWill you be my wife?\n\nWhen Alabama gives her answer, her voice cracks.\n\nALABAMA\nYes.\n\nCLARENCE\n(a little surprised)\nYou will?\n\nALABAMA\nYou better not be fucking teasing me.\n\nCLARENCE\nYou better not be fuckin' teasin' me.\n\nThey seal it with a kiss.\n\n\nLATER - THAT NIGHT\n\nCLOSEUP - Alabama's wedding ring.\n\nThe newlyweds are snuggling up together onthe couch watching TV. The movie they're watching is \"The Incredible One-Armed Boxer vs. the Master of the Flying Guillotine\". Alabama watches the screen, but every so often she looks down to admre the ring on her hand.\n\nCLARENCE\nDid ya ever see \"The Chinese Professionals\"?\n\nALABAMA\nI don't believe so.\n\nCLARENCE\nWell, that's the one that explains how Jimmy Wang Yu became the Incredible \nOne-Armed Boxer.\n\nWe hear, off screen, the TV Announcer say:\n\nTV ANNOUNCER\n(off)\nWe'll return to Jimmy Wang Yu in... \"The Incredible One-Armed Boxer vs. the \nMaster of the Flying Guillotine\", tonight's eight o'clock movie, after \nthese important messages...\n\nClarence looks at the TV. He feels the warmth of Alabama's hand holding his. We see commercials playing.\n\nHe turns in her direction. She's absent-mindedly looking at her wedding ring.\n\nHe smiles and turns back to the TV.\n\nMore commercials.\n\nDolly close on Clarence's face\n\n\nFLASH ON:\n\nAlabama, right after he proposed.\n\nALABAMA\nYou better not be fucking teasing me.\n\n\nFLASH ON:\n\nIn a cute, all-night wedding chapel. Clarence dressed in a rented tuxedo and Alabama in a rented white wedding gown.\n\nALABAMA\nI do.\n\nCLARENCE\nThank you.\n\n\nFLASH ON:\n\nClarence and Alabama, dressed in tux and gown, doing a lover's waltz on a ballroom dance floor.\n\n\nFLASH ON:\n\nClarence and Alabama in a taxi cab.\n\nCLARENCE\nHello, Mrs. Worley.\n\nALABAMA\nHow do you do, Mr. Worley?\n\nCLARENCE\nTop o' the morning, Mrs. Worley.\n\nALABAMA\nBottom of the ninth . Mr. Worley. Oh, by the by, Mr. Worley, have you seen \nyour lovely wife today?\n\nCLARENCE\nOh, you're speaking of my charming wife Mrs. Alabama Worley.\n\nALABAMA\nOf course. Are there others, Mr. Worley?\n\nMoving on top of her.\n\nCLARENCE\nNot for me.\n\nHe starts kissing her and moving her down on the seat. She resists.\n\nALABAMA\n(playfully)\nNo no no no no no no no no...\n\nCLARENCE\n(playfully)\nYes yes yes yes yes yes yes yes...\n\n\nFLASH ON:\n\nA big mean-looking black man in pimp's clothes.\n\nPIMP\nBitch, you better git yo ass back on the street an' git me my money.\n\nPimp on street corner with his arm around Alabama, giving her a sales pitch to a potential customer.\n\nPIMP\nI'm tellin' you, my man, this bitch is fine. This girl's a freak! You can \nfuck 'er in the ass, fuck 'er in the mouth. Rough stuff, too. She's a freak \nfor it. Jus' try not to fuck 'er up for life.\n\n\nFLASH ON:\n\nPimp beating Alabama.\n\nPIMP\nYou holdin' out on me, girl? Bitch, you never learn!\n\n\nFLASH ON:\n\nAlabama passionately kissing the uninterested pimp.\n\nPIMP\nHang it up, momma. I got no time for this bullshit.\n\n\nBACK TO:\n\nTV showing kung fu film.\n\n\nBACK TO:\n\nClarence's face. There's definitely something different about his eyes.\n\nClarence springs off the couch and goes into his bedroom. Alabama's startled by his sudden movement.\n\nALABAMA\n(yelling after him)\nWhere you goin', honey?\n\nCLARENCE\n(off)\nI just gotta get somethin'.\n\n\nINT. CLARENCE'S APARTMENT - BATHROOM - NIGHT\n\nClarence splashes water on his face, trying to wash away the images that keep polluting his mind. Then, he hears a familiar voice.\n\nFAMILIAR VOICE\n(off)\nWell? Can you live with it?\n\nClarence turns and sees that the voice belongs to Elvis Presley. Clarence isn't surprised to see him.\n\nCLARENCE\nWhat?\n\nELVIS\nCan you live with it?\n\nCLARENCE\nLive with what?\n\nELVIS\nWith that son-of-a-bitch walkin' around breathin' the same air as you? And \ngettin' away with it every day. Are you haunted?\n\nCLARENCE\nYeah.\n\nELVIS\nYou wanna get unhaunted?\n\nCLARENCE\nYeah.\n\nELVIS\nThen shoot 'em. Shoot 'em in the face. And feed that boy to the dogs.\n\nCLARENCE\nI can't believe what you're tellin' me.\n\nELVIS\nI ain't tellin' ya nothin'. I'm just sayin' what I'd do.\n\nCLARENCE\nYou'd really do that?\n\nELVIS\nHe don't got no right to live.\n\nCLARENCE\nLook, Elvis, he is hauntin' me. He doesn't deserve to live. And I do want \nto kill him. But I don't wanna go to jail for the rest of my life.\n\nELVIS\nI don't blame you.\n\nCLARENCE\nIf I thought I could get away with it -\n\nELVIS\nKillin' 'em's the hard part. Gettin' away with it's the easy part. Whaddaya \nthink the cops do when a pimp's killed? Burn the midnight oil tryin' to \nfind who done it? They couldn't give a flyin' fuck if all the pimps in the \nwhole wide world took two in the back of the fuckin' head. If you don't get \ncaught at the scene with the smokin' gun in your hand, you got away with \nit.\n\nClarence looks at Elvis.\n\nELVIS\nClarence, I like ya. Always have, always will.\n\n\nINT. CLARENCE'S APARTMENT - BEDROOM - NIGHT\n\nCLOSEUP - A snub-nosed .38, which Clarence loads and sticks down his heavy athletic sock.\n\n\nINT. CALRENCE'S APARTMENT - LIVING ROOM - NIGHT\n\nClarence returns.\n\nCLARENCE\nSweetheart, write down your former address.\n\nALABAMA\nWhat?\n\nCLARENCE\nWrite down Drexl's address.\n\nALABAMA\nWhy?\n\nCLARENCE\nSo I can go over there and pick up your things.\n\nALABAMA\n(really scared)\nNo, Clarence. Just forget it, babe. I just wanna disappear from there.\n\nHe kneels down before her and holds her hand.\n\nCLARENCE\nLook, sweetheart, he scares you. But I'm not scared of that motherfucker. \nHe can't touch you now. You're completely out of his reach. He poses \nabsolutely no threat to us. So, if he doesn't matter, which he doesn't, it \nwould be stupid to lose your things, now wouldn't it?\n\nALABAMA\nYou don't know him -\n\nCLARENCE\nYou don't know me. Not when it comes to shit like this. I have to do this. \nI need for you to know you can count on me to protect you. Now write down \nthe address.\n\nTITLE CARD: \"CASS QUARTER, HEART OF DETROIT\"\n\n\nEXT. DOWNTOWN DETROIT STREET - NIGHT\n\nIt's pretty late at night. Clarence steps out of his red Mustang. He's right smack dab in the middle of a bad place to be in daytime. He checks the pulse on his neck; it's beating like a race horse. To pump himself up he does a quick Elvis Presley gyration.\n\nCLARENCE\n(in Elvis voice)\nYeah... Yeah...\n\nHe makes a beeline for the front door of a large, dark apartment building.\n\n\nINT. DARK BUILDING - NIGHT\n\nHe's inside. His heart's really racing now. He has the TV guide that Alabama wrote the address on in his hand. He climbs a flight of stairs and makes his way down a dark hallway to apartment 22, the residence of Drexl Spivey. Clarence knock on the door.\n\nA Young Black Man, about twenty years old, answers the door. He has really big biceps and is wearing a black and white fishnet football jersey.\n\nYOUNG BLACK MAN\nYou want somethin'?\n\nCLARENCE\nDrexl?\n\nYOUNG BLACK MAN\nNaw, man, I'm Marty. Watcha want?\n\nCLARENCE\nI gotta talk to Drexl.\n\nMARTY\nWell, what the fuck you wanna tell him?\n\nCLARENCE\nIt's about Alabama.\n\nA figure jumps in the doorway wearing a yellow Farah Fawcett T-shirt. It's our friend, Drexl Spivey.\n\nDREXL\nWhere the fuck is that bitch?\n\nCLARENCE\nShe's with me.\n\nDREXL\nWho the fuck are you?\n\nCLARENCE\nI'm her husband.\n\nDREXL\nWell. That makes us practically related. Bring your ass on in.\n\n\nINT. DREXL'S LIVING ROOM - NIGHT\n\nDrexl and Marty about-face and walk into the room, continuing a conversation they were having and leaving Clarence standing in the doorway. This is not the confrontation Clarence expected. He trails in behind Drexl and Marty.\n\nDREXL\n(to Marty)\nWhat was I sayin'?\n\nMARTY\nRock whores.\n\nDREXL\nYou ain't seen nothin' like these rock whores. They ass be young man. They \ngot that fine young pussy. Bitches want the rock they be a freak for you. \nThey give you hips, lips, and fingertips.\n\nDrexl looks over his shoulder at Clarence.\n\nDREXL\n(to Clarence)\nYou know what I'm talkin' about.\n\nDrexl gestures to one of the three stoned Hookers lounging about the apartment.\n\nDREXL\n(to Marty)\nThese bitches over here ain't shit. You stomp them bitches to death to get \nthe kind of pussy I'm talkin' about.\n\nDrexl sits down at a couch with a card table in front of it, scattered with take-out boxes of Chinese food. A black exploitation movie is playing on TV.\n\nDREXL\nLooky here, you want the bitches to really fly high, make your rocks with \nCherry Seven-Up.\n\nMARTY\nPussy love pink rocks.\n\nThis is not how Clarence expected to confront Drexl, but this is exactly what he expected Drexl to be like. He positions himself in front of the food table, demanding Drexl's attention.\n\nDREXL\n(eating with chopsticks, to Clarence)\nGrab a seat there, boy. Want some dinner? Grab yourself an egg roll. We got \neverything here from a diddle-eyed-Joe to a damned-if-I-know.\n\nCLARENCE\nNo thanks.\n\nDREXL\nNo thanks? What does that mean? Means you ate before you came down here? \nAll full. Is that it? Naw, I don't think so. I think you're too scared to \nbe eatin'. Now, see we're sittin' down here, ready to negotiate, and you've \nalready given up your shit. I'm still a mystery to you. But I know exactly \nwhere your ass is comin' from. See, if I asked you if you wanted some \ndinner and you grabbed an egg roll and started to chow down, I'd say to \nmyself, \"This motherfucker's carryin' on like he ain't got a care in the \nworld. Who know? Maybe he don't. Maybe this fool's such a bad motherfucker, \nhe don't got to worry about nothin', he just sit down, eat my Chinese, \nwatch my TV.\" See? You ain't even sat down yet. On that TV there, since you \nbeen in the room, is a woman with her titties hangin' out, and you ain't \neven bothered to look. You just been starin' at me. Now, I know I'm pretty, \nbut I ain't as pretty as a couple of titties.\n\nClarence takes out an envelope and throws it on the table.\n\nCLARENCE\nI'm not eatin' 'cause I'm not hungry. I'm not sittin' 'cause I'm not \nstayin'. I'm not lookin' at the movie 'cause I saw it seven years ago. It's \n\"The Mack\" with Max Julian, Carol Speed, and Richard Pryor, written by \nBobby Poole, directed by Michael Campus, and released by Cinerama Releasing \nCompany in 1984. I'm not scared of you. I just don't like you. In that \nenvelope is some payoff money. Alabama's moving on to some greener \npastures. We're not negotiatin'. I don't like to barter.  I don't like to \ndicker. I never have fun in Tijuana. That price is non-negotiable. What's \nin that envelope is for my peace of mind. My peace of mind is worth that \nmuch. Not one penny more, not one penny more.\n\nYou could hear a pin drop. Once Clarence starts talking Marty goes on full alert. Drexl stops eating and the Whores stop breathing. All eyes are on Drexl. Drexl drops his chopsticks and opens the envelope. It's empty.\n\nDREXL\nIt's empty.\n\nClarence flashes a wide Cheshire cat grin that says, \"That's right, asshole.\"\n\nSilence.\n\nDREXL\nOooooooooh weeeeeeee! This child is terrible. Marty, you know what we got \nhere? Motherfuckin' Charles Bronson. Is that who you supposed to be? Mr. \nMajestyk? Looky here, Charlie, none of this shit is necessary. I ain't got \nno hold on Alabama. I just tryin' to lend the girl a helpin' hand -\n\nBefore Drexl finishes his sentence he picks up the card table and throws it at Clarence, catching him of guard.\n\nMarty comes up behind Clarence and throws his arm around his neck, putting him in a tight choke hold. \n\nClarence, with his free arm, hits Marty hard with his elbow in the solar plexus. We'll never know if that blow had any effect because at just that moment Drexl takes a flying leap and tackles the two guys.\n\nAll of them go crashing into the stereo unit and a couple of shelves that hold records, all of which collapse to the floor in a shower of LPs.\n\nMarty, who's on the bottom of the pile, hasn't let go of Clarence.\n\nSince Drexl's on top, he starts slamming fists into Clarence's face.\n\nClarence, who's sandwiched between these two guys, can't do a whole lot about it.\n\nDREXL\nYa wanna fuck with me?\n(hits Clarence)\nYa wanna fuck with me?\n(hits Clarence)\nI'll show ya who you're fuckin' wit!\n\nHe hits Clarence hard in the face with both fists.\n\nClarence, who has no leverage whatsoever, grabs hold of Drexl's face and digs his nails in. He sticks his thumb in Drexl's mouth, grabs a piece of cheek, and starts twisting.\n\nMarty, who's in an even worse position, can do nothing but tighten his grip aroud Clarence's neck, until Clarence feels like his eyes are going to pop out of his head.\n\nDrexl's face is getting torn up, but he's also biting down hard on Clarence's thumb.\n\nClarence raises his head and brings it down fast, crunching Marty's face, and busting his nose.\n\nMarty loosens his grip around Clarence's neck. Clarence wiggles free and gets up on his knees.\n\nDrexl and Clarence are now on an even but awkward footing. The two are going at each other like a pair of alley cats, not aiming their punches, keeping them coming fast and furious. They're not doing much damage to each other because of their positions, it's almost like a hockey fight.\n\nMarty sneaks up behind Clarence and smashes him in the head with a stack of LPs. This disorients Clarence. Marty grabs him from behind and pulls him to his feet.\n\nDrexl socks him in the face: one, two three! Then he kicks him hard in the balls.\n\nMarty lets go and Clarence hits the ground like a sack of potatoes. He curls up into a fetal position and holds his balls, tears coming out of his eyes.\n\nDrexl's face is torn up from Clarence's nails.\n\nMarty has blood streaming down his face frim his nose and on to his shirt.\n\nDREXL\n(to Marty)\nYou OK? That stupid dumb-ass didn't break your nose, did he?\n\nMARTY\nNaw. It don't feel too good but it's alright.\n\nDrexl kicks Clarence, who's still on the ground hurting.\n\nDREXL\n(to Clarence)\nYou see what you get when you fuck wit me, white boy? You're gonna walk in \nmy goddamn house, my house! Gonna come in here and tell me! Talkin' smack, \nin my house, in front of my employees. Shit! Your ass must be crazy.\n(to Marty)\nI don't think that white boy's got good sense. Hey, Marty.\n(laughing)\nHe must of thought it was white boy day. It ain't white boy day, is it?\n\nMARTY\n(laughing)\nNaw, man, it ain't white boy day.\n\nDREXL\n(to Clarence)\nShit, man, you done fucked up again. Next time you bogart your way into a \nnigger's crib, an' get all his face, make sure you do it on white boy day.\n\nCLARENCE\n(hurting)\nWannabee nigger...\n\nDREXL\nFuck you! My mother was Apache.\n\nDrexl kicks him again. Clarence curls up.\n\nDrexl bends down and looks for Clarence's wallet in his jacket.\n\nClarence still can't do much. The kick to his balls still has him down.\n\nDrexl finds it and pulls it out. He flips it open to driver's license.\n\nDREXL\nWell, well, well, looky what we got here. Clarence Worley. Sounds almost \nlike a nigger name.\n(to Clarence)\nHey, dummy.\n\nHe puts his foot on Clarence's chest. Clarence's POV as he looks up.\n\nDREXL\nBefore you bought your dumb ass through the door, I didn't know shit. I \njust chalked it up to au revoir Alabama. But, because you think you're some \nmacho motherfucker, I know who she's with. You. I know who you are, \nClarence Worley. And, I know where you live, 4900 116th  street, apartment \n48. And I'll make a million-dollar bet, Alabama's at the same address. \nMarty, take the car and go get 'er. Bring her dumb ass back here.\n\nHe hands Marty the driver's license. Maty goes to get the car keys and a jacket.\n\nDREXL\n(to Marty)\nI'll keep lover boy here entertained.\n(to Clarence)\nYou know the first thing I'll do when she gets here. I think I'll make her \nsuck my dick, and I'll come all in her face. I mean it ain't nuttin' new. \nShe's done it before. But I want you as a audience.\n(hollering to Marty)\nMarty, what the fuck are you doin'?\n\nMARTY\n(off)\nI'm tryin' to find my jacket.\n\nDREXL\nLook in the hamper. Linda's been dumpin' everybody's stray clothes there \nlately.\n\nWhile Drexl has his attention turned to Marty, Clarence reaches into his sock and pulls out the .38. he stick the barrel between Drexl's legs. Drexl, who's standing over Clarence, looks down just in time to see Clarence pull the trigger and blow his balls to bits. Tiny spots of blood speckle Clarence's face.\n\nDrexl shrieks in horror and pain, and falls to the ground.\n\nMARTY\n(off)\nWhat's happening?\n\nMarty steps into the room.\n\nClarence doesn't hesitate, he shoots Marty four times in the chest.\n\nTwo of three Hookers have run out of the front door, screaming. The other Hooker is curled up in the corner. She's too stoned to run, but stoned enough to be terrified.\n\nDrexl, still alive, is laying on the ground howling, holding what's left of his balls and his dick.\n\nClarence points the gun at the remaining Hooker.\n\nCLARENCE\nGet a bag and put Alabama's thing in it!\n\nShe doesn't move.\n\nCLARENCE\nYou wanna get shot? I ain't got all fuckin' day, so move it!\n\nThe Hooker, tears of fear ruining her mascara, grabs a suitcase from under the bed, and, on her hands and knees, pushes it along the floor to Clarence.\n\nClarence takes it by the handle and wobbles over to Drexl, who's curled up like a pillbug.\n\nCLOSEUP - Clarence's forgotten driver's license in Marty's bloody hand.\n\nClarence puts his foot on Drexl's chest.\n\nCLARENCE\n(to Drexl)\nOpen you eyes, laughing boy.\n\nHe doesn't. Clarence gives him a kick.\n\nCLARENCE\nOpen your eyes!\n\nHe does. It's now Drexl's POV from the floor.\n\nCLARENCE\nYou thought it was pretty funny, didn't you?\n\nHe fires.\n\nCLOSEUP - The bullet comes out of the gun and heads right toward us. When it reaches us, the screen goes awash in red.\n\n\nINT. CLARENCE'S APARTMENT - NIGHT\n\nThe front swings open and Clarence walks in. Alabama jumps off the couch and runs toward Clarence, before she reaches him he blurts out:\n\nCLARENCE\nI killed him.\n\nShe stops short.\n\nCLARENCE\nI've got some food in the car, I'll be right back.\n\nClarence leaves. Except for the TV playing, the room is quiet. Alabama sits on the couch.\n\nClarence walks back into the room with a whole bounty of take-out food. He heaps it on to the coffee table and starts to chow down.\n\nCLARENCE\nHelp yourself. I got enough. I am fuckin' starvin'. I think I ordered one \nof everythin'.\n\nHe stops and looks at here.\n\nCLARENCE\nI am so hungry.\n\nHe starts eating french fries and hamburgers.\n\nALABAMA\n(in a daze)\nWas it him or you?\n\nCLARENCE\nYeah. But to be honest, I put myself in that position. When I drove up \nthere I said to myself, \"If I can kill 'em and get away with it, I'll do \nit.\" I could. So I did.\n\nALABAMA\nIs this a joke?\n\nCLARENCE\nNo joke. This is probably the best hamburger I've ever had. I'm serious, \nI've never had a hamburger taste this good.\n\nAlabama starts to cry. Clarence continues eating, ignoring her.\n\nCLARENCE\nCome on, Bama, eat something. You'll feel better.\n\nShe continues crying. He continues eating and ignoring her. Finally he spins on her, yelling:\n\nCLARENCE\nWhy are you crying? He's not worth one of your tears. Would you rather it \nhad been me? Do you love him?\n(no answer)\nDo you love him?\n(no answer)\nDo you love him?\n\nShe looks at Clarence, having a hard time getting a word out.\n\nALABAMA\nI think what you did was...\n\nCLARENCE\nWhat?\n\nALABAMA\nI think what you did...\n\nCLARENCE\nWhat?\n\nALABAMA\n... was so romantic.\n\nClarence is completely taken back. They meet in a long, passionate lovers' kiss. Their kiss breaks and slowly the world comes back to normal.\n\nCLARENCE\nI gotta get outta these clothes.\n\nHe picks up the suitcase and drops it on the table in front of them.\n\nALABAMA\n(comically)\nClean clothes. There is a god,\n\nClarence flips open the suitcase. Alabama's and her husband's jaws drop.\n\nALABAMA\nClarence. Those aren't my clothes.\n\nCUT TO:\n\n\nEXT. HOLLYWOOD HOLIDAY INN - DAY\n\nWe see the Hollywood Holiday Inn sign. Pan to the parking lot where Clarence's empty red Mustang is parked.\n\n\nINT. HOLLYWOOD HOLIDAY INN - CALRENCE'S ROOM - DAY\n\nCLOSEUP - Dick's jaw drops. His hand reaches out of shot.\n\nCLOSEUP - The reason for all the jaw dropping... the suitcase is full of cocaine!\n\nClarence smiles, holding a bottle of wine.\n\nAlabama's watching the cable TV.\n\nDICK\nHoly Mary, Mother of God.\n\nALABAMA\nThis is great, we got cable.\n\nCLARENCE\n(to Alabama)\nBama, you got your blade?\n\nKeeping her eyes on the TV, she pulls out from her purse a Swiss army knife with a tiny dinosaur on it and tosses it to Clarence. Clarence takes off the corkscrew and opens the wine.\n\nHe pours some wine into a couple of hotel plastic cups, a big glass for Dick, a little one for himself. He hands it to Dick. Dick takes it and drinks.\n\nDICK\nThis shit can't be real.\n\nCLARENCE\nIt'll get ya high.\n\nHe tosses the knife.\n\nCLARENCE\nDo you want some wine, sweetheart?\n\nALABAMA\nNope. I'm not really a wine gal.\n\nUsing the knife, Dick snorts some of the cocaine. He jumps back.\n\nDICK\nIt's fuckin' real!\n(to Clarence)\nIt's fuckin' real!\n\nCLARENCE\nI certainly hope so.\n\nDICK\nYou've got a helluva lotta coke there, man!\n\nCLARENCE\nI know.\n\nDICK\nDo you have any idea how much fuckin' coke you got?\n\nCLARENCE\nTell me.\n\nDICK\nI don't know! A fuckin' lot!\n\nHe downs his wine. Clarence fills his glass.\n\nDICK\nThis is Drexl's coke?\n\nCLARENCE\nDrexl's dead. This is Clarence's coke and Clarence can do whatever he wants \nwith it. And what Clarence wants to do is sell it. Then me and Bama are \ngonna leave on a jet plane and spend the rest of our lives spendin'. So, \nyou got my letter, have you lined up any buyers?\n\nDICK\nLook, Clarence, I'm not Joe Cocaine.\n\nDick gulps half of his wine. Clarence fills up.\n\nCLARENCE\nBut you're an actor. I hear these Hollywood guys have it delivered to the \nset.\n\nDICK\nYeah, they do. And maybe when I start being a successful actor I'll know \nthose guys. But most of the people I know are like me. They ain't got a pot \nto piss in or a window to throw it out of. Now, if you want to sell a \nlittle bit at a time -\n\nCLARENCE\nNo way! The whole enchilada in one shot.\n\nDICK\nDo you have any idea how difficult that's gonna be?\n\nCLARENCE\nI'm offering a half a million dollars worth of white for two hundred \nthousand. How difficult can that be?\n\nDICK\nIt's difficult because you're sellin' it to a particular group. Big shots. \nFat cats. Guys who can use that kind of quantity. Guys who can afford two \nhundred thousand. Basically, guys I don't know. You don't know. And, more \nimportant, they don't know you. I did talk with one guy who could possibly \nhelp you.\n\nCLARENCE\nIs he big league?\n\nDICK\nHe's nothing. He's in my acting class. But he works as an assistant to a \nvery powerful movie producer named Lee Donowitz. I thought Donowitz could \nbe interested in a deal like this. He could use it. He could afford it.\n\nCLARENCE\nWhat'd'ya tell 'em?\n\nDICK\nHardly anything. I wasn't sure from your letter what was bullshit, and what \nwasn't.\n\nCLARENCE\nWhat's this acting class guy's name?\n\nDICK\nElliot.\n\nCLARENCE\nElliot what?\n\nDICK\nElliot Blitzer.\n\nCLARENCE\nOK, call 'im up and arrange a meeting, so we can get through all the \ngetting to know you stuff.\n\nDICK\nWhere?\n\nCLARENCE\n(to Alabama)\nThe zoo.\n\nCLARENCE\n(to Dick)\nThe zoo.\n(pause)\nWhat are you waiting for?\n\nDICK\nWould you just shut up a minute and let me think?\n\nCLARENCE\nWhat's to think about?\n\nDICK\nShut up! First you come waltzing into my life after two years. You're \nmarried. You killed a guy.\n\nCLARENCE\nTwo guys.\n\nDICK\nTwo guys. Now you want me to help you with some big drug deal. Fuck, \nClarence, you killed somebody and you're blowin' it off like it don't mean \nshit.\n\nCLARENCE\nDon't expect me to be all broken up over poor Drexl. I think he was a \nfuckin', freeloadin', parasitic scumbag, and he got exactly what he \ndeserved. I got no pity for a mad dog like that. I think I should get a \nmerit badge or somethin'.\n\nDick rests his head in his hands.\n\nCLARENCE\nLook, buddy, I realize I'm layin' some pretty heavy shit on ya, but I need \nyou to rise to the occasion. So, drink some more wine. Get used to the \nidea, and get your friend to the phone.\n\n\nEXT. LOS ANGELES ZOO - DAY\n\nCLOSEUP - A black panther, the four-legged kind, paces back and forth.\n\nClarence, Alabama, Dick and Elliot Blitzer are walking through the zoo. One look at Elliot and you can see what type of actor he is, a real GQ, blow-dry boy. As they walk and talk, Clarence is eating a box of animal crackers and Alabama is blowing soap bubbles.\n\nELLIOT\nSo you guys got five hundred thousand dollars worth of cola that you're \nunloading -\n\nCLARENCE\nWant an animal cracker?\n\nELLIOT\nYeah, OK.\n\nHe takes one.\n\nCLARENCE\nLeave the gorillas.\n\nELLIOT\n- that you're unloading for two hundred thousand dollars -\n\nCLARENCE\nUnloading? That's a helluva way to describe the bargain of a lifetime.\n\nDICK\n(trying to chill him out)\nClarence...\n\nELLIOT\nWhere did you get it?\n\nCLARENCE\nI grow it on my window-sill. The lights really great there and I'm up high \nenough so you can't see it from the street.\n\nELLIOT\n(forcing a laugh)\nHa ha ha. No really, where does it come from?\n\nCLARENCE\nCoco leaves. You see, they take the leaves and mash it down until it's kind \nof a paste -\n\nELLIOT\n(turning to Dick)\nLook, Dick, I don't -\n\nCLARENCE\n(laughing)\nNo problem, Elliot. I'm just fuckin' wit ya, that's all. Actually, I'll \ntell you but you gotta keep it quiet. Understand, if Dick didn't assure me \nyou're good people I'd just tell ya, none of your fuckin' business. But, as \na sign of good faith, here it goes: I gotta friend in the department.\n\nELLIOT\nWhat department?\n\nCLARENCE\nWhat do you think, eightball?\n\nELLIOT\nThe police department?\n\nCLARENCE\nDuh. What else would I be talking about? Now stop askin' stupid doorknob \nquestions. Well, a year and a half ago, this friend of mine got access to \nthe evidence room for an hour. He snagged this coke. But, he's a good cop \nwith a wife and a kid, so he sat on it for a year and a half until he found \na guy he could trust.\n\nELLIOT\nHe trusts you?\n\nCLARENCE\nWe were in Four H together. We've known each other since childhood. So, I'm \nhandling the sales part. He's my silent partner and he knows if I get \nfucked up, I won't drop dime on him. I didn't tell you nothin' and you \ndidn't hear nothin'.\n\nELLIOT\nSure. I didn't hear anything.\n\nElliot is more than satisfied. Clarence makes a comical face at Dick when Elliot's not looking. Dick is wearing I-don't-believe-this-guy expresion. Alabama is forever blowing bubbles.\n\nCUT TO:\n\n\nEXT. LOS ANGELES ZOO - SNACK BAR - DAY\n\nWe're in the snack bar area of the zoo. Alabama, Dick, and Elliot are sitting around a plastic outdoor table. Clarence is pacing around the table as he talks. Alabama is still blowing bubbles.\n\nCLARENCE\n(to Elliot)\nDo I look like a beautiful blond with big tits and an ass that tastes like \nFrench vanilla ice-cream?\n\nElliot hasn't the slightest idea what that is supposed to mean.\n\nELLIOT\nWhat?\n\nCLARENCE\nDo I look like a beautiful blond with big tits and an ass that tastes like \nFrench vanilla ice-cream?\n\nELLIOT\n(with conviction)\nNo. No, you don't.\n\nCLARENCE\nThen why are you telling me all this bullshit just so you can fuck me?\n\nDICK\nClarence...\n\nCLARENCE\n(to Dick)\nLet me handle this.\n\nELLIOT\nGet it straight, Lee isn't into taking risks. He deals with a couple of \nguys, and he's been dealing with them for years. They're reliable. They're \ndependable. And, they're safe.\n\nCLARENCE\nRiddle me this, Batman. If you're all so much in love with each other, what \nthe fuck are you doing here? I'm sure you got better things to do with your \ntime than walk around in circles starin' up a panther's ass. Your guy's \ninterested because with that much shit at his fingertips he can play Joe \nfuckin' Hollywood till the wheels come off. He can sell it, he can snort \nit, he can play Santa Claus with it. At the price he's payin', he'll be \neverybody's best friend. And, you know, that's what we're talkin' about \nhere. I'm not puttin' him down. Hey, let him run wild. Have a ball, it's \nhis money. But, don't expect me to hang around forever waitin' for you guys \nto grow some guts.\n\nElliot has been silenced. He nods his head in agreement.\n\n\nINT. PORSCHE - MOVING - MULHOLLAND DRIVE - DAY\n\nMovie producer, Lee Donowitz, is driving his Porsche through the winding Hollywood hills, just enjoying being rich and powerful. His cellular car phone rings, he answers.\n\nLEE\nHello.\n(pause)\nElliot, it's Sunday. Why am I talkin' to you on Sunday? I don't see enough \nof you during the week I gotta talk to you on Sunday? Why is it you always \ncall me when I'm on the windiest street in L.A.?\n\n\nBACK TO:\n\n\nELLIOT\n\nElliot is on the zoo payphone. Clarence is next to him. Dick is next to Clarence. Alabama is next to Dick, blowing bubbles.\n\nELLIOT\n(on phone)\nI'm with that party you wanted me to get together with. Do you know what \nI'm talking about, Lee?\n\nBACK TO:\n\nLEE\n\nStore-fronts whiz by in the background.\n\nLEE\nWhy the hell are you calling my phone to talk about that?\n\nBACK TO:\n\nELLIOT\n\nELLIOT\nWell, he'd here right now, and he insists on talking to you.\n\nBACK TO:\n\n\nLEE\n\nIn the 7th street tunnel. Lee's voice echoes.\n\nLEE\nAre you outta your fuckin' mind?\n\nBACK TO:\n\nELLIOT\n\nELLIOT\nYou said if I didn't get you on the -\n\nClarence takes the receiverout of Elliot's hand.\n\nCLARENCE\n(into phone)\nHello, Lee, it's Clarence. At last we meet.\n\n\nEXT. DICK'S APARTMENT - DAY\n\nVirgil's knocking on Dick's door. Floyd (Dick's room-mate) answers.\n\nVIRGIL\nHello, is Dick Ritchie here?\n\nFLOYD\nNaw, he ain't home right now.\n\nVIRGIL\nDo you live here?\n\nFLOYD\nYeah, I live here.\n\nVIRGIL\nSorta room-mates?\n\nFLOYD\nExactly room-mates.\n\nVIRGIL\nMaybe you can help me. Actually, who I'm looking for is a friend of ours \nfrom Detroit. Clarence Worley? I heard he was in town. Might be travelling \nwith a pretty girl named Alabama. Have you seen him? Are they stayin' here?\n\nFLOYD\nNaw, they ain't stayin' here. But, I know who you're talkin' about. They're \nstayin' at the Hollywood Holiday Inn.\n\nVIRGIL\nHow do you know? You been there?\n\nFLOYD\nNo, I ain't been there. But I heard him say. Hollywood Holiday Inn. Kinda \neasy to remember.\n\nVIRGIL\nYou're right. It is.\n\n\nEXT. LOS ANGELES ZOO - PAYPHONE - DAY\n\nClarence is still on the phone with Lee.\n\nCLARENCE\nLee, the reason I'm talkin' with you is I want to open \"Doctor Zhivago\" in \nL.A. And I want you to distribute it.\n\nBACK TO:\n\n\nLEE\n\nStopped in the traffic on Sunset Boulevard.\n\nLEE\nI don't know, Clarence, \"Doctor Zhivago\" is a pretty big movie.\n\nBACK TO:\n\nCLARENCE\nThe biggest. The biggest movie you've ever dealt with, Lee. We're talkin' a \nlot of film. A man'd have ta be an idiot not to be a little cautious about \na movie like that. And Lee, you're no idiot.\n\nBACK TO:\n\n\nLEE\n\nHe's still on Sunset Boulevard, the traffic's moving better now.\n\nLEE\nI'm not sayin' I'm not interested. But being a distributer's not what I'm \nall about. I'm a film producer, I'm on this world to make good movies. \nNothing more. Now, having my big toe dipped into the distribution end helps \nme on many levels.\n\nTraffic breaks and Lee speeds along. The background whizzes past him.\n\nLEE\n(continuing)\nBut the bottom line is: I'm not Paramount. I have a select group of \ndistributers I deal with. I buy their little movies. Accomplish what I \nwanna accomplish, end of story. Easy, business-like, very little risk.\n\nBACK TO:\n\nCLARENCE\n\nCLARENCE\nNow that's bullshit, Lee. Every time you buy one of those little movies \nit's a risk. I'm not sellin' you something that's gonna play two weeks, six \nweeks, then go straight to cable. This is \"Doctor Zhivago\". This'll be \npackin' 'em in for a year and a half. Two years! That's two years you don't \nhave to work with anybody's movie but mine.\n\nBACK TO:\n\n\nLEE\n\nSpeeding down a benchside road.\n\nLEE\nWell, then, what's the hurry? Is it true the rights to \"Doctor Zhivago\" are \nin arbitration?\n\nBACK TO:\n\n\nCLARENCE\nI wanna be able to announce this deal at Cannes. If I had time for a \ncourtship, Lee, I would. I'd take ya out, I'd hold your hand, I'd kiss you \non the cheek at the door. But, I'm not in that position. I need to know if \nwe're in bed together, or not. If you want my movie, Lee, you're just gonna \nhave to come to terms with your Fear and Desire.\n\nPause. Clarence hands the phone to Elliot.\n\nCLARENCE\n(to Elliot)\nHe wants to talk ya.\n\nELLIOT\n(into phone)\nMr. Donowitz?\n(pause)\nI told you, through Dick.\n(pause)\nHe's in my acting class.\n(pause)\nAbout a year.\n(pause)\nYeah, he's good.\n(pause)\nThey grew up together.\n(pause)\nSure thing.\n\nElliot hangs up the phone.\n\nELLIOT\nHe says Wednesday at three o'clock at the Beverly Wilshire. He wants \neverybody there.\n(pointing to Clarence)\nHe'll talk to you. If after talkin' to you he's convinced you're OK, he'll \ndo business. If not, he'll say fuck it and walk out the door. He also wants \na sample bag.\n\nCLARENCE\nNo problems on both counts.\n\nHe offers Elliot the animal crackers.\n\nCLARENCE\nHave a cookie.\n\nElliot takes one.\n\nELLIOT\nThanks.\n\nHe puts it in the mouth.\n\nCLARENCE\nThat wasn't a gorilla, was it?\n\n\nEXT. HOLIDAY INN - DAY\n\nThe red Mustang with Clarence and Alabama pulls up to the hotel. Alabama hops out. Clarence stays in.\n\nALABAMA\nYou did it, Quickdraw. I'm so proud of you. You were like a ninja. Did I do \nmy part OK?\n\nCLARENCE\nBabalouey, you were perfect, I could hardly keep from busting up.\n\nALABAMA\nI felt so stupid just blowing those bubbles.\n\nCLARENCE\nYou were chillin', kind of creepy even. You totally fucked with his head. \nI'm gonna go grab dinner.\n\nALABAMA\nI'm gonna hop in the tub and get all wet, and slippery, and soapy. Then I'm \ngonna lie in the waterbed, not even both to dry off, and watch X-rated \nmovies till you get your ass back to my lovin' arms.\n\nThey kiss.\n\nCLARENCE\nWe now return to \"Bullit\" already in progress.\n\nHe slams the Mustang in reverse and peels out of the hotel. Alabama walks her little walk from the parking lot to the pool area. Somebody whistles at her, she turns to them.\n\nALABAMA\nThank you.\n\nShe gets to her door, takes out the key, and opens the door.\n\n\nINT. HOLLYWOOD HOLIDAY INN - CALRENCE'S ROOM - DAY\n\nShe steps in only to find Virgil sitting on a chair placed in front of the door with a sawed-off shotgun aimed right at her.\n\nVIRGIL\n(calmly)\nStep inside and shut the door.\n\nShe doesn't move, she's frozen. Virgil leans forward.\n\nVIRGIL\n(calmly)\nLady. I'm gonna shoot you in the face.\n\nShe does exactly as he says. Virgil rises, still aiming the sawed-off.\n\nVIRGIL\nStep away from the door, move into the bathroom.\n\nShe does. He puts the shotgun down on the chair, then steps closer to her.\n\nVIRGIL\nOK, Alabama, where's our coke, where's Clarence, and when's he coming back.\n\nALABAMA\nI think you got the wrong room, my name is Sadie. I don't have any Coke, \nbut there's a Pepsi machine downstairs. I don't know any Clarence, but \nmaybe my husband does. You might have heard of him, he plays football. Al \nLylezado. He'll be home any minute, you can ask him.\n\nVirgil can't help but smile.\n\nVIRGIL\nYou're cute.\n\nVirgil jumps up and does a mid-air kung fu kick which catches Alabama square in the face, lifting her off the ground and dropping her flat on her back.\n\n\nINT. MOVING RED MUSTANG - DAY\n\nClarence, in his car, driving to get something to eat, singing to himself.\n\nCLARENCE\n(singing)\n\"Land of stardust, land of glamour,\nVistavision and Cinema,\nEverything about it is a must,\nTo get to Hollywood, or bust...\"\n\n\nINT. HOLLYWOOD HOLIDAY INN - CLARENCE'S ROOM - DAY\n\nAlabama's laying flat. She actually blacks out for a moment, but the salty taste of the blood in her mouth wakes her up. She opens her eyes and sees Virgil standing there, smiling. She closes them, hoping it's a dream. They open again to the same sight. She has never felt more helpless in her life.\n\nVIRGIL\nHurts, don't it? It better. Took me a long time to kick like that. I'm \nthird-degree blackbelt, you know? At home I got trophies. Tournaments I was  \nin. Kicked all kinds of ass. I got great technique. You ain't hurt that  \nbad. Get on your feet, Fruitloop.\n\nAlabama wobbily complies.\n\nVIRGIL\nWhere's our coke? Where's Clarence? And when he's comin' back?\n\nAlabama looks in Virgil's eyes and realizes that without a doubt she's going to die, because this man is going to kill her.\n\nALABAMA\nGo take a flying fuck and a rolling donut.\n\nVirgil doesn't waste a second. He gives her a sidekick straight to the stomach. The air is sucked out of her lungs. She falls to her knees. She's on all fours gasping for air that's just not there.\n\nVirgil whips out a pack of Lucky Strikes. He lights one up with a Zippo lighter. He takes a long, deep drag.\n\nVIRGIL\nWhatsamatta? Can't breathe? Get used to it.\n\n\nINT. HAMBURGER STAND - DAY\n\nClarence walks through the door of some mom and pop fast-food restaurant.\n\nCLARENCE\nWoah! Smells like hamburgers in here! What's the biggest, fattest hamburger  \nyou guys got?\n\nThe Iranian Guy at the counter says:\n\nIRANIAN GUY\nThat would be Steve's double chili cheeseburger.\n\nCLARENCE\nWell, I want two of them bad boys. Two large orders of chili fries. Two  \nlarge Diet Cokes.\n(looking at a menu at the wall)\nAnd I'll tell you what, why don't you give me a combination burrito as  \nwell.\n\n\nINT. HOLLYWOOD HOLIDAY INN - CLARENCE'S ROOM - DAY\n\nAlabama is violently thrown into a corner of the room. She braces herself against the wall. She is very punchy. Virgil steps in front of her.\n\nVIRGIL\nYou think your boyfriend would go through this kind of shit for you? Dream  \non, cunt. You're nothin' but a fuckin' fool. And your pretty face is gonna  \nturn awful goddamn ugly in about two seconds. Now, where's my fuckin' coke?\n\nShe doesn't answer. He delivers a spinning roundhouse kick on the head. Her head slams into the left side of the wall.\n\nVIRGIL\nWhere's Clarence?!\n\nNothing. He gives her another kick to the head, this time from the other side. Her legs start to give way. He catches her and throws her back. He slaps her lightly in the face to revive her, she looks at him.\n\nVIRGIL\nWhen's Clarence getting back?\n\nShe can barely raise her arm, but she somehow manages, and she gives him the middle finger. Virgil can't help but smile.\n\nVIRGIL\nYou gotta lot of heart, kid.\n\nHe gives her a spinning roadhouse kick to the head that sends her to the floor.\n\n\nINT. HAMBURGER STAND - DAY\n\nCLOSEUP - Burgers sizzling on a griddle, Chili and cheese is put on them.\n\nClarence is waiting for his order. He notices a CUSTOMER reading a copy of \"Newsweek\" with Elvis on the cover.\n\nCLARENCE\nThat's a great issue.\n\nThe Customer lowers his magazine a little bit.\n\nCUSTOMER\nYeah, I subscribe. It's a pretty decent one.\n\nCLARENCE\nHave you read the story on Elvis?\n\nCUSTOMER\nNo. Not yet.\n\nCLARENCE\nYou know, I saw it on the stands, my first inclination was to buy it. But,  \nI look at the price and say forget it, it's just gonna be the same old  \nshit. I ended up breaking down and buying it a few days later. Man, I was  \never wrong.\n\nCUSTOMER\nThat good, huh?\n\nHe takes the magazine from the Customer's hands and starts flipping to the Elvis article.\n\nCLARENCE\nIt tried to pin down what the attraction is after all these years. It  \ncovers the whole spectrum of fans, the people who love his music, the  \npeople who grew up with him, the artists he inspired - Bob Dylan, Bruce  \nSpringsteen, and the fanatics, like these guys. I don't know about you, but  \nthey give me the creeps.\n\nCUSTOMER\n I can see what you mean.\n\nCLARENCE\nLike, look at her. She looks like she fell off an ugly tree and hit every  \nbranch on the way down. Elvis wouldn't fuck her with Pat Boone's dick.\n\nClarence and the Customer laugh.\n\n\nINT. HOLLYWOOD HOLIDAY INN - CLARENCE'S ROOM - DAY\n\nAlabama's pretty beat up. She has a fat lip and her face is black and blue. She's crawling around on the floor. Virgil is tearing the place apart looking for the cocaine. He's also carrying on a running commentary.\n\nVIRGIL\n Now the first guy you kill is always the hardest. I don't care if you're  \nthe Boston Strangler or Wyatt Earp. You can bet that Texas boy, Charles  \nWhitman, the fella who shot all them guys from that tower, I'll bet you  \ngreen money that that first little black dot that he took a bead on, was  \nthe bitch of the bunch. No foolin' the first one's a tough row to hoe. Now,  \nthe second one, while it ain't no Mardi Gras, it ain't half as tough row to  \nhoe. You still feel somethin' but it's just so deluted this time around.  \nThen you completely level off on the third one. The third one's easy. It's  \ngotten to the point now I'll do it just to watch their expressions change.\n\nHe's tearing the motel room up in general. Then he flips the matress up off the bed, and the black suitcase is right there.\n\nAlabama's crawling, unnoticed to where her purse is lying. Virgil flips open the black case and almost goes snow blind.\n\nVIRGIL\nWell, well, well, looky here. I guess I just reached journey's end. Great.  \nOne less thing I gotta worry about.\n\nVirgil closes the case. Alabama sifts through her purse.\n\nShe pulls out her Swiss army knife, opens it up. Virgil turns toward her.\n\nVIRGIL\nOK, Sugarpop, we've come to what I like to call the moment of truth -\n\nAlabama slowly rises clutching the thrust-out knife in both hands. Mr. Karate-man smiles.\n\nVIRGIL\nKid, you got a lotta heart.\n\nHe moves toward her.\n\nAlabama's hands are shaking.\n\nVIRGIL\nTell you what I'm gonna do. I'm gonna give you a free swing. Now, I only do  \nthat for people I like.\n\nHe moves close.\n\nAlabama's eyes study him. He grabs the front of his shirt and rips it open. Buttons fly everywhere.\n\nVIRGIL\nGo ahead, girl, take a stab at it.\n(giggling)\nYou don't have anything to lose.\n\nCLOSEUP - Alabama's face. Virgil's right, she doesn't have anything to lose. Virgil's also right about his being the moment of truth. The ferocity in women that comes out at certain times, and is just here under the surface in many women all of the time, is unleashed. The absolute feeling of helplessness she felt only a moment ago has taken a one hundred and eighty degree turn into \"I'll take this motherfucker with me if it's the last thing I do\" seething hatred.\n\nLetting out a bloodcurling yell, she raises the knfe high above her head, then drops to her knees and plunges it deep into Virgil's right foot.\n\n\nCLOSEUP - VIRGIL'S FACE\n\nTalk about bloodcurling yells.\n\nVirgil bends down and carefully pulls the knife from his foot, tears running down his face.\n\nWhile Virgil's bent down, Alabama smashes an Elvis Presley whiskey decanter that Clarence bought her in Oklahoma over his head. It's only made of plaster, so it doesn't kill him.\n\nVirgil's moving toward Alabama, limping on his bad foot.\n\nVIRGIL\nOK, no more Mr. Nice-guy.\n\nAlabama picks up the hotel TV and tosses it to him. He instinctively catches it and, with his arms full of television, Alabama cold-cocks him with her fist in the nose, breaking it.\n\nHer eyes go straight to the door, then to the sawed-off shotgun by it. She runs to it, bends over the chair for the gun. Virgil's left foot kicks her in the back, sending her flying over the chair and smashing into the door.\n\nVirgil furiously throws the chair out of the way and stands over Alabama. Alabama's lying on the ground laughing. Virgil has killed a lot of people, but not one of them has ever laughed before he did it.\n\nVIRGIL\nWhat's so fuckin' funny?!!\n\nALABAMA\n(laughing)\nYou look so ridiculous.\n\nShe laughs louder. Virgil's insane. He picks her off the floor, then lifts her off the ground and throws her through the glass shower door in the bathroom.\n\nVIRGIL\nLaugh it up, cunt. You were in hysterics a minute ago. Why ain't you  \nlaughing now?\n\nAlabama, lying in the bathtub, grabs a small bottle of hotel shampoo and squeezes it out in her hand.\n\nVirgil reaches in the shower and grabs hold of her hair.\n\nAlabama rubs the shampoo in his face. He lets go of her and his hands go to his eyes.\n\nVIRGIL\nOh Jesus!\n\nShe grabs hold of a hefty piece of broken glass and plunges it into his face.\n\nVIRGIL\nOh Mary, help me!\n\nThe battered and bruised and bloody Alabama emerges from the shower. She's clutching a big, bloody piece of broken glass. She's vaguely reminiscent of a Tasmanian devil. Poor Virgil can't see very well, but he sees her figure coming toward him. He lets out a wild haymaker that catches her in the jaw and knocks her into the toilet.\n\nHe recovers almost immediately and takes the porcelain lid off the back of the toilet tank.\n\nVirgil whips out a .45 automatic from his shoulder holster, just as Alabama brings the lid down on his head. He's pressed up against the wall with this toilet lid hitting him. He can't get a good shot in this tight environment, but he fires anyway, hitting the floor, the all, the toilet, and the sink.\n\nThe toilet lid finally shatters against Virgil's head. He falls to the ground.\n\nAlabama goes to the medicine cabinet and whips out a big can of Final Net hairspray. She pulls a Bic lighter out of her pocket, and, just as Virgil raises his gun at her, she flicks the Bic and sends a stream of hairspray through the flame, which results in a big ball of fire that hits Virgil right in the face.\n\nHe fires off two shots. One hits the wall, another hits the sink pipe, sending water spraying.\n\nUpon getting his face fried Virgil screams and jumps up, knocking Alabama down, and runs out of the bathroom.\n\nVirgil collapses on the floor of the living room. Then, he sees the sawed-off laying on the ground. He crawls toward it.\n\nAlabama, in the bathroom, sees where he's heading. She picks up the .45 automatic and fires at him. It's empty. She's on her feet and into the room.\n\nHe reaches the shotgun, his hands grasp it.\n\nAlabama spots and picks up the bloody Swiss army knife. She takes a knife-first-running-dive at Virgil's back. She hits him.\n\nHe arches up, firing the sawed-off into the ceiling, dropping the gun, and sending a cloud of plaster and stucco all over the room.\n\nAlabama snatches the shotgun.\n\nArched over on his back Virgil and Alabama make eye contact.\n\nThe first blast hits him in the shoulder, almost tearing his arm off. The second hits him in the knee. The third plays hell with his chest.\n\nAlabama then runs at him, hitting him in the head with the butt of the shotgun.\n\nEver since he's been firing it's as if some other part of her brain has been functioning independently. She's been absent-mindedly saying the prayer of Saint Francis of Assisi.\n\nALABAMA\nLord, make me an instrument of Thy peace;\nwhere there is hatred, let me sow love;\nwhere there is injury, pardon;\nwhere there is doubt, faith;\nwhere there is despair, hope;\nwhere there is darkness, light;\nand where there is sadness, joy.\nO Divine Master, grant that I may not\nso much seek to be consoled as to console;\nto be understood as to understand;\nto be loved as to love;\nfor it is in giving that we receive,\nit is pardoning that we are pardoned,\nand it is in dying that we are born\nto eternal life.\n\nClarence, who's been hearing gunshots, bursts through the door, gun drawn, only to see Alabama, hitting a dead guy on the head, with a shotgun.\n\nCLARENCE\nHoney?\n\nShe continues. He puts his gun away.\n\nCLARENCE\nSweetheart? Cops are gonna be here any minute,\n\nShe continues. He takes the gun away from her, and she falls to the ground. She lies on the floor trembling, continuing with the downward swings of her arms.\n\nClarence grabs the shotgun and the cocaine, and tosses Alabama over his shoulder.\n\nCUT TO:\n\n\nEXT. HOLLYWOOD HOLIDAY INN - DAY\n\nEverybody is outside their rooms watching as Clarence walks through the pool area with his bundle. Sirens can be heard.\n\n\nEXT. MOVING RED MUSTANG - DAY\n\nClarence is driving like mad. Alabama's passed out in the passenger seat. She's muttering to herself. Clarence has one hand on the steering wheel and the other strokes Alabama's hair.\n\nCLARENCE\nSleep baby. Don't dream. Don't worry. Just sleep. You deserve better than  \nthis. I'm so sorry. Sleep my angel. Sleep peacefully.\n\n\nEXT. MOTEL 6 - NIGHT\n\nA new motel. Clarence's red Mustang is parked outside.\n\n\nINT. MOTEL 6 - CLARENCE'S ROOM - NIGHT\n\nAlabama, with a fat lip and a black and blue face, is asleep in bed.\n\n\nINT. NOWHERE\n\nClarence is in a nondescript room speaking directly to the camera. He's in a headshot.\n\nCLARENCE\nI feel so horrible about what she went through. That fucker really beat the  \nshit out of her. She never told him where I was. It's like I always felt  \nthat the way she felt about me was a mistake. She couldn't really care that  \nmuch. I always felt in the back of my mind, I don't know, she was jokin'.  \nBut, to go through that and remain loyal, it's very easy to be unraptured  \nwith words, but to remain loyal when it's easier, even excusable, not to -  \nthat's a test of oneself. That's a true romance. I swear to God, I'll cut  \noff my hands and gouge out my eyes before I'll every let anything happen to  \nthat lady again.\n\nCUT TO:\n\n\nEXT. HOLLYWOOD HILLS - NIGHT\n\nA wonderful, gracefully flowing shot of the Hollywood Hills. Off in the distance we hear the roar of a car engine.\n\n\nEXT. MULLHOLLAND DRIVE - NIGHT\n\nVaaarrroooooommmm!!! A silver Porsche is driving hells bells, taking quick corners, pushing it to the edge.\n\n\nINT. MOVING PORSCHE - NIGHT\n\nElliot Blitzer is the driver, standing on it. A blond, glitzy Coke Whore is sitting next to him. They're having a ball. Then they're seeing a red and blue light flashing in the rear-view window. It's the cops.\n\nELLIOT\nFuck! I knew it! I fucking knew it! I should have my head examined, driving  \nlike this!\n(he pulls over)\nKandi, you gotta help me.\n\nKANDI\nWhat can I do?\n\nHe pulls out the sample bag of cocaine that Clarence gave him earlier.\n\nELLIOT\nYou gotta hold this for me.\n\nKANDI\nYou must be high. Uh-huh. No way.\n\nELLIOT\n(frantically)\nJust put it in your purse.\n\nKANDI\nI'm not gonna put that shit in my purse.\n\nELLIOT\nThey won't search you. I promise. You haven't done anything.\n\nKANDI\nNo way, JosÈ.\n\nELLIOT\nPlease, they'll be here any minute. Just put it in your bra.\n\nKANDI\nI'm not wearing a bra.\n\nELLIOT\n(pleading)\nPut it in your pants.\n\nKANDI\nNo.\n\nELLIOT\nYou're the one who wanted to drive fast.\n\nKANDI\nRead my lips.\n\nShe mouths the word \"no\".\n\nELLIOT\nAfter all I've done for you, you fuckin' whore!!\n\nShe goes to slap him, she hits the bag of cocaine instead. It rips open. Cocaine completely covers his blue suit. At that moment Elliot turns to face a flashing beam. Tears fill his eyes.\n\n\nINT. POLICE STATION - INTERROGATION ROOM - DAY\n\nElliot is sitting in a chair at the table. Two young, good-looking, casually dressed, Starsky and Hutch-type POLICE DETECTIVES are questioning him. They're known in the department as Nicholson and Dimes. The dark-haired one is Cody Nicholson, and the blond is Nicky Dimes.\n\nNICHOLSON\nLook, sunshine, we found a sandwich bag of uncut cocaine -\n\nDIMES\nNot a tiny little vial -\n\nNICHOLSON\nBut a fuckin' baggie.\n\nDIMES\nNo don't sit here and feed us some shit.\n\nNICHOLSON\nYou got caught. It's all fun and fuckin' games till you get caught. But now  \nwe gotcha. OK, Mr. Elliot actor, you've just made the big time -\n\nDIMES\nYou're no longer an extra -\n\nNICHOLSON\nOr a bit player -\n\nDIMES\nOr a supporting actor -\n\nNICHOLSON\nYou're a fuckin' star! And you're gonna be playin' your little one-man show  \nnightly for the next two fuckin' years for a captive audience -\n\nDIMES\nBut there is a bright side though. If you ever have to play a part of a guy  \nwho gets fucked in the ass on a daily basis by throat-slitting niggers,  \nyou'll have so much experience to draw on -\n\nNICHOLSON\nAnd just think, when you get out in a few years, you'll meet some girl, get  \nmarried, and you'll be so understanding to your wife's needs, because  \nyou'll know what it's like to be a woman.\n\nDIMES\n'Course you'll wanna fuck her in the ass. Pussy just won't feed right  \nanymore -\n\nNICHOLSON\nThat is, of course, if you don't catch Aids from all your anal intrusions.\n\nElliot starts crying. Nicholson and Dimes exchange looks and smile. Mission accomplished.\n\n\nINT. POLICE STATION - CAPTAIN KRINKLE'S OFFICE - DAY\n\nCAPTAIN BUFFORD KRINKLE is sitting behind his desk, where he spends about seventy-five percent of his day. He's you standard rough, gruff, no-nonsense, by-the-book-type police captain.\n\nKRINKLE\n Nicholson! Dimes! Het in here!\n\nThe two casually dressed, sneaker-wearing cops rush in, both shouting at once.\n\n\nDIMES\nKrinkle, this is it. We got it, man. And it's all ours. I mean talk about  \nfallin' into somethin'. You shoulda seen it, it was beautiful. Dimes is  \nhittin' him from the left about being fucked in the ass by niggers, I'm  \nhittin' him form the right about not likin' pussy anymore, finally he  \nstarts  cryin', and then it was all over -\n\nNICHOLSON\n Krinkle, you're lookin' at the two future cops of the month. We have it,  \nand if I say we, I don't mean me and him, I'm referring to the whole  \ndepartment. Haven't had a decent bust this whole month. Well, we mighta  \ncome in like a lamb, but we're goin' out like a lion -\n\nKRINKLE\nBoth you, idiots shut up, I can't understand shit! Now, what's happened,  \nwhat's going on, and what are you talking about?\n\nDIMES\nOkee-dokee. It's like this, Krinkle; a patrol car stops this dork for  \nspeeding, they walk up to window and the guy's covered in coke. So they  \nbring his ass in and me an' Nicholson go to work on him.\n\nNICHOLSON\nNicholson and I.\n\nDIMES\nNicholson and I go to work on him. Now er know somthing's rotten in  \nDenmark, 'cause this dickhead had a big bag, and it's uncut, too, so we're  \nsweatin' him, trying to find out where he got it. Scarin' the shit outta  \nhim.\n\nNICHOLSON\nWhich wasn't too hard, the guy was a real squid.\n\nDIMES\nSo we got this guy scared shitless and he starts talkin'. And, Krinkle, you  \nain't gonna fuckin' believe it.\n\nCUT TO:\n\n\nINT. RESTAURANT - DAY\n\nDetroit. Very fancy restaurant. Four wise-guy Hoods, one older, the other three, youngsters, are seated at the table with Mr. Coccotti.\n\nCOCCOTTI\n- And so, tomorrow morning comes, and no Virgil. I check with Nick  \nCardella, who Virgil was supposed to leave my narcotics with, he never  \nshows. Now, children, somebody is stickin' a red-hot poker up my asshole  \nand what I don't know is whose hand's on the handle.\n\nYOUNG WISE-GUY #1 (FRANKIE)\nYou think Virgil started gettin' big ideas?\n\nCOCCOTTI\nIt's possible. Anybody can be carried away with delusions of grandeur. But  \nafter that incident in Ann Arbor, I trust Virgil.\n\nYOUNG WISE-GUY #2 (DARIO)\nWhat happened?\n\nOLD WISE-GUY(LENNY)\n Virgil got picked up in a warehouse shakedown. He got five years, he served  \nthree.\n\nCOCCOTTI\nAnybody who clams up and does hid time, I don't care how I feel about him  \npersonally, he's OK.\n\nBACK TO:\n\n\nKRINKLE'S OFFICE\n\nNICHOLSON\nIt seems a cop from some department, we don't know where, stole a half a  \nmillion dollars of coke from the property cage and he's been sittin' on it  \nfor a year and a half. Now the cops got this weirdo -\n\nDIMES\nSuspect's words -\n\nNICHOLSON\nTo front for him. So Elliot is workin' out the deal between them and his  \nboss, a big movie producer named Lee Donowitz.\n\nDIMES\nHe produced \"Coming Home in a Body Bag\".\n\nKRINKLE\nThat Vietnam movie?\n\nDIMES\nUh-huh.\n\nKRINKLE\nThat was a good fuckin' movie.\n\nDIMES\nSure was.\n\nKRINKLE\nDo you believe him?\n\nDIMES\nI believe he believes him.\n\nNICHOLSON\nHe's so spooked he'd turn over his momma, his daddy, his two-panny granny,  \nand Anna and the King of Siam if he had anything on him.\n\nDIMES\nThis rabbit'll do anything not to do time, including wearing a wire.\n\nKRINKLE\nHe'll wear a wire?\n\nDIMES\nWe talked him into it.\n\nKRINKLE\nDirty cops. We'll have to bring in internal affairs on this.\n\nDIMES\nLook, we don't care if you bring in the state milita, the volunteer fire  \ndepartment, the L.A. Thunderbirds, the ghost of Steve McQueen, and the  \ntwelve Roman gladiators, so long as we get credit for the bust.\n\nNICHOLSON\nCocaine. Dirty cops. Hollywood. This is Crocket and Tubbs all the way. And  \nwe found it, so we want the fuckin' collar.\n\nBACK TO:\n\n\nINT. RESTAURANT - DAY\n\nYOUNG WISE-GUY #3 (MARVIN)\nMaybe Virgil dropped it off at Cardella's. Cardella turns Virgil's switch  \noff, and Cardella decides to open up his own fruit stand.\n\nLENNY\nExcuse me, Mr. Coccotti.\n(to Marvin)\nDo you know Nick Cardella?\n\nMARVIN\nNo.\n\nLENNY\nThen where the hell do you get off talkin' that kind of talk?\n\nMARVIN\nI didn't mean -\n\nLENNY\nShut your mouth. Nick Cardella was provin' what his words was worth before  \nyou were in your daddy's nutsack. What sun do you walk under you can throw  \na shadow on Nick Cardella? Nick Cardella's a stand-up guy.\n\nCOCCOTTI\nChildren, we're digressing. Another possibility is that rat-fuck whore and  \nher wack-a-doo cowboy boyfriend out-aped Virgil. Knowing Virgil, I find  \nthat hard to believe. But they sent Drexl to hell, and Drexl was no faggot.  \nSo you see, children, I got a lot of questions and no answers. Find out who  \nthis wing-and-a-prayer artist is and take him off at the neck.\n\nTITLE CARD: \"THE BIG DAY\"\n\n\nEXT. IMPERIAL HIGHWAY - SUNRISE\n\nClarence's red Mustang is parked on top of a hill just off of Imperial Highway. As luck would have it, somebody has abandoned a ratty old sofa on the side of the road. Clarence and Alabama sit on the sofa, sharing a Jumbo Java, and enjoying the sunrise and wonderful view of the LAX Airport runways, where planes are taking off and landing. A plane takes off, and they stop and watch.\n\nCLARENCE\nYa know, I used to fuckin' hate airports.\n\nALABAMA\nReally?\n\nCLARENCE\nWith a vengeance, I hated them.\n\nALABAMA\nHow come?\n\nCLARENCE\nI used to live by one back in Dearborn. It's real frustratin' to be  \nsurrounded by airplanes when you ain't got shit. I hated where I was, but I  \ncouldn't do anythin' about it. I didn't have enough money. It was tough  \nenough just tryin' to pay my rent every month, an' here I was livin' next  \nto an airport. Whenever I went outside, I saw fuckin' planes take off  \ndrownin' out my show. All day long I'm seein', hearin' people doin' what I  \nwanted to do most, but couldn't.\n\nALABAMA\nWhat?\n\nCLARENCE\nLeavin' Detroit. Goin' off on vacations, startin' new lives, business  \ntrips. Fun, fun, fun, fun.\n\nAnother plane takes off.\n\nCLARENCE\nBut knowin' me and you gonna be nigger-rich gives me a whole new outlook. I  \nlove airports now. Me 'n' you can get on any one of those planes out there,  \nand go anywhere we ant.\n\nALABAMA\nYou ain't kiddin', we got lives to start over, we should go somewhere where  \nwe can really start from scatch.\n\nCLARENCE\nI been in America all my life. I'm due for a change. I wanna see what TV in  \nother countries is like. Besides, it's more dramatic. Where should we fly  \noff to, my little turtledove?\n\nALABAMA\nCancoon.\n\nCLARENCE\nWhy Cancoon?\n\nALABAMA\nIt's got a nice ring to it. It sounds like a movie. \"Clarence and Alabama  \nGo to Cancoon\". Don't 'cha think?\n\nCLARENCE\nBut in my movie, baby, you get the top billing.\n\nThey kiss.\n\nCLARENCE\nDon't you worry 'bout anything. It's all gonna work out for us. We deserve  \nit.\n\n\nINT. DICK'S APARTMENT - DAY\n\nDick, Clarence and Alabama are just getting ready to leave for the drug deal. Floyd lays on the couch watching TV. Alabama's wearing dark glasses because of the black eye she has.\n\nCLARENCE\n(to Floyd)\nYou sure that's how you get to the Beverly Wilshire?\n\nFLOYD\nI've partied there twice. Yeah, I'm sure.\n\nDICK\nYeah, well if we got lost, it's your ass.\n(to Clarence)\nCome on, Clarence, lets go. Elliot's going to meet us in the lobby.\n\nCLARENCE\nI'm just makin' sure we got everything.\n(pointing to Alabama)\n You got yours?\n\nShe holds up the suitcase. The phone rings. The three pile out the door. Floyd picks up the phone.\n\nFLOYD\nHello?\n\nHe puts his hand over the receiver.\n\nFLOYD\nDick, it's for you. You here?\n\nDICK\nNo. I left.\n\nHe starts to close the door then opens it again.\n\nDICK\nI'll take it.\n(he takes the receiver)\nHello.\n(pause)\nHi, Catherine, I was just walkin' out the -\n(pause)\nReally?\n(pause)\nI don't believe it.\n(pause)\nShe really said that?\n(pause)\nI'll be by first thing.\n(pause)\nNo, thank you for sending me out.\n(pause)\nBye-bye.\n\nHe hangs up and looks to Clarence.\n\nDICK\n(stunned)\nI got the part on \"T.J. Hooker\".\n\nCLARENCE\nNo shit? Dick, that's great!\n\nClarence and Alabama are jumping around. Floyd even smiles.\n\nDICK\n(still stunned)\nThey didn't even want a callback. They just hired me like that. Me and  \nPeter Breck are the two heavies. We start shooting Monday. My call is for  \nseven o'clock in the morning.\n\nCLARENCE\nAh, Dick, let's talk about it in the car. We can't be late.\n\nDick looks at Clarence. He doesn't want to go.\n\nDICK\nClarence.\n\nCLARENCE\nYeah?\n\nDICK\nUm, nothing, let's go?\n\nThey exit.\n\n\nEXT. LAX AIRPORT - HOTEL - DAY\n\nWe see the airport and move in closer on a hotel on a landscape.\n\n\nINT. LAX AIRPORT - HOTEL ROOM - DAY\n\nLenny can be seen putting a shotgun together. He is sitting on a bed.\n\nDario enters the frame with his own shotgun. He goes over to Lenny and gives him some shells.\n\nMarvin walks through the frame cocking his own shotgun.\n\nThe bathroom door opens behind Lenny and Frankie walks out twirling a couple of .45 automatics in his hands.\n\n\nINT. BEVERLY WILSHIRE - COP S' HOTEL ROOM - DAY\n\nNicholson and Dimes and FOUR DETECTIVES from internal affairs are in a room on the same floor as Donowitz. They have just put a wire on Elliot.\n\nDIMES\nOK, say something.\n\nELLIOT\n(talking loud into the wire)\nHello! Hello! Hello! How now brown cow!\n\nNICHOLSON\nJust talk regular.\n\nELLIOT\n(normal tone)\n\"But soft! What light through yonder window breaks?\nIt is the east and Juliet is the sun.\nArise, fair sun, and kill the envious moon,\nWho is already sick and pale with grief -\"\n\nDIMES\nAre you gettin' this shit?\n\nDETECTIVE BY TAPE MACHINE\nClear as a bell.\n\nNicholson, Dime, and the head IA Officer, Wurlitzer, huddle by Elliot.\n\nDIMES\nNow, remember, we'll be monitoring just down the hall.\n\nELLIOT\nAnd if there's any sign of trouble you'll come in.\n\nNICHOLSON\nLike gang-busters. Now, remember, if you don't want to go to jail, we gotta  \nput your boss in jail.\n\nDIMES\nWe have to show in court that, without a doubt, a successful man, an important figure in the Hollywood community, is also dealing cocaine.\n\nNICHOLSON\nSo you gotta get him to admit on tape that he's buying this coke.\n\nWURLITZER\nAnd this fellow Clarence?\n\nELLIOT\nYeah, Clarence.\n\nWURLITZER\nYou gotta get him name the police officer behind all this.\n\nELLIOT\nI'll try.\n\nDIMES\nYou do more than try.\n\nNICHOLSON\nYou do.\n\nDIMES\nHope you're a good actor, Elliot.\n\n\nINT. MOVING RED MUSTANG - DAY\n\nClarence, Dick and Alabama en route.\n\nDICK\nYou got that playing basketball?\n\nALABAMA\nYeah. I got elbowed right in the eye. And if that wasn't enough, I got  \nhurled the ball when I'm not looking. Wam! Right in my face.\n\nThey stop at a red light. Clarence looks at Alabama.\n\nCLARENCE\nRed light means love, baby.\n\nHe and Alabama start kissing.\n\n\nINT. MOVING CADILLAC - DAY\n\nMarvin, Frankie, Lenny and Dario in a rented Caddy.\n\n\nINT. BEVERLY WILSHIRE PARKING LOT - DAY\n\nClarence, Alabama, and Dick get out of the red Mustang. Dick takes the suitcase.\n\nCLARENCE\nI'll take that. Now, remember, both of you, let me do the talking.\n\nClarence takes out his .38. Dick reacts. They walk and talk.\n\nDICK\nWhat the fuck did you bring that for.\n\nCLARENCE\nIn case.\n\nDICK\nIn case of what?\n\nCLARENCE\nIn case they try to kill us. I don't know, what do you want me to say?\n\nDICK\nLook, Dillinger, Lee Donowitz is not a pimp -\n\nCLARENCE\nI know that Richard. I don't think I'll need it. But something this last  \nweek has taught me, it's better to have a gun and not to need it than to  \nneed a gun and not to have it.\n\nPause. Clarence stops walking.\n\nCLARENCE\nHold it, guys. I don't know about the rest of you, but I'm pretty scared.  \nWhat say we forget the whole thing.\n\nDick and Alabama are both surprised and relieved.\n\nDICK\nDo you really mean it?\n\nCLARENCE\nNo, I don't really mean it. Well, I mean, this is our last chance to think  \nabout it. How 'bout you, Bama?\n\nALABAMA\nI thought it was what you wanted, Clarence.\n\nCLARENCE\nIt is what I want. But I don't want to spend the next ten years in jail. I  \ndon't want you guys to go to jail. We don't know what could be waiting for  \nus up there. It'll probably be just what it's supposed to be. The only  \nthing that's waiting for us is two hundred thousand dollars. I'm just  \nlooking at the downside.\n\nDICK\nNow's a helluva time to play \"what if\".\n\nCLARENCE\nThis is our last chance to play \"what if\". I want to do it. I'm just scared  \nof getting caught.\n\nALABAMA\nIt's been fun thinking about the money but I can walk away from it, honey.\n\nCLARENCE\nThat rhymes.\n\nHe kisses her.\n\nDICK\nWell, if we're not gonna do it, let's just get in the car and get the fuck  \noutta here.\n\nCLARENCE\nYeah, let's just get outta here.\n\nThe three walk back to the car. Clarence gets behind the wheel. The other two climb in. Clarence hops back out.\n\nCLARENCE\nI'm sorry guys, I gotta do it. As petrified as I am, I just can't walk  \naway. I'm gonna be kicking myself in the ass for the rest of my life if I  \ndon't go in there. Lee Donowitz isn't a gangster lookin' to skin us, and  \nhe's not a cop, he's a famous movie producer lookin' to get high. And I'm  \njust the man who can get him there. So what say we throw caution to the  \nwind and let the chips fall where they may.\n\nClarence grabs the suitcase and makes a beeline for the hotel. Dick and Alabama exchange looks and follow.\n\n\nINT. BEVERLY WILSHIRE - LOBBY - DAY\n\nElliot's walking around the lobby. He's very nervous, so he's singing to himself.\n\nELLIOT\n(singing)\nThere's a man who leads a life of danger,\nTo everyone he meets\nhe stays a stranger.\nBe careful what you say,\nyou'll give yourself away...\n\n\nINT. BEVERLY WILSHIRE - COPS' HOTEL ROOM - DAY\n\nNicholson, Dimes, Wurlitzer, and the three other Detectives surround the tape machine. Coming from the machine:\n\nELLIOT'S VOICE\n(off)\n... odds are you won't live\nto see tomorrow,\nsecret agent man,\nsecret agent man....\n\nNicholson looks at Dimes.\n\nDIMES\nWhy, all of the sudden, have I got a bad feeling?\n\nBACK TO:\n\n\nLOBBY\n\nClarence enters the lobby alone, he's carrying the suitcase. He spots Elliot and goes in his direction. Elliot sees Clarence approaching him. He says to himself, quietly:\n\nELLIOT\nElliot, your motivation is to stay out of jail.\n\nClarence walks up to Elliot, they shake hands.\n\nELLIOT\nWhere's everybody else?\n\nCLARENCE\nThey'll be along.\n\nAlabama and Dick enter the lobby, they join up with Clarence and Elliot.\n\nELLIOT\nHi, Dick.\n\nDICK\nHow you doin', Elliot?\n\nCLARENCE\nWell, I guess it's about that time.\n\nELLIOT\nI guess so. Follow me.\n\n\nINT. BEVERLY WILSHIRE - ELEVATOR - DAY\n\nThe four of them are riding in the elevator. As luck would have it, they have the car to themselves. Rinky-drink elevator Muzak is playing. They are all silent.\n\nCLARENCE\nElliot.\n\nELLIOT\nYeah?\n\nCLARENCE\nGet on your knees.\n\nNot sure he heard him right.\n\nELLIOT\nWhat?\n\nClarence hits the stop button on the elevator panel and whips out his .38.\n\nCLARENCE\nI said get on your fuckin' knees.\n\nElliot does it immediately. Dick and Alabama react.\n\nCLARENCE\nShut up, both of you, I know what I'm doin'.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nPandemonium.\n\nDIMES\nHe knows.\n\nNICHOLSON\nHow the fuck could he know?\n\nDIMES\nHe saw the wire.\n\nNICHOLSON\nHow's he supposed to see the wire?\n\nDIMES\nHe knows something's up.\n\nBACK TO:\n\n\nELEVATOR\n\nClarence puts the .38 against Elliot's forehead.\n\nCLARENCE\nYou must think I'm pretty stupid, don't you?\n\nNo answer.\n\nCLARENCE\nDon't you?\n\nELLIOT\n(petrified)\nNo.\n\nCLARENCE\n(yelling)\nDon't lie to me, motherfucker. You apparently think I'm the dumbest  \nmotherfucker in the world! Don't you? Say: Clarence, you are without a  \ndoubt, the dumbest motherfucker in the whole wide world. Say it!\n\nBACK TO:\n\n\nCOPS' ROOM\n\nNICHOLSON\nWe gotta get him outta there.\n\nDIMES\nWhatta we gonna do? He's in an elevator.\n\nBACK TO:\n\n\nELEVATOR\n\nCLARENCE\nSay it, goddamn it!\n\nELLIOT\nYou are the dumbest person in the world.\n\nCLARENCE\nApparently I'm not as dumb as you thought I am.\n\nELLIOT\nNo. No you're not.\n\nCLARENCE\nWhat's waiting for us up there. Tell me or I'll pump two right in your  \nface.\n\nBACK TO:\n\n\nCOPS\n\nNICHOLSON\nHe's bluffin ya, Elliot. Can't you see that? You're an actor, remember, the  \nshow must go on.\n\nDIMES\nThis guy's gonna kill him.\n\nBACK TO:\n\n\nELEVATOR\n\nCLARENCE\nStand up.\n\nElliot does. The .38 is still pressed against his forehead.\n\nCLARENCE\nLike Nick Carter used to say: I I'm wrong, I'll apologize. I want you to  \ntell me what's waiting for us up there. Something's amiss. I can feel it.  \nIf anything out of the ordinary goes down, believe this, you're gonna be  \nthe first one shot. Trust me, I am AIDS, you fuck with me, you die. Now  \nquit making me mad and tell me why I'm so fucking nervous.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nDIMES\nHe's bluffin', I knew it. He doesn't know shit.\n\nNICHOLSON\nDon't blow it, Elliot. He's bluffin'. He just told you so himself.\n\nDIMES\nYou're an actor, so act, motherfucker.\n\nBACK TO:\n\n\nELEVATOR\n\nElliot still hasn't answered.\n\nCLARENCE\nOK.\n\nWith the .38 up against Elliot's head Clarence puts his palm over the top of the gun to shield himself from the splatter. Alabama and Dick can't believe what he's gonna do.\n\nElliot, tears running down, starts talking for the benefit of the people at the other end of the wire. He sounds like a little boy.\n\nELLIOT\nI don't wanna be here. I wanna go home. I wish somebody would just come and  \nget me 'cause I don't like this. This is not what I thought it would be.  \nAnd I wish somebody would just take me away. Just take me away Come and get  \nme. 'Cause I don't like this anymore. I can't take this. I'm sorry but I  \njust can't. So, if somebody would just come to my rescue, everything would  \nbe alright.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nNicholson and Dimes shake their hands, They have a \"well, that's that\" expression an their faces.\n\nBACK TO:\n\n\nELEVATOR\n\nClarence puts down the gun and hugs Elliot.\n\nCLARENCE\nSorry, Elliot. Nothing personal. I just hadda make sure you're all right.  \nI'm sure. I really apologize for scaring you so bad, but believe me, I'm  \njust as scared as you. Friends?\n\nElliot, in a state of shock, takes Clarence's hand. Dick and Alabama are relieved.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nNicholson and Dimes listen open-mouthed, not believing what they're hearing.\n\n\nINT. DICK'S APARTMENT - DAY\n\nFloyd still lying on the couch watching TV. He hasn't moved since we last saw him.\n\nThere is a knock from the door.\n\nFLOYD\n(not turning away from TV)\nIt's open.\n\nThe front door flies open and the four Wise-guys rapidly enter the room. The door slams shut. All have their sawed-offs drawn and pointing at Floyd.\n\nFLOYD\nYes.\n\nLENNY\nAre you Dick Ritchie?\n\nFLOYD\nNo.\n\nLENNY\nDo you know a Clarence Worley?\n\nFLOYD\nYes.\n\nLENNY\nDo you know where we can find him?\n\nFLOYD\nHe's at the Beverly Wilshire.\n\nLENNY\nWhere's that?\n\nFLOYD\nWell, you go down Beechwood...\n\n\nINT. BEVERLY WILSHIRE  - LEE'S HOTEL ROOM - DAY\n\nThe door opens and reveals an extremely muscular guy with an Uzi strapped to his shoulder standing in the doorway, his name is Monty.\n\nMONTY\nHi, Elliot. Are these your friends?\n\nELLIOT\nYou could say that. Everybody, this is Monty.\n\nMONTY\nC'mon in. Lee's in the can. He'll be out in a quick.\n\nThey all move into the room, it is very luxurious.\n\nAnother incredibly muscular GUY, Boris, is sitting on the sofa, he too has an Uzi. Monty begins patting everybody down.\n\nMONTY\nSorry, nothin personal.\n\nHe starts to search Clarence. Clarence back away.\n\nCLARENCE\nNo need to search me, daredevil. All you'll find is a .38 calibre.\n\nBoris gets up from the couch.\n\nBORIS\nWhat compelled you to bring that along?\n\nCLARENCE\nThe same thing that compelled you, Beastmaster, to bring rapid-fire weaponry to a business meeting.\n\nBORIS\nI'll take that.\n\nCLARENCE\nYou'll have to.\n\nThe toilet flushes in the bathroom. The door swings open and Lee Donowitz emerges.\n\nLEE\nThey're here. Who's who?\n\nELLIOT\nLee, this is my friend Dick, and these are his friends, Clarence and  \nAlabama.\n\nBORIS\n(pointing at Clarence)\nThis guy's packin'.\n\nLEE\nReally?\n\nCLARENCE\nWell, I have to admit, walkin' through the door and seein' these \"Soldier  \nof Fortune\" poster boys made me a bit nervous. But, Lee, I'm fairly  \nconfident that you came here to do business, not to be a wise-guy. So, if  \nyou want, I'll put the gun on the table.\n\nLEE\nI don't think that'll be necessary. Let's all have a seat. Boris, why don't  \nyou be nice and get coffee for everybody.\n\nThey all sit around a fancy glass table except for Boris, who's getting the coffee, and Monty, who's standing behind Lee's chair.\n\nCLARENCE\nOh, Mr. Donowitz -\n\nLEE\nLee, Clarence . Please don't insult me. Call me Lee.\n\nCLARENCE\nOK, sorry, Lee. I just wanna tell you \"Coming Home in a Body Bag\" is one of  \nmy favorite movies. After \"Apocalypse Now\" I think it's the best Vietnam  \nmovie ever.\n\nLEE\nThank you very much, Clarence.\n\nCLARENCE\nYou know, most movies that win a lot of Oscars, I can't stand. \"Sophie's  \nChoice\", \"Ordinary People\", \"Kramer vs. Kramer\", \"Gandhi\". All that stuff  \nis safe, geriatric, coffee-table dog shit.\n\nLEE\nI hear you talkin' Clarence. We park our cars in the same garage.\n\nCLARENCE\nLike that Merchant-Ivory clap-trap. All those assholes make are unwatchable  \nmovies from unreadable books.\n\nBoris starts placing clear-glass coffee cups in front of everybody and fills everybody's cup from a fancy coffee pot that he handles like an expert.\n\nLEE\nClarence, there might be somebody somewhere that agrees with you more than  \nI do, but I wouldn't count on it.\n\nClarence is on a roll and he knows it.\n\nCLARENCE\nThey ain't plays, they ain't books, they certainly ain't movies, they're  \nfilms. And do you know what films are? They're for people who don't like  \nmovies. \"Mad Max\", that's a movie. \"The Good, the Bad, and the Ugly\",  \nthat's a movie. \"Rio Bravo\", that's a movie. \"Rumble Fish\", that's a  \nfuckin' movie. And, \"Coming Home in a Body Bag\", that's a movie. It was the  \nfirst movie with balls to win a lot of Oscars since the \"The Deer Hunter\".\n\nBACK TO:\n\n\nCOPS' ROOM\n\nThey're all listening to this.\n\nDIMES\nWhat's this guy doin'? Makin' a drug deal or gettin' a job on the \"New  \nYorker\"?\n\nBACK TO:\n\n\nLEE'S ROOM\n\nCLARENCE\nMy uncle Roger and uncle Cliff, both of which were in Nam, saw \"Coming Home \nin a Body Bag\" and thought it was the most accurate Vietnam film they'd  \never seen.\n\nLEE\nYou know, Clarence, when a veteran of that bullshit wars says that, it  \nmakes the whole project worthwhile. Clarence, my friend, and I call you my  \nfriend because we have similar interests, let's take a look at what you  \nhave for me.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nDIMES\nThank God.\n\nBACK TO:\n\n\nLEE'S ROOM\n\nClarence puts the suitcase on the table.\n\nCLARENCE\nLee, when you see this you're gonna shit.\n\nBACK TO:\n\n\nLOBBY\n\nThe four Wise-guys are at the desk.\n\nLENNY\n(quietly to the others)\nWhat was the Jew-boy's name?\n\nMARVIN\nDonowitz, he said.\n\nFRONT-DESK GUY\nHow can I help you, Gentlemen?\n\nLENNY\nYeah, we're from Warner Bros. What room is Mr. Donowitz in?\n\nBACK TO:\n\n\nLEE'S ROOM\n\nLee's looking over the cocaine and sampling it.\n\nCLARENCE\nNow, that's practically uncut. You could, if you so desire, cut it a  \nhelluva lot more.\n\nLEE\nDon't worry, I'll desire. Boris, could I have some more coffee.\n\nCLARENCE\nMe too, Boris.\n\nBoris fills both of their cups. They both, calm as a lake, take cream and sugar. All eyes are on them. Lee uses light cream and sugar, he begins stirring this cup. Clarence uses very heavy cream and sugar.\n\nLEE\n(stirring loudly)\nYou like a little coffee with your cream and sugar?\n\nCLARENCE\nI'm not satisfied till the spoon stands straight up.\n\nBoth are cool as cucumbers.\n\nLEE\nI have to hand it to you, this is not nose garbage, this is quality. Can  \nBoris make anybody a sandwich? I got all kinds of sandwich shit from  \nCanters in there.\n\nALABAMA\nNo thank you.\n\nDICK\nNo. But thanks.\n\nCLARENCE\nNo thanks, my stomach's a little upset. I ate somethin' at a restaurant  \nthat made me a little sick.\n\nLEE\nWhere'd you go?\n\nCLARENCE\nA Norms in Van Nuys.\n\nLEE\nBastards. That's why I always eat at Lawreys.\n\nLee continues looking at the merchandise.\n\nAlabama writes something in her napkin with a pencil. She slides the napkin over to Clarence. It says: \"You're so cool\" with a tiny heart drawn on the bottom of it. Clarence takes the pencil and draws an arrow through the heart. She takes the napkin and puts it in her pocket.\n\nLee looks up.\n\nLEE\nOK, Clarence, the merchandise is perfect. But, whenever I'm offered a deal  \nthat's too good to be true, it's because it's a lie. Convince me you're on  \nthe level.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nDIMES\nIf he don't bite, we ain't got shit except posession.\n\nNICHOLSON\nConvince him.\n\nBACK TO:\n\n\nLEE'S ROOM\n\nCLARENCE\nWell, Lee, it's like this. You're getting the bargain of a lifetime because  \nI don't know what the fuck I'm doing. You're used to dealin' with  \nprofessionals. I'm not a professional. I'm a rank amateur. I could take  \nthat, and I could cut it, and I could sell it a little bit at a time, and  \nmake a helluva lot more money. But, in order to do that, I'd have to become  \na drug dealer. Deal with cut-throat junkies, killers, worry about getting  \nbusted all of the time. Just meeting you here today scares the shit outta  \nme, and you're not a junkie, a killer or a cop, you're a fucking  \nmovie-maker. I like you, and I'm still scared. I'm a punk kid who picked up  \na rock in the street, only to find out it's the Hope Diamond. It's worth a  \nmillion dollars, but I can't get the million dollars for it. But, you can.  \nSo, I'll sell it to you for a couple a hundred thousand. You go to make a  \nmillion. It's all found money to me anyway. Me and my wife are minimum wage  \nkids, two hundred thousand is the world.\n\nLEE\nElliot tells me you're fronting for a dirty cop.\n\nCLARENCE\nWell, Elliot wasn't supposed to tell you anythin'.\n(to Elliot)\nThanks a lot, bigmouth. I knew you were a squid the moment I laid eyes on  \nyou. In my book, buddy, you're a piece of shit.\n(to Lee)\nHe's not a dirty cop, he's a good cop. He just saw his chance and he took  \nit.\n\nLEE\nWhy does he trust you?\n\nCLARENCE\nWe grew up together.\n\nLEE\nIf you don't know shit, why does he think you can sell it?\n\nCLARENCE\nI bullshitted him.\n\nLee starts laughing.\n\nLEE\nThat's wild. This fucking guy's a madman. I love it. Monty, go in the other  \nroom and get the money.\n\nClarence, Alabama and Dick exchange looks.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nNicholson and Dimes exchange looks.\n\nDIMES & NICHOLSON\nBingo!\n\nBACK TO:\n\n\nELEVATOR\n\nThe four Wise-guys are coming up.\n\nBACK TO:\n\n\nLEE'S ROOM\n\nLEE\n(pointing to Alabama)\nWhat's your part in this?\n\nALABAMA\nI'm his wife.\n\nLEE\n(referring to Dick)\nHow 'bout you?\n\nDICK\nI know Elliot.\n\nLEE\nAnd Elliot knows me. Tell me, Clarence, what department does you friend  \nwork in?\n\nDick and Alabama panic.\n\nCLARENCE\n(without missing a beat)\nCarson County Sheriffs.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nThe internal affairs officers high five.\n\nBACK TO:\n\n\nLEE'S ROOM\n\nMonty brings in a briefcase of money and puts it down on the table.\n\nLEE\nWanna count your money?\n\nCLARENCE\nActually, they can count it. I'd like to use the little boy's room.\n\nBACK TO:\n\n\nCOPS' ROOM\n\nThey all stand.\n\nDIMES\nOK, boys. Let's go get 'em.\n\n\nINT. BEVERLY WILSHIRE - LEE'S HOTEL ROOM - BATHROOM - DAY\n\nClarence steps inside the bathroom and shuts the door. As soon as it's shut he starts doing the twist. He can't believe he's pulled it off. He goes to the toilet and starts taking a piss. He turns and sees Elvis sitting on the sink.\n\nELVIS\nClarence, I gotta hand it to ya. You were cooler than cool.\n\nCLARENCE\nI was dying. I thought for sure everyone could see it on my face.\n\nELVIS\nAll anybody saw was Clint Eastwood drinkin' coffee.\n\nCLARENCE\nCan you develop an ulcer in two minutes? Being cool is hard on your body.\n\nELVIS\nOh, and your line to Charles Atlas in there: \"I'll take that gun\", \"You'll  \nhave to\".\n\nCLARENCE\nThat was cool, wasn't it? You know, I don't even know where that came from.  \nI just opened my mouth and it came out. After I said it I thought, that's a  \ncool line, I gotta remember that.\n\nBACK TO:\n\n\nLEE'S ROOM\n\nEverything's just as it was.\n\nSudenly, Nicholson, Dimes and the four Detectives break into the room with guns drawn.\n\nDIMES & NICHOLSON\nPolice! Freeze, you're all under arrest!\n\nEverybody at the table stands up. Boris and Monty stand ready with the Uzis.\n\nDIMES\nYou two! Put the guns on the floor and back away.\n\nMONTY\nFuck you! All you pigs put your guns on the floor and back away.\n\nLEE\nMonty, what are you talking about? So what they say.\n\nDIMES\nThis is your last warning! Drop those fuckin' guns!\n\nBORIS\nThis is your last warning! We could kill all six of ya and ya fuckin' know  \nit! Now get on the floor!\n\nDICK\nWhat the fuck am I doing here?\n\nLEE\nBoris! Everybody's gonna get killed! They're cops!\n\nMONTY\nSo they're cops. Who gives a shit?\n\nBORIS\nLee, something I never told you about me. I don't like cops.\n\nNICHOLSON\nOK, let's everybody calm down and get nice. Nobody has to die. We don't  \nwant it, and you don't want it.\n\nLEE\nWe don't want it.\n\nThe four Wise-guys burst through the door, shotguns drawn, except for Frankie, who has two .45 automatics, one in each hand.\n\nHalf of the cops spin around.\n\nWURLITZER\nFreeze!\n\nLENNY\nWho are you guys?\n\nWURLITZER\nPolice.\n\nDARIO\n(to Lenny)\nDo we get any extra if we have to kill cops?\n\nBACK TO:\n\n\nBATHROOM\n\nClarence and Elvis.\n\nCLARENCE\nHow do you think I'm doin' with Lee?\n\nELVIS\nAre you kiddin'? He loves you.\n\nCLARENCE\nYou don't think I'm kissin' his ass, do you?\n\nELVIS\nYou're tellin' him what he wants to hear, but that ain't the same thing as  \nkissin' his ass.\n\nCLARENCE\nI'm not lyin' to him. I mean it. I loved \"Coming Home in a Body Bag\".\n\nELVIS\nThat's why it doesn't come across as ass-kissin', because it's genuine, and  \nhe can see that.\n\nElvis fixes Clarence's collar.\n\nELVIS\nI like ya, Clarence. Always have.\n\nBACK TO:\n\n\nLEE'S ROOM\n\nThis is a Mexican stand-off if there ever was one. Gangsters on one end with shotguns. Bodyguards with machine guns on the other. And cops with handguns in the middle.\n\nDick's ready to pass out.\n\nAlabama's so scared she pees on herself.\n\nFor Elliot, this has been the worst day of his life, and he's just about had it.\n\nELLIOT\nOfficer Dimes? Officer Dimes.\n\nDimes looks at Elliot.\n\nELLIOT\n This has nothing to do with me anymore. Can I just leave and you guys just  \nsettle it by yourselves?\n\nDIMES\nElliot, shut the fuck up and stay put!\n\nLEE\n(to Elliot)\nHow did you know his name? How the fuck did he know your name? Why, you  \nfuckin' little piece of shit!\n\nELLIOT\nLee, understand, I didn't want to -\n\nDIMES\nShut the fuck up!\n\nLEE\nWell, I hope you're not planning on acting any time in the next twenty  \nyears 'cause your career is over as of now! You might as weel burn your SAG  \ncard! To think I treated you as a son! And you stabbed me in the heart!\n\nLee can't control his anger any more. He grabs the coffee pot off the table and flings hot coffee into Elliot's face. Elliot screams and falls to his knees,\n\nInstinctively, Nicholson shoots Lee twice.\n\nAlabama screams.\n\nBoris lets loose with his Uzi, pinting Nicholson red with bullets.\n\nDIMES\n(screaming)\nCody!!!\n\nNicholson flies backwards.\n\nMarvin fires his shotgun, hits Nicholson in the back, Nicholson's body jerks back and forth then on the floor.\n\nClarence opens the bathroom door.\n\nDimes hits the ground firing.\n\nA shot catches Clarence in the forehead.\n\nAlabama screams.\n\nDario fires his sawed-off. It catches Clarence in the chest, hurling him on the bathroom sink, smashing the mirror.\n\nIt might have been a stand-off before, but once the firing starts everybody either hits the ground or runs for cover.\n\nDimes, Alabama, Dick, Lenny, an IA Officer and Wurtlitzer hit the ground.\n\nBoris dives into the kitchen area.\n\nMonty tips the table over.\n\nMarvin dives behind the sofa.\n\nDario runs out of the door and down the hall.\n\nWith bullets flying this way and that, some don't have time to anything. Two IA Officers are shot right away.\n\nFrankie takes an Uzi hit. He goes down firing both automatics.\n\nElliot gets it from both sides.\n\nAlabama is crawling across the floor, like a soldier in war, towards the bathroom.\n\nClarence, still barely alive, lays on the sink, twitching. He moves and falls off.\n\nAlabama continues crawling.\n\nMarvin brings his sawed-off from behind the sofa and fires. The shotgun blast hits the glass table and Monty. Monty stands up screaming.\n\nThe Cops on the ground let loose, firing into Monty.\n\nAs Monty gets hit, his finger hits the trigger of the Uzi, spreading fire all over the apartment.\n\n\nEXT. BEVERLY WILSHIRE - DAY\n\nCop cars start arriving in twos in front of the hotel.\n\nBACK TO:\n\n\nGUNFIGHT\n\nAlabama crawling.\n\nThe suitcase full of cocaine is by Dick. Dick grabs it and tosses it in the air. Marvin comes from behind the sofa and fires. The suitcase is hit in mid-air. White powder goes everywhere. The room is enveloped in cocaine.\n\nDick takes this cue and makes a dash out the door.\n\nAn IA Officer goes after him.\n\nLenny makes a break for it.\n\nWurlitzer goes after him but is pinned down by Marvin.\n\nAlabama reaches the bathroom and finds Clarence.\n\nALABAMA\nSweety?\n\nClarence's face is awash with blood.\n\nCLARENCE\nI... I can't see you... I've got blood in my eyes...\n\nHe dies.\n\nAlabama tries to give him outh-to-mouth resuscitation.\n\n\nINT. BEVERLY WILSHIRE - HALLWAY - DAY\n\nDario runs down the hall, right into a cluster of uniformed police.\n\nHe fires his shotgun, hitting two, just before the others chop him to ribbons.\n\n\nINT. BEVERLY WILSHIRE - ANOTHER HALLWAY\n\nThe hallway's empty but we hear footsteps approaching fast. Dick comes around the corner, running as if on fire. Then we see the IA Officer turn the same corner.\n\nIA OFFICER\n(aiming gun)\nFreeze!\n\nDick does.\n\nDICK\nI'm unarmed!\n\nIA OFFICER\nPut your hands on your head, you son-of-a-bitch!\n\nHe does. Then, from off screen, a shotgun blast tears into the IA Officer, sending him to the wall.\n\nDICK\nOh shit.\n\nHe starts running again and runs out of frame, then Lenny turns around the corner and runs down the hall.\n\nDick runs into the elevator area, he hits the buttons, he's trapped, it's like a box.\n\nLenny catches up. Dick raises his hands. Lenny aimes his sawed-off.\n\nDICK\nLook, I don't know who you are, but whatever it was that I did to you, I'm  \nsorry.\n\nTwo elevator doors on either side of them open.\n\nLenny looks at Dick. He drops his aim and says:\n\nLENNY\nLotsa luck.\n\nLenny dives into one elevator car. Dick jumps into the other, just as the doors close.\n\nBACK TO:\n\n\nHOTEL ROOM\n\nThe Mexican stand-off has become two different groups of two pinning each other down.\n\nWurlitzer has Marvin pinned down behind the sofa and Dimes has Boris pinned down in the kitchen.\n\nIn the bathroom, Alabama's pounding on Clarence's bloody chest, trying to get his heart started. It's not working. She slaps him hard in the face a couple of times.\n\nALABAMA\nWake up, goddamn it!\n\nDimes discards his handgun and pulls one of the sawed-off shotguns from the grip of a dead Wise-guy.\n\nBoris peeks around the wall to fire.\n\nDimes lets loose with a blast. A scream is heard.\n\nBORIS\n(off)\nI'm shot! Stop!\n\nDIMES\nThrow out your gun, asshole!\n\nThe Uzi's tossed out.\n\nDimes goes to where Wurlitzer is.\n\nDIMES\n(to Marvin)\nOK, black jacket! It's two against one now! Toss the gun and lie face down  \non the floor or die like all you friends.\n\nThe shotgun's tossed out from behind the sofa.\n\n\nINT. BEVERLY WILSHIRE - ELEVATOR - DAY\n\nDick's sitting on the ground, he can't believe any of this. The doors open on the fourth floor. He runs out into the hallway.\n\n\nHALLWAY\n\nHe starts trying the room doors for an open one.\n\nDICK\nOh, God, if you just get me outta this I swear to God I'll never fuck up  \nagain. Please, just let me get to \"T.J. Hooker\" on Monday.\n\n\nSTEWARDESS'S ROOM - DAY\n\nDick steps in. Three gorgeous girls are doing a killer aerobics workout to a video on TV. The music is so loud they're so into their exercises, they don't hear Dick tiptoe behind them and crawl underneath the bed.\n\n\nLEE'S ROOM\n\nBoris has caught a lot of buckshots, but he'll live. He's lying on the kitchen floor. Dimes stands over him. He has the sawed-off in his hand.\n\nDIMES\nDon't even give me an excuse, motherfucker.\n\nDimes pats him down for other weapons, there are none.\n\nWurlitzer puts the cuffs on Marvin and sits him down on the couch.\n\nDimes looks in the bathroom and sees the dead Clarence with Alabama crying over him.\n\nDimes walks over to Wurlitzer.\n\nDIMES\nEverything's under control here.\n\nWURLITZER\nSorry about Nicholson.\n\nDIMES\nMe too.\n\nWURLITZER\nI'm gonna go see what's goin' on outside.\n\nDIMES\nYou do that.\n\nWurlitzer exits. Dimes grabs the phone.\n\n\nLOBBY\n\nShotgun in hand, Lenny moves hurriedly down the lobby.\n\nA Cop yells out.\n\nCOP\nYou! Stop!\n\nLenny brings up his sawed-off and lets him have it. Other cops rush forward. Lenny grabs a woman standing by.\n\nLENNY\nGet back or I'll blow this bitch's brains to kingdom come!\n\n\nLEE'S ROOM\n\nDimes on the phone talking with the department. Boris is still moving on the floor. Marvin is sitting on the couch with his hands cuffed behind his back. Alabama is crying over Clarence, then she feels something in his jacket. She reaches in and pulls out his .38. She wipes her eyes. She holds the gun in her hand and remembers Clarence saying:\n\nCLARENCE\n(off)\nShe's a sixteen-calibre kitten, equally equipped for killin' an' lovin'!  \nShe carried a sawed-off shotgun in her purse, a black belt around her  \nwaist, and the white-hot fire of hate in her eyes! Alabama Whitman is Pam  \nGrier! Pray for forgiveness, Rated R... for Ruthless Revenge!\n\nAlabama steps out of the bathroom, gun in hand.\n\nMarvin turns his head toward her. She shoots him twice.\n\nDimes, still on the phone, spins around in time to see her raise her gun. She fires. He's hit in the head and flung to the floor.\n\nShe sees Boris on the kitchen floor.\n\nALABAMA\nBye-bye, Boris. Good luck.\n\nBORIS\nYou too, cutie.\n\nShe starts to leave and then spots the briefcase full of money. She takes it and walks out the door.\n\n\nHALLWAY\n\nThe elevator opens and Wurlitzer steps out.\n\nAlabama comes around the corner.\n\nWURLITZER\nHey, you!\n\nAlabama shoots him three times in the belly. She steps into the elevator, the doors close.\n\n\nLOBBY\n\nAlabama enters the lobby and proceeds to walk out. In the background, cops are all over the place and Lenny is still yelling with the woman hostage.\n\nLENNY\nI wanna car here, takin' me to the airport, with a plane full of gas ready  \nto take me to Kilimanjaro and... and a million bucks!\n(pause)\nSmall bills!\n\n\nEXT. BEVERLY WILSHIRE - PARKING LOT - DAY\n\nAlabama puts the briefcase in the trunk. She gets into the Mustang and drives away.\n\n\nINT. MUSTANG - MOVING - DAY\n\nAlabama's driving fast down the freeway. The DJ on the radio is trying to be funny. She's muttering to herself.\n\nALABAMA\nI could have walked away. I told you that. I told you I could have walked \naway. This is not my fault. I did not do this. You did this one hundred \npercent to yourself. I'm not gonna give you the satisfaction of feeling \nbad. I should laugh 'cause you don't deserve any better. I could get \nanother guy like that. I'm hot lookin'. What are you? Dead! Dumb jerk. \nAsshole. You're a asshole, you're a asshole, you're a asshole. You wanted \nit all, didn't ya? Didn't ya? Well watcha got now? You ain't got the money. \nYou ain't got me. You ain't even got your body anymore. You got nothin'. \nNada. Zip. Goose egg. Nil. Donut.\n\nThe song \"Little Arrows\" by Leapy Lee comes on the radio. Alabama breaks down and starts crying. She pulls the car over to the side. The song continues. She wipes her eyes with a napkin that she pulls out her jacket. She tosses it on the dashboard. She picks up the .38 and sticks it in her mouth.\n\nShe pulls back hammer. She looks up and sees her reflection in the rear-view mirror. She turns it the other way. She looks straight ahead. Her finger tightens on the trigger. She sees the napkin on the dashboard. She opens it up and reads it: \"You're so cool\".\n\nShe tosses the gun aside, opens up the trunk, and takes out the briefcase. She looks around for, and finally finds, the \"Sgt. Fury\" comic book Clarence bought her.\n\nAnd with comic book in one hand, and briefcase in the other, Bama walks away from the Mustang forever.\n\nFADE OUT\n\n\n\nTHE END\n\n\n\n\n\n\n\nScreenplay by Quentin Tarantino\n\nProduced by Samuel Hadida\nSteve Perry\nBill Unger\n\nDirected by Tony Scott\n\nCast List:\n\nChristian Slater Clarence Worley\nPatricia Arquette Alabama Whitman\nDennis Hopper Clifford Worley\nMichael Rapaport Dick Ritchie\nBronson Pinchott Elliot Blitzer\nChristopher Walken Vincenzo Coccotti\nSaul Rubinek Lee Donowitz\nSamuel L. Jackson Big Don\nBrad Pitt Floyd\nVal Kilmer Elvis (Mentor)\n\n\nTyped with two bare fingers by Niki Wurster\nRemoved from zip format and formatted in text format by Kale Whorton.\n\n\nFormatted in HTML by Dabrast Caustic\n\n\n\n\n\n\n\n\n\n\n\n\nTrue Romance\nWriters :   Quentin Tarantino\nGenres :   Action  Crime  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:40.475207"}