{"title": "True Lies", "film_link": "/Movie Scripts/True Lies Script.html", "script_link": "/scripts/True-Lies.html", "info_raw": "\n\nTrue Lies Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Claude Zidi  Simon Michaël  Didier Kaminka  James Cameron\nGenres  Action  Adventure  Comedy  Romance  Thriller\nScript Date :  1994\n\nRead \"True Lies\" Script\n\n\n", "script": "\n\n\n                          T R U E   L I E S\n\n                               WRITTEN\n\n                                 BY\n\n                            JAMES CAMERON\n\n\n                       -----------------------\n\n          TITLE SEQUENCE\n\n      1   EXT. MOUNTAINS, NEAR GENEVA, SWITZERLAND - NIGHT\n\n          The snow covered Alps stand out clearly in the light of a full\n          moon.  A fortress-like CHATEAU is situated in a flat saddle of\n          forest partway up the mountain, next to a frozen lake.  The\n          property is surrounded by high stone walls, and the stately\n          grounds are bathed in floodlights and patrolled by armed guards\n          with dogs.\n\n\n      2   EXT. CHATEAU - NIGHT\n\n          The driveway and motorcourt are filled with cars.  A formal-\n          dress party is in progress... a private reception for a middle-\n          eastern dignitary.  Tuxedoes men escort their diamond-encrusted\n          ladies through the huge front doors, where they doff their\n          overcoats and are politely scanned with hand-held metal\n          detectors by white gloved security staffers.\n\n          The walled perimeter of the house runs along the lake, forming\n          a kind of rampart.  There is an opening, to a kind of waterway\n          or canal, which connects to the private docks inside the\n          grounds.  There is a steel grating across the opening.  The\n          bars disappear down into the thin ice of early winter.\n\n          With the house visible BG, we CRANE DOWN below the parapet wall\n          along which a guard is a white exposure-suit is walking... down\n          along the dark wall to the grating... TILTING DOWN to see a\n          glow pulsing under the ice.\n\n      \n      3   EXT. BENEATH THE ICE, UNDERWATER - NIGHT      \n      \n          Camera moving toward:  A FIGURE in diving gear working at the\n          metal bars with an oxygen arc cutting torch.  One bar has\n          already been cut out.  Two quick cuts and a second bar falls to\n          the muddy bottom.  Lit now only from the floodlights filtering\n          down through the ice, the figure slips through the bars and\n          swims powerfully along the stone canal wall.\n\n          Seem from below, the figure is a black shadow moving against\n          the rippled-glass of the ice above.\n\n\n      4   EXT. CANAL AND BOATHOUSE - NIGHT\n\n          A dock extends into the frozen canal, just behind a large\n          boathouse.  There is a faint chipping sound.  The ice breaks\n          quietly, and the pieces are slid back.  A head appears, in a\n          rubber drysuit hood.  The DIVER slips the regulator out of his\n          mouth and turns slowly, scanning...  revealing:\n\n          HARRY TASKER.  Our hero.  Harry floats with just his eyes above\n          the surface, silent as a water snake, as a guard passes on a\n          footpath nearby.\n\n          After a few beats Harry slips out of his tanks and fins,\n          letting them sink, and climbs the frozen ladder onto the dock.\n          He moves like a ninja into the shadows of the boathouse.\n          Opening a WATERPROOF BAG, he pulls out a walky talky.\n\n                              HARRY\n                    Honey, I'm home.\n\n\n      5   INT. / EXT. SURVEILLANCE VAN, MOUNTAIN ROAD - NIGHT\n\n          Meet Harry's partner, ALBERT \"GIB\" GIBSON, an overweight twenty-\n          year-man with a lived in looking face.  Gib answers Harry via\n          his headset.\n\n                              GIB\n                    Roger that. \n                         (he covers the mike and\n                          turns)\n                    Hey, Fize!  Get your butt in\n                    here.  Harry's inside.\n\n          Outside, FAST FAISIL, an Iranian-American, finishes making\n          yellow snow and hurries back to the van.  They are parked on a\n          winding mountain road a half-mile from the chateau, whose\n          lights are visible through the trees.\n\n          Faisil jumps in and goes to the eyepiece of a huge telephoto\n          nightvision scope.  The eerie green image lurches as he sweeps\n          the grounds, locating the boathouse.\n\n\n      6   EXT. BOATHOUSE - NIGHT\n\n          Concealed in the shadows, Harry is shucking out of his drysuit.\n          Underneath is he is wearing black tux pants, suspenders,\n          cummerbund and a formal shirt.  He puts a tiny plug, like a\n          hearing aid, deep in his ear canal.  A SUB-VOCAL TRANSCEIVER.\n          Very advanced.\n\n                              HARRY\n                    Switching to sub-vocal.  Gib, you\n                    copy?\n\n                              GIB (OVER)\n                    It's Talkradio.  You're on the\n                    air.\n\n          Harry slips into his shoulder harness... holster on one side,\n          containing his .45 auto Glock-22, and the transmitter pack for\n          the ear-piece slung on the other.  He slips on a formal jacket,\n          concealing the rig.  Then a final touch.  A little aftershave\n          from a tiny plastic vial.\n\n          Harry adjusts his bow-tie and strides confidently out of the\n          shadows, crossing quickly to the main house.  He looks\n          ultrasharp in his black tux with the white silk cummerbund and\n          his hair slicked back.  He enters the main house through a back\n          service entrance.\n\n\n      7   INT. KITCHEN - NIGHT\n                                \n          Harry strides through the huge kitchen like he owns the place.\n          The kitchen staff are scurrying around, too busy to really\n          notice.  He finger-tastes a dish as he passes.\n\n                              HARRY\n                         (French/ subtitled)\n                    This needs more garlic.\n\n          He breezes through unchallenged, exiting into the--\n\n\n      8   INT. MAIN HALL - NIGHT\n\n          Here the party is in full swing.  Harry blends smoothly into\n          the crowd of foreign dignitaries, businessman and minor mid-\n          east nobility.  They are a high-octane mixture of new oil money\n          and old European money, and run the spectrum from stodgy\n          bankers to playboy arms dealers.\n\n          Harry strolls amiably among the glittering woman, the cigar\n          smoking men, casually snagging a glass of champagne and a\n          canape from the passing waiters.  He nods to someone as if he\n          knows them.  Greets another is quite fluent Arabic.  People in\n          his wake look at each other like \"Do you know him?\"   They\n          shrug, go on with their conversation.  Harry moves through the\n          crowd.  Scanning.\n\n                              HARRY\n                    There's Daddy Petrobucks.\n\n          HARRY'S POV - Through the crowd is sees JAMAL KHALED, the host\n          of the party and owner of the chateau.  He is fat and animated,\n          greeting guests with a flourish.  As Harry watches he warmly     *\n          greets a beautiful WOMAN.  They become absorbed in a             *\n          conversation.\n\n          The woman glances up and sees Harry checking her out.  There is\n          a frank moment of returned interest.  Then the crowd shifts,\n          cutting off their view of each other.\n\n\n      9   INT. STAIRCASE AND SECOND FLOOR - NIGHT\n\n          Harry makes his way up the grand staircase to the second floor.  *\n          He slips through doors into the private area of the mansion.     *\n\n\n     10   INT. LIBRARY - NIGHT\n\n          The doors open and Harry slips into the darkened library.  He    *\n          crosses quickly to a window and opens it onto a terrace.         *\n\n\n     11   EXT. BALCONIES - NIGHT                                           *\n\n          Harry goes onto the terrace, and in a display of acrobatic       *\n          prowess, he pulls himself up onto the third floor balcony        *\n          directly above.  He lets himself into--                          *\n\n\n     12   INT. KHALED'S OFFICE - NIGHT                                     *\n\n          Khaled's office is ornately furnished.  Beautiful antiques\n          glint in the moonlight coming in the French-doors.  Harry\n          crosses to an immense desk and boots up the computer there.\n          Bathed in the glow from the screen, he pulls a FLAT BOX,  about\n          the size of a paperback,  from the back of his cummerbund.  He\n          connects it quickly to the modem port in the back of the\n          computer.\n\n                              HARRY\n                    Modem in place.  Transmitting...\n                    now.\n\n          He pushes a button and a green light comes on.\n\n\n     13   INT. VAN - NIGHT\n\n          Gib and Faisil watch as their monitor screen lights with DATA\n          from Khaled's private computer.\n\n                              FAISIL\n                    Affirmatory.  We are in.                               *\n\n          Fast Faisil is a computer ace.  His fingers fly on the keyboard\n          as he types rapid key commands.  We see familiar \"windows\n          appear\".  The words are all in Arabic characters.\n\n                              FAISIL\n                    These are encrypted files, guys.\n                    This is going to take me a few\n                    minutes.\n\n\n     14   OMITTED                                                          *\n\n\n     15   INT. 2ND FLOOR HALLWAY - NIGHT                                   *\n\n          TIGHT ON LIBRARY DOOR.  It opens a crack and a dental mirror     *\n          comes out, looking around like a U-boat periscope.  Seeing the\n          coast is clear Harry slips out.  But just as he is closing the\n          door, a GUARD rounds the corner ten feet away.  Harry turns\n          smoothly.  He smiles sheepishly and moves toward the guard.\n\n                              HARRY\n                         (In Arabic/ subtitled)\n                    Where's the john around here?  I\n                    have to take a major leak.\n\n          The guard points warily down the corridor.  Harry nods and\n          heads that way, back toward the party.\n\n\n     16   INT. MAIN HALL/ STAIRCASE - NIGHT\n\n          Harry comes down the staircase amid the glitter of the party.\n          He is sipping champagne and looking bored.  He sees two\n          security guys moving purposefully through the crowd toward the\n          stairs, walkies in their hands.  He turns away as they pass him\n          and pretends to study a large fragment of bas-relief... a\n          temple frieze depicting a war chariot drawn by four horses.\n\n          He senses someone next to him and turns.  It is the WOMAN.  She  *\n          is captivatingly beautiful, and her gaze is piercing.\n\n                              HARRY\n                         (indicating the bas-\n                          relief)\n                    Magnificent, isn't it?\n\n                              WOMAN\n                    Yes.  Hi, I'm Juno Skinner.  I\n                    thought I knew most of Khaled's\n                    friends but I don't believe I\n                    know you.\n\n          Harry offers his hand to her.\n\n                              HARRY\n                    Renquist.  Harry Renquist.\n\n\n     17   INT. VAN - NIGHT\n\n          Gib whirls to the screen displaying the mission database.  He\n          scans rapidly for--\n\n                              GIB\n                    Skinner.  Skinner.  Come on...\n\n          Gib finds the entry he's looking for.  Juno's picture and data\n          appear on the screen.\n\n                              GIB\n                    Juno Skinner.  Art and\n                    antiquities dealer, specializing\n                    in ancient Persia.\n\n\n     18   INT. MAIN HALL - NIGHT\n\n          Harry turns back to the fragment of frieze.\n\n                              HARRY\n                    This is Persian, if I'm not\n                    mistaken.\n\n                              JUNO\n                    Very good.  It's sixth century\n                    B.C.  Do you like the period?\n\n                              HARRY\n                         (shameless)\n                    I adore it.\n\n\n     19   EXT. DOCK/ BOATHOUSE (NIGHTVISION POV) - NIGHT\n\n          Seen through the starlight scope, we see one of the guards\n          shining his light on the hole in the ice and then on Harry's\n          footprints leading to the boathouse.  He calls to one of the\n          other guards, who comes running over.\n\n\n     20   INT. MANSION - NIGHT\n\n          Harry, still with Juno, hears Gib in his ear:\n\n                              GIB (VO)\n                    Harry, we got a problem.  Guards\n                    are swarming all over the dock.\n\n          Harry glances up the stairs.  Khaled's SECURITY CHIEF is\n          gesturing to several of his men, and speaking quickly into a\n          walky.  Three SECURITY MEN come down the stairs, scanning the\n          crowd.  Harry turns smoothly away from them and takes Juno's\n          arm.\n\n                              HARRY\n                    Do you dance, Ms. Skinner?\n\n          He steers her toward the dance floor.\n\n\n     21   INT. VAN - NIGHT\n\n          Gib, listening, rolls his eyes.  He looks through the night-\n          vision scope.  Guards are running around outside the chateau.\n          Harry's stirred up the hornet's nest.  Faisil is still jamming\n          at the keyboard.\n\n                              FAISIL\n                    Okay, files are unlocked.  I'm\n                    in. I'm down, baby.  I got my\n                    hand up her dress and I'm going\n                    for the gold.  I'm--\n\n                              GIB\n                    Just copy the goddamn files!\n                         (into his headset)\n                    Harry, don't be stopping to smell\n                    the roses, now.  You hear me,\n                    Harry?\n\n\n     22   INT. MAIN HALL - NIGHT\n\n          Harry whirls Juno aggressively across the dancefloor.  She\n          responds deftly.  They are well matched.  She parries each of\n          his smooth moves with a flourish.  It is a contest of wills,\n          and a surprised appraisal for each that the other is worthy.\n          Juno is hot.  He bends her back at the waist, then snaps her\n          up.  She twirls into the crook of his arm.  Their faces are\n          inches apart.  Wow.  The music ends and she gives him a wry\n          grin.\n\n                              JUNO\n                    Well.  And I thought this was\n                    going to be just another bunch of\n                    boring bankers and oil\n                    billionaires.\n\n                              GIB (OVER)\n                    Harry, seconds count, buddy.\n                    Ditch the bitch, let's go.\n\n                              HARRY\n                    Unfortunately, Juno, I have a\n                    plane to catch.\n\n          She slips a card out of a pocket in her otherwise sheer dress.\n          She hands it to him, maintaining eye contact.  Serious sparks.\n\n                              JUNO\n                    Call me, if you'd like to see\n                    some of my other pieces.\n\n                              HARRY\n                    I'd like that.\n\n\n     23   INT. VAN - NIGHT\n\n          Gib can't believe this conversation.\n\n                              GIB\n                         (to Faisil)\n                    Son of a bitch is with her two\n                    minutes and she's ready to bear\n                    his children\n                         (to Harry)\n                    What's your exit strategy Twinkle\n                    Toes?\n\n\n     24   EXT. CHATEAU/ FRONT ENTRANCE - NIGHT\n\n          Harry nods to the security men at the door as he strides\n          confidently through.  He goes down the steps to the broad\n          terrace above the motor court.  Behind Harry, a GUARD lowers\n          his walky talky and starts after him.\n\n                              GUARD\n                    May I see your invitation, sir?\n\n          Without turning, Harry slips a small flat box out of his breast\n          pocket.  A REMOTE DETONATOR.\n\n                              HARRY                                        *\n                    Here's my invitation.                                  *\n\n          He pushes the button and--                                       *\n\n          KABOOM!  The  second floor office windows blow out in a fiery\n          explosion.  Using the diversion, Harry leaps off the terrace\n          before the guard can open fire.\n\n\n     25   INT. / EXT. VAN - NIGHT\n\n          Gib sees the rising fireball a half-mile away.  He starts the\n          van.\n\n                              GIB\n                    Aw, shit.  Here we go--\n\n\n     26   EXT. CHATEAU AND GROUNDS - NIGHT\n\n          Harry sprints across the snow-covered lawn, through the trees.\n          Guards with automatic weapons run after him, firing.  The snow\n          explodes around him with bullet hits.\n\n          TWO DOBERMANS pelt toward Harry, leaping at him in perfect\n          unison.  He waits... and knocks their heads together in mid-\n          leap with a crack like a baseball bat.  The dogs drop to the\n          snow, wobbling around like they're drunk.\n\n          As Harry sprints on, ANOTHER DOBERMAN lunges out of the bushes\n          ahead, leaping directly for his throat.  Harry grabs the dog\n          and shot-puts him up into a tree without breaking stride.  Dog\n          Fu.  The dog yelps and scrambles to hold onto an icy branch,\n          looking down in amazement.\n\n\n     27   EXT. PERIMETER WALL/ MOUNTAIN SLOPE - NIGHT\n\n          Harry leaps down on the outside of the wall, hitting a snow\n          bank and sliding downhill.  He sprints down the gentle slope\n          toward the highway.\n\n          Harry looks back as TWO GUARDS ON SKIS come out of a guard\n          station beside the main entrance.\n\n          TRACKING WITH THE SKI-GUARDS, searching through the trees with\n          lights.  They have lost Harry.  They stop.  A snowbank behind\n          them EXPLODES as Harry leaps out.  He disables them both with\n          vicious street-fighter moves.  Harry looks upslope as--\n\n          A service gate opens in the perimeter wall and TEAMS OF\n          SECURITY MEN in white snow-suits pour out, some on skis, some\n          on SNOWMOBILES.  A HELICOPTER rises over the wall in a blast of\n          swirling snow.  Its xenon lights rake through the trees,\n          casting lurid wheeling shadows on the snow.\n\n          ON Harry, snapping closed the ski boots he has stolen from one\n          of the disabled guards.  He pops the boots quickly into the\n          bindings and takes off downhill with one of the guard's FN FAL\n          rifles slung across his back.\n\n          The helicopter swoops downhill, its searchlight blazing through\n          the forest.  Snowmobile headlights illuminate the ski-patrols\n          zig-zagging among the trees.\n\n          Harry slashes expertly downhill.  He cuts a distinguished\n          figure in his black tux.  Automatic weapons fire rips through\n          the trees from behind him.  Harry is going flat-out.  The xenon\n          light hits him.  A 7.62 mm machine gun in the chopper rips the   *\n          slope into white clouds around him.  Harry slashes, turns,\n          weaving among the trees at breakneck speed.  A snowmobile is\n          closing in, outflanking him.  He turns toward it, suddenly.\n          Hits a mogul.  Uses the air to slash his skis right across the\n          rider's face.  The snowmobile crashes and tumbles into the\n          night.\n\n\n     28   INT. / EXT. VAN - MOUNTAIN ROAD - NIGHT\n\n          GIB'S VAN takes an icy turn in a hairy slide.\n\n          INSIDE Gib is peering upslope, trying to see what's going on.\n          All he can see are lights and gunfire.\n\n                              GIB\n                    Harry, what's your twenty?  I\n                    need a position, buddy--\n\n          Suddenly a skier in a black tux launches across the road from\n          the slope above, RIGHT OVER THE VAN, and lands deftly\n          downslope.\n\n                              GIB\n                    Uh... right!  I'll catch you on\n                    the next bend.\n\n          Behind the van, pursuing guards leap across the road.  Only\n          about half can make the jump.  The rest crash horribly.  The\n          helicopter thunders overhead.\n\n\n     29   EXT. MOUNTAIN SLOPE - NIGHT\n\n          Harry sees the chopper start an attack run.  He comes out into\n          the open, going straight downhill like a rocket.  The chopper\n          gets suckered in...  trying to hit him, getting right down\n          behind him... and suddenly-- Harry slides to a stop in an\n          explosion of powder and whips up the rifle.  P-P-P-POW!  He\n          rakes a burst across the windshield.  The startled pilot\n          swerves and-- Suddenly two tall pine trees are right in front\n          of him.\n\n          K-WHACK!  The main-rotor blade snaps clean off and the chopper\n          drops into the snow, plowing into a snowbank.  It slides right\n          to the edge of a steep ridge and stops, teetering.\n\n          Firing from a snowmobile, one of the guards puts a burst right\n          across Harry's path.  Harry's skis are hit and he tumbles,\n          comes out of it...  running down the hill like a juggernaut in\n          his heavy boots.  He has lost the rifle somewhere in the snow.\n\n          Harry takes cover behind the burning wreck of the downed\n          chopper, which still has its engine running.  The ski patrol\n          opens fire from upslope.  Rounds whacking against the disabled\n          helicopter.\n\n          Harry looks down the slope and gets an idea.  He jerks the\n          unconscious pilot out and pushes on the fuselage, rocking it.\n          It slips over the edge.  He leaps inside as it topples forward\n          and slides down the slope.\n\n\n     30   INT./ EXT. HELICOPTER - MOUNTAIN SLOPE - NIGHT\n\n          Harry adds throttle and works the footpedals, using the tail-\n          rotor to steer.  The chopper had snow-skids, and Harry is\n          skiing the damn thing down the mountain.\n\n          The copter is burning as it rockets down the slope on its        *\n          skids.  Bullets are hitting the fuselage, and everything around\n          it.  Skiers are wiping out, hitting trees.  A snowmobile hits\n          a rock and flies spectacularly into a ravine.\n\n                              GIB (OVER)\n                    Harry!  Where are you!\n\n                              HARRY\n                    In the helicopter.\n\n\n     31   INT./ EXT. VAN - MOUNTAIN ROAD - NIGHT\n\n          Gib slides the van around a curve.\n\n                              GIB\n                         (deadpan, to Faisil)\n                    He's in the helicopter.\n\n          Big is scanning above for the chopper.  Then upslope he sees\n          the burning fuselage skiing expertly among the trees.\n\n          The chopper hits a jump and launches into the air-- It crashes\n          through trees, still soaring and-- Gib looks up, screaming as--\n          The chopper drops right toward him-- He hits the brakes and--\n          BLAMMO!  It drops onto the road ten feet in front of the\n          skidding van...  then slides over the edge and tumbles into a\n          rocky canyon where is BLOWS UP!  The fireball lights up the\n          night.\n\n          Gib and Faisil jump out of the van.  They look downslope at the\n          burning wreckage.\n\n                              GIB\n                    Harry?  HARRY?!\n\n                              HARRY\n                    What?\n\n          Gib and Faisil spin to look behind them.  Harry is lodged in\n          tree-branches hanging over the road.  Gib hands his MP-5K        *\n          machine gun to Faisil and reaches up to Harry, who grabs his     *\n          hand and pulls.  Harry tumbles down into the snowbank.  He\n          stands, brushing snow off his tux, and clomps toward the van in\n          his ski-boots.  He is completely unruffled.\n\n                              HARRY\n                    Let's go.  We can still make our\n                    flight.\n\n          As Faisil is getting into the van behind Harry, TWO GUARD TEAMS\n          ON SNOWMOBILES roar around the bend behind them, fish-tailing\n          on the ice.  Faisil OPENS FIRE.  One snowmobile swerves over\n          the embankment.  The other pulls up broadside, and the guards\n          duck behind it.  Gib floors it and the van roars down the\n          mountain.  Faisil is still Ramboing on full-auto.\n\n                              FAISIL\n                    This is GREAT!!  I never get to\n                    shoot!\n\n                                                      CUT TO:\n\n\n     32   EXT. DULLES AIRPORT - NIGHT\n\n          An American Airlines 747 touches down amid puffs of tire smoke.\n\n\n     33   EXT. SUBURBAN D.C. STREET - NIGHT\n\n          A NON-DESCRIPT SEDAN pulls to the curb in a neighborhood of\n          modest middle-income tract homes.  The street is deserted.  It\n          is 4 A.M.  Gib is at the wheel, dropping Harry off at his\n          house.\n\n\n     34   INT. SEDAN - NIGHT\n\n          Harry is emptying his pockets... passport, business cards etc.\n          All documents under his name \"Renquist\".  He double checks that\n          his pants and jacket pockets and empty.  Gib fastidiously puts\n          the items into a plastic zip-lock.\n\n                              HARRY\n                    Empty.  Go.\n\n          Gib starts handing him items from a briefcase.  This should all\n          feel like a tired ceremony between them.\n\n                              GIB\n                    Harry Tasker wallet.  Harry\n                    Tasker passport.  Plane ticket\n                    stub, hotel receipt, Tasker.  Two\n                    postcards of Lake Geneva.  House\n                    keys.  Souvenir snowing Swiss\n                    village.\n\n          Gib snows him how is snows when you shake it up and turn it\n          over.\n\n                              HARRY\n                    What's this for?\n\n                              GIB\n                    For Dana, schmuck.  Bring your\n                    kid something.  You know.  The\n                    dad thing.\n\n                              HARRY\n                    Got it.  Nice touch.  Okay, pick\n                    me up at eight.  The de-brief is\n                    at ten hundred.\n\n          Harry opens the car door.\n\n                              GIB\n                    Hey, hey, hey... what are we\n                    forgetting?\n\n          Gib holds up Harry's gold wedding band.  Harry puts it on.\n\n                              HARRY\n                    What a team.  See you at eight.\n\n                              GIB\n                    Yep.  Sleep fast.\n\n\n     35   INT. TASKER HOUSE - NIGHT\n\n          Harry slips inside.  He sets down his suitcase and walks\n          quietly down the hall.  He pauses at a door with lurid labels\n          and stickers plastered all over it (Toxic Waste,  STAY OUT!, IF\n          IT'S TOO LOUD YOU'RE TOO OLD, etc.)\n\n          Harry silently opens the door and looks in at his sleeping\n          daughter, DANA.  She looks like an angel in the moonlight\n          coming in the window.  In fact, she is a typical 14 year old\n          girl, and therefore hardly an angel.  But to Harry she is\n          unflawed.\n\n\n     36   INT. MASTER BEDROOM - NIGHT\n\n          Harry, undressed now, slips into bed next to... a lump in the\n          covers which we presume to be a human being.  This is HELEN\n          TASKER, Harry's wife of 15 years.  He kisses her on the cheek\n          and she stirs.  She rolls toward him, giving him a sleepy hug\n          and a kiss.\n\n                              HELEN\n                         (a drowsy murmur)\n                    Hi, honey.  How was the flight?\n\n                              HARRY\n                    Fine, honey.  Stay asleep.\n\n                              HELEN\n                    Okay.\n\n          As she drifts off, Harry puts his head on the pillow and stares\n          at the ceiling.\n\n                                                      DISSOLVE TO:\n\n\n     37   INT. TASKER HOUSE - DAY (MORNING)\n\n          TIGHT ON SWISS VILLAGE.  It is snowing.\n\n          ON DANA,  reaching to the present Harry just gave her.\n\n                              DANA\n                    Hey, thanks dad.  I never had one\n                    of these.\n\n          They are in her room, which is your basic room from Hell.\n          Pearl Jam posters, and an unbelievable clutter of junk,\n          magazines and cheap jewelry.  Harry kisses her on the cheek, to\n          which she submits dutifully.  He looks at his watch and heads\n          for the door.\n\n                              HARRY\n                    You better hurry.  You're going\n                    to be late for school.\n\n          Harry hurries out and Dana considers the Swiss village a\n          moment.\n\n                              DANA\n                    Really lame.\n\n          She plonks is straight in the wastebasket.\n\n\n     38   INT. HALLWAY/BEDROOM/ BATHROOM - DAY\n\n          Harry strides down the hall, avoiding their small but            *\n          incredibly ugly dog, GIZMO, who skitters past him going the      *\n          other way.\n\n                              HARRY\n                    Dana, don't forget to feed Gizmo!                      *\n\n          Harry crosses the bedroom, hurrying past Helen who is clearly\n          rushing to get ready herself.  We get our first good look at\n          Helen.  She is wearing a terrycloth robe as she picks out an\n          outfit.  Her hair is wrapped in a towel.  To call her plain\n          would be inaccurate.  She could be attractive if she put any\n          effort into it, which doesn't occur to her.\n\n                              HARRY\n                    I'm late.\n\n                              HELEN\n                    Me too.\n\n          They talk without looking at each other, the way people who\n          have been together a long time do.\n\n                              HELEN\n                    How'd it go at the trade show?\n                    You make all the other salesmen\n                    jealous?\n\n                              HARRY\n                    Yeah.  You should have seen it.\n                    We were the hit of the show with\n                    the new model ordering system,\n                    the one for the 680... how you\n                    can write up an order and the\n                    second the customer's name goes\n                    into the computer, it starts\n                    checking their credit, and if\n                    they've ordered anything in the\n                    past, and if they get a\n                    discount...\n\n          She is already tuning him out.  And it hits us:  SHE HAS NO\n          IDEA WHAT HARRY REALLY DOES.\n\n                              HELEN\n                         (barely listening)\n                    That's fabulous Harry.\n\n                              HARRY\n                    Yeah, it was wild.\n\n          Harry glances at her, oblivious to him and brushing her teeth.\n          He smiles.  The best lies are told with enthusiasm.\n\n\n     39   INT. FRONT HALLWAY, LIVING ROOM - DAY\n\n          Gib opens the door, knocks a bit, then strolls in like he lives\n          there.  He is wearing dark Ray Bans, like he's doing a Roy\n          Orbison impression.  Gizmo runs toward him, yapping, but Gib\n          gives him the evil eye.\n\n                              GIB\n                    Come any closer I'll kill you.\n\n          The dog backs up, whining plaintively.  Gib throws his jacket\n          over the back of the couch and then, inexplicably, he takes out\n          a pack of CAMELS and sets it on the mantelpiece.  He adjusts\n          its position carefully.  Hmmmm.\n\n\n     40   INT. BATHROOM - DAY\n\n          Harry  and Helen maneuver around each other expertly.  She is\n          doing her make-up.\n\n                              HELEN\n                    The plumber came yesterday.  He\n                    said they have to dig under the\n                    slab or something and it's going\n                    to be six hundred dollars to fix.\n\n          Harry is not really paying attention as he ties his tie in\n          front of the mirror.  His mind is elsewhere.  He couldn't care\n          less about there domestic problems.\n\n                              HARRY\n                    Uh huh.  Okay.\n\n                              HELEN\n                    It's not okay.  It's extortion.\n\n                              HARRY\n                    What did you tell him?\n\n                              HELEN\n                    I slept with him and he knocked\n                    off a hundred bucks.\n\n                              HARRY\n                    Good thinking, honey.\n\n          Harry kisses her on the cheek and exits.\n\n\n     41   INT. KITCHEN - DAY\n\n          Gib enters and pours two cups of coffee.  Dana is drinking\n          orange juice from the bottle at the fridge.\n\n                              GIB\n                    Hi, kid.\n\n                              DANA\n                    Hey, Gib.  What up?\n\n          She EXITS, eating an uncooked pop-tart.  Harry comes in a\n          second later and Gib hands him his coffee.\n\n                              HARRY\n                    Thanks dear.\n\n                              GIB\n                    Here, check these out.\n\n          Gib hands Harry the glasses.  Harry studies them, seeing the\n          VIRTUAL VIDEO DISPLAY inside the left lens of the Ray Bans.\n          Harry glances down the hall, making sure no-one is looking,\n          then he puts them on.\n\n          HARRY'S POV - INSIDE THE GLASSES - A black and white video\n          image of his own living room.\n\n                              GIB\n                    The CCD camera and transmitter\n                    and inside a pack of smokes.\n                    Slick little unit, huh?\n\n          IN POV we see Dana enter the living room.  She looks around\n          carefuly, then quickly lifts Gib's jacket and slips out his\n          wallet.  She palms two twenties in the blink of an eye and puts\n          the wallet back.  Pro moves.\n\n                              HARRY\n                    Son of a bitch!\n\n                              GIB\n                    What?\n\n          Harry whips off the glasses and charges out of the kitchen.\n          Gib goes after him.\n\n\n     42   EXT. HOUSE - DAY\n\n          Dana comes out the front door, letting it slam behind her, and\n          runs to her boyfriend, TRENT, who is waiting for her in the\n          driveway on his idling YAMAHA.  Trent is 16, dressed in grunge-\n          rock style, trying to look tough.  Harry comes out the front\n          door as Trent revs the motor.\n\n                              HARRY\n                    Dana!!\n\n          She waves from the back of the bike as Trent pops the clutch\n          and they shoot down the driveway.\n\n                              DANA\n                         (yelling over the\n                          engine)\n                    Can't stop, I'm late.  Bye, Dad!\n\n\n     43   INT. / EXT. GIB'S CAR/ STREETS OF WASHINGTON - DAY\n\n          They are driving through D.C.  Harry is still shocked by his     *\n          daughter's behavior.\n\n                              GIB\n                    Kids.  Ten seconds of joy.\n                    Thirty years of misery.\n\n                              HARRY\n                    She knows not to steal.  I've\n                    taught her better than that.\n\n                              GIB\n                    Yeah, but you're not her parents,\n                    anymore, you and Helen.  Her\n                    parents are Axl Rose and Madonna.\n                    The five minutes you spend a day\n                    with her can't compete with that\n                    kind of constant bombardment.\n                    You're outgunned, amigo.\n\n          Gib and Harry turn onto Pennsylvania Avenue, heading toward\n          Lafayette Square.  Capital Hill is behind them.\n\n\n     44   INT. TEKTEL OFFICES - DAY                                        *\n\n          Harry and Gib come out of an elevator on the 12th floor.         *\n          Behind the receptionist is a burnished metal sign which reads    *\n          TEKTEL SYSTEMS.  They cross a open floor of cubicle spaces.      *\n          There is the hum of activity everywhere.  A normal day at a      *\n          normal business.                                                 *\n\n                              SECRETARY                                    *\n                    Morning, Mr. Tasker.                                   *\n\n                              HARRY                                        *\n                    Morning, Charlene.\n\n                              GIB\n                    See, kids now are ten years ahead                      *\n                    of where we were at the same age.\n                    You probably think she's still a\n                    virgin--\n\n                              HARRY\n                    Don't be ridiculous.  She's only --\n                    how old is she?\n\n                              GIB\n                    Fourteen, Harry.\n\n                              HARRY\n                    Right.  She's only fourteen.\n\n          They go into a corridor.                                         *\n\n                              GIB\n                    Uh huh.  And her little hormones\n                    are going like a fire alarm.  I                        *\n                    say even money that physicist on                       *\n                    the bike is boinkin' her.                              *\n\n                              HARRY\n                    No way.  Not Dana.\n\n          They stop at a door, like any other along the corridor.  It is   *\n          blank.                                                           *\n\n                              GIB\n                    Okay.  Okay.  De-nail ain't just\n                    a river in Egypt.  She's probably\n                    stealing the money to pay for an\n                    abortion.\n\n                              HARRY\n                    Will you just open the door!                           *\n\n          Gib touches a plastic card to an unmarked spot just above the    *\n          doorknob.  There is the CLUNK of a SOLENOID LOCK.                *\n\n                              GIB\n                    Or drugs.\n\n\n     45   OMITTED                                                          *\n\n\n     46   INT. CORRIDOR - DAY\n\n          They enter a long corridor, which is featureless except for      *\n          video surveillance cameras.  They walk along the silence for a   *\n          moment, then .  .  .                                             *\n\n                              GIB\n                    Twenty here, fifty there... I\n                    figured my wife's boyfriend was\n                    taking it.\n\n                              HARRY\n                    I thought you moved out.\n\n                              GIB\n                    Well .  .  .  I moved back in.\n                    My lawyer said it would give me\n                    a better claim on the house in\n                    the property settlement.  Don't\n                    change the subject... you owe me\n                    two hundred bucks.\n\n          They approach another door, with a (bulletproof) glass window    *\n          in it.  Beyond is a brightly lit room, with a woman sitting at\n          a desk... and nothing else.  Gib presses a buzzer.\n\n\n     47   INT. OUTER SECURITY ROOM - DAY\n\n          JANICE sits at the non-descript desk like a receptionist... but\n          she is a highly trained security specialist.  She is also hefty\n          through the shoulders, aggressively unattractive and utterly\n          humorless.  She watches them on a monitor screen as they stand\n          outside the door.  Harry and Gib appear as living X-Ray images.\n          Their weapons are visible in their shoulder harnesses.  Janice\n          puts one hand automatically on the butt of a .45 tucked in a\n          holster riveted beneath her desk.  She buzzes Harry and Gib in\n          with the other.\n\n                              JANICE\n                    Gentlemen, please idenitify\n                    yourselves to the scanner.\n\n          Harry and Gib step up to the combination retinal-thumbprint-\n          voice scanners.  Harry presses his thumb against a black-glass\n          plate for laser scan, and looks into the eye-piece of the\n          retinal scanner.\n\n                              HARRY\n                    Harry Tasker.  One zero zero two\n                    four.\n\n                              GIB\n                    Albert Gibson.  Three four nine\n                    nine one.\n\n          Their clearance appears on a monitor on Janice's desk.\n\n                              JANICE\n                    Thank you.  You are cleared.\n\n          She stands to give them plastic I.D.  badges which they hang\n          around their necks.\n\n                              GIB\n                    Janice, how many years have you\n                    been buzzing us in?\n\n                              JANICE\n                    Ten, Mr. Gibson.\n\n                              GIB\n                    And you still reach for your\n                    piece every time.\n\n                              JANICE\n                    Yes sir.\n\n                              GIB\n                    God!  You have no idea how much\n                    that turns me on.  I've never had\n                    the courage to say this before\n                    but... I love you, Janice.\n\n                              JANICE\n                    Yes, sir.\n\n          He kisses her wetly on the cheek as he goes by.  She does not\n          react is any discernible way.\n\n          They pass through a heavy stainless steel door which opens\n          automatically.  Beyond is a kind of airlock... a SALLY PORT.\n          Behind a lexan shield are TWO GUARDS armed with MP5s.  They nod\n          but do not speak at Harry and Gib pass them.\n\n                              HARRY\n                    You better watch it.  She might\n                    file on you for sexual\n                    harassment.\n\n                              GIB\n                    In her dreams.\n\n\n     48   INT. OMEGA SECTOR INNER SANCTUM - DAY\n\n          Gib and Harry pass through the inner door of the sally port\n          into a large austere atrium.\n\n          ANGLE FROM ABOVE as they cross.  A huge graphic logo covers the\n          floor.  Across the center is says OMEGA SECTOR.  In smaller\n          print, around the perimeter, is the motto: \"THE LAST LINE OF\n          DEFENSE\".\n\n          They enter a high-tech office space.  It is a maze of glass\n          partitions surrounding a central floor-space of cubicles.\n          There is a hushed quality here.  People do not joke.  They do\n          not hurry.  There are a lot of computer screens displaying\n          information from around the world.  It looks like a combination\n          of NASA mission control and FBI headquarters.\n\n          Fast Faisil greets them, yawning, as they pass his partitioned\n          cubicle.\n\n                              HARRY\n                    Come on, Fize.  We're late for\n                    our butt-grinding.\n\n          Faisil gulps his coffee and hurries after them.\n\n\n     49   INT. CONFERENCE ROOM - DAY\n\n          A dark and severe conference room, with large-screen computer\n          displays at one end.  Glowering at one end of the long,\n          polished table, is SPENCER TRILBY, the chief of Omega Sector.\n          Visualize a cross between Colin Powel and J.  Edgar Hoover.\n\n                              TRILBY\n                    Jesus, Harry!  You guys really\n                    screwed the pooch last night.\n                    Please tell me how I can look at\n                    this, that it's not a total pooch-\n                    screw.\n\n                              HARRY\n                    Total is a strong word--\n\n                              GIB\n                    There are degrees of totality.\n\n                              FAISIL\n                    It's a scale really, with\n                    \"perfect mission\" on one end and\n                    \"total pooch-screw\" on the other\n                    and we're more about here--\n\n                              TRILBY\n                    Faisil.  You're new on Harry's\n                    team, aren't you?\n\n                              FAISIL\n                    Yes.\n\n                              TRILBY\n                    So what makes you think that the\n                    slack I cut him in any way\n                    translates to you?!\n\n                              FAISIL\n                    Sorry, sir.  Uh... here's what we\n                    got.\n\n          He hits a button and a photo of Khaled fills a wall-screen.\n\n                              FAISIL\n                    Jamal Khaled.  We think he's\n                    dirty so we raid his financial\n                    files...  Check it out...\n\n          Faisil hits some buttons and a second screen lights up with the\n          data for their raid.\n\n                              FAISIL\n                    One hundred million in wire\n                    transfers from the COMMERCE BANK                       *\n                    INTERNATIONAL--                                        *\n\n                              GIB\n                    Which we all know is a front for\n                    certain nations to fund terrorist                      *\n                    activities.  Something big is                          *\n                    going down --\n\n                              FAISIL                                       *\n                    And we know that a week ago four                       *\n                    MIRV warheads were smuggled out                        *\n                    of the former Soviet Republic of                       *\n                    Kazakhstan .  .  .\n\n                              HARRY                                        *\n                    We think Khaled's group has                            *\n                    bought the nukes and is bringing                       *\n                    them to U.S.  soil.                                    *\n\n                              TRILBY                                       *\n                    So far this is not blowing my\n                    skirt up, gentleman.  Do you have                      *\n                    anything remotely substantial?                         *\n                    Don't be pumping beets up my ass                       *\n                    here.  Do you have hard data?                          *\n\n                              HARRY                                        *\n                    Not what  you'd call rock hard.                        *\n\n                              GIB                                          *\n                    It's pretty limp, actually.                            *\n\n                              TRILBY                                       *\n                    Then perhaps you better get some                       *\n                    ... before somebody parks a car                        *\n                    in front of the White House with\n                    a nuclear weapon in the trunk!\n\n\n     50   INT. OFFICE BUILDING - DAY\n\n          It is the interior of a huge law office.  Helen works there as\n          a paralegal.  She is going to the break room for coffee with\n          her friend, ALLISON, a secretary.  Allison is black, younger\n          then Helen, and still single.\n\n                              HELEN\n                    I mean, it's not like he's saving\n                    the world or anything.  He's a\n                    sales rep for Chrissakes.\n                    Whenever I can't get to sleep I\n                    ask him to tell me about his day.\n                    Six seconds and I'm out.  But he\n                    acts like he's curing cancer or\n                    something.\n\n                              ALLISON\n                    So I guess you didn't get away                         *\n                    for the weekend after all?                             *\n\n                              HELEN\n                    Are you kidding?  Harry had to go\n                    out of town.\n\n                              ALLISON\n                    I'm shocked.\n\n                              HELEN\n                    Yeah.  You know Harry.\n\n          Helen's nerdy boss BRAD, comes up behind her, scowling.\n\n                              BRAD\n                    Helen, have you pulled those\n                    files yet?  I need them by lunch.\n\n                              HELEN\n                    I won't let you down, Brad.\n\n          Brad leaves.\n\n                              HELEN                                        *\n                         (under her breath)                                *\n                    You little pencil-neck.                                *\n                         (to Allison)                                      *\n                    So... yo... sista!  D'you do                           *\n                    anything interesting?\n\n                              ALLISON                                      *\n                    Oh... Eric and I drove up to this                      *\n                    little romantic inn, and...                            *\n                    pretty much lapped champagne out\n                    of each other's navels for two\n                    days.\n\n                              HELEN\n                    You bitch.\n\n                              ALLISON\n                    Girlfriend, you got a man.  You                        *\n                    just have to take control .  .\n                    .  set up the right mood.                              *\n\n                              HELEN\n                    Harry only has two moods: busy...                      *\n                    and asleep.\n\n                              ALLISON\n                    Then you better do something to                        *\n                    jumpstart that man's motor.  You\n                    know... wake up the sleeping\n                    giant of his passion.\n\n          They both crack up at that one.\n\n\n     51   INT. OMEGA SECTOR (DATA CENTER) - DAY                            *\n\n          Harry meets up with Gib and Faisil coming from the ANALYSIS      *\n          Department.                                                      *\n\n                              HARRY\n                    What'ya got?\n\n          The following will play as they wind their way through the rows  *\n          of data-analysis workstations.\n\n                              FAISIL\n                         (handing Harry a\n                          printout)\n                    Here, check this out--\n\n                              GIB\n                    It's a two million dollar\n                    disbursement from Khaled to...\n                    Juno Skinner.\n                         (Harry raises an\n                          eyebrow)\n                    Uh huh.  The babe at the party.                        *\n\n                              HARRY\n                    It doesn't mean anything.  She\n                    buys antiquities for Khaled.\n\n                              GIB\n                    Nope.  The art buys are in a\n                    separate ledger.\n\n                              FAISIL\n                    And this is a little above market-                     *\n                    rate for the horizontal bop, even                      *\n                    for a total biscuit like her.\n\n                              HARRY\n                    Alright, I want a complete workup\n                    on her.  Do we know where she is?\n\n                              FAISIL\n                    Uh huh.  Right here in river\n                    city.\n\n                              HARRY\n                    You're kidding.\n\n                              FAISIL\n                    She lives in Rome, but she does\n                    stuff here the Smithsonian and\n                    has a lot of diplomatic\n                    connections, so she has offices                        *\n                    here.                                                  *\n\n          Gib starts tangoing with an imaginary partner.\n\n                              GIB\n                    Sounds like a job for a\n                    specialist.\n\n\n     52   INT. TASKER HOUSE/ KITCHEN - NIGHT (10PM)\n\n          DING!  Harry opens the microwave as his dinner finishes re-\n          heating.  He sits down alone at the kitchen table and pulls the\n          Saran-wrap off the plate.  Another solo supper two hours late.\n          His motions are so automatic we gather that this is the rule,\n          not the exception.  Helen comes in from the living room,\n          holding the suspense novel she is reading.\n\n                              HELEN\n                    I need you to talk to Dana.  The\n                    vice principle called and she cut\n                    class again this afternoon.\n\n                              HARRY\n                    I'll handle it.\n\n          Harry picks up his porkchop and goes out the back door.\n\n\n     53   EXT. DRIVEWAY - NIGHT\n\n          A basketball hoop is bolted to the garage and Dana is shooting\n          baskets in the driveway.  Moths orbit the outside floodlights.\n          She sinks one, dribbled back to the foul line.  Harry comes up\n          behind her and lifts the ball out of her hands as she stands\n          poised to shoot.  She turns.\n\n                              HARRY\n                    Dana, Mr. Hardy called.  Why\n                    weren't you in class today?\n\n                              DANA\n                    He lies!  I was there!  I was in\n                    the nurse's office, cause I had\n                    a headache.\n\n                              HARRY\n                    You seem fine now.\n\n                              DANA\n                    Great!  You're going to believe\n                    that fat dweeb Mr. Hardy over\n                    your own daughter.\n\n                              HARRY\n                    I'm not sure what to believe\n                    anymore, young lady.  You never\n                    used to lie to me.  But lately\n                    you don't seem to know the\n                    difference between right and\n                    wrong.\n\n          Dana studies something really fascinating at the end of a\n          fingernail.\n\n                              HARRY\n                    Dana, are you listening to me?\n\n                              DANA\n                    Yeah, Dad.\n\n                              HARRY\n                    You know you can always talk to\n                    me.  Right?  Whatever is going on\n                    in your life, your mom and I'll\n                    understand.\n\n                              DANA\n                    Okay, Dad.\n\n                              HARRY\n                    You'd tell me if there was\n                    something wrong, wouldn't you,\n                    pumpkin?\n\n                              DANA\n                    I'm not a pumpkin!  Okay?!!  Do\n                    I look even remotely like a\n                    pumpkin?! I'm not a muffin, or a\n                    cupcake or a honeybear either!\n                    And you don't understand anything\n                    Dad...\n\n          Dana runs into the house, agent.  Hold on Harry, superagent,     *\n          unable to comprehend the mind of a 14-year-old.  He looks up to  *\n          see Helen at the backdoor.                                       *\n\n                              HELEN                                        *\n                         (macho voice)\n                    \"I'll handle it\".\n\n                                                      CUT TO:\n\n\n     54   OMITTED                                                          *\n\n\n     55   INT. / EXT. LIMO - DAY (NEXT MORNING)\n\n          A BLACK LIMO cruises through a morning fill of bright promise.\n\n          INSIDE, Gib is at the wheel in a chauffeur's uniform.  He talks\n          to Harry, riding in the back, without turning.\n\n                              GIB\n                    It's all set up...  ghost phones\n                    and fax, all the usual stuff.\n                    You have a suite at the Marquis\n                    Hotel under Renquist.  Okay,\n                    reality check.  Go.\n\n                              HARRY\n                    Hi, I'm Harry Renquist.  I own a--\n\n\n     56   INT. JUNO'S OFFICES - DAY\n\n                              HARRY\n                    --corporate art consulting\n                    company in San Francisco.  I have\n                    an appointment with Ms. Skinner--\n\n          Harry is extending his business card to the receptionist as\n          Juno breezes into the lobby from a corridor.  She is dressed\n          sharply and looks as stunning as Harry remembers.\n\n                              JUNO\n                    Harry!  I thought I might see you\n                    again.  I just didn't  except you\n                    to call so soon.\n\n          Juno lingers a second or so long on the handshake.\n\n                              HARRY\n                    Well, what's the point of\n                    waiting?\n\n                              JUNO\n                    I agree.\n\n          There is definitely unholy magnetism here.  She indicates for\n          Harry to walk with her and leads him through the suite of\n          offices.  There are mounted fragments of ancient sculpture in\n          niches on either side, and beautifully restored mosaics and\n          tablets of hieroglyphics mounted on the walls.\n\n                              JUNO\n                    So your clients want something\n                    for the lobby of their new\n                    corporate headquarters?\n\n                              HARRY\n                    That's right.  They want\n                    something...  dramatic.  I spoke\n                    to a number of people who said\n                    you're the one to see.\n\n          Juno leads Harry through a door into a large warehouse area.\n          There is a bustle of activity as workmen unpack crates.  An\n          overhead crane is used to move huge stone pieces.  There are\n          massive columns, and statues two stories high.  Even the entire\n          facade of a tomb.\n\n                              JUNO\n                    So what did these... people...\n                    say about me exactly?\n\n          They stroll amongst the statues, as coveralled workmen move\n          around them with tools, scaffolding, pneumatic equipment.  Most\n          of the workers are middle-eastern.\n\n                              HARRY\n                    Let's see... that you can read\n                    ancient Sanskrit without having\n                    to sound out the words.  And that\n                    other dealers and archeologists\n                    don't like you much.\n\n                              JUNO\n                    Those wimps.  It's because I use                       *\n                    my diplomatic contacts to export\n                    cultural treasures from countries\n                    which tell them to take a hike.\n                         (yelling in Arabic to\n                          two workmen)\n                    I told you to move those crates\n                    an hour ago.  Come on guys, let's\n                    get going.\n\n          We realize that A WORKMAN is watching them intently from\n          nearby.  He is an intense looking MIDDLE-EASTERN MAN in his mid-\n          thirties.\n\n                              JUNO\n                    You see, a lot of these pieces\n                    are from ancient Persia.\n                    Unfortunately, ancient Persia is\n                    twenty feet under the sand of                          *\n                    Iran, Iraq and Syria.  Not the\n                    most popular places lately.  So\n                    I've had to become an expert in\n                    international diplomacy.\n\n          Juno stops and looks at Harry.  Her smile indicates the\n          possibility of more than just business.\n\n                              JUNO\n                    Well, do you see anything you\n                    like, Mr. Renquist?\n\n                                                      CUT TO:\n\n\n     57   INT. HOTEL SUITE - DAY\n\n          Harry, Gib and Fast Faisil are in a luxury suite at the MARQUIS\n          HOTEL.  It is a corner suite, with a spectacular view of the\n          city.  Faisil is routinely sweeping the room for bugs with an\n          electronic DETECTOR.\n\n                              HARRY\n                    She's importing stuff from all\n                    over the mid-east.\n\n                              GIB\n                    She could be moving money, guns.\n                    Anything.\n\n                              FAISIL\n                    And the second you left there, we\n                    started getting calls to the                           *\n                    ghost numbers.  They were\n                    checking out the Renquist front.\n\n                              HARRY\n                    Okay.  Let's step up the\n                    surveillance on her.  Put on two\n                    more guys.\n\n\n     58   INT. JUNO'S WAREHOUSE - DAY\n\n          WE FOLLOW the WORKMAN we saw watching Harry earlier.  He\n          catches up with Juno, who is going through the doors to the\n          office area.  His name is MALIK.\n\n                              MALIK\n                    Ms. Skinner?  Can I speak to you\n                    for a moment please, in your\n                    office?\n\n          His manner is self-effacing.  Humble.  He doesn't meet her\n          gaze.  She nods and they go into the private office.\n\n\n     59   INT. JUNO'S OFFICE - DAY\n\n          MALIK comes in behind her and closes the door.  The moment they\n          are away from public observation, his manner changes.  His\n          humble posture straightens and his eyes flash intensely as he\n          approaches her.  Without warning he SLAPS HER HARD ACROSS THE\n          FACE.\n\n                              MALIK\n                    You stupid undisciplined bitch!\n\n          Her jaw clenches but her reaction is surprisingly submissive.\n\n                              JUNO\n                    It's a good thing you pay me\n                    well.\n\n                              MALIK\n                    Do you realize that there are\n                    surveillance teams watching this\n                    place right now?  Your phones are\n                    almost certainly tapped.  And you\n                    are busy laughing and flirting\n                    like a whore with this Renquist,\n                    who may be a--\n\n                              JUNO\n                    No.  He checked out okay--\n\n          Malik slaps her again.\n\n                              MALIK\n                    That is for interrupting.\n                         (He backhands her)\n                    And that is for being wrong.  We\n                    do not tolerate mistakes.\n\n          Juno bites her lip.\n\n                              JUNO\n                    What do you want me to do?\n\n                              MALIK\n                    Find out who this Renquist it.\n\n                              JUNO\n                    How?\n\n                              MALIK\n                    Use the gifts that Allah has\n                    given you.\n\n\n     60   INT. TEKTEL SYSTEMS OFFICES - DUSK                               *\n\n          The phone rings on the desk of CHARLENE, Harry's secretary at    *\n          Tektel Systems, the permanent front-company for Omega Sector.    *\n\n                              SECRETARY\n                    Hello, Tektel Systems.  Mr.                            *\n                    Tasker's office.\n\n\n     61   INT. TASKER HOUSE - DUSK\n\n          Helen is in the kitchen, showing Dana how to put icing on a\n          large birthday cake.\n\n                              HELEN\n                    Hi, Charlene?  It's Helen.  Is he\n                    there?\n\n\n     62   INT. TEKTEL OFFICES - DUSK\n\n          Charlene doesn't hesitate a microsecond.\n\n                              CHARLENE\n                    Harry's in a sales meeting, Mrs.\n                    Tasker.  Let me try him in there.\n                    Hold please.\n\n          She punches a key, engaging a digital scrambler and connecting\n          to--\n\n\n     63   INT. SUITE AT THE MARQUIS - DUSK\n\n          A PHONE RINGS.  Gib opens his briefcase and looks at the\n          console of the cellular scrambler-phone inside.  The display\n          reads TEKTEL/CALLER ID POS -- TASKER, HELEN.                     *\n\n                              GIB\n                    It's Helen.                                            *\n\n          Harry picks up the phone.  INTERCUT THE FOLLOWING WITH HELEN.\n\n                              HARRY\n                    Hi honey.  What's going on?                            *\n\n                              HELEN\n                    Sorry to bother you in a meeting,\n                    but you have to promise me that                        *\n                    you'll be home at eight.  I don't                      *\n                    want Dana and I sitting here by\n                    ourselves like we were last year.\n                    You promise?\n\n                              HARRY\n                         (laughing)\n                    Baby, I said I'd be there.\n                    Really.  Trust me.\n                         (the room phone RINGS)\n                    Gotta go, honey.  Bye bye.\n\n          RING.  Harry raises an eyebrow as he answers.\n\n                              HARRY\n                    Hello?  Oh, Juno, hi.\n                         (pause)\n                    Well sure.  I can be there in\n                    twenty minutes.\n\n          Harry hangs up.  Gib, checking his watch, has a look like he's\n          got a bad gas pain.\n\n                              HARRY\n                    What?  It's on the way.  She says\n                    she's got something for me.\n\n                              GIB\n                    Yeah, right.\n\n\n     64   INT. JUNO'S WORKSHOP - NIGHT\n\n          A WORKMAN guides Harry through the maze of statuary.  He points\n          toward the back of the warehouse and then leaves.  Harry is\n          left alone in the vast space.\n\n          Only a few lights are on, rendering the place somewhat Gothic.\n          Harry strolls in the direction the workman pointed.  Ahead of\n          him, is the huge facade of a royal tomb.  There is a flickering\n          light inside.  A shadow moves across the wall in the entryway.\n\n                              HARRY\n                    Hello?\n\n          He enters the stone doorway of the tomb.  FOLLOWING HARRY as he\n          steps into the inner chamber.  There is an oil-lamp burning on\n          a stone sarcophagus, the only light.  The room appears empty.\n\n          REVERSE ON HARRY.  Behind him a figure emerges from a shadowed\n          alcove.  It is Juno.  She looks ethereal in the strange light.\n\n                              JUNO\n                    Hello, Harry.\n\n          Harry whips around, startled.\n\n                              JUNO\n                    Do you like my tomb?  The museum                       *\n                    financing fell out, so I thought                       *\n                    your clients might be interested.\n\n                              HARRY\n                    It's certainly... dramatic.\n\n                              JUNO\n                    Especially in this light.  This\n                    is the only light they had then,                       *\n                    so I like to study it this way.\n                    I love this place.  I love all\n                    ruins.\n\n                              HARRY\n                    Is that why you got into this\n                    business?\n\n          Juno turns to him in the flickering half-light.  She moves\n          closer.  Her eyes seem to glitter.\n\n                              JUNO\n                    I've always been a collector at\n                    heart.  When I see something I\n                    want, I have to have it.\n\n                              HARRY\n                    And you have a reputation as\n                    someone who gets what she wants.\n\n          She is very close to him.  Her eyes seem to glitter in the\n          light from the oil lamp.  She is unbelievably beautiful.\n\n                              JUNO\n                    Yes, I do.\n\n\n     65   INT. GIB'S CAR - NIGHT\n\n          Gib is sitting in the car, in the shadows, up the street...\n          with his earphone in place.  Listening.\n\n                              GIB\n                    Harry, this is your conscience\n                    speaking...\n\n\n     66   INT. TOMB - NIGHT\n\n          Juno picks up the lamp and walks along the wall, holding it up\n          so that the flickering shadows seem to bring the bas-relief\n          figures to life.  Stone faces shift and change, stone eyes\n          move.\n\n                              JUNO\n                    Look at this.  People who dies\n                    twenty centuries ago.\n\n          Juno presses her cheek against the cold stone.  She runs her\n          fingers slowly across the figures.  It is strange and erotic.\n\n                              JUNO\n                    They breathed and loved and wept,\n                    just like us.  And now their\n                    ideals, their religions, their\n                    social orders... are gone like\n                    mist.  What did any of it matter?\n\n          She crosses to Harry.\n\n                              JUNO\n                    I only hope they lived well.\n                    That they got what they wanted.\n\n          She puts her hands on him and pulls herself close.  It is a\n          hypnotic moment.\n\n                              JUNO\n                    Getting what you want is the only\n                    important thing.\n\n          She kisses him, very lightly, with infinite sensuality.\n\n\n     67   INT. GIB'S CAR - NIGHT\n\n                              GIB\n                    Harry?  Listen to the following\n                    code word.  Helen.  H-E-L-E-N.\n                    Now, do you want me to I beep\n                    you?\n\n\n     68   INT. TOMB - NIGHT\n\n          Harry breaks the kiss... slowly pulling back.\n\n                              HARRY\n                    Yes.\n\n                              JUNO\n                    Yes what?\n\n                              HARRY\n                    Uh, yes, it is important.\n\n          Juno is moving in for a more passionate lip-lock when-- BEEP\n          BEEP BEEP!!  Harry pulls his beeper off his hip and looks at\n          it.  The moment is spoiled.\n\n                              HARRY\n                    Uh, it looks like I have to run.\n                    I'll call you tomorrow.  Your\n                    proposal is very interesting.\n\n\n     69   INT. GIB'S CAR - NIGHT\n\n          Gib lets out a big exhale of relief.  He looks at his watch.\n\n\n     70   INT. TASKER HOUSE - NIGHT\n\n          Helen and Dana are sitting expectantly at the dining room\n          table.  There is a big cake, and presents piled on the buffet.\n          The food is getting cold.  Helen looks at her watch.\n\n                              DANA\n                    See.\n\n\n     71   INT./EXT. GIB'S CAR - NIGHT\n\n          Harry is changing clothes, getting ready to be Harry Tasker      *\n          again, as Gib drives through evening traffic.  Gib keeps\n          checking the rearview.\n\n                              GIB\n                    We have a friend.  Five cars\n                    back, inside lane.  They've been                       *\n                    on us since we left Juno's.                            *\n\n          Harry adjusts the passenger side mirror.\n\n                              HARRY\n                    Station wagon?\n\n                              GIB\n                    Uh huh.  Want me to lose them?\n\n                              HARRY                                        *\n                    No.  We need this lead.                                *\n                         (into his Rover)                                  *\n                    Unit Seven.                                            *\n\n                              UNIT SEVEN (FAISIL)                          *\n                    Seven here.\n\n                              HARRY\n                         (into Rover)                                      *\n                    I need you at the Georgetown mall                      *\n                    in three minutes.                                      *\n\n                              SEVEN\n                    Copy that.  We're rolling.\n\n                              GIB\n                    Helen's going to be pissed.\n\n                              HARRY\n                    See, that's the problem with\n                    terrorists.  They're really\n                    inconsiderate when it comes to\n                    people's schedules.\n\n\n     72   INT.  STATION WAGON - NIGHT\n\n          There are three men in the car.  YUSIF and MAHMOUD are in the\n          front, with Mahmoud driving.  In the back, shadowed, we can\n          just make out ABU MALIK.  Yusif is massively built, with a body\n          like a beer-keg.  Mahmoud is skinny and intense.\n\n     \n     73   OMITTED                                                          *\n\n\n     74   INT./EXT. GIB'S CAR - MALL - NIGHT\n\n          Harry puts his SUB-VOCAL TRANSCEIVER into his ear canal.\n\n                              HARRY\n                    Test two three.\n                         (Gib nods, receiving)\n                    Pull over here.\n\n          Gib pulls the car to the curb near the mall entrance.  Half a\n          block behind them the station wagon does the same.  Harry slips\n          on the virtual-image sunglasses and gets out of the car.\n\n\n     75   EXT. MALL - NIGHT\n\n          Harry pauses on the sidewalk a moment to light a cigarette.  He\n          coughs slightly.\n\n                              GIB\n                         (in his ear)\n                    You don't smoke, dickhead.\n\n          Harry lets his hand drop to his side, holding the pack of\n          cigarettes casually.  He turns his hand.  The tiny lens in the\n          cigarette pack glints.\n\n          POV VIDEO SCREEN --inside the left lens of the glasses.  The\n          camera in the cigarette pack reveals Yusif and Mahmoud getting\n          out of their cars, crossing the street half a block away.\n\n          HARRY strolls into the mall.  It is an open promenade design,\n          with a moderate crowd of shoppers and movie-goers.  Harry\n          watches in the glasses as Mahmoud and Yusif slip through the\n          crowd behind him.\n\n                              GIB (VO)\n                    What's the plan?\n\n                              HARRY\n                         (apparently mumbling to\n                          himself)\n                    Gonna try to get a closer shot of                      *\n                    Beavis & Butthead.                                     *\n\n\n     76   INT. / EXT. GIB'S CAR - NIGHT\n\n          Gib looks in the rearview, studying the car behind him.\n\n                              GIB\n                    There's another guy, still in the\n                    car.\n\n                              HARRY\n                         (on radio)\n                    Stay on him.\n\n          All Gib can see is a silhouette in the car.  A soft cherry\n          glow, the tip of a cigarette in the dark.  No features.\n\n\n     77   EXT. MALL - NIGHT\n\n          Harry turns off the main concourse, into a narrower walkway\n          between shops.  In the video-glasses he watches Yusif and\n          Mahmoud, who have split up to look less conspicuous, as they\n          track him through the pedestrian traffic.\n\n\n     78   INT. / EXT. GIB'S CAR - NIGHT\n\n          Gib in on the cellular phone.\n\n                              GIB\n                    Helen?  Hi, it's Gib.  Harry\n                    remembered something he left at\n                    the office.  You know Harry.\n\n          As he is talking he sees that a bus has blocked his view of the\n          station wagon.\n\n\n     79   INT. HARRY'S HOUSE - NIGHT\n\n          She sighs fatalistically.\n\n                              HELEN\n                    Yeah, Gib.  I know Harry.\n\n          Helen hangs up the phone just as Dana strides through the room,\n          putting on a jacket and heading for the front door.\n\n                              HELEN\n                    Where are you going?\n\n                              DANA\n                    Out.  If Dad doesn't care enough\n                    about us to be here on his\n                    birthday, then why should I care?\n                    I'm going to a movie.\n\n                              HELEN\n                    No you're not.  You're going to\n                    stay here until your father gets\n                    home and have cake!\n\n                              DANA\n                    Mom, wake up!  Dad barely knows\n                    we exist.\n\n          We see the hurt in her eyes.  She doesn't hate her father.  She\n          just misses him.\n\n                              HELEN\n                    That's not true, honey--\n\n                              DANA\n                    It is true!  He doesn't know\n                    anything about me.  He still\n                    thinks I'm like ten years old or\n                    something.  As long as I just\n                    smile and say yes to whatever he\n                    says, like his good little\n                    fantasy daughter, he thinks\n                    everything's fine.  But it's not\n                    fine.  Nothing's fine.\n\n          Dana runs out the kitchen by the other door.  Helen runs\n          after her.\n\n                              HELEN\n                    Dana!  Come back here!\n\n          The slamming door is her answer.\n\n\n     80   EXT. MALL - MEN'S ROOM - NIGHT\n\n          Yusif sees Harry, up ahead, enter a public restroom.  He\n          signals Mahmoud with his eyes and the two of them close in on\n          the restroom.\n\n\n     81   INT. / EXT. GIB'S CAR - NIGHT\n\n          Gib hangs up the car-phone.  Ten the bus blocking his view\n          finally pulls away and Gib see that the station wagon is\n          empty.  No silhouette.\n\n                              GIB\n                    Oh shit.\n                         (into his headset)\n                    Harry, I lost the third guy.\n                    Harry?\n\n\n     82   INT. RESTROOM - NIGHT\n\n          Harry can't answer because Mahmoud just entered the room behind\n          him.  Harry is at one of the urinals, apparently taking a leak.\n          Mahmoud goes to the mirror.  Starts combing his hair.  He\n          doesn't much notice the pack of Camels sitting on the counter\n          nearby.  Harry is whistling.  Shaking himself.\n\n          HARRY'S POV - In the video glasses Harry sees himself and\n          Mahmoud.  Yusif comes into the restroom, seemingly ignoring\n          both Harry and Mahmoud, as if heading for the stalls.  As he\n          passes behind Harry he reaches into his coat--\n\n          Harry spins lightning fast.  He knocks away the SILENCED PISTOL\n          aimed at the back of his head with a sweeping block, capturing\n          Yusif's arm in an arm-lock.  The shot goes wide, shattering a\n          urinal.\n\n          Harry slams his palm into Yusif's face like a piledriver, and\n          spins him against the steel stalls.  The silenced pistol goes\n          skittering across the floor.\n\n          Mahmoud whips a pistol out of his waistband.  Still holding the\n          bear-like Yusif, Harry draws his Glock so fast we can barely\n          see him move.  BLAM!  BLAM!  BLAM!  Three .45 slugs  go through\n          Mahmoud's chest, shattering the mirror behind him.  He flops on\n          his butt, slumping against the wall.\n\n          Yusif, who is easily Harry's size, bellows and grabs his gun\n          arm.  They smash against the walls, struggling for the gun.\n          Yusif, locked to Harry, hurls him against the stalls.  They hit\n          a locked door, which pops open, banging inward.\n\n          Yusif drives Harry to the floor.  Harry's head is between the\n          shoes of an OLD GUY sitting on the can, who looks down\n          uncomprehendingly at him.\n\n          Yusif slams Harry's gun hand repeatedly against the doorframe\n          of the stall.  He twists Harry's wrist brutally.  He even\n          pounds against Harry's hand with his knee.  The old guy winces.\n          That's got to hurt.  Harry cries out in pain and the gun drops.\n          Yusif reaches for it, but Harry kicks it under the stalls.\n\n          He punches Yusif in the face, driving him back.  They grapple,\n          spinning.  Harry drives Yusif's head into the counter.  Then he\n          elbows him in the throat and they crash together on the filthy\n          floor.  Harry grabs Yusif's hair and pounds his face repeatedly\n          against the rim of a urinal.  In case you haven't noticed, this\n          is a messy, nasty fight.  Survival is like that.\n\n          Yusif sags into submission.  Harry pulls a nylon zip-strip out\n          of his pocket and uses it like hand-cuffs, securing Yusif's\n          wrists.\n\n\n     83   EXT. MALL - NIGHT\n\n          Gib is running full out, drawing his gun.  He has one finger\n          jammed in his ear.  His gut is doing the rumba as he runs.\n\n                              GIB\n                    Harry?  Harry, you copy?!  Shit!\n\n\n     84   INT. RESTROOM - NIGHT\n\n          Harry is pulling Yusif to his feet when the door bangs open\n          behind him.  He turns, thinking it is Gib.  It's not.  Malik\n          raises a FULL-AUTO BERETTA 92-F and opens fire.  Harry spins\n          Yusif between him and the machine pistol.  Yusif's beer-keg\n          body stops the spray of 9mm slugs form hitting Harry long\n          enough for him to dive into a stall.\n\n          Malik hoses the room with the Beretta.  The metal stalls are\n          riddled with hits.\n\n          HARRY is in the stall with the old guy, who's just sitting\n          there.  The walls of the stall are pimpling with the hits on\n          the far side.  Harry reaches under the stall, retrieving his\n          Glock.\n\n          MALIK goes empty.  Harry hears that and pops out, cranking off\n          rounds--\n\n          Malik is a blur going out the door, as Harry's shots shatter\n          tiles on the doorframe.  Then silence.\n\n                              HARRY\n                         (to the old guy)\n                    Sorry.\n\n\n     85   EXT. MALL - NIGHT\n\n          MOVING WITH MALIK, who backs rapidly away from the restroom,\n          reloading.\n\n                              GIB (OFF)\n                    FREEZE!!!\n\n          Malik spins to see Gib nearby, going into a firing stance\n          behind a light-standard.  The terrorist doesn't hesitate.  His\n          Beretta ROARS at 900 rounds per minute.\n\n          Gib tries to hide behind the light-standard, which is about\n          half as wide as he is.  Shots hit all around him, shattering\n          window glass behind him.  His stomach sticks out from behind\n          the pole.  He sucks it in. Now his butt is sticking out on the\n          other side.  Shots clang into the steel column, and riddle\n          everything behind him.\n\n                              GIB\n                    WRONG!  THIS IS NOT GOOD!\n\n          Just when it looks like Gib is going to get a 9mm tummy tuck,\n          Malik turns and sprints away, through shocked pedestrians.\n          Harry runs out of the restroom, trying for a shot, but there\n          are too many people in the line of fire and Malik knows it.\n\n                              HARRY\n                    Get back to the car!\n\n          Gib nods and heads the other way as Harry takes off after\n          Malik.  Malik is fast and vicious.  He hurls people out of the\n          way, sending shoppers sprawling.  Harry is ruthless in his\n          pursuit.  They pound through the mall and out onto the street--\n\n\n     86   EXT. STREET - NIGHT\n\n          Malik sprints straight into traffic.  A car screeches, not\n          stopping in time... Malik goes right over the hood.  Harry\n          leaps over the hoods of cars after him.  Malik sees Harry\n          coming after him like a juggernaut.\n\n          He turns and sees a MOTORCYCLIST coming down the street,\n          accelerating from a right-turn.  Malik runs at him, clothes-\n          lining him right off the bike.  The terrorist picks up the\n          nimble little Kawasaki 250, which is still running, and leaps\n          on.  He pops the clutch and takes off.  Harry pounds after him\n          like a locomotive.  He sees Malik turn, taking the bike path\n          into a large PARK.  Harry cuts into the park on a diagonal.\n\n\n     87   EXT. PARK - NIGHT\n\n          ON HARRY, running.  Ahead is a MOUNTED COP.  Harry doesn't\n          break stride, heading right for the cop on the horse.  The cop\n          turns, surprised, a split second before-- Harry pulls him off\n          the horse and slams him to the ground (he's wearing a helmet).\n\n                              HARRY\n                    Federal Officer in pursuit of\n                    suspect!  Sorry.\n\n          Harry is in the saddle and galloping after Malik before the cop\n          can get his gut out of the holster to stop him.\n\n          MALIK roars through the park on the Kawasaki.  He looks back,\n          amazed to see Harry charging after him on a horse.  They\n          scatter joggers and bicyclists, people walking their dogs.\n\n          TRACKING WITH THEM as they rocket through the park.  Malik\n          leaves the winding path and goes straight through the trees.\n          Harry charges through some rollerbladers who go sprawling.\n          Malik fires his Beretta straight back at Harry, emptying it.\n          He drops the pistol and crouches over the bike, twisting the\n          last bit of throttle out of it.  They are going flat out,\n          through the trees, in a kinetic blur.\n\n\n     88   EXT. STREET - NEAR MALL - NIGHT\n\n          Gib, panting and heaving, pulls his car into traffic.  The Unit\n          Seven car pulls out as well, up the block.\n\n                              GIB\n                    Harry, what's your twenty?\n\n\n     89   EXT. PARK/ STREETS - NIGHT\n\n          Harry is legging the police horse hard.  He has his reigns in\n          one hand, his Glock in the other.  It's the wild west.\n\n                              HARRY\n                    Westbound in the park... suspect\n                    is on a motorcycle... he's going\n                    to  come out on Franklin.  Hang\n                    on--\n\n          Harry leaps a park bench like he's in a steeple chase.\n\n                              HARRY (CONT'D)\n                    I want you on 14th in case he\n                    turns south.  And I need Seven on\n                    the north side to box him in.\n\n\n     90   INT. /EXT. GIB'S CAR - NIGHT\n\n          Gib is weaving furiously through traffic.  He slides into a\n          turn.\n\n                              GIB\n                    Copy that.\n\n                              HARRY\n                    And make it fast.  My horse is\n                    getting tired.\n\n          ON GIB, mouthing \"Your horse?\"\n\n\n     91   EXT. STREET - NEXT TO PARK - NIGHT\n\n          Malik explodes through the bushes and out onto the street.\n          Cars skid around him, out of control.  He turns south.  Weaving\n          through traffic.  Harry leaps the hedgerow behind Malik and\n          gallops among the spun-out cars.  He goes right over the hood\n          on one which is blocking his path.  The driver ducks as the\n          horse's hoof cracks the windshield.\n\n\n     92   EXT. STREET/ HYATT REGENCY HOTEL - NIGHT\n\n          Up ahead traffic is stopped, jammed tight at a light.  Malik\n          goes into the oncoming traffic lanes, which are empty.  Gib's\n          car slides around the corner in a blare of horns and comes\n          barrelling down the street toward him.  Gib cranks the wheel\n          the slides the car broadside, blocking both lanes.  Malik locks\n          up the brakes and the bike slides to a stop.  Then the\n          terrorist pops the clutch and wheels the bike around-- Jumping\n          the curb and going straight at the entrance of THE HYATT\n          REGENCY HOTEL.\n\n          Bellmen and guests scatter as the bike roars right at them.\n          The sliding doors and opening for a bellman coming out with\n          bags and Malik blasts past him into the lobby.\n\n          HARRY ducks, galloping through the doors after him.\n\n\n     93   INT. HOTEL - NIGHT\n\n          Acres of marble and red carpet.  Liveries porters.  Guests\n          dressed for evening, the men in suits, diamonds on the women.\n          And sudden pandemonium as Malik roars through the lobby, with\n          Harry charging along behind him.  Malik guns it across the\n          lounge, knocking over tables.  He gets air at the top of  the\n          steps going up to the RESTAURANT.\n\n          Harry swerves to avoid a panicking guest and finds himself\n          careening toward the JAZZ QUARTET at a full gallop.  He gathers\n          the animal and LEAPS (in glorious SLOW MOTION) over the\n          bassist, who is diving for the carpet.  Harry and horse land\n          deftly and then he urges his mount right up the steps after\n          Malik.\n\n\n     94   INT. HOTEL RESTAURANT - NIGHT\n\n          Malik roars between the tables, looking around wildly for a way\n          out.  Harry charges in, ducking to avoid the chandelier.\n          Waiters, trays, dinners, tables... everything seems to be\n          flying at once as people dive out of the way.\n\n\n     95   INT. HOTEL - MAIN HALL - NIGHT\n\n          MALIK skids out into the main hall by another door, and sees--\n          the ELEVATORS.  The door is just closing on one of them.  He\n          guns it and slides through the doors.\n\n          HARRY RIDES out of the restaurant in time to catch a glimpse of\n          Malik as the doors close.\n\n\n     96   INT. SCENIC ELEVATOR - NIGHT\n\n          Harry canters the horse into the next elevator, which has just\n          been boarded by an older couple.  He has to practically lie\n          down on the horse to fit through the door.  The animal barely\n          fits, nose to tail, in what turns out to be--\n\n          A GLASS ELEVATOR with a view of the whole atrium of the hotel\n          as it rises, right to the top of the building.  Harry looks\n          through the glass at the elevator car next to him, fifteen feet\n          away.  Malik is inside, punching a button.  He glances up and\n          sees Harry.  There eyes meet for a moment, just before Malik's\n          car ascends rapidly.  Malik's malevolent glare is etched on\n          Harry's retinas.\n\n          The older couple is jammed against the side-wall by Harry's\n          panting, snorting horse.  It clomps around the tight elevator.\n          The woman is trying to crawl between her husband and the wall.\n\n                              HARRY\n                    Can you just press the top floor,\n                    please.\n\n          The man nods mutely and complies.  Their elevator takes off,\n          rising after Malik's.\n\n\n     97   INT. HOTEL LOBBY - NIGHT\n\n          Gib runs in with Faisil and Keough.  They follow the path of\n          destruction, growing more and more amazed.  Gib yells to one of\n          the porters.\n\n                              GIB\n                    The guy on the horse?!\n\n          The porter points at the elevators.\n\n\n     98   INT. / EXT. SCENIC ELEVATORS - NIGHT\n\n          Harry has slid off the horse to get next to the control panel.\n          He can look up at an angle and see Malik in the car above him.\n          His thumb hovers over the emergency stop button.  If Malik gets\n          out at any floor, Harry will have a moment to react and stop.\n          Malik can look down and see this.  He knows Harry's got him.\n          He just keeps going, floor after floor, using the time to\n          think.\n\n          The older woman is still just staring, trying not to breathe.\n          The horse flicks her in the face with his tail.\n\n\n     99   INT. /EXT. ROOFTOP - NIGHT                                       *\n\n          The rooftop has a spectacular view of the city.  TRACKING WITH   *\n          Malik as he comes out of the elevator, rides to the far edge of  *\n          the roof and slides to a stop.  He looks  down twenty stories.\n\n          THE SECOND ELEVATOR  arrives.  The doors part and Harry comes    *\n          out, with his Glock poised and ready.  He sees Malik revving     *\n          his bike.  The terrorist brodies the bike into a fast one-\n          eighty and speeds back toward the edge of the roof.  Amazingly,\n          he increases speed, ROARING RIGHT OFF THE EDGE,  ARCING THE\n          BIKE SUICIDALLY OUT INTO SPACE!\n\n          Harry rides to the edge in time to see Malik, on his bike,\n          CLEAR A 60 FOOT JUMP and SPLASH INTO THE ROOFTOP POOL of a       *\n          LOWER BUILDING next to the hotel!\n\n          Harry is out of control now, seeing the guy setting away.  He\n          wheels his mount and charges across the roof to get some\n          running space.  Then he turns again, back toward the edge Malik\n          jumped from.  He kicks the horse's flanks and yells HAAHH!!\n          The horse's hoofs thunder on the roof as they go full tilt\n          toward the edge.\n\n          But a horse is not a motorcycle.  It is slightly smarter.  It\n          slams its front hoofs down together, stopping suddenly.  Harry\n          goes right over its head.  He flies forward, almost going right\n          off the roof.  He slams to the edge, with his legs dangling\n          over, holding onto a piece of pipe with one hand.  His Glock\n          tumbles down into darkness.\n\n          Harry sees Malik far below, climb out of the pool, running to\n          the roof door of the other building.  Getting away.  Harry\n          clambers up onto his own roof, breathing hard.  He walks over\n          to the horse.\n\n                              HARRY\n                    What the hell were you thinking?\n                    We had the guy and you let him\n                    get away.\n\n          He looks into the horse's innocent brown eyes.  Pats its neck\n          fondly.\n\n                              HARRY\n                    What kind of  cop are you?\n\n\n    100   INT. TASKER HOUSE - NIGHT\n\n          Helen is asleep at the dining room table next to a half-eaten\n          cake and some melted ice cream.  His unopened presents are\n          piled at one end of the table.  She raises her head as Harry\n          enters sheepishly.\n\n                              HARRY\n                    Look, I know you're upset.  I'm\n                    really sorry, honey.  I raced\n                    home as quick--\n\n                              HELEN\n                    It's okay, don't bother, Harry.\n\n          He goes to her and puts his arms around her.  He is tender with\n          her.  He wishes he can tell her the truth.\n\n                              HARRY\n                    I'm sorry.  Thank you for the\n                    party.\n\n                              HELEN\n                    Yeah.  It was great.\n\n          Helen finds a smile for him somewhere.  She really does love\n          him, though more and more often lately she finds her heart in\n          pain.\n\n                              HELEN\n                    Let's go to bed, Harry.  There's\n                    only one present you have to open\n                    tonight.\n\n          She grins and arches one eyebrow meaningfully.\n\n\n    101   INT. BEDROOM / BATHROOM - NIGHT\n\n          Helen walks Harry to the edge of the bed and sits him down.\n          She puts her hand on his chest and pushes, causing him to lie\n          back.\n\n                              HELEN\n                    Don't move.  I'll be right back.\n\n          She turns on the stereo.  A Kenny G disc she put in there\n          earlier.  Soft tenor sax flows around the room.  Helen enters\n          the BATHROOM and shuts the door partway.  She opens a cupboard\n          and quickly pulls out some things she hid there earlier.  A\n          bottle of champagne on ice.  Two glasses.  Some trashy\n          lingerie.\n\n                              HARRY\n                    Come on to bed, you don't have to\n                    brush your teeth.\n\n                              HELEN\n                    I'll just be a second.  So what\n                    happened tonight at the office?\n\n                              HARRY\n                    I couldn't believe it.  I go back\n                    to get this report I need, right,\n                    and the phone is ringing, so like\n                    a bonehead I answer it--\n\n          Helen is hurrying to put on the unfamiliar lingerie.  G-string\n          panties and low-cut bra.  She holds up the garter belt, turning\n          it backward and forward, trying to figure out which way it\n          goes.\n\n          ON HARRY, yawning.  Lying with the ease of years of practice.\n\n                              HARRY\n                    It's the big client in Japan,\n                    and it's the middle of the\n                    morning there and their whole\n                    system is crashed... this guy's\n                    having a meltdown--\n\n                              HELEN\n                         (keeping him talking)\n                    What'd you do, honey?\n\n                              HARRY\n                    Well I pull out the manual on\n                    their setup, which is the new 680\n                    server...\n\n          Helen is pulling up the black stockings.  She fastens the\n          garters to the tops.  Her features are a scowl of\n          concentration.  She is very earnest in her preparations.\n\n                              HARRY (CONT'D)\n                    ...and I'm troubleshooting it\n                    with them over the phone...\n                    talking to a translator, right,\n                    who's getting half of it wrong...\n                    it was unbelievable...  really\n                    wild.\n\n                              HELEN\n                         (putting on black\n                          pumps)\n                    It sounds wild.  So now you're a\n                    big hero, right?  For fixing\n                    their system.\n\n                              HARRY\n                         (faintly)\n                    Uh huh.\n\n                              HELEN\n                    My husband the hero.\n\n          Red lipstick.  Then she puts a little perfume on her wrists.\n\n                              HELEN\n                    I'll be right there, honey.  Just\n                    a minute.\n\n          Harry doesn't answer.  Helen puts a little perfume down the\n          front of her panties.\n\n                              HELEN\n                    Just a second.\n\n          Helen quickly pours two glasses of champagne.  Then she slinks\n          around the doorframe, making her entrance.  She looks like a\n          living 900 number.  Helen stands before the bed, looking down,\n          holding the champagne glasses.\n\n          ON HARRY: sprawled on the bed, fully clothed, snoring softly.\n          A little bit of drool is coming out the side of his mouth.\n\n          HOLD ON HELEN, all dressed up with no place to go.  She gazes\n          down at him, her shoulders slumping.\n\n                              HELEN\n                    Happy Birthday, Harry.\n\n          She sighs deeply and downs her champagne in one long gulp.\n\n                                                      CUT TO:\n\n\n    102   EXT. STREET/ NEAR HIGH-SCHOOL - DAY\n\n          It is the following morning.  Harry and Gib are staked out\n          watching the front of Dana's school.  Actually, Harry is staked\n          out, scanning the crowds of kids with binoculars.\n\n          Gib just keeps looking at his watch.  He picks up a cellular\n          phone and pretends to call the office.\n\n                              GIB\n                    Hey, did that guy Harry chased\n                    last night call in to give\n                    himself up yet?  Cause apparently\n                    that's the only way we're going\n                    to catch the son of a bitch --\n\n                              HARRY\n                         (not listening)\n                    Okay.  Here she comes.\n\n\n    103   EXT. STREET - DAY\n\n          HARRY'S POV THROUGH BINOCULARS - We see Dana come out to the\n          curb and meet Trent, who pulls up on his bike.  She gets on\n          behind him, adjusts her walkman headphones over her ears and he\n          launches out into traffic.\n\n\n    104   INT. HARRY'S CAR - DAY\n\n          Harry, who is behind the wheel, pulls out after her.  Trent\n          weaves radically through the light traffic, going in between\n          the cars.\n\n                              HARRY\n                    Look at the way the little punk\n                    is driving.  He's all over the\n                    place.  Look-- he hasn't\n                    signalled once.\n\n                              GIB\n                    Goddammit!  That's outrageous.\n\n          Harry speeds up.  Somebody honks as he cuts them off to stay\n          with Trent.\n\n\n    105   EXT. MOTORCYCLE - DAY\n\n          ON DANA AND TRENT as she looks back and sees Harry following\n          her.  She is mortified that her father is actually tailing her\n\n                              DANA\n                    Oh my God!  I think that's my\n                    dad!\n\n                              TRENT\n                    Hang on!\n\n          Trent downshifts and punches it.  The nimble little bike\n          screams as it zips between cars.\n\n\n    106   INT. HARRY'S CAR - DAY\n\n                              HARRY\n                         (clenching his jaw)\n                    So, you wanna play huh?  You\n                    little--\n\n                              GIB\n                         (rolling his eyes)\n                    That's it.  Get 'im Harry\n                         (he draws a pistol)\n                    We'll teach that little puke not\n                    to signal.\n\n\n    107   EXT. MOTORCYCLE\n\n          BACK ON TRENT, who's actually a really good rider.  He zig-zags\n          through the cars, cutting between them at the next light where\n          Gib and Harry get blocked.  He cuts a sharp right turn and\n          disappears.\n\n\n    108   INT. HARRY'S CAR - DAY\n\n          Harry is stuck in stopped traffic.  He pounds the wheel in\n          frustration.\n\n                              GIB\n                         (exploding with\n                          laughter)\n                    Ha!  The little prick ditched\n                    you!  That is so goddamn funny.\n\n                              HARRY\n                    Son of a bitch!\n\n                              GIB\n                    Can we go to the office now, Mr.\n                    Superspy?\n\n                                                      CUT TO:\n\n\n    109   INT. OMEGA SECTOR / I.D. ANALYSIS ROOM - DAY\n\n          Harry is sitting at a computer workstation, lit by the monitor\n          screen.  Gib and Faisil look on as he clicks through HEADSHOTS\n          of known terrorists.  CLICK.  CLICK.  CLICK.  Harry is very\n          focussed.  He stops.  He goes back one.  Studies the face.\n\n\n    110   INT. ANALYSIS ROOM - TIGHT ON THE SCREEN - DAY\n\n          A defiant looking Syrian with a full beard.\n\n          HARRY holds up his hand, blocking out the beard, concentrating\n          on the eyes.\n\n                              HARRY\n                    That's him.\n\n\n    111   INT. CONFERENCE ROOM - DAY\n\n          Harry slaps photos down in front of Trilby.\n\n                              HARRY\n                    Abu Kaleem Malik.\n\n                              GIB\n                         (reading from a file)\n                    Hardcore, highly fanatical, ultra-                     *\n                    fundamentalist.  Linked to                             *\n                    numerous car-bombings, that cafe                       *\n                    bomb in Rome, and the 727 out of\n                    Lisbon last year.  Major player.                       *\n\n                              FAISIL                                       *\n                    Now he's formed his own splinter\n                    faction called CRIMSON JIHAD.\n\n                              GIB                                          *\n                    Guess he thought the other\n                    terrorist groups were too warm\n                    and fuzzy for his taste.\n\n                              FAISIL\n                    They call him \"The Sand Spider\".                       *\n\n                              TRILBY\n                    Why?\n\n                              FAISIL\n                         (he shrugs)\n                    Probably because it sounds scary.                      *\n\n                              TRILBY\n                    This is impressive, gentlemen.\n                    Of course, it would have been\n                    even more impressive if you\n                    actually knew where he was.\n\n                              HARRY\n                    We'll get him.\n\n                              TRILBY\n                    Yes.  You will.\n                         (meaning-- you damn\n                          well better)\n                    Harry, I still want you in\n                    charge, even though your cover is\n                    blown.  Just keep a low profile.\n                         (he slaps a newspaper\n                          on the table)\n                    I generally prefer it when my\n                    covert operations don't make the\n                    front page.\n\n          The agents look at the headlines:  WILD WEST CHASE.  Harry and\n          Gib wince.\n\n\n    112   EXT. HELEN'S OFFICE BUILDING - DAY\n\n          Harry and Gib pull to the curb in front of the building.\n\n                              GIB\n                    What's going on?\n\n          Harry gets out of the car and turns back, leaning in the door\n          to talk to Gib.\n\n                              HARRY\n                    Look, uh... I've got to talk to\n                    Helen about this thing with Dana.\n                    I'm just going to run in and see\n                    if she can get away for lunch.\n\n                              GIB\n                    You want me to just hang-- ?\n\n                              HARRY\n                    Just hang a minute.\n\n                              GIB\n                    I'll just hang then, shall I?\n\n\n    113   INT. OFFICE BUILDING - DAY\n\n          Harry enters the office of Helen's firm.  He stops at\n          reception.\n\n                              RECEPTIONIST\n                    Hello Mr. Tasker.  Just a second,\n                    I'll  buzz Helen.\n\n                              HARRY\n                    No.  No, I'd like to surprise\n                    her.  Thanks, I know where her\n                    desk is.\n\n          He smiles and breezes past her before she has a chance to\n          object.\n\n\n    114   INT. HELEN'S OFFICE - DAY\n\n          TRACKING WITH HARRY as he moves through the offices.  He passes\n          through a library-like maze of records stacks.  Through them he\n          can see Helen at her desk.  But as he approaches, still\n          concealed, ALLISON puts a call on hold and whips around to\n          Helen.\n\n                              ALLISON\n                    Helen!\n                         (grinning\n                          conspiratorially)\n                    It's your mystery man.\n\n                              HELEN\n                    Simon?  Ohmygod.\n\n          Helen, normally the image of composure, goes suddenly fluttery\n          and nervous as a high-school girl.  She takes the phone,\n          turning away from Allison.\n\n                              HELEN\n                    Hello, Simon?\n                         (pause)\n                    It's all right.  There's no one\n                    around.\n\n          Helen glimpses Allison with her ears cocked and gives her a\n          scowl and a shooing motion.  Allison turns away, grinning.\n\n\n    115   INT. OFFICE - STACKS OF RECORDS - DAY\n\n          ON HARRY, behind the stacks, reacting.  He silently mouths\n          \"SIMON?!\"\n\n\n    116   INT. HELEN'S OFFICE - DAY\n\n                              HELEN\n                    You mean right now?\n                         (she looks around\n                          guiltily)\n                    I guess so.  Okay.  I'll be right\n                    there.\n                         (pause)\n                    Yes.  I can't wait.  Bye.\n\n          She hangs up, a little flushed.  Then turns to Allison.\n\n                              HELEN\n                    Can you cover me for an hour?\n\n                              ALLISON\n                    Just an hour?  You should tell\n                    this stud to take more time.\n\n                              HELEN\n                    Will you shutup.  I should never\n                    have told you about him.\n\n          Helen grabs her purse and rushes out, going right past the\n          stack where Harry is standing, dumbfounded.  He looks like he\n          was slammed in the stomach with a lead pipe.  His whole like is\n          unravelling.\n\n\n    117   EXT. BUILDING - DAY\n\n          Gib sees Harry crossing the street, holding his stomach.  He\n          seems dazed.  He is not so much walking to the car as wandering\n          in its general direction.  He stops, in the street.  Gib gets\n          out of the car and rushes to him.  He pulls him out of the path\n          of a bus which is HONKING irritably.\n\n                              GIB\n                    You look like you got gut-kicked.\n                    What's the matter?  You sick?\n\n          Harry leans against the car for support.\n\n                              HARRY\n                         (barely audible)\n                    He-- Helen.  Helen-- it's Helen.\n                    It's Helen, Gib.\n\n                              GIB\n                    Something to do with Helen, is\n                    what I'm getting.\n\n                              HARRY\n                    She's having an affair.\n\n          Harry's best friend in the world brightens with the news.  He\n          slaps him on the back.\n\n                              GIB\n                    Congratulations.  Welcome to the\n                    club.\n\n                              HARRY\n                    It can't be.  Not Helen.\n\n                              GIB\n                    Nobody believes it can happen to\n                    them.\n\n                              HARRY\n                    It can't be.\n\n                              GIB\n                    Same thing happened to me with\n                    wife two.  I had no idea until I\n                    came home and the house was\n                    empty.  I mean empty.  She even\n                    took the ice-cube trays from the\n                    fridge.  What kind of person\n                    would think of that?\n\n                              HARRY\n                         (not listening)\n                    I still don't believe it.\n\n                              GIB\n                    Relax.  Helen still loves you.\n                    She just wants this guy to bang\n                    her.  It's nothing serious.\n                    You'll get used to it after a --\n\n          Harry wheels around on Gib, grabbing him by the lapels, and\n          slams him against the car.\n\n                              HARRY\n                    STOP.  CHEERING.  ME.  UP.\n\n          We see in Harry's rage, frustration, and hurt confusion a\n          vulnerability we never expected to see.\n\n                              GIB\n                    What'dya expect Harry?  She's a\n                    flesh and blood woman.  And\n                    you're never there.  It was only\n                    a matter of time.\n\n          Harry sags.  His friend is right.  Gib opens the car door and\n          helps him in like an invalid, talking soothingly the whole time--\n\n                              GIB\n                    I say we concentrate on work.\n                    That's how I always got through\n                    it whenever my life turned to\n                    dogshit.  Let's catch some\n                    terrorists and then you can beat\n                    the crap out of them.  You'll\n                    feel better.\n\n          Gib gets in and starts the car, full of stoic cheer for Harry.\n\n                              GIB\n                    Women.  Can't live with 'em.\n                    Can't kill 'em.\n\n\n    118   INT. OMEGA SECTOR / LISTENING ROOM - DAY\n\n          Harry and Gib are in the LISTENING ROOM.  Banks of tape-decks\n          recording calls, rows of technicians in cubicles processing and\n          collating transcripts.\n\n                              GIB\n                    He's giving us a blank check on                        *\n                    wiretaps.  So I've set 'em up on\n                    all of Juno's shipping agents,\n                    her clients, and Faisil made up                        *\n                    a list of possible contacts that\n                    Crimson Jihad might have in this\n                    country.  Now all we can do is                         *\n                    wait --                                                *\n\n          He notices Harry is not listening.\n\n                              GIB\n                    Is this national security stuff\n                    boring you?\n\n                              HARRY\n                    Put a tap on her phone.\n\n                              GIB\n                    What're you talking about?  We\n                    have that.\n\n                              HARRY\n                    Helen's phone.  Her office line\n                    and the line at my house.\n\n          Gib gives Harry a stricken look, and glances around nervously.\n          He pulls him into an empty office.\n\n                              GIB                                          *\n                         (a whispered hiss)                                *\n                    Okay .  .  .I have two words to                        *\n                    describe that idea.  In.  Sane.\n                    Unauthorized wiretap is a felony,\n                    pard.\n\n          Harry grabs him and rams him up against the wall, his teeth\n          clenched.\n\n                              HARRY\n                    Yeah, and we do it twenty times\n                    a day.  Don't give me that crap.\n                    Just put on the taps.  Now.\n\n                              GIB\n                    Sure, Harry.  I'm on it.\n\n          Harry releases him and turns away.  Gib straightens his jacket,\n          looking at his friend like he's completely losing it.\n\n\n    119   INT. TASKER HOUSE - NIGHT\n\n          That night Harry is actually there on time for dinner.  He\n          glances at Dana, who has been eyeing him warily.  She looks at\n          her peas.\n\n                              HARRY\n                    How was school today?\n\n                              DANA\n                    Fine.\n\n          Harry takes a bite of his food, watching her.  Silence.  Helen\n          glances at him.\n\n                              HELEN\n                    So.  You came by to see me today?\n\n          She is a too casual, masking her nervousness.\n\n                              HARRY\n                    I was in the area, and I thought\n                    you might like to have lunch.\n\n                              HELEN\n                    They must've just missed me.\n\n                              HARRY\n                    They said you had to run out.\n\n                              HELEN\n                    Yeah.  It was a rush thing.  They\n                    needed some documents down at the\n                    court house.  I barely made it.\n\n          Harry watches her lying to him with some amazement.  You can\n          see the jaw muscles clenching.\n\n                              HARRY\n                    So, a little excitement in an\n                    otherwise dull day.  Did is work\n                    out okay?\n\n                              HELEN\n                    Oh, sure.  Fine.\n                         (she gets up suddenly)\n                    I'll get some more gravy.\n\n                              DANA\n                    I'm done.\n\n          Dana bolts.  She has eaten about four bites.  Harry sits at the\n          table, alone.  He feels isolated, knowing that everybody is\n          lying to everybody else.  He is a man without a center, lost.\n\n                                                      CUT TO:\n\n\n    120   INT. OMEGA SECTOR/ LISTENING ROOM - DAY\n\n          TRACKING ALONG THE BANK OF RECORDERS.  Harry comes to a\n          particular set of machines.  He reaches past the technician and\n          picks up the hard-copy of the transcripts.\n\n          ON HARRY walking and leafing through the phone transcripts.\n          Gib watches him through a glass partition, shaking his head\n          slowly.  Harry freezes, staring at the page and WE HEAR THE\n          SOUND OF THE CONVERSATION OVERLAID:\n\n                              HELEN\n                    Hello?\n\n                              SIMON\n                    Helen?  It's Simon.  Is it safe\n                    to talk?\n\n                              HELEN\n                    Yes.  Go ahead.\n\n\n    121   INT. CAR - FLASHBACK SEQUENCE - DAY\n\n          A man in his mid-thirties, sitting in a car SOMEPLACE (DAY),\n          speaks into a cellular phone.  This is SIMON.  He is dark\n          haired, and fairly good-looking in an off-beat way.  He is\n          unshaven and his clothes look slept in.  He glances around in\n          a furtive manner.\n\n                              SIMON\n                    I can't talk long.  Can you meet\n                    me for lunch tomorrow?  I must\n                    see you.\n\n\n    122   INT. HELEN'S OFFICE - DAY\n\n          NOW WE SEE HELEN, at her office.\n\n                              HELEN\n                    Yes.  I suppose so.  Where?\n\n                              SIMON\n                    The same place.  One o'clock.  I\n                    have to go now.  See you\n                    tomorrow.  Remember, I need you.\n\n\n    123   INT. LISTENING ROOM - DAY\n\n          The last line is played ON HARRY, reading.  Now he is seeing\n          the proof in black and white.  He slowly crumples the paper in\n          one hand, his expression dark.\n\n\n    124   INT. TASKER HOUSE - NIGHT\n\n          Helen is reading in bed.  She glances up as Harry comes into\n          the room.  Gives  him a quick smile.  Too quick.\n\n                              HARRY\n                    I thought we might have lunch\n                    tomorrow.\n\n                              HELEN\n                    I can't, honey.  I promised\n                    Allison I'd go shopping with her.\n                    Sorry.\n\n          Harry watches her smoothly lying to him.  It's surreal to him.\n\n                              HARRY\n                    No problem.\n\n          He surreptitiously picks up Helen's purse from a dresser and     *\n          goes into the hall.                                              *\n\n    125   OMITTED                                                          *\n\n\n    126   EXT. TASKER HOUSE - NIGHT                                        *\n\n          THE FRONT DOOR OPENS and Harry comes out, walking Gizmo on a     *\n          leash.  Harry walks briskly along the sidewalk, jerking the\n          poor dog along twice as fast as his little legs will go.         *\n\n\n    127   EXT. SIDEWALK, BY GIB'S CAR - NIGHT\n\n          He reaches Gib's car, half a block up, and hands him Helen's     *\n          purse.  Gib eyes the dog warily.  He growls at it.  Gizmo hides  *\n          behind Harry's legs.\n\n                              GIB\n                    Look, Harry.  I know this is\n                    rough.  I felt the same way the\n                    first time it happened to--\n\n          Harry holds up one finger.  His eyes and expression are so\n          intense, Gib just soft of trails off.\n\n                              GIB                                          *\n                    Right.                                                 *\n                         (hefting the purse)                               *\n                    So .  .  .  the usual, right?                          *\n                    GPS locator, telemetry burst                           *\n                    transmitter, audio transmitter,                        *\n                    power supply.\n\n                              HARRY                                        *\n                    Just have is back in two hours.                        *\n    128\n   thru   OMITTED                                                          *\n    129\n\n    130   INT. / EXT. HELEN'S CAR - DAY\n\n          TIGHT ON THE PURSE sitting on the seat next to her as Helen\n          drives through the city.\n\n\n    131   INT. / EXT. N.D. SEDAN - DAY\n\n          Harry drives while Gib watches--\n\n\n    132   INT. SEDAN, CLOSE UP ON MAP - DAY\n\n          A COMPUTERIZED MAP below the dash.  Helen's purse appears as a\n          moving blip on a street-map of the city.\n\n\n    133   INT. / EXT. SEDAN - DAY\n\n                              GIB\n                    Okay, she's turning on\n                    Seventeenth.  Make a left, you\n                    should see her.\n\n          Harry makes the turn.\n\n                              HARRY\n                    There she is.\n\n\n    134   EXT. PARKING LOT - DAY\n\n          Up ahead they see Helen's RED ACCORD pulling into a parking low\n          next to a CAFE.  Harry parks the car a block away and gets out\n          his binoculars.\n\n\n    135   EXT. HELEN'S CAR THROUGH BINOCULARS - DAY\n\n          HARRY'S POV through the scope.  Helen gets out of her car and\n          looks around as she walks to the cafe.  It is not a nervous\n          look, but it is clear she is making sure she is not followed.\n          She goes inside.\n\n\n    136   INT. SEDAN - DAY\n\n                              HARRY\n                    Give me audio.\n\n          Gib hits a switch and they hear the clamor of the cafe at lunch\n          rush come over a speaker.\n\n\n    137   INT. CAFE - DAY\n\n          The restaurant is nothing fancy.  A little dark.  Helen makes\n          her way to a booth in the back.  Sitting in the shadows, facing\n          the door, is SIMON.  She sits down opposite him.  He doesn't\n          smile or kiss her in greeting, but glances around the room like\n          he expects a threat to leap out at any moment.\n\n                              SIMON\n                    Are you sure you weren't\n                    followed?\n\n                              HELEN\n                    I kept looking back, like you\n                    taught me.  I didn't see anyone.\n\n                              SIMON\n                    Okay.  It's just, things are a\n                    bit hot for me right now.  If I\n                    get a signal...\n                         (holds up a cigarette\n                          lighter meaningfully)\n                    I may have to leave suddenly.\n\n                              HELEN\n                    I understand.\n\n                              SIMON\n                    It's my job to risk my life, but\n                    not yours.  I feel bad about\n                    bringing you into this, but\n                    you're the only one I can trust.\n\n          Simon creates an atmosphere of danger.  His haggardness give\n          him an air of mystery and desperation.\n\n                              HELEN\n                    Where were you?  On a... uh,                           *\n                    mission?\n\n                              SIMON\n                    Ssshhh!  We say Op.  Covert                            *\n                    operation.  And this one got a\n                    little rough.\n\n                              HELEN\n                    Worse than Cairo?                                      *\n\n                              SIMON\n                    Cairo was a day at the beach next                      *\n                    to this.\n\n\n    138   INT. SEDAN - DAY\n\n          Harry and Gib turn to each other, shocked with the dawning\n          awareness.\n\n                              GIB\n                    Guy's a spook!\n\n                              HARRY\n                    Yeah, but for who?                                     *\n\n                              GIB\n                    He could be working her to get to\n                    you.\n\n          Harry waves his hand, silencing Gib.\n\n          INTERCUT FROM HERE ON BETWEEN HARRY/GIB AND HELEN/SIMON.\n\n\n    139   INT. CAFE - DAY\n\n          SIMON puts a newspaper on the table, sliding it over to Helen.\n\n                              SIMON\n                    Did you read the papers\n                    yesterday?\n\n                              HELEN\n                    Yes.\n\n                              SIMON\n                    Sometimes a story is a mask for\n                    a covert operation.  See-- two\n                    men killed in a restroom, and two\n                    unidentified men in a running                          *\n                    shootout, ending at the                                *\n                    Marriot...\n\n\n    140   INT. SEDAN - DAY\n\n          HARRY AND GIB react, realizing that it is the story of their\n          operation gone awry.\n\n\n    141   INT. CAFE - DAY\n\n                              HELEN\n                    That was you?!\n\n                              SIMON\n                    You recognized my style.  See,\n                    you're very good.  You're a\n                    natural at this.\n\n\n    142   INT. SEDAN - DAY\n\n          Harry starts to get it.  Then is dawns on Gib.\n\n                              GIB\n                    The guy's a fake!  He's taking\n                    credit for our moves.\n\n\n    143   INT. CAFE - DAY\n\n          HELEN LEANS CLOSE TO SIMON.  She clearly is hanging on his\n          every word.\n\n                              HELEN\n                    Tell me what happened?\n\n                              SIMON\n                    I'm sorry, I can't.\n\n                              HELEN\n                    You can trust me completely.\n\n                              SIMON\n                    I know.  But it would compromise\n                    your safety too much to know\n                    certain things.\n\n                              HELEN\n                    Right, of course.  I was worried\n                    when I didn't hear from you that\n                    night.\n\n                              SIMON\n                    It's strange.  I knew I was in a\n                    woman's thoughts when I was\n                    shooting it out with those\n                    assassins.\n\n\n    144   INT. SEDAN - DAY\n\n          HARRY REACTS to the outrageous fabrication.\n\n                              GIB\n                    Unbelievable.\n\n\n    145   INT. CAFE - DAY\n\n          BUT HELEN is eating it up.\n\n                              HELEN\n                    Were they trying to kill you?                          *\n\n                              SIMON\n                    Three of them.  Hardly worth                           *\n                    talking about.  Two won't bother                       *\n                    me again.\n\n                              HELEN\n                    And you chased one?\n\n                              SIMON\n                    Something came over me, I just\n                    had nail him, no matter what the                       *\n                    risk.  It was pretty hairy.  I\n                    thought he had me, a couple of                         *\n                    times.  But I really can't take\n                    credit .  .  .\n\n                              HELEN                                        *\n                    You can't?                                             *\n\n                              SIMON                                        *\n                    No.  It's the training.  It                            *\n                    shapes you into a lethal                               *\n                    instrument.  You react without                         *\n                    thinking.                                              *\n\n\n    146   INT. SEDAN - DAY\n\n          HARRY AND GIB guffaw.  This is too much.\n\n                              GIB                                          *\n                    I'm starting to like this guy.                         *\n\n          Harry shoot him a hard look.                                     *\n\n                              GIB                                          *\n                         (holding up his hand                              *\n                          defensively)                                     *\n                    We still have to kill him, that's                      *\n                    a given.                                               *\n\n\n    147   INT. CAFE - DAY\n\n          BACK TO HELEN AND SIMON as she leans even closer.\n\n                              HELEN\n                    What is it you want me to do?\n\n                              SIMON\n                    Not here.  I'll call you and\n                    we'll rendezvous again.\n                         (he looks around)\n                    We have to leave separately, so\n                    we aren't seen together.  For\n                    your safety.\n\n                              HELEN\n                    You'll call me then?\n\n                              SIMON\n                    Yes.  Now go.\n\n    148\n   thru   OMITTED                                                          *\n    155\n\n          PAGES 66-67 OMITTED                                              *\n\n    156   EXT. STREET/CAR LOT - DAY\n\n          Simon is cruising in the Corvette with the radio blasting.\n          Thinking he is supercool.\n\n\n    157   EXT. USED CAR LOT - DAY\n\n          Simon pulls into a used car lot, which is a run-down place.  A\n          hodge-podge of makes and models, a few that might aspire to be\n          classics.\n\n          Simon backs the Vette into an open space on the front line.  He\n          reaches into the back seat and pulls out a dayglo sign showing\n          the SALE PRICE of the car.  He sticks it back on the dash.  The\n          car doesn't even belong to him!\n\n\n    158   EXT. ACROSS THE STREET FROM CAR LOT - DAY\n\n          Harry and Gib pull up.  They watch as Simon jumps out of the\n          Vette and goes into the sales office.\n\n                              GIB\n                         (laughing)\n                    He's a goddamn used car salesman.\n                    This just gets better.\n                         (catching himself)\n                    Sorry Harry, I know this is\n                    painful.\n\n          Harry's eyes are slitted down lethally as he stares across the\n          street.\n\n\n    159   INT. CAR LOT SALES OFFICE - DAY (LATE AFTERNOON)                 *\n\n          TIGHT ON A TAPE PLAYER, with Simon's hand adjusting the volume.\n          The sound of traffic noise and middle-eastern music blares from\n          the deck.\n\n          PULL BACK to see Simon on the phone, talking loud, as if over\n          the din of a real place.\n\n                              SIMON\n                    It's a great little bar, Amanda,\n                    you'd love it.  Beirut's a great\n                    place if you know the city.                            *\n                    Listen, this isn't a secure line.\n                    I'll tell you all about it when\n                    I get back tomorrow... if I live.\n                         (pause)\n                    Scared?  Never!  Except of you--\n\n          During this, the owner of the place, DOUG WURTZ, has come out\n          of the back room and looked out at the lot.  What Doug sees is--\n\n          HARRY, browsing among the cars.\n\n          DOUG turns from the window and bears down on Simon, who sees\n          him coming and speeds up his rap.\n\n                              SIMON\n                    --I have to go, baby.  A guy's\n                    coming toward me--\n\n          Doug grabs the phone out of his hand and slams it in the\n          cradle.\n\n                              DOUG                                         *\n                    Simon, look out there.  You see\n                    that man?  Notice how he's\n                    looking at the cars.  He's called\n                    a customer.  I know it's been a\n                    while, but do you remember what\n                    you're supposed to do when we\n                    have a customer?\n\n\n    160   EXT. CAR LOT - DAY\n\n          Simon bounces jauntily up to Harry, talking before he's even\n          reached him.\n\n                              SIMON\n                    It wants you too.  Feel it\n                    vibrate?  How about a little\n                    spin?\n\n          Simon opens the passenger door and sits Harry inside, then runs\n          around the car.  He leaps over the closed door into the\n          driver's seat and starts the car.\n\n                              SIMON\n                    You gotta jump in.  That's rule\n                    number one.  It takes a little\n                    practice, but there's no way\n                    around it.\n\n\n    161   EXT. STREET - DAY\n\n          Simon swings the car out onto the boulevard, kicking back.\n\n                              SIMON\n                    See, it's not just the car, it's\n                    a total image.  An identity you\n                    have to go for.  This isn't some\n                    high-tech sports car...  it\n                    doesn't even handle that great.\n                    But that's not the idea, is it.\n\n          Simon gives Harry a big grin.  Harry returns a knowing chuckle.\n          Ha ha.\n\n                              SIMON\n                    What're we talking about here?\n                    Pussy, right?\n\n                              HARRY\n                    Absolutely.\n\n          Simon laughs.  Harry laughs.  A big lusty, male-bonding kind of\n          laugh.\n\n                              SIMON\n                    Well then this is a vital piece\n                    of equipment.  Used properly, it\n                    can change your life.  See, you\n                    cruise.  No racing.  This ain't\n                    a Ferrari.  You check out the\n                    scenery, let the scenery check\n                    you out.  You got to take it\n                    slow.  Old cars are like good\n                    women... they heat up fast.\n\n          How do you grin warmly while your eyes are so cold?  Ask Harry.\n\n                              HARRY\n                    Keep talking.\n\n                                                      CUT TO:\n\n\n    162   EXT. TACO STAND - DAY\n\n          Simon is holding court.  Over tacos, he waxes eloquent on his\n          greatest area of expertise.  We see Harry laughing, going along\n          with the guy.  Pretending to bond.\n\n                              SIMON\n                    Let's face it, Harry, the Vette\n                    gets 'em wet.  But it's not\n                    enough.  If you want to really\n                    close escrow, you gotta have an\n                    angle.\n\n                              HARRY\n                    And you've got one.\n\n                              SIMON\n                    It's killer.  Look at me-- I'm\n                    not that much to look at.  No\n                    really.  I can be honest.  But I\n                    got 'em lining up, and not just\n                    skanks, either.  Some are.\n\n                              HARRY\n                    So what's your angle?\n\n                              SIMON\n                    Sorry.  Trade secret.\n\n                              HARRY\n                         (grinning)\n                    Sure.  Set me up and then don't\n                    tell me.\n\n          Simon leans forward, conspiratorially.\n\n                              SIMON\n                    Okay, just ask yourself.  What do\n                    women really want?  You take\n                    these bored housewives, married\n                    to the same guy for years.  Stuck\n                    in a rut.  They need some\n                    release.  The promise of\n                    adventure.  A hint of danger.  I\n                    create that for them.\n\n                              HARRY\n                    So you're basically lying your\n                    ass off the whole time?  I\n                    couldn't do it.\n\n                              SIMON\n                    Well, think of it as playing a\n                    role.  It's fantasy.  You have to\n                    work on their dreams.  Get them\n                    out of their daily suburban grind\n                    for a few hours.\n\n                              HARRY\n                    Isn't that hard to keep up, in\n                    the long run?\n\n                              SIMON\n                    Doesn't matter.  I like change.\n                    You know, constant turnover.  As\n                    soon as I close the deal, it's\n                    one of two more times, then\n                    adios.\n\n                              HARRY\n                    Use 'em and lose 'em.\n\n                              SIMON\n                    Exactly.  The trick is, you gotta\n                    pick your target.  They have to\n                    be nice little housewife types.\n                    School-teachers.  But, I'm\n                    telling you, you get their pilot\n                    lit, these babes, they can suck-\n                    start a leaf-blower.\n\n                              HARRY\n                    What about the husbands?\n\n                              SIMON\n                    Dickless.  If they took care of                        *\n                    business, I'd be out of business,\n                    know what I mean?\n\n                              HARRY\n                    Those idiots.\n\n\n    163   EXT. STREET/ VETTE - DAY\n\n          They are cruising along, with Harry driving this time.\n\n                              HARRY\n                    You working on someone right now?\n\n                              SIMON\n                    I always have a couple on the\n                    hook.  You know.  There's one\n                    right now, I've got her panting\n                    like a dog.  It's great.\n\n          Unconsciously, Harry's hands clench the wheel tighter.\n\n                              HARRY\n                    What does she do?\n\n                              SIMON\n                    Some kinda legal secretary of\n                    something.  Married to some\n                    boring jerk.\n\n          Harry takes a corner too fast.  The tires squealing.\n\n                              SIMON\n                    And she could be so hot, if she\n                    wanted to be.  She's like a dying\n                    plant that just needs a little\n                    water.\n\n          When Simon is looking, Harry is open and encouraging...  they\n          laugh together... then when he looks away Harry goes snake-\n          eyed.  He could kill Simon with one punch.  He's visualizing\n          his wife getting porked by this guy.\n\n                              HARRY\n                    But with you, she gets to be hot,\n                    right?\n\n                              SIMON\n                    Red hot.  Her thighs steam.\n\n          They laugh together.  Harry's laugh is getting a bit brittle.\n          He speeds up, his knuckles white on the wheel.  Now for the big\n          question: HAVE THEY OR HAVEN'T THEY?\n\n                              HARRY\n                    Sooooo... she's pretty good in\n                    bed, then?\n\n                              SIMON\n                         (yelling suddenly)\n                    Hey, slow down you're gonna miss\n                    the turn!\n\n\n    164   EXT. USED CAR LOT - DAY\n\n          Harry comes barrelling into the lot at forty.  He cranks the\n          wheel and hits the emergency brake, slewing the car into a\n          smoking bootlegger-180.  It screeches backward, sliding right\n          into its parking space perfectly.\n\n          Simon is bugeyed.  But he is non-plussed for only about two\n          seconds.  Then he's back to selling.  He scrambles out and goes\n          around to Harry, coughing in the cloud of tire smoke.\n\n                              SIMON\n                    See.  You and this car were meant\n                    for each other.  Why fight it?\n                    Sure, I have a couple other\n                    buyers lined up, but I like your\n                    style.  Whattya say?  Should we\n                    start on the paperwork?\n\n                              HARRY\n                    Let me think about it.  Hold it\n                    a day for me?\n\n          Simon grins and winks.\n\n                              SIMON\n                    Because it's you.\n\n\n    165   INT. TASKER HOUSE - NIGHT\n\n          Dana is in the living room, watching TV when she sees her\n          mother cross through, dressed to go out.\n\n                              HELEN\n                    Dinner's in the warmer.  Tell\n                    your father I may be late.\n\n                              DANA\n                    Where are you going?\n\n                              HELEN\n                    Out.\n\n          Dana is momentarily puzzled by the reversal of roles.\n\n\n    166   INT. ENTRY WAY - NIGHT\n\n          ON HELEN, checking herself in the hall mirror.  She looks at\n          her big dowdy purse.  Hating it suddenly.  She pulls her\n          pocketbook out and rummages on the top shelf of the hall closet\n          for a small handbag, then charges out.\n\n    167   OMITTED\n\n\n    168   INT. / EXT. SEDAN - NIGHT\n\n          Harry is driving.  Gib pulls a sheaf of pages out of his\n          briefcase and hands them to him.\n\n                              GIB\n                    Here's today's transcripts.\n                    There's nothing interesting.\n\n                              SIMON\n                    Nothing from Simon?\n\n          Keeping one eye on the road, Harry riffles through the sheets.\n          He glances at the top of the last couple of sheets.  He scowls.\n          Then SUDDENLY SLAMS ON THE BRAKES.  The car dives to the curb,\n          bumping one wheel.  Harry gets out and charges around to Gib's\n          side.  Gib gets out, his expression blank.\n\n                              HARRY\n                    Give me the page.\n\n                              GIB\n                    What are you talking about?\n\n                              HARRY\n                    It skips from page nine to\n                    eleven.  Where's page ten?\n\n                              GIB\n                    Aw, it's gotta be a typo--\n\n                              HARRY\n                    GIVE ME THE GODDAMN PAGE!!\n\n          Harry hammers his fist against the car-window right next to\n          Gib.  It explodes inward in a shower of glass.\n\n                              GIB\n                         (shrugging)\n                    Okay.  Here.\n\n          He fishes a crumples sheet of paper out of his pocket.  Harry\n          grabs it from him, straightening it.\n\n                              GIB\n                    Jeez, Harry.  Seek help.\n\n          As Harry begins to read, we go into FLASHBACK.\n\n\n    169   INT. USED CAR LOT OFFICE - DAY/FLASHBACK\n\n          ON SIMON - He is talking into the phone in hushed, urgent\n          tones.\n\n                              SIMON\n                    Helen.  I need your help.  Can\n                    you meet me tonight?\n\n          INTERCUT WITH HELEN at her office.\n\n\n    170   INT. HELEN'S OFFICE - DAY/FLASHBACK/INTERCUT\n\n                              HELEN\n                    What's happened?\n\n                              SIMON\n                    It's serious.  That's all I can                        *\n                    say.  Just meet on K Street under                      *\n                    the Key Bridge.  At eight sharp.                       *\n\n\n    171   INT./ EXT. SEDAN - NIGHT\n\n          BACK TO THE PRESENT.  Harry checks his watch.                    *\n\n                              HARRY\n                    Shit!  It's almost eight.                              *\n\n          He jumps back in the car and activates the GPS locator.\n          Helen's purse-blip flashes on the grid map.\n\n                              HARRY\n                    She's still at my house.                               *\n\n                              GIB\n                    The purse is still at the house.\n\n\n    172   INT. SEDAN - NIGHT\n\n          Harry growls and slams the car into gear, roaring out into\n          traffic.  Horns honk as he cuts off people.  He is oblivious.\n          He grabs his rover.\n\n                              HARRY\n                    Unit Two?  Unit Seven?\n\n\n   172A   CUT TO -- FAISIL AND AGENT WEBSTER IN THE UNIT SEVEN VAN         *\n\n                              FAISIL\n                    Seven here.\n\n\n   172B   CUT TO -- AGENT MORTON IN UNIT TWO CAR                           *\n\n                              UNIT TWO\n                    This is Two.\n\n\n   172C   INT. SEDAN - NIGHT                                               *\n\n                              HARRY\n                    Immediate roll.  Acquire subject\n                    at K Street and Key Bridge.                            *\n                    Vehicle is red-and-white                               *\n                    convertible.  You have six\n                    minutes.\n\n                              FAISIL\n                    Roger, One.  Rolling.\n\n                              UNIT TWO\n                    Copy that.\n\n                              GIB\n                    Wait a minute!  Are you out of\n                    your mind?  You can't pull agents\n                    off a priority surveillance to\n                    follow  your wife!    It's gross\n                    misappropriation of Sector's\n                    resources, it's...  it's a breach\n                    of national security.\n\n          Harry drives on, ignoring him.  Gib grabs his shoulder, shaking\n          him.\n\n                              GIB                                          *\n                    You copy, Harry?  This is too\n                    far.  You're losing it big-time.\n                    I have to stop you.\n\n                              HARRY\n                    Whatya going to do?   Tell?\n\n                              GIB\n                    Goddamnit, Harry.  This is our\n                    butts.  So your life is in the\n                    toilet.  So your wife is banging\n                    a used car salesman.  Sure it's\n                    humiliating.  But be a man here--\n\n                              HARRY\n                    You tell on me, I tell on you.\n\n                              GIB\n                    Whatya talking?  I'm clean as a\n                    preacher's sheets, babe.  Clean\n                    as a --\n\n                              HARRY\n                    What about that time you trashed\n                    a six-week operation because you\n                    were busy getting a blow-job?\n\n                              GIB\n                         (instantly contrite)\n                    You know about that?\n\n          Harry turns to him.  His glare could melt metal.  Gib gives a\n          fatalistic shrug.\n\n                              GIB\n                    Take Franklin, it's quicker.\n\n          Harry makes the turn, squealing tires.\n\n                              GIB\n                    You don't have any pictures\n                    though, do ya.  Huh?                                   *\n\n\n    173   EXT. BRIDGE - NIGHT\n\n          Helen pulls  her car under the bridge.  She checks her watch.\n          Helen notices that her hand is shaking.  She looks around and    *\n          the place seems deserted.  She is about to leave when she sees\n          headlights flash briefly in the shadows.\n\n          A red-and-white Vette emerges from the darkness and pulls up\n          next to her.  Simon motions for her to get in quickly.\n\n\n    174   EXT. PARKING LOT - THROUGH BINOCULARS - NIGHT\n\n          LONGSHOT  on Simon and Helen in the Vette, coming out of the\n          parking low under the bridge.  We are watching them through a\n          sophisticated telephoto night-vision device.\n\n\n    175   INT. UNIT TWO SEDAN - NIGHT\n\n          Agent MORTON lowers the SCOPE and picks up his rover.  He puts   *\n          the car in gear to follow.\n\n                              MORTON\n                    Two here.  Subject is southbound\n                    on Key Bridge.  A man and a woman                      *\n                    in the vehicle.\n\n                              HARRY (RADIO)\n                    Roger's two.\n\n\n   175A   INT./EXT. SIMON'S CAR\n\n          Simon makes a show of checking the mirrors.\n\n                              SIMON\n                    Now don't be alarmed... but if\n                    I'm spotter, it would be best if\n                    they don't see you.  You should\n                    keep your head down until we're\n                    out of the city.\n\n          He pushes her head down onto his lap.  She crouches there, with\n          her cheek against his thigh.  He's cruising along, loving it.\n\n\n    176   INT. HARRY'S CAR - NIGHT\n\n          Gib is trying to watch the computerized city map on the screen,\n          but Harry keeps cornering so fast he loses his place.\n\n                              MORTON (RADIO)\n                    The woman has her head in the\n                    guy's lap.\n\n          Harry is doing a jaw-clenched slow burn.\n\n                              HARRY\n                    Roger, two.  One to Condor, do\n                    you have visual?\n\n    177\n   thru   OMITTED\n    183\n\n    184   EXT. HIGHWAY LEAVING CITY - NIGHT\n\n          It is a highway heading away from the city.  IN A LONG LENS\n          SHOT, the Vette appears over the brow of a hill.  A moment\n          later A HELICOPTER rises up behind them, A DRAMATIC REVEAL.  It\n          follows the Vette.\n\n                              CONDOR (VOICE OVER/RADIO)\n                    This is Condor.  We have the\n                    ball, repeat... we have a good\n                    lock-up on I.R.\n\n          CUT TO: INFRARED VIEW of the Vette, from the helicopter's FLIR\n          system.  The greenish, image-intensified view of the car is\n          like daylight.\n\n\n    185   OMITTED\n\n       PAGES 79 - 80 OMITTED\n\n\n       EXT. HELICOPTER - AERIAL SHOT - NIGHT                          186\n\n       Down past the helicopter, to the Vette on the highway below\n       as they head out into the country.\n\n\n       OMITTED (187)                                                  187\n\n\n       EXT. TRAILER PARK - NIGHT                                      188\n\n       The headlights of the Vette light up a ratty single-wide\n       mobile home, on the outskirts of a TRAILER PARK off the\n       highway.  Simon and Helen get out of the car.\n\n                            SIMON\n                 My place in the city is too\n                 hot right now.  So is the\n                 penthouse in New York.  But\n                 this place is secure.\n\n       He takes her inside.\n\n\n       OMITTED (189)                                                  189\n\n\n       INT. SIMON'S TRAILER - NIGHT                                   190\n\n       Helen feels awkward in the small, junky space.  A tape deck\n       is playing cool jazz.  Simon hands her a glass of cheap wine.\n       He clinks her glass with his.\n\n                           SIMON\n                 To our assignment.\n\n                           HELEN\n                 What is it you need me to do?\n\n                              SIMON\n                    Helen, I want you to be my wife.\n\n                              HELEN\n                    I'm married!\n\n                              SIMON\n                         (quickly)\n                    Just for the operation in Paris.\n                    I need to be married.  They'll be\n                    looking for a man traveling\n                    alone.\n\n                              HELEN\n                    We're going to Paris?\n\n                              SIMON\n                    Helen, there's a double agent in\n                    my outfit... I don't know who.\n                    There's no one I can trust.\n                    Except you.  Can you get away?\n                    Just for two days.\n\n                              HELEN\n                    I don't know.  I have to think...\n\n                              SIMON\n                    Here.  Sit down.  Be comfortable.\n\n          He clears a place for her on the bed, shoving clothes and\n          magazines out of the way.  She sits down and he tops off her\n          glass from the wine bottle.\n\n\n    191   EXT. BILLBOARD AND TRAILER PARK - NIGHT\n\n          The agents have gathered behind a billboard.  Harry, Gib and     *\n          the other three agents have donned black jumpsuits.  They\n          finish fitting battle-harnesses, then they grab black ski-       *\n          masks.  They don them in perfect unison.  Commando precision.\n          Harry leads off and they quick-time from behind the billboard,\n          closing in on Simon's trailer.\n\n\n    192   INT. TRAILER - NIGHT\n\n          Helen looks up at Simon and nods slowly.\n\n                              HELEN\n                    Okay.  I'll do it.\n\n          Simon shoots over and sits next to her, taking her hand.\n\n                              SIMON\n                    You are incredibly brave.  I have\n                    to remind myself the fear you\n                    must be feeling.  I've lived like\n                    this for years, so I'm used to\n                    it.  Every day when I get up, I\n                    think it might be my last.  But\n                    it makes you appreciate life.\n                    And the moment.  Because that may\n                    be all you have.\n\n          He moves a little closer.  Casting his spell.\n\n                              SIMON\n                    To pull this cover story off, we\n                    have to look exactly like two\n                    people who are intimate with each\n                    other.  The enemy can spot a fake\n                    easily.\n\n          He puts his hand on her knee.  She tenses up instantly.\n\n                              SIMON\n                    You see what I mean?  That\n                    reaction would give us away in a\n                    second.  Try to relax.\n\n                              HELEN\n                    It's just that... it's been\n                    sixteen years since anyone but\n                    Harry did that, I--\n\n                              SIMON\n                    Relax.  There, that's better.\n                    Let yourself slip into the role.\n\n          He puts his other arm around her shoulders and pulls her slowly\n          into a kiss.  This doesn't seem real to Helen.  She finds\n          herself not pulling away.  He lowers her slowly until they are\n          lying together on the bed.\n\n                              SIMON\n                    There you go.  That's right...\n\n          He slides his hand up her thigh.  The fingers, stroking in\n          little circles, slips under her skirt.  And--\n\n          She suddenly EXPLODES, pushing on his chest, forcing him up off\n          her.\n\n                              HELEN\n                    NO!  Stop!\n                         (he keeps kissing her)\n                    Get off me RIGHT NOW!\n\n          Simon struggles with her.  She gets one knee up under him and\n          levers him up.  She pushes him to a standing position.  She\n          sits up on the bed, straightening her skirt.\n\n          He looks forlorn and pathetic.  Now he's going to try\n          pleading...\n\n                              SIMON\n                    If not for me, do it for\n                    democracy.\n\n\n    193   INT. / EXT. TRAILER - NIGHT\n\n          KABOOM!!  The back wall of the trailer is blown outward by tiny\n          shaped-charges.  The concussion throws Simon forward on top of\n          her.  Five BLACK-SUITED FIGURES swarm in, carrying machine\n          pistols and flashlights.\n\n\n    194   INT. TRAILER - HARRY'S POV - NIGHT\n\n          Lit by the beam of the flashlight, he sees Simon on top of\n          Helen, her knees up on either side of his hips.  It looks bad.\n          Simon and Helen sit up... stunned.  They look like two rabbits\n          in the headlights of a truck.  She screams.\n\n\n    195   INT. TRAILER - ON SIMON - NIGHT\n\n          Reacting as all his years of bullshit have suddenly\n          materialized as a nightmarish reality.  He is stunned.\n          Blinking, mouth hanging open.\n\n\n    196   INT. / EXT. TRAILER - SIMON'S POV - NIGHT\n\n          WHAT SIMON SEES -- Five demonic figures, backlit by the XENON\n          LIGHT from a helicopter.  Smoke and dust swirling in the rotor-\n          wash.  The figures lunge toward them, grabbing them both.\n          Helen struggles fiercely as Gib (disguised) pulls her up.\n          Harry yanks Simon to his feet.\n\n\n    197   EXT. TRAILER - NIGHT\n\n          Gib comes out first with Helen.  She struggles like a wildcat,\n          frankly surprising the hell out of Harry.  Simon is brought\n          out, dazed and compliant.  Helen whips around, KNEEING GIB\n          right in the balls.  Gib OOPHS and doubles over, and Helen runs\n          for it.\n\n          Harry leaves Simon with the other agents and runs after Helen.\n          She sprints through the trees, Harry pounding after her.  He\n          grabs her and gets her in a headlock.  She bites the hell out\n          of his arm.  Harry yells and lets her go, just as-- Keough runs\n          up and matter-of-factly clips her on the head with his weapon.\n          Standard operating procedure.  Which is why he can't understand\n          why Harry punches him, knocking him down.\n\n          Harry supports a sagging Helen, gesturing sharply to the other\n          agents and going RRRRR-RRRR to make his point (since he can't\n          talk without her recognizing his voice).  They head for the\n          cars.\n\n                                                      CUT TO:\n\n\n    198   INT. INTERROGATION ROOM/OBSERVATION CHAMBER - NIGHT\n\n          An empty room with a single stool under a light, and a large\n          two-way mirror.  The door opens and Helen is escorted in by\n          Keough, still wearing his jumpsuit.  Helen has a black hood\n          over her head.  Keough undoes a pair of handcuffs, freeing her,\n          then leaves quickly.\n\n          Helen whips the hood off and blinks in the light.  She wheels\n          at the sound of the door locking and runs to it.  Pulls twice\n          on the handle, without effect.  She crosses to the mirror and\n          peers at her reflection, trying to see if anyone is there on\n          the other side.\n\n\n    199   INT. OBSERVATION ROOM - NIGHT\n\n          ON THE OTHER SIDE OF THE GLASS is a dark chamber.  We see Helen\n          perfectly, peering in, though she sees nothing.  Harry and Gib,\n          in silhouette, sit at a console.  Harry speaks into a\n          microphone.\n\n                              HARRY\n                    Sit down.\n\n\n    200   INT. INTERROGATION ROOM - NIGHT\n\n          ON HELEN'S SIDE of the mirror we hear Harry's voice shifted by\n          a DIGITAL PROCESSOR.  It is a cold booming mechanical voice.\n          Harsh and inhuman.\n\n                              VOICE (HARRY)\n                    I said SIT DOWN.\n                         (she does)\n                    Who do you work for?\n\n                              HELEN\n                    Kettleman, Barnes and McGrath.\n                    I'm a legal secretary.\n\n                              VOICE (HARRY)\n                    Of course.  Mrs. Tasker.  And\n                    what were you going with the\n                    international terrorist, Carlos\n                    the Jackal?  Taking dictation?\n\n                              HELEN\n                    He said he was an American agent.\n\n\n    201   INT. OBSERVATION ROOM - NIGHT\n\n          INSIDE THE CONTROL room we can see Harry, Gib and, through the\n          glass, Helen.  Their voices sound normal on this side.\n\n                              HARRY\n                    How long have you been a member\n                    of his faction?\n\n                              HELEN\n                    I don't know anything about a\n                    faction.  I just met Simon...  or\n                    whatever his name is...  a couple\n                    of weeks ago.  I barely know him.\n\n                              GIB\n                    That's not what it looked like\n                    when we found you.\n\n          Harry scowls at Gib in the dark.  Helen flushes, remembering.\n\n                              HARRY\n                    How did you meet him?\n\n          FLASHBACK SEQUENCE:\n\n\n    202   INT. MALL - DAY/FLASHBACK\n\n          We see Helen sitting at table at a mall near where she works,\n          having a cappucino and a croissant.\n\n                              HELEN (V.O.)\n                    About two weeks ago I was at the\n                    mall, having coffee...\n\n          Simon appears behind her, sort of stalking up to her.  He\n          approaches quickly the last few steps and slips into the seat\n          next to her.  His manner is furtive.  He keeps looking around,\n          as if for hidden assasins.  He hands her a briefcase.\n\n                              SIMON\n                         (speaking very low)\n                    Keep this for me.  I can't afford\n                    to be taken with it.  National\n                    security is at stake.  I'll\n                    contact you if a can.  Okay?  Oh--\n\n          He seems to suddenly spot something OFF CAMERA and dashes off\n          the other way.\n\n\n    203   EXT. BUSINESS DISTRICT - DAY/FLASHBACK\n\n          Helen walks back to her office building, carrying the\n          briefcase.  She keeps looking over her shoulder.\n\n\n    204   INT. HELEN'S OFFICE - DAY/FLASHBACK\n\n          She has the briefcase on her desk while she works.  She keeps\n          glancing at it as she types.  Finally she hunches over it and\n          starts picking the locks with a paper clip.\n\n          TIGHT ON SECOND LOCK, popping open.\n\n          ON HELEN as she opens the case.  She gasps.\n\n          INSIDE THE CASE are the following items:  A tiny camera, some\n          loose tapes, some circuit diagrams, some transcripts that look\n          like gibberish which must be ENCRYPTED, some street maps of\n          Beirut, Rome and Berlin, and a Walther P.P.K.  PISTOL.  Helen,\n          eyes wide, closes the case.\n\n\n    205   INT. INTERROGATION ROOM - NIGHT / PRESENT\n\n          Helen shrugs, finishing up her story.\n\n                              HELEN\n                    I should have gone to the police,\n                    I suppose.\n\n                              GIB\n                    But you didn't.  Why not?\n\n                              HELEN\n                    I don't know.  I guess... I\n                    wanted to see what would happen.\n\n                              HARRY\n                    What did happen?\n\n                              HELEN\n                    Three days later, he called me.\n                    He told me to meet him at\n                    Overlook Park.\n\n\n    206   EXT. OVERLOOK PARK - SUNSET/FLASHBACK\n\n          Through the trees is a sweeping view across the Potomac to\n          Georgetown and Embassy Row.  Helen is sitting on a park bench\n          when Simon shows up, sitting beside her.  She hands him the\n          briefcase.\n\n                              SIMON\n                    Thank you.  You saved my life.\n                    What's your name?\n\n                              HELEN\n                    Helen.\n\n                              SIMON\n                    You can call me Simon.\n                         (he touches her hand)\n                    You're very brave to do this...\n                         (then notices the locks\n                          have been opened)\n                    You opened it.\n\n                              HELEN\n                    I just glances inside.\n\n\n    207   EXT. OVERLOOK PARK - CLOSE UP ON SIMON\n\n          CLOSE ON SIMON, looking right into her eyes.\n\n                              SIMON\n                         (solemn)\n                    Then you know.\n\n\n    208   INT. INTERROGATION ROOM - NIGHT / PRESENT\n\n          Harry shakes his head and rubs his eyes, picturing the whole\n          thing.\n\n                              HARRY\n                    Why did you continue to see him?\n\n                              HELEN\n                    He needed my help.\n\n                              HARRY\n                    Not because you were attracted to\n                    him?\n\n                              HELEN\n                    No.\n\n                              HARRY\n                    You weren't attracted to him at\n                    all?\n\n                              HELEN\n                    Well, maybe a little.\n\n                              GIB\n                    Is this a common thing for you?\n                    Cheating?\n\n                              HELEN\n                    No!  Never!\n\n                              GIB\n                    So, it was your first time.\n\n                              HELEN\n                    I wasn't cheating!\n\n                              HARRY\n                    Tell me about your husband, Mrs\n                    Tasker.\n\n                              HELEN\n                    Harry?  What can I say about\n                    Harry?  He's a sales rep for a\n                    computer company.\n\n                              HARRY\n                         (hard question for him)\n                    Would you say he was boring,\n                    then?\n\n                              HELEN\n                         (she sighs, nodding\n                          fatalistically)\n                    Yeah.  I suppose he is.\n\n                              GIB\n                    So sex with him isn't exactly\n                    making your flag wave anymore.\n\n          Harry cuffs him on the shoulder.  Signals with a scowl for him\n          to stay out of it.  Gib smirks.  Harry's put him through enough\n          shit the last couple of days, it's time for a couple digs.\n\n                              HELEN\n                    That's none of your goddamn\n                    business!  What kind of questions\n                    are these?\n\n                              HARRY\n                    You're in a lot of trouble, Mrs.\n                    Tasker, so I suggest you\n                    cooperate.  If we want to know\n                    the most intimate details of your\n                    life, you'd better tell us.\n\n          Helen glowers at the mirror.  Her hands are shaking and she\n          hates it that they can probably see she is afraid.\n\n                              HELEN\n                    My husband is a good man.\n\n                              GIB\n                    But he's not exactly ringing your\n                    bell lately, right?  I mean--\n\n          Harry covers the mike and whips around on Gib.\n\n                              HARRY\n                    Let me handle this part.  Do you\n                    mind?\n                         (to Helen)\n                    Why did you go to Carlos'\n                    hideout?\n\n                              HELEN\n                    He wanted me to go with him on a\n                    mission, to pose as him wife.\n\n                              HARRY\n                    And you agreed?\n\n                              HELEN\n                    Yes.\n\n                              HARRY\n                         (amazed)\n                    Why?\n\n          Helen searches herself for the explanation.\n\n                              HELEN\n                    I don't know.  I guess I needed\n                    something...\n\n                              HARRY\n                    What did you need?\n\n                              HELEN\n                    I needed to feel alive.  I wanted\n                    to do something...  outrageous.\n                    And... I don't know... it felt\n                    good to be needed.  To be\n                    trusted.  To be special.\n\n          In verbalizing it she just feels smaller, more pathetic that\n          she ever did.  She hates the unseen voices for making for try\n          to explain her deepest, unvoiced needs.\n\n                              HELEN\n                    There's so much I wanted to do in\n                    this life, and it's like I\n                    haven't done any of it.  And the\n                    sand's running out of the\n                    hourglass.  I want to be able to\n                    look back and say:  See!  I did\n                    that.  It was wild and it was\n                    reckless and outrageous and I\n                    fucking did it!\n                         (she glares at the\n                          mirror)\n                    And I frankly don't give a shit\n                    if you understand this or not.\n\n          Gib looks at Harry, eyebrows raised.  Whew!  Harry is studying\n          his wife like she's some fantastic new species.\n\n                              HARRY\n                    This Simon.  Did you sleep with\n                    him?\n\n                              HELEN\n                    No.\n\n                              GIB\n                         (covering the mike)\n                    She's lying.\n\n                              HARRY\n                    You didn't have sexual relations\n                    with him?\n\n                              HELEN\n                         (acidly)\n                    Look, if you ask me everything\n                    twice, this is going to take a\n                    really long time.  And I have to\n                    get home to my family.\n\n                              GIB\n                    You're not going anywhere.\n\n          Helen loses it.  It is fury and fear, tears and rage all at\n          once--\n\n                              HELEN\n                    Let me out of her!  Right now!\n\n                              HARRY\n                    Answer the question--\n\n          She picks up her stool and charges toward the mirror, swinging\n          it with all her might.  It bounces off harmlessly.\n\n                              HELEN\n                         (she swings again,\n                          yelling)\n                    I didn't sleep with him!\n                         (and again--WHAM!)\n                    You hear me, you chickenshit\n                    bastards--\n\n          WHAM!  She hits the mirror again.\n\n                              GIB (INHUMAN VOICE)\n                    Everyone tries.  It's\n                    unbreakable.\n\n          WHAM!  WHAM!  WHAM!  The mirror suddenly stars from side to\n          side with huge cracks.  She's about to beat her way through it.\n\n\n    209   INT. OBSERVATION ROOM - NIGHT\n\n          INSIDE THE OBSERVATION ROOM Harry and Gib jump back.\n\n                              GIB\n                    She could be telling the truth.\n\n                              HARRY\n                         (to Helen)\n                    Wait!  Calm down, Mrs. Tasker.\n                    There is only one more question.\n\n          Helen drops the stool.  She stands there panting.  Her fury\n          spent, she begins to cry.\n\n                              HELEN\n                    What?\n\n                              HARRY\n                    Do you still love your husband?\n\n                              HELEN\n                         (softly)\n                    Yes.\n\n                              HARRY\n                    Louder please.\n\n                              HELEN\n                    I love him.  I have always loved\n                    him and I will always love him.\n                         (she wipes at her eyes)\n                    Can I go home, please?\n\n\n    210   INT. OBSERVATION ROOM - NIGHT\n\n          INSIDE THE OBSERVATION ROOM Harry states at her.  He smiles.\n\n                              GIB\n                    Now what?\n\n                              HARRY\n                         (leaning forward to the\n                          mike)\n                    There is only one solution to\n                    your problem, Mrs. Tasker.  You\n                    must work for us.\n\n                              GIB\n                         (whispering to Harry)\n                    Oh shit.  Harry... what're you\n                    doing?\n\n                              HARRY\n                         (like: isn't it\n                          obvious?)\n                    I'm giving her an assignment.\n                         (to Helen)\n                    I am offerring you a choice.  If\n                    you work for us we will drop the\n                    charges and you can go back to\n                    your normal life.  If not, you\n                    will go to federal prison, and\n                    your husband and daughter will be\n                    left humiliated and alone.  Your\n                    like will be destroyed.\n\n                              HELEN\n                    Oh, gee thanks.  Mmmm, let me see--\n\n                              HARRY\n                    Yes or no.\n\n                              HELEN\n                    What do you think?  Of course\n                    yes!  What's involved?\n\n                              HARRY\n                    You will be contacted with the\n                    assignment.\n\n                              HELEN\n                    My husband can't know about this.\n\n                              HARRY\n                    No one must know!  Especially\n                    him.  You must appear to live\n                    your life normally, conveying\n                    nothing.  The security of this\n                    nation depends on it.  Can you do\n                    that?\n\n                              HELEN\n                    I think so.\n\n                              HARRY\n                    Think carefully.  You will be\n                    lying to the man you love.  The\n                    person who trusts you the most.\n\n                              HELEN\n                         (fearless)\n                    I can do it!\n\n                              HARRY\n                    The code name of your contact\n                    will be Boris.  Your code name\n                    will be--\n\n                              HELEN\n                         (excited)\n                    Natasha?\n\n                              HARRY\n                    No.  Doris.\n\n\n    211   INT. INTERROGATION ROOM - NIGHT\n\n          ON HELEN, not liking her wimpy code-name.\n\n\n    212   EXT. BRIDGE - NIGHT\n\n          The unit-seven van pulls up in the spooky shadows under the\n          bridge, stopping next to Helen's red Accord.  The door slides\n          open and Helen gets out, helped my black-garbed hands.  She is\n          wearing her hood, which is whisked off by one of the hands.\n          She whirls in time to see the door slide shut and the van speed\n          off.  She watches it drive off into the night.\n\n\n    213   EXT. ROCK QUARRY - NIGHT\n\n          The van pulls up near the edge of a large quarry.  The door\n          opens and Simon is pushed out, followed by Harry, who is in his\n          black jumpsuit and wearing a ski-mask.  Gib follows as Harry\n          guides Simon to the edge of a sheer drop.  Harry whips off the\n          hood and Simon takes in his surroundings.\n\n                              SIMON\n                    Yeeaoowww!!\n\n                              HARRY\n                    You son of a bitch.  Did you\n                    really think you could elude us\n                    forever, Carlos?\n\n                              SIMON\n                    Wait!  You got the wrong guy.  My\n                    name's Simon.  Look, just let me\n                    go.  There's no need to kill me.\n                    I haven't seen your--\n\n          Harry whips off his ski-mask.\n\n                              SIMON\n                    -- face.  Shit!  Shit!!\n\n          Simon has ducked his head and won't look at Harry.  Then it\n          dawns...  He looks up, brightening hopefully.\n\n                              SIMON\n                    It's you!  Hey, you still\n                    interested in that Vette at all?\n\n                              GIB\n                    You can drop it now, Carlos.  The\n                    game is over.  Your career as an\n                    inter-national terrorist is too\n                    well documented.\n\n                              SIMON\n                    No... I sell cars.  That's all!\n                    Not even foreign cars.  Nothing\n                    international, I swear.  I'm no\n                    terrorist.  Everything I said was\n                    a lie... you have to believe me.\n                    I'm actually a complete coward.\n                    If I ever even saw a gun I'd--\n\n          Harry whips his pistol out in one liquid motion and snaps the\n          muzzle right in front of Simon's eyes.\n\n                              SIMON\n                    -- faint.  Aahhh!  Don't kill me.\n                    I'm not a spy.  I'm nothing.  I'm\n                    navel lint.  I have to lie to\n                    women to get laid.  And I don't\n                    score much.  It's pathetic.\n                         (he looks down)\n                    See, look... would a spy pee\n                    himself?\n\n          Harry is finally sickened by his grovelling.  He pulls Simon\n          away from the edge, then gestures with his gun.\n\n                              HARRY\n                    Beat it.\n\n                              SIMON\n                    No.  Soon as I turn you'll shoot\n                    me.\n\n          Harry starts back to the truck.  Simon stays right with him,\n          facing him, terrified to turn away.  Like a dog following him.\n\n                              SIMON\n                    Please don't.  You can have the\n                    car for free--\n\n                              GIB\n                    Take off, dipshit!\n\n          Gib finally shoves Simon back and Harry contemptuously cranks\n          THREE ROUNDS into the ground by his feet, forcing him to dance\n          backward.  The two agents get into the van and tear off in a\n          cloud of dust.  Leaving Simon alone in the moonlight, miles\n          from nowhere.\n\n                                                      CUT TO:\n\n\n    214   INT./ EXT. SEDAN - DAY\n\n          TIGHT ON LOCATOR SCREEN as a blip moves across the grid of city\n          streets.  Gib drives while Harry watches the screen.\n\n                              HARRY\n                    We should pick up visual at the\n                    next light.\n\n          The scrambler phone in Harry's briefcase rings.  He picks it\n          up.\n\n                              HARRY\n                    Morning, boss.\n\n\n    215   INT. OMEGA SECTOR - DAY\n\n          INTERCUT WITH SEDAN.  Spencer Trilby stands glowering as he\n          talks to Harry.\n\n                              TRILBY\n                    Harry, this report on last\n                    night's operation is the thinnest\n                    piece of crap I've ever seen from\n                    you.  I'm sure you won't mind\n                    giving me a little more detail on\n                    why all these assets were\n                    deployed.\n\n\n    216   INT./EXT. SEDAN - DAY\n\n                              HARRY\n                    Absolutely.  But can it wait?\n                    I'm on a critical surveillance\n                    right now.\n\n          Harry spots something up ahead.  He snaps his fingers and\n          points, then whips a pair of gyro-stabilized binoculars to his\n          eyes.\n\n          HARRY'S POV THROUGH SCOPE:  Trent, on the Yamaha with Dana on\n          the back, rides through the intersection up ahead.  Dana bops\n          to the sound coming over her walkman headphones as Trent zips\n          between cars.  Gib makes the turn, pulling in behind them at a\n          distance.\n\n                              TRILBY\n                    Harry.  Is there anything you\n                    want to tell me?\n\n                              HARRY\n                         (innocently)\n                    No.  Not that I can think of.\n\n          THE CAMERA PUSHES IN ominously on Spencer Trilby.\n\n                              TRILBY\n                    Harry?  You know we never fire\n                    anybody.\n\n          Click.  Harry hangs up the phone slowly.\n\n                              GIB\n                    We're dead, right?  So...\n                    where'd you put the transmitter?\n\n                              HARRY\n                    In her Walkman.  It's the one\n                    thing I knew she'd be taking.\n\n\n    217   EXT. WAREHOUSE - DAY\n\n          Harry walks toward the closed warehouse doors, past Trent's\n          parked Yamaha.  We hear MUSIC from inside.\n\n\n    218   INT. WAREHOUSE - DAY\n\n          INSIDE THE WAREHOUSE, we see what it is that Dana has been\n          doing when she skips school.  A garage band of teenagers,\n          mostly older than her, are playing loudly.  Dana has the\n          microphone, belting out a punchy cover of the old Cream classic\n          \"Sunshine of Your Love\".  The guitar parts have been industrial-\n          ized, and it actually sounds pretty hip.\n\n          Harry watches from the shadows, standing behind a pillar not\n          far from the stage.  Watching his daughter gyrating in the\n          spotlight.  His reaction is hard to read.\n\n\n    219   INT. WAREHOUSE - CLOSE UP OF CIRCUIT-BREAKER - DAY\n\n          TIGHT ON THE MASTER CIRCUIT-BREAKER as Harry's hand throws the\n          switch.\n\n\n    220   INT. WAREHOUSE - STAGE - DAY\n\n          The stage is plunged into darkness and the music stops\n          abruptly.  Before the band members can react, they hear the big\n          metal doors rolling and sunlight blazes in.  Dana stares into\n          the glare, seeing an ominous silhouette standing there.  The\n          shadowy figure walks toward them.\n\n                              FIGURE\n                    You! Come with me.\n\n          The figure comes straight toward Dana.  To her horror is turns\n          out to be her dad.  Her heart stops.\n\n                              DANA\n                    Oh my Gooooood.\n\n\n    221   EXT. WAREHOUSE - DAY\n\n          Harry appears through the doors, marching Dana by the arm.  He\n          walks her over to some industrial junk nearby, overgrown with\n          weeds, and sits her down for a talk.\n\n          She is sullen, still mortified from getting dragged out in\n          front of her friends.\n\n                              HARRY\n                    There are going to be some\n                    changes Dana.  You're going to\n                    start following some rules.  And\n                    I'm going to be there to see that\n                    you do.\n\n                              DANA\n                    Yeah, right.\n\n                              HARRY\n                    You're going to stay in school.\n                    Do you understand?\n\n                              DANA\n                    Why?  So I can wind up like you?\n                    What's the point?\n\n          You think Harry's going to really rain on her parade.  But he\n          doesn't.  He becomes very tender.  He pushes the hair back from\n          her face.\n\n                              HARRY\n                    Did I tell you about the time we\n                    first met?\n\n          She looks up at him, puzzled?\n\n                              HARRY\n                    You were quite young at the time.\n                    All wet and still attached to\n                    your mom by a cord.  You opened\n                    your eyes and looked right at me.\n                    And I knew then I would always\n                    love you with all my heart.\n\n          Dana stares at her father with a dawning awareness.  This is\n          not just some chump that she has to put up with.  This is her\n          father.  He is a part of her.  No matter what happens they are\n          in this thing together.  Tears start to run down her cheeks.\n\n                              HARRY\n                    Somewhere along the way I got\n                    lost, honey.  I forgot about what\n                    was really important.  I'm sorry\n                    pump-- I mean--\n\n          She grabs his in a fierce hug.  Harry closes his eyes, letting\n          the moment purify him.\n\n                              HARRY\n                    Dana, regarding this singing--\n\n          She pulls back, suddenly wary.  Oh shit.\n\n                              HARRY\n                         (grinning)\n                    You were pretty good.\n\n\n    222   INT. / EXT. SEDAN - DAY\n\n          Dana sits wedged into the front seat between Gib and Harry.\n          Father and daughter are singing raucously loud, with the\n          windows down.\n\n                              HARRY/ DANA\n                    I've been waiting so long To be\n                    where I'm going In the sunshine\n                    of your looooove\n\n          They crack up after the long sustain.  They are both suffused\n          with a glow of rediscovery.  Harry pulls the car to the curb in\n          front of Dana's school.\n\n                              DANA\n                    Dad, how come you know the words?\n\n                              HARRY\n                    Honey that song came out in 1968,\n                    when I was exactly your age.\n\n                              DANA\n                    Unbelievable!  Trent told me he\n                    wrote it.  He's history.\n\n\n    223   INT. TASKER HOUSE - NIGHT\n\n          The image of a family dinner.  Helen is avoiding Harry's eyes.\n          Harry looks over at Dana and she gives him a tiny smile.  Then\n          she rises from her half-finished dinner and heads out of the\n          kitchen.\n\n                              DANA\n                    I'm done.\n\n                              HELEN\n                    Where are you off to young lady?\n\n                              DANA\n                         (pointing toward her\n                          room)\n                    I have a book report.\n\n          Helen watches her go.  That's strange.\n\n                              HARRY\n                    So last night was pretty\n                    exciting, huh?\n\n                              HELEN\n                         (alarmed)\n                    What?\n                         (then smoothly--)\n                    Oh, the flat tire?  Yeah, I\n                    thought the damn towtruck was\n                    never going to get there.\n\n          Harry smiles, reaching for more chicken.  The phone RINGS.\n          Helen controls the urge to run to it.\n\n                              HELEN\n                    Hello?\n\n                              METALLIC VOICE\n                    Doris?\n\n                              HELEN\n                    Oh.  Yes?\n\n\n    224   INT. OMEGA SECTOR - NIGHT\n\n          GIB, AT OMEGA SECTOR, uses the SPEECH SYNTHESIZER to disguise\n          his voice.\n\n                              GIB\n                    Listen carefully.  Go to the\n                    Hotel Marquis in one hour.  Pick\n                    up an envelope marked Doris at\n                    the front desk.  And dress sexy.\n\n\n    225   INT. TASKER HOUSE - NIGHT\n\n          BACK ON HELEN as she reacts to that.\n\n                              HELEN\n                    What?\n\n                              VOICE\n                    Get going!\n                         (CLICK)\n\n                              HELEN\n                         (thinking for a second,\n                          then--)\n                    Uh... well, okay then.  You sound\n                    terrible.  I'll run out right\n                    now.  Just call the prescription\n                    in to the pharmacy.  Sure, no\n                    problem.  Bye.\n\n          Harry smirks, listening to her lie.  She's good.  The smirk\n          drops as she turns.\n\n                              HELEN\n                    Allison is sick in bed.  I have\n                    to go over there, honey.\n\n                              HARRY\n                    Sure, hon.\n\n          She walks unhurriedly out of the room.  Behind her back, Harry\n          is grinning.  The second Helen is out of his sight line, she\n          runs up the stairs.  Harry waits a moment then picks up the\n          phone.\n\n\n    226   INT. OMEGA SECTOR/ ELECTRONIC LAB -- NIGHT\n\n          Gib is in a corner of the electronics lab, in an area dedicated\n          to DIGITAL AUDIO PROCESSING.  The phone in his briefcase rings.\n          Gib answers.\n\n                              GIB\n                    You've reached a new low with\n                    this one.  I can't believe you're\n                    crazy enough to use the room at\n                    the Marquis.\n\n                              HARRY\n                    Why not?  You think I can afford\n                    a suite like that on my salary?\n                    Is Jean-Claude done yet?                               *\n\n          Gib looks over at a SOUND RECORDING BOOTH nearby.  In it a FAT   *\n          FRENCH AGENT, JEAN-CLAUDE is doing voice recording from a hand-  *\n          written page.\n\n                              GIB\n                    Not quite.\n\n\n    227   INT. OMEGA SECTOR - INSIDE THE BOOTH - NIGHT\n\n          We hear Jean-Claude record a line on a tiny DAT tape recorder.   *\n          He speaks with a cosmopolitan French accent.  Close your eyes    *\n          and he's Charles Boyer.\n\n                              JEAN-CLAUDE                                  *\n                    No no.  Do it slowly.  Very\n                    slowly.\n\n\n    228   OMITTED                                                          *\n\n\n    229   INT. HOTEL MARQUIS - NIGHT\n\n          A big luxury hotel downtown, with an opulent lobby.  Helen\n          enters, looking different than we have ever seen her.  She has\n          been commanded to be sexy, and she is.  Her black slinky dress\n          is cut at mid-thigh, showing some good legs we haven't been\n          aware of.  She's pulled her hair back and added pearls.  Now\n          she looks elegant and hot.  Playing the role.\n\n\n    230   INT. HOTEL - FRONT DESK - NIGHT\n\n          She goes to the front desk and signals the ASSISTANT MANAGER\n          with her eyes.  He comes over to her.\n\n                              HELEN\n                    Do you have an envelope for\n                    Doris?\n\n          The man nods.  Saying nothing, he reaches under the counter and\n          hands her the envelope.  She opens it as she walks across the\n          lobby.  In contains a room key, a small bugging device, and a\n          phone number.\n\n\n    231   INT. HOTEL LOBBY - NIGHT\n\n          TIGHT ON A PAY PHONE as Helen finishes dialing the number.  She\n          scans the lobby as the phone rings--\n\n                              METALLIC VOICE\n                    Listen.  You are a prostitute\n                    named Michelle.  Go to the room.\n                    A man will be there.  He is a\n                    suspected arms dealer.\n\n                              HELEN\n                    Do I have to... you know-- ?\n\n                              VOICE\n                    No.  He has particular tastes.\n                    He likes to watch.  You will say\n                    his regular girl, Carla, is sick.\n                    If he likes you, he will tell you\n                    what to do.  You must plant the\n                    bug near the telephone, by the\n                    bed, before you leave.  If you do\n                    not accomplish your mission, the\n                    deal is off.\n\n\n    232   INT. HOTEL/ TENTH FLOOR - NIGHT\n\n          Helen exits an elevator and walks down the long hallway toward\n          the suite.  She stops by a mirror and checks her look.  Decides\n          she is too uptown.  She pulls the neckline of her dress down so\n          it shows more shoulder, then hitches up the hem.  Ditches the\n          pearls.  Puts on some red lipstick.\n\n          Now she doesn't look hot and elegant... just hot.  She\n          practices a slinky walk, getting into the role.\n\n          Suddenly she remembers her wedding ring.  She pulls on it.  It\n          probably hasn't been off in years.  She licks her finger and     *\n          twists it off.  Yoww!  She puts it on her right hand and turns   *\n          the modest diamond palm-side in .  .  .  Out of site.  Then,     *\n          reading the number off the key, she goes to the room and\n          unlocks the door.\n\n\n    233   INT. SUITE - NIGHT\n\n          Helen comes in hesitantly.  The lights are off.  The suite is\n          large and richly furnished, with a breathtaking view of the\n          city.  It is the room Harry was using, posing as Renquist.  A\n          FRENCH-ACCENTED VOICE comes from the next room.\n\n                              VOICE\n                    In here.\n\n          She goes into the bedroom.  There is a dark figure sitting in\n          a chair, just a silhouette.\n\n                              MAN\n                    Step into the light.\n\n          It is a corner room.  The drapes on one side are closed,\n          shadowing the man, but open on the other just enough to let in\n          a slash of moonlight.  She steps forward into it.\n\n          TIGHT CLOSE UP on the figure.  We can just make out that it is\n          Harry, though Helen cannot.  TILT DOWN to show his hand, out of\n          sight behind the chair-arm, as he manipulates the pause button\n          on the DAT tape deck.\n\n                              HELEN\n                    I'm Michelle.  Carla's sick.  She\n                    thought you might like me, so --\n\n          Harry goes SSSSHHHH.  Silencing her gently.  He silently clicks\n          off the PAUSE button.  The DAT recorder plays.  Charles Boyer,\n          deep and hypnotic, speaks from Harry's outline.  Harry\n          lipsynchs.\n\n                              HARRY (TAPE)\n                    Let me do the talking.  You are                        *\n                    very pretty.  You may start by                         *\n                    unzipping your dress.\n\n          PAUSE button.  She starts to yank the zipper down.               *\n\n                              HARRY (TAPE)\n                    No no.  Do it slowly.  Very\n                    slowly.\n\n          Helen turns her back to him, and draws the zipper down           *\n          languorously, revealing her creamy back.  She is not wearing a   *\n          bra.                                                             *\n\n                              HARRY (TAPE)\n                    Now slip the dress down...                             *\n                    slowly.\n\n          Helen is starting to get into the ritual.  She lets the dress    *\n          slip off her shoulders.  It slides down her body to the floor.   *\n          She steps out of it, still in high heels.                        *\n\n                              HARRY (TAPE)\n                    Now slide the nylons off one by\n                    one.\n\n                              HELEN\n                         (puzzled)\n                    I'm not wearing any.\n\n          Harry winces.  He starts the next line immediately.\n\n                              HARRY (TAPE)\n                    That's good.  Now the panties.                         *\n\n          The ritual continues as she strips slowly (this will be\n          tastefully done).  She conceals the bugging device in her hand\n          as she sets her clothes on the bed near the phone.  Helen is\n          still concentrating on her mission.\n\n                              HARRY (TAPE)\n                    Now turn, cheri, in the\n                    moonlight.  Let your body flow\n                    like water.\n\n          She turns.  Her skin is beautiful in the silvery light.\n\n                              HARRY (TAPE)\n                    Now dance for me.  Go on.\n\n          Helen has no idea what to do, but she improvises quite well.\n          The scrutiny of the shadowed man, who is fully clothed, and her\n          raw vulnerability are a quiveringly powerful erotic\n          combination.\n\n                              HARRY (TAPE)\n                    Let your hands be a lover's hands\n                    on your own skin as you move.\n                    Yes, that's it.\n\n          TIGHT ON Harry's eyes as he studies her.  His game, meant to\n          give her a dangerous fantasy, is actually turning him on\n          mightily.  He is amazed to see her playing the role, getting\n          into it.  This is not the Helen is thought he knew for sixteen\n          years.\n\n                              HARRY (TAPE)\n                    Now, lie on the bed and close\n                    your eyes.\n\n          She does.  Harry rises and goes to her, bringing the tape deck.\n\n                              HARRY (TAPE)\n                    Keep them closed.  Do not open\n                    them.\n\n          He sits on the bed, next to her, but without touching her.  He\n          strokes her hair, lovingly.  Then runs his fingertips over her\n          eyes, down her cheeks.  To her it feels delicate and delicious.\n          Part of her is enjoying this a lot.  But Helen is torn between\n          wanting to flee and knowing that nothing the man has done so\n          far is enough to cause her to abort her mission.\n\n                              HELEN\n                    I thought you only liked to\n                    watch.\n\n          Harry goes SSSHHH.  It's all he can do.  He bends over her and\n          brings his lips slowly down to her.  He touches them to hers so\n          slowly that she barely knows he is kissing her.  Then he takes\n          her in a passionate kiss.\n\n          And she grabs the lamp on the bedside table and SMASHES IT OVER\n          HIS HEAD.  Harry flies off onto the floor, groaning and\n          semiconscious.\n\n          Helen flips on the light and grabs her clothes, starting to\n          dress rapidly.  She still doesn't recognize Harry, who is face\n          down.  He groans and starts to rise.  She kicks him in the ribs\n          and finishes putting her dress on.  She sticks the bug under\n          the night table and grabs her shoes.  Mission accomplished,\n          motherfuckers.\n\n          Harry grabs her ankle.  She raises one shoe to kosh him again,\n          and sees who it is.  Freezeframe.  Total shock.  She can't even\n          form the question.\n\n                              HELEN\n                    Harry-- ?!\n\n\n    234   INT. SUITE DOOR - NIGHT\n\n          CRASH!!  The door lock is shattered by tremendous force and\n          THREE MEN burst into the room.  We may recognize them as\n          workers from Juno's shop.  They are wielding pistols and are\n          clearly part of Malik's terrorist brigade.\n\n          Harry is still groggy, and he doesn't want to start anything\n          with Helen there, and risk her getting shot.  He acquiesces as\n          they pull him to his feet.\n\n                              HELEN\n                    He's got nothing to do with this.\n                    It's me you want, right?\n\n                              HARRY\n                         (to lead TERRORIST)\n                    Let the hooker go.  She's not\n                    important.\n\n                              HELEN\n                    Harry, be quiet.  Let me handle\n                    this.\n\n                              LEAD TERRORIST\n                    Shutup, both of you.\n\n          During this exchange, the thugs have handcuffed Harry's hands\n          behind his back.  The leader gestures to one of the men to\n          bring Helen along.  Helen and Harry are dragged roughly out of\n          the room with pistol-muzzles stuck in their ribs.\n\n\n    235   INT. STAIRWELL - NIGHT\n\n          The door from the corridor bangs open and the thugs hustle\n          Harry and Helen down the fire-escape stairs.\n\n                              HELEN\n                    Listen, you don't need him, he's\n                    nothing.  He's a sales rep for a\n                    computer company, really--\n\n          The thug leader cuffs her across the head to shut her up.\n\n                              HELEN\n                    That was unnecessary.\n\n\n    236   INT. HOTEL BASEMENT - NIGHT                                      *\n\n          A stairwell door opens and the terrorists rush Harry and Helen   *\n          through the basement labyrinth.                                  *\n\n                              HELEN\n                    What were you doing there?\n\n                              HARRY\n                    You wouldn't believe me.\n\n          A pistol muzzle is jammed hard behind Helen's ear.\n\n                              TERRORIST LEADER\n                    Talk again, I kill you.\n\n          They are hustled across a loading dock to a RENTAL VAN waiting   *\n          with the door open.  A fourth terrorist slides the van door      *\n          shut after they get in and gets in behind the wheel.  The van    *\n          takes off.\n\n                                                      CUT TO:              *\n\n    237   OMITTED                                                          *\n\n\n    238   EXT. AIRPORT - NIGHT\n\n          The rental van pulls up to a G-3 JET warming up outside a\n          private hanger.  The van doors open and the hostages are\n          brought out.  Harry sees a long black LIMO pulling up behind\n          the van.  The driver, an enormous man names AKBAR, hurries to\n          open the passenger door.  A slender pair of ankles emerge,\n          followed by the rest of Juno Skinner, looking devastatingly\n          beautiful but now quite sinister.\n\n          To Helen it is like a living James Bond film, with the jet, the\n          limo, the terrorists, and now an exotic femme fatale, dressed\n          to kill, approaching them.\n\n                              JUNO\n                         (with a wry smile)\n                    Hello, Harry.\n\n                              HARRY\n                    Juno.  I wish I could say it's a\n                    pleasure to see you again.\n\n                              HELEN\n                    You know her?\n\n          Juno signals with her eyes and the terrorists march the\n          prisoners toward the plane.\n\n                              JUNO\n                    Who's your little friend?\n\n                              HELEN\n                    I'm Helen Tasker.  Harry's my\n                    husband.  And you are?\n\n                              JUNO\n                         (to Harry)\n                    So now it's Tasker?  Not\n                    Renquist?\n\n\n    239   INT. G-3 JET - NIGHT\n\n          They enter the luxurious passenger cabin of the plane.  Helen\n          has never seen anything like this.\n\n                              HELEN\n                    Look, Harry's not part of this.\n                    He's just a sales rep.\n\n                              JUNO\n                    No, my dear, he is a federal\n                    agent.  He killed two of my\n                    colleagues the other night.\n\n                              HELEN\n                    No, you don't understand, we've\n                    been married for 15 years--\n\n                              HARRY\n                    Look, Juno, this is just some\n                    whacko hooker I met in the bar.\n\n          AKBAR and the other terrorists push Helen and Harry into seats\n          and strap them in.\n\n                              HELEN\n                    Harry, what's the matter with\n                    you?  Tell them the truth.  We're\n                    married, we have a daughter--\n\n                              HARRY\n                         (looking at Helen\n                          contemptuously)\n                    I don't know what this crazy\n                    bitch is on.  You should just cut\n                    her loose, so we can get down to\n                    business.\n\n                              HELEN\n                    Oh yeah?  Oh yeah?  Then where\n                    did I get this?\n\n          Helen grabs the locket, dangling on a chain around her neck,\n          and opens it to show Juno.\n\n          THE PICTURE IN THE LOCKET -- Harry and Helen together, smiling.\n\n          Harry roles his eyes.  Great, Helen.  A FLIGHT HOSTESS walks up\n          carrying a tray.  Juno smiles graciously at Helen.\n\n                              JUNO\n                    Something before take-off?\n\n          The hostess whips a PNEUMATIC INJECTOR off the tray and zaps\n          Helen in the shoulder.\n\n                              HELEN\n                    Oooowww!!  That hurt.  You biii--\n\n          She slumps.  Juno looks at Harry.\n\n                              JUNO\n                    She was telling the truth, wasn't\n                    she Harry?  She really doesn't\n                    know.  Interesting.\n\n          Juno nods and the hostess zaps Harry.  He slides into\n          unconsciousness as the plane engines begin to SCREAM.\n\n\n    240   EXT. AIRPORT - NIGHT\n\n          The G-3 lifts into the night sky, turning south.\n\n\n    241   EXT. PIER - NIGHT\n\n          A small FREIGHTER is tied up to a half-crumbling pier.  Next to\n          the pier is a dilapidated corrugated-metal warehouse building,\n          two stories high.  There are floodlights on the dock but beyond\n          is black night, with the ghostly shapes of mangroves and palms.\n          It is an abandoned facility on what appears to be a tiny island\n          in the Caribbean.\n\n          There is a lot of activity.  Three U-RENT TRUCKS are parked by\n          the warehouse, as well as some other vehicles.  About thirty\n          men, clearly CRIMSON JIHAD TERRORISTS are busy at various\n          activities.  Many of them carry AK47 assault rifles.\n\n          MALIK is supervizing them as they finish unloading a tarp-\n          covered object about 15 feet high from the ship.  A rusting\n          gantry crane trundles it into the warehouse.  Malik looks up as\n          an AEROSPATIALE HELICOPTER thunders toward them over the black\n          Caribbean water.\n\n          The helicopter lands and Juno steps down from the front door.\n          The sliding door is opened and Akbar and the others pull a\n          groggy Harry and Helen out of the aircraft.  They are covered\n          by hoods.\n\n          Malik walks up to them and pulls their hoods off.  Harry takes\n          in his surroundings and looks back into the eyes of Malik.\n          Lethal energy flows between them.\n\n                              MALIK\n                    Who is this woman?\n\n                              JUNO\n                    His wife.\n\n                              MALIK\n                         (seeing the\n                          possibilities)\n                    His wife?  Good.  Bring them.\n\n\n    242   INT. WAREHOUSE - NIGHT\n\n          Malik leads the entourage into the warehouse, where brilliant\n          floodlights illuminate--\n\n          THREE HUGE STONE FIGURES, lined up in the middle of the space.\n          The tarp is removes from the object they just unloaded,\n          revealing a FOURTH STATUE.  The figures are cracked and\n          obscured by centuries, but they are unmistakably warriors\n          mounted on horseback.  The legs and arms are missing on some,\n          but the massive heads and necks remain.\n\n                              JUNO\n                    Incredible, aren't they?  Warrior\n                    figures from the Persian Empire\n                    of Darius the First, around 500\n                    BC.  I call them \"The Four\n                    Horsemen\".\n\n          She approaches the nearest figure, caressing its flank.  A man\n          with a jackhammer steps up to her.\n\n                              JUNO\n                    They're absolutely priceless.\n\n          She shrugs and nods to the man with the jackhammer.  He blasts\n          right into the body of one of the Horseman, destroying it.\n          Stone fragments fall away, revealing a cavity cut with great\n          precision inside the figure.\n\n          Inside is a BRIGHT METAL CONTAINER.  Four terrorists pull it\n          out and set it on the ground.  It is six feet long and coffin-\n          like.  Malik steps up to it, his eyes glistening.  A hush has\n          fallen over the group.\n\n                              MALIK\n                    Open it.\n\n          The latches are released and the lid lifted.  Inside is\n          machined metal object, roughly conical, about five feet long.\n          Malik signals to Harry to step closer and look.\n\n                              MALIK\n                    Do you know what this is?\n\n                              HARRY\n                    Can you give me a clue?  It could\n                    be a water heater for all I know.\n\n          Malik grabs Helen, jerking her roughly forward.  He whips out\n          a knife and inserts the point under Helen's jaw, forcing her\n          head back and drawing blood.\n\n                              MALIK\n                    Do you know why you have been\n                    brought here?\n\n                              HELEN\n                    N-no.\n\n                              MALIK\n                    So that this man can verify to\n                    the world that Crimson Jihad is\n                    now a nuclear power.\n\n                              HELEN\n                    How can Harry do that?  He's a\n                    salesman for chrissakes.\n\n                              MALIK\n                    If we were wrong about him...\n                    then the last thing you see will\n                    be your blood spraying in his\n                    face.\n\n          Harry steps forward, his face grim.\n\n                              HARRY\n                    This is a Soviet MIRV-Six, from\n                    an SS-22N launch vehicle.  The\n                    warhead contains 14.5 kilos of\n                    enriched uranium, with a\n                    plutonium trigger.  The nominal\n                    yield is 10 kilotons.\n                         (in Arabic, subtitled)                            *\n                    Release her and I'll cooperate.\n\n          Malik lowers the knife from her jaw.  He turns away from her\n          like she has ceased to exist and yells at the terrorists to\n          remove the other weapons.  Jackhammers tear into the stone\n          figures.\n\n          Helen is just staring at Harry, her mouth open.  He turns to\n          her, not knowing what to say.  He shrugs sheepishly.\n\n                              HARRY\n                    What can I say?  I'm a spy.\n\n          She just looks at him for a long time.  She moves closer,\n          staring and staring, letting it sink in.  Then she hauls off\n          and slugs him right in the jaw so hard is almost knocks him\n          down.\n\n                              HELEN\n                    You bastard!!  You lying son of\n                    a bitch!!\n\n          Terrorists grabs her and restrain her.  She starts to cry.\n\n                              HARRY\n                    I'm sorry, honey.\n\n                              HELEN\n                    Don't call me honey!  You don't\n                    ever get to call me honey again.\n                    You understand?!  You pig!\n\n          Juno looks at them both and laughs.  She offers Helen a tissue.\n\n                              JUNO\n                    Here you go, dear.\n\n          NEARBY, Akbar is going through the contents of Helen's handbag\n          and Harry's wallet.  He rips open the bottom stitching and\n          pulls out the geo-positioning transmitter.\n\n                              AKBAR\n                    Abu!  Look at this!                                    *\n\n          Malik looks at the tracker and then smashes it to the floor.\n          Helen looks at the crushed transmitter.  She stares at Harry\n          with dawning realization.\n\n                              HELEN\n                    You bugged me?!!\n\n          Juno cracks up at this.\n\n\n    243   INT. CITATION JET - NIGHT\n\n          The jet has become a mobile tactical-command center, with Gib,   *\n          Faisil, and several other agents working out of portable         *\n          equipment cases.  Faisil looks up from a computer screen         *\n          suddenly.\n\n                              FAISIL                                       *\n                    We've lost the signal.\n\n          Gib, who has been pacing the aisile whirls to the screen.        *\n\n                              GIB\n                    Son of a bitch!  Where?\n\n                              FAISIL                                       *\n                    It's an island in the Keys, out                        *\n                    past Marathon.                                         *\n\n          Gib goes up to the cockpit.  They are on approach and the\n          lights of Miami fill the front window.\n\n                              PILOT\n                    Miami TCA, we are on final.\n\n                              GIB\n                    Call our DEA contact, tell him I\n                    want those choppers flight-ready\n                    the second we land.\n\n\n    244   INT. WAREHOUSE - NO NAME KEY - NIGHT\n\n          TIGHT ON BLACK AND WHITE VIEWFINDER IMAGE of the terrorists'\n          handycam.  Harry is speaking directly into the camera,\n          finishing up his message.\n\n                              HARRY\n                    ...and I can verify that they\n                    have the arming box and all                            *\n                    equipment necessary to detonate\n                    the four warheads.  This is\n                    absolutely the real thing,\n                    gentlemen.\n\n          The camera swings off Harry to Malik, standing before the rest\n          of the Jihad warriors, who are assembled behind the four bombs.\n\n                              MALIK\n                    You have killed our women and                          *\n                    children, bombed our cities from\n                    afar like cowards, and dare to\n                    call us terrorists--\n\n          Over the image of Malik, a LOW-BATTERY warning begins to flash.\n\n          CUT TO SCENE, as Malik speaks into the camera, which is head by\n          one of his men.  The CAMERAMAN is sweating, wondering if he\n          should interrupt.  He gulps nervously as Malik drones on.\n\n                              MALIK\n                    -- But now the Oppressed have                          *\n                    been given a mighty sword, to                          *\n                    strike back at their enemies.                          *\n                    Unless the US pulls all military\n                    forces out of the Persian Gulf\n                    area, immediately and forever,\n                    Crimson Jihad will rain fire on\n                    one major US city each week until\n                    these demands are met...\n\n          BACK TO VIEWFINDER IMAGE.  BATTERY warning flashing faster.\n\n                              MALIK\n                    ... First one weapon will be\n                    detonated on this uninhabited\n                    island as a demonstration of\n                    Crimson Jihad's power and our\n                    willingness to be humanitarian.\n                    However, if there demands are not--\n\n          In a burst of static the image GOES BLACK.\n\n          The cameraman nervously lowers the camera, ashen faced.\n          Malik's eyes are black with murder.\n\n                              CAMERAMAN\n                    Battery, Abu.\n\n                              MALIK\n                    Get another one, you moron!\n\n\n    245   INT. BUILDING - NIGHT\n\n          A filthy, crumbling cinderblock building (near the warehouse).\n          A few bare light bulbs with bugs zipping around then, and no\n          glass in the windows.  Harry and Helen are brought in by two\n          TERRORIST GUARDS.  Juno follows then into the bleak room.\n          Guards shackle them to steel chairs with handcuffs.\n\n          A MAN enters the room carrying a small suitcase.  He has skull-\n          like features.  He opens the suitcase and Harry has a good view\n          of the contents:  medical instruments, needle-probes, drills,\n          Dremel tools with saw blades.\n\n                              JUNO\n                    This is Samir.  See if you can\n                    guess his specialty.\n\n                              HARRY\n                    Oral hygiene?\n\n                              JUNO\n                    Not exactly.\n\n                              HELEN\n                         (scared)\n                    What's going on, Harry?\n\n                              JUNO\n                    Samir is just going to ask Harry\n                    a few questions.  See, we're not\n                    even sure which agency Harry\n                    works for.  Now, Samir is\n                    absolutely first class, but on\n                    the other hand we have Harry,\n                    here, who has managed to lie\n                    convincingly to the woman he\n                    loves for 15 years.  So it will\n                    be interesting to see how long he\n                    can resist.\n\n                              SAMIR\n                         (holding up a syringe)\n                    This will help.\n\n          Samir injects Harry in the arm with the syringe.\n\n                              HARRY\n                    You know, you should swab that\n                    with alcohol.  I might get an\n                    infection.\n\n                              SAMIR                                        *\n                    I'll return when this has taken                        *\n                    effect.  Then we'll talk.                              *\n\n                              HARRY                                        *\n                    I'm looking forward to it.                             *\n\n          Samir exits.                                                     *\n\n                              HARRY                                        *\n                    Why are you helping these raving\n                    psychotics.\n\n                              JUNO\n                    Because they're very well-funded\n                    raving psychotics, and I'm\n                    getting a lot of money.\n\n          She kneels down in front of Harry, stroking his leg.\n\n                              JUNO\n                    You think I care about their                           *\n                    cause?  Or yours?  Not at all.                         *\n                    See, America is on top now .  .                        *\n                    .  but so was Rome, once.  All                         *\n                    civilizations crumble.  One\n                    nation succeeding over another.\n                    What does it mean in the long\n                    run?  The only important thing is\n                    to live well.  And...  living                          *\n                    well takes money.                                      *\n\n                              HARRY\n                    You're damaged goods, lady.\n\n          Harry's words are beginning to be slightly slurred.  The drugs\n          are taking effect.\n\n                              JUNO\n                         (indicating Helen)\n                    Did you tell her about us, Harry?\n\n                              HARRY\n                    There is no us, you psychotic\n                    bitch.\n\n                              JUNO\n                    Sure.  Say that now.\n\n          Juno puts her arms around him and kisses him passionately.  She\n          breaks, looking at Helen to savor the effect.  Helen is\n          trembling with rage.\n\n                              JUNO\n                    Thanks for everything, Harry.  It\n                    was good while it lasted.\n\n          Juno crosses to the guard and takes a hand-grenade off his\n          belt.  Then she goes to Helen and places it between her knees.\n          She pushes Helen's knees together to hold the spoon against the\n          grenade then pulls the pin.\n\n                              JUNO\n                    Now just keep your knees\n                    together, and you'll be fine.\n\n                              HELEN\n                    Something you obviously have a\n                    hard time doing!\n\n                              JUNO\n                    Hold that thought.\n\n          Juno leaves.  Harry looks dopily at Helen.\n\n                              HARRY\n                    There was nothing.  I swear.\n\n          Helen doesn't believe him, and why should she.  She looks up     *\n          from staring at the grenade, to see that Harry's head has\n          slumped forward.\n\n                              HELEN\n                    What did he give you?\n\n                              HARRY\n                         (groggy)\n                    Sodium amytal, maybe some other\n                    truth agent.\n\n                              HELEN\n                    It makes you tell the truth?\n\n                              HARRY\n                    Yes.\n\n                              HELEN\n                    Is it working yet?\n\n                              HARRY\n                    Ask me a question I would\n                    normally lie to.\n\n                              HELEN\n                    Are we going to die?\n\n                              HARRY\n                    Yup.                                                   *\n\n                              HELEN                                        *\n                    I'd say it's working.\n\n                              HARRY                                        *\n                    They'll either torture us to\n                    death, shoot us in the head, or\n                    leave us until the bomb goes off.\n\n                              HELEN                                        *\n                    Okay, okay.  I get it.  How long                       *\n                    have you been a spy, Harry?\n\n                              HARRY\n                    17 years.\n\n                              HELEN\n                    My God.  Have you had to...  have\n                    sex with other women in the line\n                    of duty?\n\n                              HARRY\n                    I don't take those assignments.\n\n                              HELEN\n                    What about Juno?\n\n                              HARRY\n                    She's really a fox, isn't she?\n\n                              HELEN\n                    Did you pork her Harry?\n\n                              HARRY\n                    No.\n                         (pause)\n                    But I wanted to.\n\n                              HELEN\n                         (crying)\n                    Are you a total lying,\n                    scumsucking pig Harry?\n\n                              HARRY\n                    Looks that way.\n\n\n    246   INT. WAREHOUSE - NIGHT\n\n          ON MALIK as he pokes through Harry and Helen's stuff on the\n          table.  He picks up Helen's wallet and opens it.  ECU WALLET -\n          a picture of Harry, Helen and Dana.  Malik stares at it a\n          moment.  Then motions to one of his men.\n\n\n    267   INT. TORTURE ROOM - NIGHT\n\n          Samir lifts Harry's head and sees that he is pretty shitfaced.\n\n                              SAMIR\n                    Is there anything you would like\n                    to tell me before we start?\n\n                              HARRY\n                    Yes.  I'm going to kill you\n                    pretty soon.\n\n                              SAMIR\n                         (calmly preparing his\n                          instruments)\n                    I see.  How exactly?\n\n                              SAMIR\n                    Well, I thought I'd break your\n                    neck, then use you as a human\n                    shield, then kill the guard with\n                    that knife there on your table\n                    and take his gun.\n\n          Samir approaches Harry with a long steel needle probe.\n\n                              SAMIR\n                         (humoring Harry)\n                    And what makes you think you can\n                    do all that?\n\n                              HARRY\n                    Because I picked the lock on\n                    these handcuffs...\n\n          He holds them up to show Samir.  Then he explodes out of the\n          chair-- Breaks the torturer's neck-- Spins him between himself\n          and the guard-- Who then hesitates to fire-- Giving Harry the\n          split second he needs to grab the knife from the table and\n          throw it into the guard's eye, killing him instantly.\n\n          Helen is flat blown away.  Wow.  It only took a few seconds for\n          Harry to reverse the situation.  Her Harry!  He picks up the\n          guard's 9mm pistol and staggers over to her.\n\n                              HARRY\n                    Don't move.\n\n          He kneels down in front of her.  Gently he slips his hands\n          between her thighs, getting a grip on the grenade, then sliding\n          his fingers slowly over the spoon to hold it securely.\n\n          He stops moving, suddenly.  She realizes with a sudden jolt of\n          terror that he has frozen.\n\n                              HELEN\n                    What is it?\n\n                              HARRY\n                         (staring transfixed)\n                    God, you have great legs.\n\n                              HELEN\n                    Harry... snap out of it!\n\n          She sees how shitfaced he is.  He holds the grenade up, gripped\n          safely so the spoon can't fly off.\n\n                              HARRY\n                    Go it, baby.\n\n\n    248   EXT. BUILDING - NIGHT\n\n          Harry and Helen emerge from the building, creeping through the\n          shadows.  She stops him for a second.  Gets very close to him,\n          whispering, crouched in the shadows.\n\n                              HELEN\n                    Tell me something before this\n                    stuff wears off and you start\n                    lying again.\n\n                              HARRY\n                    What?\n\n                              HELEN\n                    Do you still love me?\n\n                              HARRY\n                    Yes.\n\n                              HELEN\n                    As much as you used to?\n\n                              HARRY\n                    No.\n                         (she deflates)\n                    Much more.\n\n          She looks into his eyes, and knows he is telling the truth.\n\n                              HELEN                                        *\n                         (grinning)                                        *\n                    It wore off.\n\n          At that moment, they hear yelling from the cinder-block\n          building.\n\n                              HARRY\n                    They found the bodies.  Come on--\n\n\n    249   EXT. SWAMP - NIGHT\n\n          Harry takes her hand and they sprint for cover at the edge of\n          the mangrove swamp.  A LIGHT HITS THEM.  TWO TERRORISTS,\n          running around the corner, open fire with AK47s just as Harry\n          and Helen reach a cluster of palm trees.  The trunks explode     *\n          with bullet hits as they run through the darkness.               *\n\n          As the two terrorists move through the trees, Harry lunges from  *\n          the shadows and grabs one from behind.  He wrests his rifle      *\n          away and swings it at the other, knocking his AK down.  The      *\n          first terrorist draws a knife and slashes at him, but Harry\n          grabs his knife arm and swings the blade into his partner.\n          Then he elbow smashes the first guy and seizes him in a two-\n          hand neck-breaker-- SNAP.\n\n          Two more run around the corner of a building.  Harry stomps his  *\n          foot down on one of the AKs, which is lying across a log.  It    *\n          flips into the air and he catches it in firing position .  .     *\n          .  and takes them out with two well-aimed bursts.  Helen comes   *\n          out of the shadows staring at Harry in amazement.  His shirt is\n          ripped, he is scratched and bleeding, holding an assault rifle   *\n          expertly and scanning the brush like a feral animal.             *\n\n                              HELEN\n                    I married Rambo.                                       *\n\n          He grabs her and kisses her passionately.\n\n                              HARRY\n                    Let's go.\n    250\n   thru   OMITTED                                                          *\n    253\n\n    254   INT. WAREHOUSE - NIGHT\n\n          LOOKING DOWN FROM A CATWALK on the activity below the four\n          horsemen statues and several utility trucks almost fill the\n          floorspace.  A rental truck is being loaded with conventional\n          weapons, including machine guns and several HAND-LAUNCHED\n          STINGER MISSILES.  One of the nukes has been lowered into a pit\n          cut in the concrete floor.  Malik and most of the terrorists\n          are gathered around it.\n\n          A GUARD, F.G.  on the catwalk, watches intently from the\n          railing.  So intently that he doesn't head Harry sneak up on\n          him.  SNAP.  Harry catches the guard's MAC-10 machine pistol\n          before it can hit the floor.  He and Helen crouch behind a\n          steel pillar, watching the proceedings below.  Helen keeps\n          glancing at the dead guard, killed so effortlessly a moment\n          before by her husband.  It is all surreal.\n\n          BELOW, MALIK is shouting in his native language.  He pulls a\n          chain from around his neck and holds up a METAL ARMING KEY.\n          Then jumps down into the pit and inserts it into the warhead's\n          arming computer.  Harry is listening intently, translating for\n          Helen.\n\n                              HARRY\n                    In ninety minutes a pillar of                          *\n                    holy fire will rise at this place                      *\n                    as a sign to out enemies.                              *\n                         (Malik theatrically\n                          turns the arming key)\n                    It is done...\n\n          Malik jumps out of the pit.  He signals and terrorists pour\n          concrete into the pit, covering the bomb.  He begins ranting\n          again.\n\n                              HARRY\n                    Now no man can stop us.  We are\n                    set on our course.  No force can\n                    stop us...\n                         (as libbing)\n                    ... we're cool, we're badass,\n                    blah blah.\n\n\n    255   INT. WAREHOUSE - DOWN BELOW - NIGHT\n\n          Malik raises his fist and chants some Crimson Jihad slogans.\n          The terrorists echo and chant and then cheer, firing their guns\n          in the air.  Harry pulls Helen back as ricochets clatter all\n          over the inside of the metal building.\n\n          Malik shouts something and all the terrorists go back to work\n          at double time.  They are loading warheads Two and Three onto\n          trucks (one per truck) and the last, number Four, is being\n          wheeled out on a cart to the Aerospatiale outside.\n\n\n    256   INT. WAREHOUSE - ON CATWALK - NIGHT\n\n                              HELEN\n                    If we're on an island, why are\n                    they using trucks?\n\n                              HARRY\n                    We must be in the Florida Keys .                       *\n                    .  .  the Overseas Highway                             *\n                    connects the islands to the\n                    mainland.\n\n                              HELEN                                        *\n                    So there's no border, no customs.                      *\n                    They can just drive anywhere they                      *\n                    want .  .  .  there's nothing to                       *\n                    stop them .  .  .\n\n                              HARRY\n                    Just us.\n\n                              HELEN\n                    What are you going to do?\n\n                              HARRY\n                         (shrugs, like: what do\n                          you think?)\n                    Go down there and kill everybody,\n                    I guess.\n\n          He hands her the MAC-10.  She holds it clumsily.\n\n                              HELEN\n                    Oh shit.\n\n                              HARRY\n                    Wait here.  If you have to use\n                    this, use it.  Don't choke.\n                    Okay?\n\n          She nods gamely and Harry starts down the steel stairs to the\n          floor below.\n\n\n    257   INT. WAREHOUSE - MAIN FLOOR - NIGHT\n\n          ON HARRY, reaching the floor.  He slips behind some packing\n          crates.  Then swings into action-- He hurls the grenade as hard\n          as he can, down to the other end of the building.  KABOOM!!  He\n          uses the distraction to move forward.  But it goes wrong almost\n          right away...  A TERRORIST comes around a corner behind him,\n          shouts-- Harry dives for cover as the guy fires, but-- He trips\n          on a pipe and goes sprawling-- Losing the AK47, which slides\n          under some equipment and-- Seven terrorists run toward him,\n          with guns raised.\n\n                              HARRY\n                         (to Helen)\n                    SHOOT!!\n\n\n    258   INT. WAREHOUSE - CATWALK - NIGHT\n\n          HELEN fires a burst at the terrorists, actually hitting one!\n          But-- The recoil knocks her back, into a metal column, and the\n          gun\n\n          FLIES OUT OF HER HANDS.\n          It falls to the metal steps and hits-- Going off.  B-B-BLAM!\n          The burst kills two more terrorists, and-- The Mac-10\n          cartwheels and hits further down.  ANOTHER BURST.  Another\n          terrorist is splattered.\n\n          It spins and hits another step-- ANOTHER RANDOM BURST\n          MIRACULOUSLY KILLS THE LAST TWO TERRORISTS!!\n\n          She has inadvertently saved her husband.  Harry looks up from\n          behind cover-- to see all seven dead.  Now it's his turn to be\n          amazed.  He signals to her to run... get off the exposed\n          catwalk.  She makes it through the door to the outside stairs\n          as bullets start hitting the steel walls behind her.\n\n\n    259   INT. WAREHOUSE - MAIN FLOOR - NIGHT\n\n          A TERRORIST with a knife runs at the unarmed Harry.  Harry\n          snatches up a jack-hammer and BRAT-TAT-TAT-- Drives it into the\n          guy's chest.  Then he-- Grabs an AK from one of the fallen\n          terrorists and opens fire.  Malik shouts to the drivers of the\n          trucks to get going.  The other terrorists return fire at Harry--\n          Who sprints from cover to cover, reaching a side door-- Where\n          he rakes one of the passing trucks with a burst-- But\n          terrorists behind him in the building have a clear shot and\n          rounds hit the wall next to him as he-- Dives through the door--\n\n\n    260   EXT. WAREHOUSE - NIGHT\n\n          --landing outside.  He takes cover behind an aircraft REFUELING\n          TRUCK.  Not a good place.  He is pinned down by automatic\n          weapons fire.  He looks around for Helen, who is--\n\n\n    261   EXT. WAREHOUSE - BEHIND A FORKLIFT - NIGHT\n\n          50 yards away.  She is unarmed and unable to help.\n\n\n    262   EXT. WAREHOUSE - BEHIND A REFUELING TRUCK - NIGHT\n\n          HARRY cranks up the pump on the refueling truck and grabs the\n          nozzle of the hose.  He opens the flow and-- A stream of JET-\n          FUEL blasts out of the nozzle and-- Harry fires his AK right\n          across the nozzle-- The muzzle-blast ignites the av-gas and he\n          has a flame thrower with a 70 foot reach.\n\n          Harry, lit demonically by the inferno, paints the whole area,\n          setting vehicles afire, and scattering the terrorists.\n\n\n    263   EXT. WAREHOUSE - NIGHT\n\n          Through the flames and smoke he sees one of the men hand Malik\n          a LAW rocket.  Malik snaps it to his shoulder, preparing to\n          fire.\n\n\n    264   EXT. DOCK - NIGHT\n\n          Harry runs toward the edge of the dock thirty feet away as--\n          MALIK fires.  The rocket shoots toward the truck and-- Harry\n          leaps toward the dark water as-- KABOOOM!  Behind him the gas\n          truck EXPLODES IN A HUGE FIREBALL.\n\n\n    265   EXT. UNDERWATER - OFF THE DOCK - NIGHT\n\n          ANGLE LOOKING UP, UNDERWATER, AS HARRY HITS THE WATER AND\n          dives down.  An instant later a sheet of fire sweeps across the\n          surface above him.  Harry kicks hard, trying to swim beyond the\n          inferno above him so he can surface.\n\n\n    266   EXT. WAREHOUSE - NIGHT\n\n          CLOSE ON HELEN, watching the burning wreckage of the gas truck.\n\n                              HELEN\n                    Oh my God.  Harry.\n\n          A PISTOL ENTERS FRAME.  Its muzzle taps the back of her head.\n          She gasps and turns to see-- JUNO, holding the weapon expertly.\n\n                              JUNO\n                    My condolences to the window.                          *\n\n          Juno grabs her and yanks her to her feet.  Helen SLAPS JUNO      *\n          HARD.  Juno has a slash across her cheek.  Blood trickles down.  *\n          She grabs Helen's hand and viciously turns it, seeing the        *\n          wedding ring turned inward, the diamond on the palm-side.  Her   *\n          face darkens with fury and she points the gun at Helen's face,   *\n          preparing to kill her .  .  .                                    *\n\n          And Malik's hand grabs her wrist, stopping her.                  *\n\n                              MALIK                                        *\n                    Not now.  We may need a hostage.                       *\n\n          Juno grabs her and twists her around, pushing her toward the     *\n          limo nearby.                                                     *\n\n                              JUNO\n                    Let's go, Suzy Homemaker.\n\n\n    267   EXT. UNDERWATER - NIGHT\n\n          Harry is still swimming.  He reaches the edge of the fire and\n          surfaces, gasping for breath.  Treading water he scans the\n          dock.\n\n\n    268   EXT. WATER OF THE DOCK - HARRY'S POV - NIGHT\n\n          Amid the fire and smoke, he sees Juno walking Helen at gun\n          point toward a LIMO.\n\n\n    269   EXT. WAREHOUSE - NIGHT\n\n          TRACKING WITH JUNO, approaching the car.  Malik passes, jumping  *\n          into the Aerospatiale with his few remaining men.  The fourth    *\n          bomb is clearly visible as the sliding door is closed.  The      *\n          copter pulls pitch, fanning the flames of the inferno below as   *\n          it arcs away.\n\n          AKBAR, the 300 pound terrorist/chauffeur opens the door and      *\n          Juno gets into the limo with Helen.  Akbar scrunches into the\n          front seat and starts the car.\n\n\n    270   EXT. RAMP TO HIGHWAY - PREDAWN\n\n          There is just enough light to see some geography.  The island\n          is very tiny.  Running right over it and to the horizon in both\n          directions is the OVERSEAS HIGHWAY.  The terrorists' trucks\n          rumble up an on-ramp past a sign that says MIAMI - 110.  The\n          limo is the last member of the convoy.  The Aerospatiale passes\n          overhead, hugging the deck, headed for Miami at 150 knots.\n\n\n    271   EXT. DOCK/ WAREHOUSE - DAWN\n\n          It looks like the aftermath of a battle... burning wreckage,\n          black smoke, bodies.  Not a living soul around.  The smoke\n          swirls as two big BELL 206 HELICOPTERS settle on the middle of\n          the dock.  GIB jumps out of the nearest with an AR-15, scanning\n          the wreckage.  Several of his men, and a couple of DEA agents,\n          spread out.  Gib breaks into a grin as he sees--\n\n          HARRY, materializing out of the swirling smoke.  Dripping wet,\n          clothes ripped and bloody.  But okay.\n\n                              GIB\n                    I thought this look like your\n                    work.\n\n                              HARRY\n                    Let's go.  I'll brief you in the\n                    air.\n\n                              GIB\n                    You're welcome.\n\n\n    272   INT. BELL 206 - DAY\n\n          Gib and Harry are working out of brief-case mobile com-units.\n          Several Omega agents with headsets are reading maps, giving\n          commands, coordinating the evacuation, mobilizing their own\n          forces.  The energy is controlled but very high, everybody\n          talking at once.  This is the day they all have trained for.\n          It is impressive to watch.\n\n                              GIB\n                    --you tell the son of bitch this\n                    is  Bright Boy Alert.  Repeat,\n                    a Bright Boy Alert.  And I need\n                    a patch of the White House ASAP.\n                    That's right--\n\n                              HARRY\n                         (overlapping)\n                    ... the Coast Guard has to clear\n                    them back to a twenty mile\n                    radius.  Anybody that can't make\n                    the minimum safe distance we need\n                    an airlift on, immediately--\n\n          Gib whips around to Harry, lowering his headset mike.\n\n                              GIB\n                    I can get 3 Marine Corps Harriers\n                    here in about 12 minutes.\n                    They're on maneuvers out of Boca\n                    Chica.\n\n                              HARRY\n                         (checking his watch)\n                    Get 'em.  I'll brief them on the\n                    way in.\n\n\n    273   EXT. OVERSEAS HIGHWAY - DAY\n\n          TRAFFIC on the two causeways is almost non-existent this early\n          in the morning.  The three rental trucks, followed by the limo\n          about a mile back, are almost the only vehicles.\n\n\n    274   INT. LIMO - DAY\n\n          Juno has a 9mm pistol aimed at Helen.  She opens the sunroof,\n          letting in the morning air and light.  Then pours herself a\n          Scotch from the bar.\n\n                              JUNO\n                    Like one?\n\n                              HELEN\n                         (eyes like steel)\n                    Fuck you.\n\n\n    275   INT. BELL 206 COPTER - DAY\n\n          HARRY AND GIB are both talking a mile a minute, coordinating\n          the evacuation of the highway and the surrounding area.\n\n                              GIB\n                    ... well get the Highway Patrol\n                    to go through the streets and\n                    tell everybody on their damn\n                    loudspeakers.  Just the basics...\n                    get away from windows, don't look\n                    at it... yeah--\n\n                              HARRY\n                    Here they come.\n\n          Gib looks out the window in time to see--\n\n          THREE hunch-winged P.S.T.O.L.  HARRIER jets pass them at 600\n          knots.\n\n                              HARRY\n                         (to the pilots)\n                    Roger, Mike Three Five, you are\n                    cleared to engage.  Be advised,\n                    your targets have Stingers and\n                    light machine guns.\n\n\n    276   INT. COCKPIT OF LEAD HARRIER - DAY\n\n          The pilot, like all jet pilots, seems icy calm.\n\n                              PILOT\n                    Copy that, Bright Boy command.\n                         (to his wingman)\n                    Tally ho.\n\n\n    277   EXT. OVERSEAS HIGHWAY - DAY\n\n          The terrorists see the Harriers approaching on a low attack\n          run, and scramble to get out their Stingers.\n\n          The Harriers open fire with cannons and rocket pods on the\n          trucks below.  The 20mm cannons rip the ocean on either side of\n          the causeway into plumes of spray.\n\n\n    278   EXT. HIGHWAY - ON TRUCK - DAY\n\n          One of the Bomb trucks is hit.  It explodes and flies off the    *\n          bridge into the water.  The terrorists on one of the other\n          trucks fire a Stinger missile.\n\n\n    279   EXT. ABOVE HIGHWAY - ON HARRIER - DAY\n\n          It arrows up, blowing one wing off the lead Harrier.  The pilot\n          ejects as the plane cartwheels into the sea and explodes.\n\n\n    280   INT. BELL 206 COPTER - DAY\n\n          Harry sees the battle far ahead... the exploding jet.\n\n                              HARRY\n                         (to the pilots)\n                    Recommend you use your Mavericks                       *\n                    to take out the bridge.                                *\n\n                              PILOT (OVER)\n                    They won't set off those nukes\n                    will they?\n\n                              HARRY\n                    Negative, Mike Three Five.\n                    That's a negative.\n                         (low, to Gib)\n                    Probably not.\n\n\n    281   EXT. HIGHWAY/ OCEAN - DAY\n\n          The two remaining Harriers make an attack run, launching four    *\n          Maverick missiles at the bridge.                                 *\n\n\n    282   EXT. HIGHWAY - DAY\n\n          The missiles hit the support trestles ahead of the trucks and    *\n          .  .  .  K-BOOOOM!!  A whole section of the concrete span        *\n          collapses into the water.\n\n\n    283   EXT. HIGHWAY - TRUCKS - DAY\n\n          The first truck is consumed in the blast.  The last truck        *\n          slides to the edge of the gap and stops.                         *\n\n\n    284   INT. / EXT. LIMO - DAY\n\n          Juno is trying to see what's going on ahead.  All they can see\n          is smoke and explosions.  Akbar is speaking heatedly (in\n          Arabic) into a walky talky and getting no answer.\n\n          Helen uses this moment of distraction to lunge forward,\n          grabbing the gun.  Juno fires wildly as they struggle for\n          control of the weapon.  The sound is deafening in the tiny\n          space.  The second shot catches Akbar behind the ear, and he\n          slumps forward.  His foot mashes down on the accelerator pedal\n          and the car surges faster.\n\n\n    285   EXT. HIGHWAY/ BATTLE SITE - DAY\n\n          The third Harrier fires its 2.75 Rockets and blows the           *\n          remaining truck into tinfoil.  Battle over.  Two bombs down.\n\n\n    286   INT. BELL 206 COPTER - DAY\n\n          The columns of smoke from the battle are still a couple miles\n          ahead of the copter.\n\n                              HARRY\n                    Good shooting, Mike Three Five.\n                    I need you to stay on station.\n                         (to the copter pilot)                             *\n                    Okay.  You see that limo?\n\n\n    287   INT./ EXT. LIMO - HIGHWAY - DAY                                  *\n\n          THE LIMO tracks lazily back and forth across the lanes from one\n          guardrail to the other, throwing sheets of sparks where it\n          hits.  In is funneling along the causeway, unslowed, like an out-\n          of-control-train.\n\n\n    288   INT. LIMO - DAY\n\n          INSIDE, Helen knocks Juno's hands against the edge of the open\n          sunroof and the pistol goes flying out.\n\n                              HELEN\n                    You... bitch!!\n\n          Helen is raging, grabbing Juno's head and pounding it against\n          anything hard she can find inside the car.  Suddenly she stops,\n          looking out the front window.  Juno turns too, off her look, to\n          see-- ANGLE THROUGH THE WINDSHIELD.  The causeway is blown away\n          about a quarter mile ahead.\n\n                              JUNO\n                    Shit!\n\n          Juno climbs through the window into the front seat, tugging on\n          the dead driver.  The heavyset Akbar is like a bag of cement.\n          Helen look up through the sunroof and sees--\n\n\n    289   EXT. ABOVE LIMO - DAY\n\n          THE BELL 206 COPTER, descending rapidly.  Harry is climbing out\n          onto the skids.  He hooks on arm and leg over the skid and\n          hangs down as low as he can.  HELEN stands up in the opening\n          and waves her arms.\n\n\n    290   INT. / EXT. BELL COPTER/ LIMO - DAY\n\n          Gib is yelling at the DEA pilot, who's not thrilled with this\n          idea.\n\n                              GIB\n                    Get lower, goddamnit!  Right now!\n\n          Harry strains downward with one hand.  Helen reaches up toward\n          him.  The car screeches along the guard-rail, slamming against\n          it, throwing her from side to side in the sunroof.  Their\n          fingers touch, then separate.  She looks-- the limo is almost\n          on the precipice.\n\n\n    291   INT. LIMO - DAY\n\n          INSIDE THE CAR, Juno is desperately pulling on the inert\n          driver.  He slumps over on her, pinning her.  She looks over\n          the dash as the shattered edge of the causeway rushes toward\n          them--\n\n\n    292   EXT. LIMO - DAY\n\n          HARRY'S HAND grabs Helen's.  He pulls her out of the car just\n          as the limo clears the edge.  She is jerked through the\n          sunroof, screaming.  The car falls away, arcing gracefully to\n          the ocean below.  It hits with an enormous explosion of water.\n\n\n    293   INT. / EXT. BELL 206 COPTER - DAY\n\n          HARRY PULLS HELEN up onto the skid with him, getting her\n          stable.  She is gasping, holding on for dear life.  She looks\n          down at the ocean, the burning wreckage on the bridge, the\n          whole unbelievable panorama.\n\n          Then she looks at Harry and-- Grins.  She's alive!  And so is\n          he.  And not only that, this is the biggest rush of her life.\n          Harry grins back.  Surprised and pleased that she is more of a\n          soul-mate than he ever knew.\n\n                                                      CUT TO:\n\n\n    294   EXT. HIGHWAY - DAY\n\n          ANGLE ON A HARRIER, landing in full-hover on the causeway.  The\n          shriek of the jet engine is enormous.  It bounces down onto its\n          wheels like a big inscect.  The other remaining Harrier is\n          already down, behind it.\n\n\n    295   EXT. BELL 206 - DAY\n\n          TRACKING past burning wreckage to Harry's Bell 206 just\n          settling on the highway.  B.G.  the other DEA Bell 206 is\n          landing with the Harrier pilot who ejected hanging in a sling.\n          Harry jumps out of the open door, followed by Helen and Gib.     *\n          Harry looks at his watch.                                        *\n\n                              HARRY\n                    Any minute now.\n\n                              GIB\n                         (with a megaphone/ to\n                          everybody)\n                    It's show time.  Don't look at                         *\n                    the flash.  Do not look at the\n                    flash.\n\n                              HARRY                                        *\n                         (to Helen)                                        *\n                    We're safe here.                                       *\n\n\n    296   EXT. CAUSEWAY - DAY\n\n          Helen and Harry move away from the agents.  They are safe and\n          together.  They look at each other, and there is nothing to\n          say.  Harry removes her wedding band from the wrong hand and     *\n          slips it back onto its rightful finger.                          *\n\n          He leans forward to kiss her.  She reaches for him.  Their lips  *\n          meet.\n\n\n    297   EXT. CAUSEWAY - HARRIERS IN BACKGROUND - DAY\n\n          And they are locked together in that position when the sky\n          lights up behind them.  Talk about fireworks.  Harry covers her  *\n          eyes and they stay in the kiss.                                  *\n\n          They are in no danger, but the effect is stunning.  The classic  *\n          mushroom cloud appears at the horizon.  Helen watches, awed,\n          the most glorious and terrifying sight of our age.\n\n                              HELEN                                        *\n                    That was some kiss.                                    *\n\n          The two young Harrier pilots stand nearby, watching the\n          mushroom disperse.  Gib is with the other Omega agents, his\n          finger pressed in his ear, listening to his headset.  He waves\n          to Harry to come to him.\n\n          Harry detaches from Helen and walks over to him.  Helen watches\n          him go... back to work.  She glances over at the two Harrier\n          pilots.\n\n                              HELEN\n                         (to the pilots)\n                    That's my husband.\n\n          HARRY goes into the huddle with Gib and the others.\n\n                              GIB\n                    Malik's copter landed twenty\n                    minutes ago in Miami.  He's on\n                    the top of a high-rise downtown.\n                    SWAT's on the scene, and I got\n                    the cops sealing off the area.                         *\n                    He renezvous'd there with about                        *\n                    a dozen more faction members.                          *\n                    They're barricaded on the                              *\n                    twentieth floor.\n                         (he gets very serious)                            *\n                    Harry, they have a hostage.  It's                      *\n                    Dana.                                                  *\n\n                              HARRY                                        *\n                    My Dana!?\n\n                              GIB\n                    They must have grabbed her during\n                    the night... we didn't know.\n                    Sorry, Harry, I--\n\n\n    298   EXT. HARRIER - DAY\n\n          But Harry is already moving.  He sprints toward the nearest\n          Harrier, witch is idling nearby.  Gib runs after him.\n\n                              GIB\n                    Harry!  We'll get her out!  We                         *\n                    have a man inside already .  .                         *\n                    .  Harry!!  Aw, shit... here we\n                    go.\n\n          Harry walks up to the young pilot...\n\n                              HARRY\n                    I need to borrow this thing for\n                    a few minutes.\n\n          He pushes past the pilot before the guy can react.\n\n                              PILOT\n                    Excuse me .  .  .  sir?!                               *\n\n                              GIB                                          *\n                    Force Comm cleared you to give us                      *\n                    total cooperation, right?                              *\n\n                              PILOT                                        *\n                    Yessir, but .  .  .                                    *\n\n                              GIB                                          *\n                    That's coming right from the                           *\n                    President, Captain.                                    *\n\n                              PILOT                                        *\n                    Yessir.  Uh .  .  .  sir?  You're                      *\n                    going to have to sign for the                          *\n                    aircraft.                                              *\n\n                              GIB                                          *\n                    I'll sign for it.  You got a pen?                      *\n                         (one of the agents                                *\n                          pulls out a pen)                                 *\n                    Here, he'll sign for it.                               *\n\n          Harry is in the cockpit by now.  Gib climbs up.                  *\n\n                              GIB\n                    I'd like to remind you that it\n                    has been ten years since you were\n                    actually in one of these.\n\n                              HARRY\n                    If I break it they can take it\n                    out of my pay.\n\n\n    299   INT. HARRIER - DAY\n\n          Harry doesn't have a G-suit or a helmet of anything.  He just\n          has his walky on his belt.\n\n          INSIDE THE CRAMPED COCKPIT, Harry looks around for the lever\n          which vectors the thrust.  Finds it, and sets it to 90 degrees\n          (vertical).  He bangs the canopy closed and brings the throttle\n          up to FULL.\n\n                              GIB\n                         (to pilot)\n                    It'll be fine.  He's got hundreds\n                    of hours in Harriers.  Joint-ops,\n                    cross-training and all that.\n\n                              AGENT\n                    Harry can fly anything.\n\n          The big plane wobbles off the ground like a drunken bumble-bee.\n\n                              GIB\n                    He's a little rusty.  It's like\n                    riding a bicycle .  .  .  you\n                    never forget.  Uh .  .  .  I'd\n                    seek shelter!\n\n          It drifts sideways and everybody runs to get out of the way.\n          At about six feet above the ground it slides sideways, clips\n          the top of a cop car and knocks off the light bar.  It lifts\n          unsteadily straight into the sky.  It turns around 180.\n\n                              GIB\n                    He's got it.\n\n                              HARRY\n                    Sorry.\n\n          Harry pushes the vector lever forward and the thrust-nozzles\n          turn, accelerating the plane forward.\n\n\n    300   EXT. CAUSEWAY - DAY\n\n          Gib is standing, watching Harry go.  He never believes this\n          guy.  Harry's voice comes over the walky...\n\n                              HARRY\n                    Tell Helen what's going on.  Tell\n                    her I love her.  And ask the\n                    pilot where the button for the\n                    20mm cannon is-- never mind.  I\n                    found it.\n\n          The plane disappears toward Miami.\n\n\n    301   EXT. HIGH RISE - MIAMI - DAY\n\n          AN AERIAL SHOT, circling the building.  It is an unfinished\n          building in the high rise district.  The Aerospatiale sits on\n          the roof, its rotor turning slowly.  The street below is jammed\n          with cars.  Honking horns echo up the glass canyons.\n\n\n    302   EXT. STREET - DAY\n\n          ANGLE AT STREETLEVEL as cops use bullhorns and bad attitudes to\n          clear the street around the building, setting up a perimeter\n          two blocks away.\n\n\n    303   INT. HIGH RISE - DAY\n\n          INSIDE THE HIGH RISE the terrorists have barricaded themselves\n          on the twentieth floor.  There are 12 TERRORISTS, all with\n          automatic weapons.  Occasionally one of them will fire a burst\n          down a stairwell with an AK-47.  Miami-Dade SWAT team members\n          are deployed in the stairwell but are keeping their distance.\n\n\n    304   INT. HIGH RISE - ON THE 21ST FLOOR - DAY\n\n          Malik is sequestered with the bomb.  It sits on the floor,\n          still in its shipping case.  Dana stands nearby, looking\n          scares.  She is not ties up.  Where can she go?\n\n          She watches Malik go to the warhead and insert his arming key.\n          He has a TV set up on some crates, and we see that his video-\n          tapes demands are running on CNN.  Harry's face fills the\n          screen, verifying the the nuclear weapons as a real threat.  He\n          is identified at the bottom of the screen as HARRY TASKER,\n          ATOMIC ENERGY COMMISSION.  Dana stares at her father's face on\n          the national news.  It's like a bad dream.  She has been crying\n          but she is fairly composed now.\n\n                              DANA\n                    I have to go to the bathroom.\n\n          The terrorists ignore her.  A terrified ACTION NEWS REPORTER\n          and his CAMERAMAN, under guard by TWO TERRORISTS, are hastily\n          setting up to shoot Malik.\n                              CAMERAMAN\n                    Tape is rolling.\n\n                              MALIK\n                    This is a communique from Crimson\n                    Jihad.  You have heard from your\n                    own expert.  You have seen the\n                    Holy fire with your own eyes.  Do\n                    not force us to destroy this\n                    city.  And do not try to use\n                    force against us.  I can trigger\n                    this bomb instantly.  All I have\n                    to do is turn that key...\n                         (he points fiercely at\n                          the bomb)\n                    ... and five million of your\n                    people will die.\n\n          The reporter glances down, nervously.\n\n                              REPORTER\n                    What key?\n\n                              MALIK\n                         (pointing like the\n                          guy's blind)\n                    That key right there!\n\n          Malik looks down.  The key is gone.\n\n                              MALIK\n                         (to his men)\n                    Someone has stolen the key!\n\n          He turns, looking around wildly.  Malik then sees Dana running\n          for the stairwell to the roof.  He pulls a pistol and shoots at\n          her, but hits the wall as she bangs through the door.  He runs\n          after her.\n\n\n    305   EXT. BUILDING / ROOF - DAY\n\n          ON THE ROOF, Malik bursts through the stairwell door.  His TWO\n          MEN have followed him.  Malik stops suddenly when he sees--\n          Dana standing at the edge of the roof.  She is holding the\n          ARMING KEY by its chain.  Dangling it over the edge.  He\n          signals to his men not to fire.\n\n                              DANA\n                         (terrified, but\n                          thinking)\n                    You shoot me, this'll fall.\n\n          Malik advances slowly, his eyes glistening ferally.  She backs\n          up a step with each of his, moving along the edge of the roof.\n          Malik keeps his pistol aimed at her chest.\n\n                              DANA\n                    Don't come any closer.  I'll drop\n                    it!  I swear to God.\n\n                              MALIK\n                    If you drop it, I will have no\n                    reason not to kill you.\n\n          He advances, calling her bluff.  She backs away from him along\n          the edge.\n\n                              MALIK\n                    Come on, child.  Give me the key.\n                         (smiling)\n                    Don't you want to live?  I give\n                    you my word.\n\n                              DANA\n                    No way you whacko.\n\n          She reaches the corner of the building.  Her back touches\n          something.  it is the boom of a small crane, used for lifting\n          building supplies.  Careful to keep the key dangling over open\n          space, Dana climbs up on the lattice-work boom and moves out\n          beyond the edge of the building, never taking her eyes off\n          Malik.  She is hyperventilating, terrified, but thinking\n          clearly.\n\n          Malik steps up on the crane, crawling out after her.  He knows\n          she will not drop the key as long as he has the gun.  It is a\n          game which will end when she reaches the end of the boom.  Dana\n          puts the key between her teeth so she can hang on better.  It\n          is windy and the boom is swinging.\n\n\n    306   INT. 20TH FLOOR - DAY\n\n          The Crimson Jihad warriors hear a thunderous, shrieking roar\n          and look toward the window.\n\n\n    307   EXT. HIGH RISE - DAY\n\n          RISING INTO VIEW, LIKE A GARGOYLE FROM HELL, IS THE HARRIER.\n          It fills the windows completely, hovering only a few feet\n          outside.  The terrorists raise their AK-47s to fire just as\n          Harry hits the 20mm nose-cannon.\n\n\n    308   INT. / EXT. HIGH RISE - 20TH FLOOR - DAY\n\n          Glass explodes into glittering mist, and terrorists explodes\n          into bloody spray as Harry pivots the plane and the cannon\n          sweeps the floor clear from side to side.  The Crimson Jihad is\n          vaporized.\n\n\n    309   EXT. ROOF - CRANE BOOM - DAY\n\n          Malik hears the thunder of the jet and the firing, but from\n          where he is he can't see what's going on.  He focuses on the\n          key.  He must have that key.\n\n\n    310   EXT. ROOF - NEAR HELICOPTER - DAY\n\n          Malik's TWO REMAINING MEN run to the helicopter, gesticulating\n          to the pilot to get ready to take off.  The pilot revs the\n          turbine and the rotor whirls faster.  The two men jump in,\n          picking up M-60 machine guns.\n\n\n    311   EXT. ROOF - CRANE BOOM - DAY\n\n          MALIK IS STILL ADVANCING out the crane boom.  Dana slips as she\n          backs up, toppling off the boom.  She is hanging now by her\n          hands over a 20 story drop.\n\n          Malik is almost to her.  He needs a hand free to grab her.  He\n          sets his gun down on the girder.  He grabs for her wrist.\n\n\n    312   EXT. ROOF - OVERLOOKING EDGE - DAY\n\n          ANGLE LOOKING DOWN.  Malik, Dana, the street far below.  With\n          an unbelievable roar the Harrier sweeps in beneath Dana,\n          FILLING FRAME.\n\n\n    313   EXT. CRANE BOOM / OVER EDGE - DAY\n\n          Harry has the canopy up.  Malik sees Harry, ten feet below.\n          His eyes narrow with an all-consuming rage.  He glances at the\n          pistol on the beam.  Back at the girl, the key in her teeth--\n          So close.\n\n          Harry maneuvers the cockpit directly under Dana.\n\n                              HARRY\n                         (shouting)\n                    Let go baby!  I've got you!\n                    Daddy's got you!\n\n\n    314   EXT. ROOF / HARRIER - DAY\n\n          Malik lunges for her wrist.  She screams and lets go-- Dana\n          drops and hits the windshield of the hovering jet-- Harry grabs\n          her with his left hand, right hand still on the stick-- He\n          holds her until she can get a grip.  She is lying across the\n          nose of the plane.  Harry starts to bank away and--\n\n\n    315   EXT. CRANE BOOM - DAY\n\n          Malik shrieks in rage.  He grabs his 9mm pistol and leaps off\n          the crane--\n\n\n    316   EXT. HARRIER - DAY\n\n          Onto the back of the plane.  He starts crawling toward the\n          cockpit.  Dana screams and Harry looks back, but just then--\n\n\n    317   EXT. BUILDING - DAY\n\n          The Aerospatiale swings around the building right in front of\n          them-- The door-gunner OPENS FIRE.\n\n\n    318   EXT. HARRIER - DAY\n\n          Harry banks hard, taking the hits under the wing.  He pivots\n          and slides sideways around the building, playing tag with the\n          copter.\n\n          He can't do anything radical enough to dislodge Malik without\n          tossing off his own daughter.\n\n\n    319   EXT. BUILDING - DAY\n\n          The helicopter appears around the corner, guns blazing in the\n          doors.  Harry pivots the plane and FIRES THE NOSE CANNON.  The\n          helicopter is riddled.  It tilts and plummets, auto-rotating\n          out of control.\n\n\n    320   EXT. BUILDING - ANGLE AT STREETLEVEL - DAY\n\n          As the copter hits the ground and explodes.  Fortunately the\n          police had created a cleared perimeter.\n\n\n    321   EXT. HARRIER - DAY\n\n          THE HARRIER dips and slews, half out of control.  Malik is\n          taking aim with the pistol, right at Harry's head.  Harry grabs\n          his daughter with his left hand, holding her with all his\n          strength and he-- Jinks the stick hard, just as-- Malik opens\n          fire, but-- The plane tilts wildly and Malik topples, screaming--\n          He slides along the wing, and falls over the leading edge--\n          Only to catch himself on the only available hand-hold-- The\n          last Sidewinder missile.\n\n\n    322   EXT. HARRIER / SIDEWINDER - DAY\n\n          Harry and Malik lock eyes for one long second.  Then Harry hits\n          the FIRING STUD.  The Sidewinder drops away and ignites.\n          Carrying Malik out over Miami Beach.  It explodes a mile out to\n          sea.\n\n\n    323   INT. HARRIER - COCKPIT - DAY\n\n          HARRY PULLS DANA into the cockpit, settling her on his lap.\n\n                              HARRY\n                    Don't touch the stick, baby.\n\n          She stares at her father in amazement.  He banks away from the\n          building, accelerating the jet.  He grins at her.  Raises one\n          eyebrow.  Woggles the plane's wings.\n\n                              HARRY\n                    Hi, pumpkin.\n\n\n          ONE YEAR LATER\n\n\n    324   INT. TASKER HOUSE - NIGHT\n\n          Dinner at home, and everybody's there.  We come in on the end\n          of some story that everybody thinks is hysterical.\n\n                              HELEN\n                    ... you should have seen your\n                    father, standing there all\n                    covered with spaghetti sauce.  He\n                    looked like such a dope.\n\n                              HARRY\n                    I told the guy---\n                         (snorts, it's too\n                          funny)\n                    I told the guy, this isn't even\n                    my order.\n\n          Dana is laughing too, a part of it.  They are happy.  They are\n          a family.  Dana gets up, her meal half-eaten as usual.\n\n                              DANA\n                    I'm done.\n\n          She heads for the front door.\n\n                              HARRY\n                    I seem to remember something\n                    about a history project that's\n                    due tomorrow.\n\n                              DANA\n                         ( busted)\n                    Dad.  You just think you know\n                    everything, don't you?\n\n          Dana trudges off to her room to do her homework.  The phone\n          rings.  Helen answers.\n\n                              VOICE\n                    Boris and Doris?\n\n                              HELEN\n                         (calmly, signalling\n                          Harry with her eyes)\n                    Go ahead.\n\n\n    325   INT. EMBASSY PARTY - NIGHT\n\n          It is a black tie affair.  Very glitzy.  CAMERA SWOOPS over the\n          guests, sipping champagne and dancing.  It is an embassy crowd,\n          very international.  HARRY AND HELEN work their way through the\n          crowd.  He is in tux, hair slicked back, looking rakish.  She\n          is elegant in a low-cut gown and diamond choker.\n\n          Harry scoops two glasses of champagne off a passing tray and\n          hands her one.\n\n\n    326   INT. VAN - NIGHT\n\n          VERY CLOSE ON GIB, hunches in a dark van someplace nearby.  He\n          speaks into his headset mike.\n\n                              GIB\n                    So, what's the scoop, team?  You\n                    see your contact yet?\n\n\n    327   INT. PARTY - NIGHT\n\n          HELEN AND HARRY smile and nod as if they know people.  Speaking\n          very low, Helen answer Gib via SUB-VOCAL transceiver.\n\n                              HELEN\n                    Not yet.  But we'll find him.\n\n                              HARRY\n                    Dance?\n\n          He whirls her across the floor and the CAMERA PULLS BACK AND UP\n          as they dance.\n\n                                                      FADE OUT\n\n                            The END\n\n\t\n\t\t\t\n\n\n\n\nTrue Lies\nWriters :   Claude Zidi  Simon Michaël  Didier Kaminka  James Cameron\nGenres :   Action  Adventure  Comedy  Romance  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:37:39.524681"}