{"title": "Usual Suspects, The", "film_link": "/Movie Scripts/Usual Suspects, The Script.html", "script_link": "/scripts/Usual-Suspects,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Usual Suspects, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Usual Suspects, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9.06 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Christopher McQuarrie\" title=\"Scripts by Christopher McQuarrie\">Christopher McQuarrie</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : May 1994<br/>\n<br/>\n<a href=\"/scripts/Usual-Suspects,-The.html\">Read \"Usual Suspects, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre><b>\n</b><b>\n</b>\n<title>The Usual Suspects</title>\n\n\n<b>\n</b><pre>\nThe Usual Suspects\n\nWritten By Christopher McQuarrie\n\n\nProduced and Directed By Bryan Singer\n\n\nRevised, 05/25/94 White<br/>\nRevised, 06/01/94 Blue<br/>\nRevised, 06/07/94 Pink<br/>\nRevised, 06/11/94 Yellow<br/>\n\n\n\n<b>SCRIPT DATE 5/25/94\n</b>\n\n<b>1 -BLACK\n</b>\n     The lonely sound of a buoy bell in the distance. Water\n     slapping against a smooth, flat surface in rhythm. The\n     creaking of wood.\n\n     Off in the very far distance, one can make out the sound of\n     sirens.\n\n     SUDDENLY, a single match ignites and invades the darkness. It\n     quivers for a moment. A dimly lit hand brings the rest of the\n     pack to the match. A plume of yellow-white flame flares and\n     illuminates the battered face of DEAN KEATON, age forty. His\n     salty-gray hair is wet and matted. His face drips with water\n     or sweat. A large cut runs the length of his face from the\n     corner of his eye to his chin. It bleeds freely. An un-lit\n     cigarette hangs in the corner of his mouth.\n\n     In the half-light we can make out that he is on the deck of a\n     large boat. A yacht, perhaps, or a small freighter. He sits\n     with his back against the front bulkhead of the wheel house.\n     His legs are twisted at odd, almost impossible angles. He\n     looks down.\n\n     A thin trail of liquid runs past his feet and off into the\n     darkness. Keaton lights the cigarette on the burning pack of\n     matches before throwing them into the liquid.\n\n     The liquid IGNITES with a poof.\n\n     The flame runs up the stream, gaining in speed and intensity.\n     It begins to ripple and rumble as it runs down the deck\n     towards the stern.                                                       \n\n<b>2     EXT. BOAT - NIGHT - STERN                                             2'\n</b>\n     A stack of oil drums rests on the stern. They are stacked on\n     a palette with ropes at each corner that attach it to a huge\n     crane on the dock. One of the barrels has been punctured at\n     it's base. Gasoline trickles freely from the hole.\n\n     The flame is racing now towards the barrels. Keaton smiles\n     weakly to himself.\n\n     The flame is within a few yards of the barrels when another\n     stream of liquid splashes onto the gas. The flame fizzles out\n     pitifully with a hiss.\n\n     Two feet straddle the flame. A stream of urine flows onto the\n     deck from between them.\n\n<b>                                            BLUE 06/01/94\n</b>\n<b>                                                               2.\n</b>\nThe sound of a fly zipping. Follow the feet as they move over\nto where Keaton rests at the wheel house.\n\nCRANE UP to the waist of the unknown man. He pulls a pack of\ncigarettes out of one pocket and a strange antique lighter\nfrom the other. It is gold, with a clasp that folds down over\nthe flint. The man flicks up the clasp with his thumb and\nstrikes it with his index finger. It is a fluid motion,\n\nsomewhat showy.\nKeaton looks up at the man. A look of realization crosses his\nface. It is followed by frustration, anger, and finally\nresignation.\n\n<b>                         VOICE (O.S.)\n</b>           How are you, Keaton?\n\n<b>                             KEATON\n</b>           I'd have to say my spine was broken,\n           Keyser.\n\nHe spits the name out like it was poison.\n\nThe man puts the lighter back in his pocket and reaches under\nhis jacket. He produces a stainless .38 revolver.\n\n<b>                         VOICE (O.S.)\n</b>           Ready?\n\n<b>                             KEATON\n</b>           What time is it?\n\nThe hand with the gun turns over, turning the gold watch on\nits wrist upward.\nThe sound of sirens is closer now. Headed this way.\n\n<b>                         VOICE (O.S.)\n</b>           Twelve thirty.\n\nKeaton grimaces bitterly and nods. He turns his head away and\ntakes another drag.\nThe hand with the gun waits long enough for Keaton to enjoy  \nhis last drag before pulling the trigger.\n\n<b>GUNSHOT\n</b>\nThe sound of Keaton's body slumping onto the deck.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                             3.\n</b>\nMOVE OUT ACROSS THE DECK. Below is the stream of gasoline\nstill flowing freely.\n\nThe sound of the gasoline igniting. The flame runs in front\nof us towards the barrels, finally leaping up in a circle\naround the drums, burning the wood of the pallet and licking\nthe spouting stream as it pours from the hole.\n\nMOVE OUT ACROSS THE DOCK, away from the boat.\n\nThe pier to which the boat is moored is littered with DEAD\nBODIES. Twenty or more men have been shot to pieces and lie\nscattered everywhere in what can only be the aftermath of a\nfierce fire-fight.\n\n<b>A BARGE COMES INTO VIEW.                                             \n</b>\nOn the deck of the barge is a tangle of cables and girders.          \nThe mesh of steel and rubber leaves a dark and open cocoon           \nbeneath its base.                                                    \n\n<b>MOVE INTO THE DARKNESS.\n</b>\nSirens are close now. Almost here. The sound of fire raging\nout of control.\n\n<b>SIRENS BLARING. TIRES SQUEALING. CAR DOORS OPENING. FEET\n</b><b>POUNDING THE PAVEMENT.\n</b>\n<b>MOVE FURTHER, SLOWER, INTO THE DARKNESS\n</b>\nVoices yelling. New light flickering in the surrounding\ndarkness.\n\n<b>SUDDENLY, AN EXPLOSION.\n</b>\nThen silence. TOTAL BLACKNESS.\n\nWe hear the voice of ROGER \"VERBAL\" KINT, whom we will soon\nmeet.\n\n<b>                         VERBAL (V.O.)\n</b>           New York. - six weeks ago. A truck loaded\n           with stripped gun parts got jacked\n           outside of Queens. The driver didn't see\n           anybody, but somebody fucked up. He heard\n           a voice. Sometimes, that's all you need.\n\n\n<b>                                                YELLOW 06/11/94\n</b><b>                                                                   4.\n</b><b>      BOOM\n</b><b>3     INT. DARK APARTMENT - DAY - NEW YORK - SIX WEEKS PRIOR TO\n</b><b>      PRESENT DAY\n</b>\n      The black explodes with the opening of a door into a dark\n      room. Outside, the hall is filled with blinding white light.\n      Shadows in the shapes of men flood into the room. We can make\n      out men in hoods with flashlights. They are laden with\n      weapons.\n\n<b>                                   VOICES\n</b><b>                 POLICE. SEARCH WARRANT. DON'T MOVE.\n</b>\n      It is a blur of violent action and sound.'Beams of\n      flashlights cut the darkness in all directions.\n\n<b>      FINALLY:\n</b>\n      A dozen flashlights land on one man. He lies naked in bed,\n      Merging from a deep sleep. He squints at the flood of\n      blinding white light, more annoyed than frightened. He nearly\n      laughs at the sound of countless guns cocking. He is\n      McMANUS. Age twenty-eight.\n\n<b>                               VOICE (O.S.)\n</b>                 Mr. McManus?\n\n                                  McMANUS\n                 Yeah.\n\n<b>                               VOICE (O.S.)\n</b>                 Police. We have a warrant for\n                 your arrest.\n\n                                   McMANUS\n                 Will they be serving coffee downtown?\n\n      Two dozen black gloved hands grab him and yank him out of\n      bed.\n\n<b>4     INT. AUTO BODY SHOP - DAY                                            4 \n</b>      An old paint mixer vibrates furiously.\n      TODD HOCKNEY, a dark, portly man in his thirties is working\n      on an old Fire-bird.                                                    \n      A YOUNG HISPANIC KID mixes paint a few feet away.\n      SUDDENLY, the garage door opens TO REVEAL:\n<b>                                                   YELLOW 06/11/94\n</b><b>                                                                     4A .\n</b>        A row of five men silhouetted by the bright sun.\n        Hockney squints.\n\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   5.\n</b>\n<b>                                  HOCKNEY\n</b>                 Can I help you?\n\n      Hockney's voice is gruff.\n\n<b>                                    MAN\n</b>                 Todd Hockney'\n\n      Hockney reaches for something just inside the door of the\n      Fire-bird.  \n\n<b>                                  HOCKNEY\n</b>                 Who are you?\n\n      All six men INSTANTLY PRODUCE GUNS and aim them at Hockney.\n\n<b>                                    MAN  \n</b>                 Police.\n\n      Hockney withdraws a filthy towel and wipes grease and sweat\n      from his forehead.                                                       \n\n<b>                                  HOCKNEY\n</b>                 We don't do gun repair.\n\n<b>S     EXT. STREET - NEW YORK - DAY\n</b>\n      FRED FENSTER, a tall, thin man in his thirties strolls\n      casually down the street. He is dressed conspicuously in a\n      loud suit and tie with shoes that have no hope of matching.\n      He smokes a cigarette and chews gum at the same time.\n\n      He happens to glance over his shoulder and notice a brown\n      Ford sedan with four men in it cruising along the curb. He\n      picks up his step a little. The Ford keeps up.\n\n      He looks ahead at the corner. He tries to look as comfortable\n      as he can, checking his watch as though remembering an\n      appointment he is late for. The Ford stays right on him.\n\n      SUDDENLY, he bolts. He gets no more than a few yards before\n      cars pour out of every conceivable nook and cranny. Brakes\n      are squealing, radios squawking, guns cocking. Fenster is\n      surrounded instantly. He stops short and flaps his hands on\n      his thighs in defeat.\n\n<b>6     INT. MONDINO'S RESTAURANT - DAY\n</b>\n      An attractive man and woman walk quickly through the front of\n      a small New York cafe. They are charged with nervous, excited\n      energy.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                             5A.\n</b>\nThe man is DEAN KEATON, a well dressed, sturdy looking man in\nhis forties with slightly graying hair. He looks much better\nthan he did in the opening scene. The woman with him is EDIE\nFINNERAN, age thirty-three, poised and attractive - Easily\nthe calmer of the two.\n\n<b>                                                 BLUE 06/01/94\n</b>\n\n<b>                                                                     6.\n</b>\n     They come to a staircase at the back of the restaurant\n     leading down to a dark room. Edie takes Keaton's arm and\n     stops him.\n\n<b>                                  EDIE\n</b>                Let me look at you.\n\n     Keaton is uncomfortable in his suit, or perhaps the\n     situation. Still, he smiles with genuine warmth.\n\n     Edie straightens his tie and picks microscopic imperfections\n     from his lapel.\n\n<b>                              EDIE (CONT'D)\n</b>                Now remember, this is another kind of\n                business. They don't earn your respect.\n                You owe it to them. Don't stare them down\n                but don't look away either. Confidence.\n                They are fools not to trust you. That's\n                the attitude.\n\n<b>                                 KEATON\n</b>                I'm having a stroke.\n\n<b>                                   EDIE\n</b>                You've come far. You're a good man. I\n                love you.\n\n     Keaton blinks then stammers, looking for a response.\n<b>     PAUSE\n</b><b>                              EDIE (CONT'D)\n</b>                Live with it.\n\n     She kisses him and runs down the steps with Keaton close\n     behind. Keaton playfully grabs her ass and she nearly\n     stumbles down the stairs.\n\n<b>7     INT. RESTAURANT - DOWNSTAIRS\n</b>\n     They come to the bottom of the steps giggling and jabbing\n     each other. Once off the stairs they instantly transform as\n     though hit with cold air. They assume a cool, professional\n     exterior and walk two feet apart. One would look at them and\n     see only two business associates here to ply their trade.\n\n     They walk across the dimly lit dining room to a table in the\n     far corner where two men are already waiting. The first is\n     MR. FORTIER, age thirty-five, the other is MR. RENAULT, age  \n\n     sixty. Both men are impeccably dressed with a distinguished\n     air. They stand and smile.\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   7.\n</b>\n\n<b>                                  FORTIER\n</b>                 Edie, nice to see you.\n\n<b>                                   EDIE\n</b>                 Sorry we're late.\n\n<b>                                  FORTIER\n</b>                 Nonsense. Sit, please.\n\n<b>                                  RENAULT\n</b>                         (struggling with English)\n                 You must be Mr. Keaton.\n\n<b>                                   EDIE\n</b>                 I'm sorry. Dean Keaton\n\n     Renault's hand is already out.\n\n<b>                                  RENAULT\n</b>                 Monsieur Renault. A pleasure.\n\n<b>                                  KEATON\n</b>                 How do you do?\n\n     They shake hands. Keaton takes Fortier's hand next.\n\n<b>                                  FORTIER\n</b>                 Monsieur Fortier. So nice to finally meet\n                 you.\n\n     Everyone sits at the table. All faces are smiling.\n<b>     LOW ANGLE: UNDER TABLE\n</b>     Edie's hand reaches out and finds Keaton's leg. Her hand runs\n     high up his inner thigh and squeezes firmly.\n\n     Her face is absolutely calm, giving no hint of what her hand\n     is doing. Keaton smiles and clears his throat.\n\n<b>8     INT. MONDINO'S RESTAURANT                                            8'\n</b>     Follow a waiter past the flight of steps.\n<b>     PAN DOWN TO REVEAL:\n</b>\n     Five sets of feet arriving at the bottom.\n\n     The feet in the middle wear shoes notably nicer than the\n     rest.\n\n<b>                                               YELLOW 06/11/94\n</b><b>                                                                  7A.\n</b><b>     PAN UP TO REVEAL:\n</b>     SPECIAL AGENT DAVID KUJAN (Pronounced Koo-yahn), U.S.\n     CUSTOMS. Thirtyish, dark-haired and determined.\n\n<b>9 SCENE DELETED\n</b><b>                                                                             9'\n</b>\n<b>                                                 PINK 06/07/94\n</b>\n<b>                                                                      8.\n</b>\n<b>10 INT. RESTAURANT - DOWNSTAIRS                                        10\n</b><b>                                 FORTIER\n</b>                Edie brought us your proposal and I'll be                  \n\n\n                honest. We're very impressed. A bit                       \n                skeptical, I must admit, but impressed.                    \n\n\n<b>                                 KEATON\n</b>                Skeptical.\n<b>                                 RENAULT\n</b>                We find the concept brilliant, but New\n                York is difficult for new restaurants.\n                How can we be certain that our money will                  \n                be returned in the long run?\n     Keaton looks at Edie and smiles confidently.\n<b>                                 KEATON\n</b>                It's simple gentlemen, design\n\n                versatility. A restaurant that can change                  \n                with taste without losing the overall\n\n                aesthetic. Our atmosphere won't be\n                painted on the walls.\n\n<b>                                 FORTIER\n</b>                This was the part of the proposal that\n                intrigued us, but I'm not sure I follow.                   \n\n\n<b>                                 KEATON\n</b>                Let's say for example -\n\n<b>                              VOICE (O.S.)\n</b>                This I had to see myself.\n\n     Keaton looks up. He sees David Kujan. Behind him are the very\n     serious looking guys in suits.\n\n     Keaton is not happy to see them.\n\n<b>                                 KEATON\n</b>                Dave. I'm in a meeting.\n\n<b>                                  KUJAN\n</b>                Time for another one.\n\n<b>                                   KEATON\n</b>                 This is my attorney, Edie Finneran.\n                                (Gesturing)\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                9.\n</b>                        KEATON (cont'd)\n           This is Mr. Renault and Mr. Fortier.\n           Everyone, this is David Kujan.\n\n<b>                             KUJAN\n</b>           Special Agent Kujan. U.S. Customs.\n                 (Gestures to men behind him)\n           These gentlemen are with the New York\n           police department. You look great,\n           Keaton. Better than I would have thought.\n\n<b>                            RENAULT\n</b>           Is there a problem, Mr. Keaton?\n\n<b>                             KUJAN\n</b>           The small matter of a stolen truck-load\n           of guns that wound up on a boat to\n           Ireland last night.\n\nRenault and Fortier's confusion is giving way to suspicion.\n\n<b>                            FORTIER\n</b>           Mr. Keaton?\n\n<b>                             KEATON\n</b>           If you will excuse us for a moment,\n           gentlemen.\n\n<b>                             KUJAN\n</b>           We need to ask you some questions\n           downtown. You'll be quite awhile.\n\nRenault starts to get up.\n\n<b>                            RENAULT\n</b>           We should leave you to discuss whatever\n           this is.\n\n<b>                            KEATON\n</b>           Please. Sit.\n\nKeaton stands up and throws a wad of money on the table to\ncover the check. He looks at Edie. She moves to stand, but he\nsits her back down with a hand on her shoulder.\n\n<b>                            KEATON\n</b>           Enjoy the meal.\n                           (To Edie)\n           I'LL call you.\n\nKujan takes him by the arm, but Keaton yanks away.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   10.\n</b>\n      He looks out over the dozens of other faces in the\n      restaurant. Everyone is looking at him with some level of\n      surprise. If Keaton is humiliated by the whole affair, he\n      hides it well.\n\n<b>11    INT. LOCK-UP HALLWAY - NIGHT                                        11'\n</b>\n      A police officer steps into the frame and opens the steel\n      door.\n\n      FOLLOW A PAIR OF FEET as they shuffle across the cement\n      floor. The shoes are shabby and worn, as are the wrinkled\n      pants that hang too low and loose at the cuffs. The right\n      foot is turned slightly inward and falls with a hard limp. It\n      is clear that the knee does not extend fully.\n\n      The sound of a steel door opening. The bottom corner of a\n      steel cage comes into view. Another set of feet falls into\n      step with the first. Another steel door and another set of\n      feet. Another door, another and another. Five pairs of feet\n      walk single file down the hall.\n\n      The lame feet are in the front of the line. They come to\n      another steel door, this one solid and covered with dents and\n      rivets.\n\n<b>      CRANE UP TO REVEAL:\n</b>\n      ROGER KINT, VERBAL to his few friends. He has a deeply lined\n      face, making his thirty-odd years a good guess at best. From\n      his twisted left hand, we can see that he suffers from a\n      slight but not debilitating palsy. Behind him are Dean\n      Keaton, Fred Fenster, McManus and Todd Hockney.                      t\n\n      Verbal steps through the door, followed by the rest.\n\n<b>                              VERBAL (V.O.)\n</b>                It didn't make sense that I be there. I\n                mean these guys were hard-core hijackers,\n                but there I was. At that point, I wasn't\n                scared, f knew I hadn't done anything\n                they could do me for. Besides, it was\n                fun. I got to make like I was notorious.\n\n<b>12    INT. LINE-UP ROOM                                                   12\n</b>\n      The five men are ushered into the room in front of a white\n      wall painted with horizontal blue stripes. Each has a number\n      at either end to denote the height of the man in front of it.\n      Between these lines are thinner blue lines to tell the\n      specific height in inches.\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n<b>                                                                11.\n</b>\nBright lights shine on all of them. They squint, eyes\nadjusting.\n\nKeaton leans forward a bit and looks at the men in line with\nhim. He shares a look of familiarity with Fenster and then\nMcManus. Hockney smiles at all of them.\n\n                            McMANUS\n                          (To Keaton)\n           Where you been, man?\n\n<b>                         VOICE (O.S.)\n</b>           SHUT UP IN THERE. Alright, you all know\n           the drill. When your number is called,\n           step forward and repeat the phrase you've\n           been given. Understand?\n\nThe men all nod.\n\n<b>                         VOICE (O.S.)\n</b>           Number one. Step forward.\n\nHockney takes a step forward. He looks directly into a mirror\non the other side of the room. It is three feet square and we\ncan make out faint light behind it. It is a two-way. He\nspeaks in a complete dead-pan.\n\n<b>                            HOCKNEY\n</b>           Hand-me-the-keys, you-fucking-cock-\n           sucker.\n\n<b>                         VOICE (O.S.)\n</b>           Number two. Step forward.\n\nMcManus steps up and makes a gun with his thumb and\nforefinger. He mocks criminal intensity, pointing at the\nmirror. He camps up his line.\n\n                            McMANUS\n           Give me the keys, you motherfucking,\n           cocksucking pile of shit, or I'll rip off\n           your\n\n<b>                         VOICE (O.S.)\n</b>           KNOCK IT OFF. Get back in line.\n\nMcManus steps back.\n\nThe rest of the men do their bit as Verbal speaks.\n\n<b>                                                 BLUE 06/01/94\n</b>\n\n<b>                                                                     12.\n</b>\n<b>                              VERBAL (V.O.)\n</b>                It was bullshit. The whole rap was a\n                setup. Everything is the cops' fault. You\n                don't put guys like that in a room\n                together. Who knows what can happen?\n\n<b>13 INT. INTERROGATION ROOM - NIGHT\n</b><b>                                                                           13\n</b>\n     McManus sits in a chair in front of a white wall. He smiles\n     at someone off-screen.\n\n<b>     OVERLAPPED:\n</b>\n\n<b>                                MCMANUS  \n</b>                This has to be embarrassing for you\n\n\n                guys, huh? I mean you know and I know\n                this is a load of shit, but at least I\n                don't have a captain with his dick in\n                my ass making me play along. That has\n                got to suck,\n\n<b>                             VOICE (O.S.)                                 \n</b>                Are you done?                                            \n\n                                McManus                                   \n                Do you work for a broad? That would\n                have to be the worst.                                     \n\n<b>                             VOICE (0.8.)                                 \n</b>                Are you done?                                             \n\n                                McMANUS                                   \n                Still, I guess dignity is a small\n                pries to pay for medical and a\n                pension. A small pension, mind you,\n                but a pension nonetheless.                                \n\n<b>                              VERBAL (V.O.)\n</b>                They drilled us all night. Somebody was\n                pissed about that truck getting knocked\n                off and the cops had nothing. They were\n                hoping somebody would slip. Give them\n                something to go on. They knew we wouldn't\n                fight it because they knew how to lean on\n                us. They'd been doing it forever. Our\n                rights went right out the window. It was\n                a violation. I mean disgraceful.\n\n<b>                                 BLUE 06/01/94\n</b>\n\n<b>                                                    12A.\n</b>\n<b>                              VERBAL (V.O.)\n</b>                They went after McManus first. He was a\n                good guy. Crazy though. A top notch entry\n                man .\n\n<b>                              VOICE (O.S.)\n</b>                So where'd you dump the truck?\n\n                              McMANUS\n                What truck?\n\n<b>                              VOICE (O.S.)\n</b>                The truck with the guns, fucko.\n\n                 \t\t\t  McMANUS\n                You kill me, you really do. Where's my\n                phone call?\n\n<b>                 \t\t\t  VOICE (O.S.)\n</b>                Right here. Suck it out.\n\n                   \t\t\t   McMANUS\n                Clever guy.\n\n<b>                 \t\t\t  VOICE (O.S.)\n</b>                You want to know what your buddy Fenster\n                told us?\n\n<b>                                                 BLUE 06/01/94\n</b>\n<b>                                                                     13.\n</b>\n\n                                 McMANUS\n                Do I look stupid enough to fall for that?\n                Jesus Christ. Beat me if you gotta, but\n                no more of the candy-land tactics, man.\n\n<b>                              VOICE (O.S.)\n</b><b>                WHERE'S THE FUCKING TRUCK?\n</b>\n<b>14 INT. INTERROGATION ROOM                                             14\n</b>     Now Fenster is in the seat. He sweats profusely.\n<b>                                 FENSTER\n</b>                I want to call my lawyer. I don;'t know                    \n                about any truck. I was in Connecticut all\n                night on Friday.\n\n<b>                              VOICE (O.S.)\n</b>                That's not what McManus said.\n\n<b>     OVERLAPPED:\n</b>\n<b>                                FENSTER                                     \n</b>                Who?                                                        \n\n<b>                             VOICE (0.8.)                                   \n</b>                McManus. Be told us another story                           \n                altogether.                                                 \n\n                                FENSTER                                    t\n                Was it the one about the hooker with                        \n                dysentery I swear , she never                             \n                mentioned money until I came.                               \n\n<b>                              VOICE (O.S.)\n</b>                Be fold us about the truck.                                 \n\n                                FENSTER                                    s\n                To be honest, it was more like a                           +\n                mobile home. She made a lot of money,                      t\n\n<b>                             VOICE (O.S.)                                  +\n</b>                Who took the guns off your hands?                           \n\n<b>                                 FENSTER\n</b>                Hey, are we talking about the same\n                thing?\n\n<b>                             VOICE (O.S.)                                   \n</b>                I'm losing my patience.                                     \n\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                13A.\n</b>\n<b>                         VERBAL (V.O.)\n</b>           Fenster always worked with McManus. He\n           was a real tight-ass, but when it came to\n           the job, he was right on. Smart guy. A\n           gopher. Got whatever you needed for next\n           to nothing.\n<b>                            FENSTER\n</b>           You guys got nothing on me. Where's your\n           probable cause?\n\n<b>                         VOICE (O.S.)\n</b>           You're a known hijacker. You're sweating\n           like a guilty motherfucker. That's my\n           p.c. Save us the time. Tell us where the\n           truck is.\n\nFenster knocks on the table.\n\n\n<b>                            FENSTER\n</b>           HELLO? Can you hear me in the back? P.C.\n\nHe looks under his chair.\n\n<b>                       FENSTER (CONT'D)\n</b>           Where is it? I'm lookin'. It's not\n           happening. What's going on with that? I\n           want\n\n<b>                                                  BLUE 06/01/94\n</b>\n\n<b>                                                                     14.\n</b>\n<b>15 INT. INTERROGATION ROOM\n</b><b>                                                                            15\n</b>\n\n     Hockney's turn in the chair. He laughs it all off.\n\n<b>                                  HOCKNEY\n</b>                 - my lawyer. I'll have your badge,\n                 cocksucker.\n\n<b>     OVERLAPPED:  \n</b>\n\n<b>                            HOCKNEY (CONT'D)\n</b>                 I know you. You don't think I know\n                 you're on the take. This whole fucking\n                 precinct is dirty. You don't have a\n                 fucking leg to stand on.\n\n<b>                              VERBAL (V.O.)\n</b>                 Hockney was just a bad bastard. Good with\n                 explosives. Mean as a snake when it\n                 mattered .\n\n<b>                              VOICE (O.S.)\n</b>                 You think so, tough guy? I can put you in\n                 Queens the day of the hijacking.\n\n<b>                                  HOCKNEY\n</b>                 I live in Queens. What the fuck is this?\n                 You come into my store and lock me up in\n                 front of my customers. What the hell is\n                 wrong with this country? Are you guys\n                 gonna charge me or what?\n\n<b>                              VOICE (O.S.)\n</b>                 You know what happens if you do another\n                 turn in the joint?\n\n<b>                                  HOCKNEY\n</b>                 I'll fuck your father in the shower.\n                 Charge me, dick-head.\n\n<b>16 INT. INTERROGATION ROOM                                              16\n</b>     Now Keaton sits in the chair, cool and indifferent.\n<b>                              VERBAL (V.O.)\n</b>                 Keaton was the real prize for them, for\n                 obvious reasons.\n\n<b>                               VOICE (O.S.)\n</b>                 I'll charge you when I'm ready.\n\n<b>                                 BLUE 06/01/94\n</b>\n<b>                                                    14A.\n</b>\n<b>                                KEATON\n</b>                with what?\n\n<b>                           \t    VOICE (O.S.)\n</b>                You know damn well, dead-man.\n\n<b>                                KEATON\n</b>                Hey, that was your mistake, not mine. Did\n                you ever think to ask me? I've been\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   15.\n</b>                             KEATON (cont'd)\n                walking around with the same face, same\n                name - I'm a businessman, fellas.\n\n<b>                               VOICE (O.S.)\n</b>                What's that? The restaurant business? Not\n                anymore From now on you're in the\n                getting-fucked-by-us business . I'm gonna\n                make you famous, cocksucker.\n\n     Keaton shows just a flicker of contempt. The threat has hit\n     home.\n\n<b>                                  KEATON\n</b>                Like I said. It was all your mistake.\n                Charge me with it and I'll beat it. Let's\n                get back to the truck.\n\n     A FIST flies into the frame and connects with Keaton's jaw.\n     His head snaps back, blood flowing freely from his mouth.\n\n<b>17   DELETED                                                              17\n</b><b>18   INT. CELL BLOCK                                                      18\n</b>     Keaton is brought in to a holding where he joins Fenster,\n     Hockney, Verbal and McManus. He sits in a corner and keeps to\n     himself.\n\n     Fenster is in mid-tirade.\n\n<b>                                  FENSTER\n</b>                Somebody should do something. What is\n                this shit - getting hauled in every five                   \n                minutes? Okay, so I did a little time,                    \n                does that mean I get railed every time a\n                truck finds its way off the planet?\n\n     McManus is silently staring at Keaton, who sits on a bench,\n     looking away.\n\n<b>                                  HOCKNEY\n</b>                These guys got no probable cause.\n\n\n\n\n\n\n<b>                                              SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                16.\n</b>\n<b>                            FENSTER  \n</b>           You're fuckin' A right, no P.C. Well\n           screw P.C. No right. No goddamn right.\n           You do some time, they never let you go.\n           Treat me like a criminal, I'll end up a\n           criminal.\n\n<b>                            HOCKNEY\n</b>           You are a criminal.\n\n<b>                            FENSTER\n</b>           Why you gotta go and do that? I'm trying\n           to make a point.\n\n<b>                            KEATON\n</b>           Then make it. Christ, you're making me\n           tired all over.\n\nMcManus looks at Keaton.\n\n\n                            McMANUS\n           I heard you were dead, Keaton.                              \n\n<b>                            KEATON\n</b>           You heard right.\n\n<b>                            HOCKNEY\n</b>           The word I got is you hung up your spurs,\n           man. What's that all  about?\n\n                            McMANUS  \n           What's this?\n\n<b>                            HOCKNEY\n</b>           Rumor has it, Keaton's gone straight -\n           cleaning house. I hear he's tapping Edie\n           Finneran.\n\n                            McMANUS  \n           Who?  \n\n<b>                            HOCKNEY\n</b>           She's a heavy-weight criminal lawyer from\n           uptown. Big-time connected. She could\n           erase Dillinger's record if she tried. I\n           hear she's Keaton's meal ticket.\n                          (To Keaton)\n           Is it true?\n\n\n                            McMANUS\n        What about it, Keaton? You a lawyer's \n        wife. What sort of \"retainer\" you giving\n        her?\n\n<b>     \n</b><b>                                              SCRIPT DATE 5/25/94\n</b>\n<b>                                                               17.\n</b>Keaton shoots McManus a fiery glare.\n<b>                            FENSTER\n</b>           I'd say you've gotten on his main and\n           central nerve, McManus.\n\n<b>                            KEATON\n</b>           Do your friend a favor, Fenster, keep him\n           quiet .\n\n                            McMANUS  \n           You're clean, Keaton? Say it ain't so.\n           Was it you that hit that truck?\n\n<b>                            FENSTER  \n</b>           Forget him. It's not important. I was\n           trying to make a point.\n\n<b>                            KEATON\n</b>                      (Ignoring McManus)\n           This whole thing was a shakedown.\n\n                            McMANUS\n           What makes you say that?\n\n<b>                            KEATON\n</b>           How many times have you been in a line-\n           up? It's always you and four dummies. The                  \n           P.D. pays homeless guys ten bucks a head\n           half the time. No way they'd line five\n           felons in the same row. No way. And what\n           the hell is a voice line-.up? A public\n           defender could get you off of that.\n\n<b>                            FENSTER\n</b>           So why the hell was I hauled in and\n           cavity searched tonight?\n\n<b>                            KEATON\n</b>           It was the Feds. A truck load of guns\n           gets snagged, Customs comes down on\n           N.Y.P.D. for some answers - they come up\n           with us. They're grabbing at straws. It's\n           politics - nothing you can do.\n\n<b>                            FENSTER\n</b>           I had a guy's fingers in my asshole\n           tonight.\n\n<b>         HOCKNEY\n</b>        Is it Friday already?\n<b>                                              SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                18.\n</b>\n<b>                            FENSTER\n</b>           Fuck you. I'11 never shit right again. So\n           who did it? Own up.\n\n<b>                            KEATON\n</b>           I don't want to know.\n\n                            McMANUS  \n           Nobody asked you, workin'-man.\n\n<b>                            HOCKNEY\n</b>           Fuck who did it. What I want to know is,\n           who's the gimp?\n\nALL EYES suddenly turn on Verbal. He has been quietly\nlistening the whole time without uttering a word.\n\n<b>                             KEATON\n</b>           He's alright.\n\n<b>                            HOCKNEY\n</b>           How do I know that? How about it,\n           pretzel-man? What's your story?\n\n<b>                            KEATON\n</b>           His name is Verbal Kint. I thought you\n           guys knew him.\n\n                            McMANUS\n           Verbal?\n\n<b>                            VERBAL\n</b>           Roger really. People say I talk too much.\n\n<b>                            HOCKNEY\n</b>           Yeah, I was gonna tell you to shut up.\n\n<b>                            KEATON\n</b>           We've met once or twice. Last time was\n           in...\n\n<b>                             VERBAL\n</b>           County. I was in for fraud.\n\n<b>                            KEATON\n</b>           You were waiting for a line-up then, too.\n           What happened with that?\n\n<b>                            VERBAL\n</b>        I walked. Ninety days, suspended.\n\n\n<b>                                           YELLOW 06/11/94\n</b>\n\n<b>                                                               19.\n</b>\n<b>                             HOCKNEY\n</b>            So you did it?\n\n\n<b>                             VERBAL\n</b>            To your mother's ass.\n\n Verbal looks away from Hockney, awaiting a violent response.\n Everyone slowly starts to laugh. Hockney looks as if he is\n about to boil in his own skin.\n\n<b>                              KEATON\n</b>                          (To Hockney)\n            Let it go.\n\n Verbal smiles at Keaton appreciatively.\n\n McManus stands and walks to the toilet in the corner of\n the cell. He starts taking a leak;\n\n                              McMANUS\n            Look, we've all been put out by this, I\n            figure we owe it to ourselves to salvage\n            a little dignity. Now Fenster and I got\n            wind of a possible job -\n\n<b>                              KEATON\n</b>            Why don't you just calm down'\n\n<b>                             HOCKNEY\n</b>            What do you care what he says?\n\n                             McMANUS\n           Yeah, I'm just talking here, and Hockney\n           seems to want to hear me out. I know\n           Fenster is with me -\n                           (To Verbal)\n           How about you, guy?\n\nMcManus finishes pissing.\n\n\n<b>                            VERBAL\n</b>           I'm interested, sure.\n\n\n                             McMANUS\n           There, so you see, I'm going to exercise\n           my right to free assembly.\n\nMcManus taps the bars of his cell and the others LAUGH.\n\n<b>                              KEATON\n</b>           I'm not kidding. Shut your mouth.\n\n<b>                              YELLOW 06/11/94\n</b>\n<b>                                                  19A.\n</b>\n                 McMANUS\nYou're missing the point.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   20.\n</b>\n<b>                                  KEATON\n</b>                 No, you're missing the point. Shut up. I\n                 don't want to hear anything you have to\n                 say. I don't want to know about your\n                 \"job\". Just don't let me hear you. I want\n                 nothing to do with any of you -\n                                  (Beat)\n                 I beg your pardon but all of you can go\n                 to hell.\n\n                                  McMANUS\n                 Dean Keaton, gone the high road. What is\n                 the world coming to?\n\n     McManus and Keaton stare at one another for a long and tense\n     moment. Finally McManus turns to the others.\n\n                             McMANUS (CONT'D)\n                 Forget him then.\n                               (Whispering)\n                 Now I can't talk about this here in any\n                 detail, but listen up...\n\n     Everyone but Keaton gravitates toward McManus's cell as he\n     begins to speak in low, hushed tones.\n\n<b>                              VERBAL (V.O.)\n</b>                 And that was how it began. The five of us\n                 brought in on a trumped-up charge to be\n                 leaned on by half-wits. What the cops\n                 never figured out, and what I know now,\n                 was that these men would never break,\n                 never lie down, never bend over for\n                 anybody. .. Anybody.\n\n<b>19    EXT. PIER - DAY - SAN PEDRO - PRESENT DAY                          19\n</b>     It is morning in the aftermath of the opening scene.\n     Harsh sunlight shines on a line of body bags on the dock.\n\n     Police swarm everywhere, photographers are taking pictures of\n     the scene while a team of men in rolled up sleeves and\n     plastic gloves pick at the remains.\n\n     Two men on a fire boat operate a water cannon, dousing the\n     smoldering remains of a burned-out ships hull.\n\n     Watching this from the edge of the pier is a man in a dark\n     suit. He is SPECIAL AGENT JACK BAER of the F.B.I. He is tall\n     and fit, in his late thirties. He gazes out over the water\n     thoughtfully.\n\n<b>                                          YELLOW 06/11/94\n</b><b>                                                             21.\n</b>A UNIFORM COP trots up to him.\n<b>                              COP\n</b>           Who are you?\n\n\nBaer holds up his badge without looking at the man.\n\n<b>                              BAER\n</b>           Agent Jack Baer, F.B.I. How many dead?\n\nBefore the cop can answer, Baer turns and walks along the\nline of body bags.\n\n<b>                              COP\n</b>           Fifteen so far. We're still pulling some\n           bodies out of the water.\n\nBaer eyes the corpses on the dock, burned beyond recognition.\n\n<b>                              COP\n</b>           Looking for anyone in particular?\n\nBaer looks at the cop for the first time, unamused.\n\n<b>                              BAER\n</b>           f don't want any of the bodies taken away\n           until I've had a chance to go over this,\n           understood?\n\n<b>                              COP\n</b>           I have to clear the scene. I've got word\n           direct from the Chief\n\nBaer lights a cigarette, only half listening.\n\n<b>                              BAER\n</b>                         (Unimpressed)\n           Yes, the chief. Spooky stuff. Any\n           survivors?\n\n<b>                              COP\n</b>           Two. There's a guy in county hospital,\n           but he's in a coma. The D.A. has the\n           other guy - A cripple - from New York I\n           think. Listen, the Chief said -\n\n<b>                              BAER\n</b>           Excuse me.\n\nBaer walks away from the cop, ignoring him completely. He\nwanders through the carnage on the pier.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   22.\n</b>\n<b>20 MT. OCEAN\n</b><b>                                                                            20\n</b>\n     A half mile out from the pier.\n\n     The sea is choppy, stirred by the wind. An object floats into\n     view a few feet away, bobbing in the water.\n\n     It is A DEAD BODY - a man, face down, wearing a CHECKERED\n     BATHROBE. He drifts quietly toward the open ocean.\n\n<b>21    INT. HEARING ROOM - DAY - LOS ANGELES PRESENT                      2: \n</b>\n     Verbal Kint sits in a chair in front of a microphone attached\n     to a tape recorder, his brow beaded with sweat.\n\n     On the wall behind him is the seal of the STATE OF CALIFORNIA\n\n     He is cleaner, better kept, in a well-cut suit and neatly\n     trimmed hair. He looks older than he did in New York - worn\n     down.\n\n     A flurry of voices banter off screen. Verbal's eyes follow\n     the voices back and forth.\n\n<b>                             VOICE #1 (O.S.)\n</b>                My client offers his full cooperation in\n                these proceedings. In exchange, his\n                testimony is to be sealed and all matters\n                incriminating to himself are to be\n                rendered inadmissible.\n\n<b>                             VOICE #2 (O.S.)\n</b>                The district attorney's office will\n                comply provided -\n\n<b>                                 VOICE #1\n</b>                No provisions, nothing. My clients\n                testimony for his immunity.\n\n<b>                                 VOICE #2\n</b>                May-I be frank, Counselor? I suspect your\n                political power as much as I respect it.\n                I don't know why Mr. Kint has so many\n                faceless allies in City Hall, and I don't\n                care. The embarrassment he helped cause\n                the city of New York will not happen\n                here.\n\n<b>                                VOICE #1\n</b>                Immunity.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              22A.\n</b>\n<b>                           VOICE #2                                      \n</b>           Counselor, I will prosecute your client.\n\n<b>                            VOICE #1\n</b>           Then prosecute. I will be very impressed\n           to see if the District Attorney manages\n           to bring in twenty-seven simultaneous\n           counts of murder against one man with\n           cerebral palsy. I would think a man with\n           your job would agree with these alleged\n           \"faceless people in City Hall\" you\n           mention.\n\n<b>                            VOICE #2 1\n</b>           One would think the counsel is veiling a\n           threat.                                                       \n\n<b>                           VOICE #1                                     +\n</b>           Counsel isn't veiling anything.\n\n<b>                            VOICE #2\n</b>           I'11 take my chances then. I'11 feel\n           safer without a job if a man like Mr.\n           Kint is behind bars.\n\n<b>                           VOICE #1                                      \n</b>           Mr. Kint will plead guilty to weapons\n           possession.\n\n<b>                            VOICE #2\n</b>           You're joking.\n\n<b>                            VOICE #1                                     \n</b>           Weapons. Misdemeanor one.\n\n<b>                           VOICE #2                                      \n</b>           Counselor, you're insulting me.\n\n<b>                            VOICE #1                                    \n</b>           Counselor, you're bluffing. Shall I push\n           for misdemeanor two?                                          \n\nVoices mumble off screen. Verbal fidgets in his chair.\n\n<b>                           VOICE #2                                     +\n</b>           Misdemeanor one. Fine. This is\n           ludicrous.  \n\nA tiny smile and a genuine look of disbelief flash across\nVerbal's face.\n\n<b>                                                YELLOW 6/11/94\n</b>\n\n<b>                                                                   22B.\n</b>\n<b>                            VOICE #2 (CONT'D)\n</b>                            (Clearing throat)\n                As for the rest of the charges grand\n                larceny, arson... murder - the district\n                attorney will accept the subject's\n                testimony in connection with the above\n                mentioned events and in exchange will\n                offer complete immunity. The\n                transcript... The transcript of said\n                testimony will be sealed and all matters\n                incriminating to Mr. Kint will be\n                rendered inadmissible.\n\n     Verbal lets out a long-held sigh of relief.\n\n<b>22 INT. POLICE STATION - HALLWAY - DAY\n</b><b>                                                                            22\n</b>\n     David Kujan is walking quickly beside SERGEANT RABIN, a dark\n     and weathered looking man in his late thirties. They move up\n     a staircase into the heart of police headquarters.\n\n<b>                                  KUJAN\n</b>                What do you mean I can't see him?\n\n<b>                                  RAB IN\n</b>                The D.A. came down here last night ready\n                to arraign before they even moved him to\n                county. Kint's lawyer comes in and five\n                minutes later, the D.A. comes out looking\n                like he'd been bitch-slapped by the\n                boogey man. They took his statement and\n                cut him a deal.\n\n<b>                                  KUJAN\n</b>                Did they charge him with anything?\n\n\n<b>                                  RAB IN\n</b>                Weapons. Misdemeanor two.\n\n<b>                                  KUJAN\n</b>                What'the fuck is that?\n\n     Rabin motions for Kujan to lower his voice. He points out\n     that they are walking through a bullpen filled with desks\n     where a number of other police are working within earshot.\n\n<b>                                  RABIN\n</b>                I give the D.A. credit for getting that\n                much to stick. This whole thing has\n                turned political. The Mayor was here -\n                the chief - the Governor called this\n                morning, for Christ's sake. This guy is\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                             220.\n</b>                        RABIN (cont'd)\n           protected - From up on high by the prince\n           of fucking darkness.\n\n\n<b>                             KUJAN\n</b>           When does he post bail?\n\n<b>                             RAB IN\n</b>           Two hours, tops.\n\n<b>                             KUJAN\n</b>           I want to see him.\n\nRabin comes to an office door with his name on it. He opens\nit and lets Kujan in before following.\n\n<b>                                                 PINK 06/07/94\n</b><b>                                                                      23-24.\n</b><b>23 INT. RABIN'S OFFICE                                                  23 \n</b><b>                                  RABIN                                 +\n</b>                Dave, please.                                            \n\n     Rabin's office can only be described as a disaster area. The        \n     desk is cluttered with weeks, perhaps months or even years of       \n     paperwork that could never conceivably be sorted out.               \n\n     Above his desk is a bulletin board. It is a breathtaking\n     catastrophe of papers, wanted posters, rap-sheets, memos and +\n     post-its. This is in the neighborhood of decades. Rabin is a\n     man with a system so cryptic, so far beyond the comprehension       \n     of others, he himself is most likely baffled by it.                 \n\n<b>                             RABIN (CONT'D)                              \n</b>                Even if I was to let you talk to him, he                 \n                won't talk to you. He's paranoid about                   \n                being recorded and he knows the                          \n                interrogation rooms are wired                            \n\n<b>                                   KUJAN\n</b>                This won't be an' interrogation, just a...               \n                friendly chat to kill time.                              \n\n<b>                                   RAB IN\n</b>                              (enunciating)                              \n                He won't go into the interrogation room.                 \n\n<b>                                  KUJAN\n</b>                Someplace else, then.\n\n<b>                                  RAB IN\n</b>                Where?\n\n     Kujan looks around Rabin's messy office.                            \n\n<b>                             RABIN (CONT'D)\n</b>                No, no, no, no, no.\n\n<b>                                   KUJAN\n</b>                If it was a dope deal, where's the dope,                 \n                if it was a hit, who called it in?\n\n<b>                                   RABIN\n</b>                And I am sure you have a host of wild                   +\n                theories to answer these questions.                      \n\n<b>                                   KUJAN\n</b>                You know damn well what I think.                         \n\n<b>                               YELLOW 06/11/94\n</b>\n\n<b>                                                  24A.\n</b>\n<b>            \t\t\t\t        RABIN\n</b>              That's crazy, Dave and it doesn't matter.\n              He has total immunity and his story\n              checks out. He doesn't know what you want\n              to know.\n\n<b>                    \t\t\t\tKUJAN\n</b>              I don't think he does. Not exactly, but\n              there's a lot more to his story. I want\n              to know why twenty-seven men died on that\n              pier for what looks to be ninety-one\n              million dollars worth of dope that wasn't\n              there. Above all, I want to be sure that\n              Dean Keaton is dead.\n\n<b>                \t  \t      \t\tRAB ZN\n</b>              He's dead.\n\n<b>                \t  \t      \t\tKUJAN\n</b>              Two hours. Just until he makes bail.\n\n<b>               \t\t          \t\tRAB IN\n</b>              They're all dead. No matter how tough you                 r.\n              say this Keaton was, no one on that boat\n              could've made it out alive.                                \n\n<b>                                                 PINK 06/07/94\n</b>\n\n<b>                                                                      25-29.\n</b>\n<b>24   INT. HOSPITAL - DAY                                                 24\n</b>     A door marked INTENSIVE CARE.\n     The door BURSTS OPEN. SUDDENLY, the hallway is a flurry of\n     activity.\n     DOCTOR LISA PLUMBER, age fifty, walks quickly beside JACK\n<b>     BAER .\n</b>     Baer walks with all of the determination of a battalion of\n     Chinese infantry.\n\n     DOCTOR RIDGLY WALTERS, a young intern in his late twenties\n     rushes up to them.\n\n<b>                                 PLUMBER\n</b>                Ridgly, this is Special Agent Jack Baer\n                from the F.B.I. Agent Baer, this is\n                Doctor Ridgly Waiters.\n\n<b>                                 RIDGLY\n</b>                Nice to meet you.\n\n<b>                                  BAER\n</b>                Is he talking?\n\n<b>                                 RIDGLY\n</b>                He regained consciousness less than an\n                hour ago. He spoke - not English - then\n                he lapsed.\n\n<b>                                  BAER\n</b>                Hungarian?\n\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   30.\n</b>\n<b>                                  RIDGLY\n</b>                 I don't\n\n<b>                                   BAER\n</b>                 It was Hungarian. Most of them were\n                 Hungarians. Any fluent Hungarians on your\n                 staff?\n\n<b>                                  RIDGLY\n</b>                 We have a Turkish audiologist.\n\n     Ridgly opens a door and Baer barrels through.\n<b>     \n</b><b>25    INT. HOSPITAL ROOM                                                   25\n</b>     (&lt;&lt; .. DENOTES LINES SPOKEN IN HUNGARIAN)                          +\n     Baer comes to an abrupt halt at the foot of a bed surrounded\n     by a massive tangle of medical equipment. In the center of it\n     all is the as yet unnamed ARKOSH KOVASH, mid-thirties. His\n     body is nearly mummified in bandages and plaster from waist\n     to chin.\n\n\n<b>     BOLD IS OVERLAPPED:                                                \n</b>\n\n                                  KOVASH                                s\n                 &lt;&lt;Are you the police? I need the\n                 police. He'll find out I'm here and                      \n                 he'll kill me. I need the police. I\n                 will tell them anything they want to\n                 know. Please, I am going to be\n      \t\t\t killed.&gt;&gt;\n\n\n<b>                                   BAER\n</b>                 will he die?\n\n<b>                                  PLUMBER\n</b>                 There's a chance.\n\n     Baer walks over to Rovash and kneels down on the bed beside\n     him.\n\n     He looks closely at his battered and scalded face. He listens\n     to him far a moment. Kovash goes on incessantly.\n\n<b>                                  KOVASH\n</b>                 &lt;&lt;Find someone who understands me,\n                 you idiot, I'm going to be killed,                     \n                 You'll all be killed if he has to do\n                 it. Help me, God. They're all stupid.\n                 Get someone who understands me or\n                 we're all going to die.&gt;&gt;\n\n\n<b>                                           YELLOW 06/11/94\n</b><b>                                                             30A.\n</b>Baer pulls a cellular phone out of his jacket and dials.\n<b>                             BAER\n</b>           Call hospital security and put a man on\n           the door until the police get here.\n\n<b>                            KOVASH\n</b>           &lt;&lt;Why are you just standing there,\n           you idiot? I'm not speaking English\n           am I? Wouldn't it make sense to find\n           someone who could talk to me so you\n           could find the person that set me on\n           fire, perhaps? He is the Devil.\n           You've never seen anyone like Keyser\n           Soze in all your miserable life you\n           idiot. Keyser Soze. Do you at least\n           understand that? Keyser Soze. The\n           Devil himself. Or are you American\n           policemen io stupid that you haven't\n           even heard of him. Keyser Soze, you\n           ridiculous man. KEYSER SOZE . &gt;&gt;\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                31.\n</b>\nRidgly runs out of the room. Kovash babbles louder and\nlouder, trying to get Baer's attention. Baer sticks a finger\nin one ear to block him out and hear the phone.\n\n<b>                            PLUMBER\n</b>           Is he dangerous?\n\n<b>                             BAER\n</b>           Yes.\n\nSomeone picks up on the other end of the phone.\n\n<b>                         BAER (CONT'D)\n</b>           Joel, it's Baer. I'm down at L.A. county.\n           The guy they pulled out of the harbor is\n           ARKOSH Kovash... Yes, I'm sure... No,\n           he's all fucked up... What? I can't hear\n           you.\n                          (To Arkosh)\n           Shut up, Hugo, I'm on the phone.\n                         (Into Phone)\n           Yes... No... Not until I put someone on\n           him. Listen, I need you to send me\n           someone who can speak Hungarian. He's\n           awake and talking like a Thai hooker...\n           How should I know? Get me someone who can\n           talk to him -\n\nBaer is suddenly distracted by something Kovash has said. In\nthe middle of a long string of unintelligible dialect, he has\nspouted two words that have gotten Baer's attention.\n\nHe turns and looks down at the tattered man in the bed.\nKovash realizes Baer is listening and says the two words\nagain.\n\n<b>                             KOVASH\n</b>           Keyser - Soze.                                               \n\n<b>                              BAER\n</b>           What?\n\nHe waves his hand, gesturing for Kovash to say it again.\n\n<b>                            KOVASH\n</b>           Keyser - Soze.\n\n<b>                              BAER\n</b>           No shit?\n                          (Into Phone)\n           Joel, call Dan Metzheiser over at Justice\n           and find Dave Kujan from Customs.\n\n<b>                                               YELLOW 06/11/94\n</b>\n<b>                                                                   32.\n</b>\n<b>2     INT. HALLWAY - POLICE STATION                                       26\n</b>\n      Rabin walks out of a small room. Behind him, we catch a\n      glimpse of a workroom with a bench covered with wires.\n\n      Kujan comes out a moment later, gently fixing his tie.\n\n      Rabin opens the door to his office and Kujan enters. Rabin \n      follows, looking up and down the hall before closing the door\n      behind them.\n\n      As the door closes we can just make out the back of Verbal's\n      head. He is seated in Rabin's office, smoking a cigarette.\n\n<b>27    INT. RABIN'S OFFICE                                                 27\n</b>      Kujan and Rabin sit down across from Verbal.\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   34.\n</b>\n<b>                                   KUJAN\n</b>                               (Exasperated)\n                 Verbal, you know we're trying to help\n                 you.\n\n<b>                                   VERBAL\n</b>                 Sure. And I appreciate that. And I want\n                 to help you, Agent Kujan. I like cops. I\n                 would have liked to have been a Fed\n                 myself but my C.P. was -\n\n<b>                                   KUJAN\n</b>                 Verbal, I know you know something. I know\n                 you're not telling us everything.\n\n<b>                                   VERBAL\n</b>                 I told the D.A. everything I know.\n\n<b>                                                                            28\n</b><b>28    INT. WORKSHOP\n</b>\n     Rabin stands over LOUIS, a messy looking technician at his\n     workbench in a room full of electronic equipment. He adjusts\n     several dials on a receiver until the voices of Kujan and\n     Verbal come clearly through a tinny speaker on the wall.\n     Rabin reaches over for a nearby pot of coffee.\n\n<b>                               KUJAN (VOICE)\n</b>                 I know you liked Keaton I know you think\n                 he was a good man.\n\n<b>                              VERBAL (VOICE)\n</b>                 I know he was good.\n\n<b>                              KUJAN (VOICE)\n</b>                 He was a corrupt cop, Verbal.\n\n<b>29 INT. RABIN'S OFFICE                                                  29\n</b>\n\n<b>                                  VERBAL\n</b>                 Sure. Fifteen years ago, but he was a\n                 good thief Anyway, the cops wouldn't let\n                 him go legit.\n\n<b>                                   KUJAN\n</b>                 Keaton was a piece of shit.\n\n\n<b>                                  VERBAL\n</b>                 You trying to get a rise out of me, Agent                  \n                 Kujan?\n\n<b>                              YELLOW 06/11/94\n</b>\n<b>                                                  34A.\n</b>\n<b>        \t\t\t          KUJAN\n</b>\t\t\tI just want to hear your story.\n\n<b>                                           YELLOW 06/11/94\n</b>\n\n<b>                                                              35.\n</b>\n<b>                             VERBAL\n</b>            It's right here.\n\n\n He taps a finger on the stack of paper that Kujan brought in.\n Kujan picks it up and thumbs through it.\n\n<b>                              KUJAN\n</b>            According to your statement you are a\n            short-con operator. Run of the mill\n            seams. Everything you do, you learned\n            from somebody else.\n\n<b>                              VERBAL\n</b>            That's been suppressed. Anything in there\n            is inadmissible.\n\n<b>                              KUJAN\n</b>            Oh, I know. Sweet deal you have. Total\n            immunity .\n\n<b>                              VERBAL\n</b>                           (laughing)\n            Well I do have the weapons charge. I'm\n            looking at six whole months hard time.\n\n<b>                              KUJAN\n</b>                           (smiling)\n            You know a dealer named Ruby Deemer,\n            Verbal?\n\n<b>                             VERBAL\n</b>            You know a religious guy named John Paul?\n\n<b>                              KUJAN\n</b>            You know Ruby is in Attica? \n\n<b>                       VERBAL\n</b>           He didn't have my lawyer.\n\n<b>                              KUJAN\n</b>           I know Ruby. He's very big on respect.\n           Likes me very much.\n\nVerbal sees this getting to something. His smiles fades.\n\n<b>                        KUJAN (CONT'D)\n</b>           Now I know your testimony was sealed.\n           Ruby is well connected. He still has\n           people running errands for him. What do\n           you think he'd say if he found out you\n           dropped his name to the D.A.?\n\n<b>                                             SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                36.\n</b>\n<b>                             VERBAL\n</b>           There's nothing in there about Ruby.\n\n<b>                             KUJAN\n</b>           I'11 be sure to mention that to him.\n\nVerbal is not smiling anymore. He stares at Kujan with utter\ncontempt, knowing he is being shafted.\n\n<b>                         KUJAN (CONT'D)\n</b>           The first thing I learned on the job,\n           know what it was? How to spot a murderer.\n           Let's say you arrest three guys for the\n           same killing. Put them all in jail\n           overnight. The next morning, whoever is\n           sleeping is your man. If you're guilty,\n           you know you're caught, you get some rest\n           - let your guard down, you follow?\n\n<b>                            VERBAL\n</b>           No.\n\n<b>                             KUJAN\n</b>           I'11 get right to the point. I'm smarter\n           than you. I'11 find out what I want to\n           know and I'11 get it from you whether you\n           like it or not.\n\n<b>                            VERBAL\n</b>           I'm not a rat.\n\nKujan puts his hand on the transcript of Verbal's confession.\nRabin walks in with a cup of coffee. Verbal takes it with his\ngood hand and sips it with a relish.\n\n<b>                         VERBAL (CONT'D)\n</b>           Ahhh. Back when I was picking beans in\n           Guatemala we used to make fresh coffee.\n           Right off the trees I mean. That was\n           good. This is shit, but hey...\n\n<b>                             RAB IN\n</b>           Can we get started again?\n\n<b>                             KUJAN\n</b>           Now what happened after the line-up?\n\nVerbal sneers at Kujan, unable to change the subject.\n\n\n<b>                                                 BLUE 06/01/94\n</b>\n\n<b>                                                                     37.\n</b>\n<b>30    EXT. POLICE STATION - NIGHT - NEW YORK - SIX WEEKS PRIOR         30\n</b>\n     Keaton stops at the top of the front steps of the police\n     station and lights a cigarette. Edie comes out behind him,\n     fuming mad.\n\n<b>                                   EDIE\n</b>                ...and the desk Sergeant is actually\n                trying to tell me he can't release you?\n                Can you believe that? You weren't even\n                charged. New York police - Jesus. I want\n                to take pictures of your face to bring to\n                the D.A. first thing in the morning.\n\n<b>                                 KEATON\n</b>                Just forget about it.\n\n     He looks across the street and sees Fenster and McManus\n     talking by a newsstand. McManus is thumbing through\n     magazines.\n\n<b>                                   EDIE\n</b>                Absolutely not.\n\n     Keaton looks to his right and sees Hockney trying to hail a\n     cab.\n\n<b>                              EDIE (CONT'D)\n</b>                I'11 have this thing in front of a grand\n                jury by Monday.\n\n<b>                                  KEATON\n</b>                Edie, please. I don't want to hear this\n                right now. What did Renault and Fortier                    \n                say?\n\n<b>                                   EDIE\n</b>                They want more time to think about\n                investing.\n\n<b>                                  KEATON\n</b>                Goddamnit.\n\n<b>                                   EDIE\n</b>                They just said they wanted time.\n\n<b>                                   KEATON\n</b>                Time for what, Edie? Time to look into me\n                a little more, that's what. No matter how\n                well you cover my tracks now, they'll\n                find out who I am.\n\n<b>                                              SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                38.\n</b>\n<b>                              EDIE\n</b>           Give me some credit. I got you this far,\n           let's go to the grand jury. This is never\n           going to stop if we -\n\n<b>                             KEATON\n</b>           No. It's never going to stop, period. It\n           won't take more than a week before every\n           investor in this city is walking away\n           from us. It's finished. I'm finished.\n\nJust then, Verbal bumps into him on his way out the door. He\nexcuses himself and hobbles down the steps, oblivious to who\nhe has bumped into as he tries to navigate the stairs.\n\n<b>                              EDIE\n</b>           Don't give up on me now, Dean.\n\n<b>                            KEATON\n</b>           They'll never stop.\n\n<b>                             EDIE\n</b>           I love you.\n\n<b>                             KEATON\n</b>                          (To himself)\n           They ruined me tonight.\n\n<b>                              EDIE\n</b>           Dean, I love you. Do you hear me?\n\nVerbal gets to the sidewalk and stops. He turns, realizing it\nis Keaton on the steps.\n\n<b>                         EDIE (CONT'D)\n</b>           Let's just go to my place. We'll worry\n           about this tomorrow.\n\nKeaton and Verbal look at one another for a moment. Keaton\nthen looks over to the newsstand and sees Fenster looking at\nhim.\n\n<b>                            KEATON\n</b>           Huh?\n\nMcManus notices Fenster and glances up from his magazine to\nsee what he is looking at.                                             +\n\n<b>                              EDIE\n</b>           Come home with me, please. Dean?\n\n<b>                                                   SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                     39.\n</b>\n      Keaton looks at Hockney who has one foot in a cab. He is\n      looking at Fenster and McManus who are looking at Keaton.\n      This makes Hockney look up at Keaton as well.\n\n      SUDDENLY, Edie tunes in to what is going on. She notices the\n      others on the street. She reaches over and takes Keaton by\n      the arm, pulling gently. She glares at the others.\n\n<b>                                   EDIE\n</b>                Come home, Dean.\n\n<b>                                  KEATON\n</b>                                (Distant)\n                Alright.\n\n      Verbal looks at everyone else from where he stands on the\n      street. Fenster, McManus and Hockney all look at him and then\n      at each other. It is a strange moment of unspoken\n      understanding.\n\n      All eyes finally turn to Keaton, high on the front steps of\n      the police station as he walks away with Edie.\n\n<b>31    INT. HALLWAY - DAY                                                   31\n</b>\n      Verbal stands in front of an apartment door. He hesitates for\n      a long moment before he knocks.\n\n      After a moment, the door opens and Keaton stands on the other\n      side of it. He is wearing a bathrobe and smoking a cigarette.\n\n      He looks at Verbal without any expression whatsoever.\n\n<b>                                  KEATON\n</b>                What are you doing here'! How did you find\n                me?\n\n\n<b>                                  VERBAL\n</b>                I just asked one of the detectives\n                downtown. He seemed pretty happy to tell\n\n                me.\n      Keaton curses under his breath and motions for Verbal to come\n      in.\n<b>                                                                            32\n</b><b>32    INT. EDIE'S APARTMENT\n</b>\n\n      Verbal walks in and sits down on the couch, watching Keaton\n      cautiously. He looks around the large apartment, beautifully\n      furnished and decorated.\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                40.\n</b>\nEdie walks into the room in a man's button-down shirt and\nsweat pants.\n\n<b>                             EDIE\n</b>           Dean, who was at the\n\nShe stops when she sees Verbal. Verbal stands and smiles\nnervously.\n\n<b>                            VERBAL\n</b>           How do you do?\n\n<b>                             KEATON\n</b>           Verb - Roger, this is Edie Finneran.\n           Edie, this is Roger Kint, he was at\n\n<b>                              EDIE\n</b>                             (Cold)\n           I know who he is.\n\n<b>                             VERBAL\n</b>           I hope I didn't disturb you.\n\n<b>                             EDIE\n</b>           I hope so, too, Mr. Kint. Can I get you\n           something to drink?\n\n<b>                             VERBAL\n</b>           A glass of water would be nice.\n\nEdie shoots a look at Keaton on her way out of the room.\nKeaton tries to hush his voice despite his anger.\n\n<b>                             KEATON\n</b>           What the hell do you want?\n\n<b>                             VERBAL\n</b>           I wanted to talk to you. The other guys -\n\n<b>                             KEATON\n</b>           I did you a favor by standing up for you\n           last night, but don't think we're\n           friends. I'm sorry, but I have other\n           things -\n\n<b>                             VERBAL\n</b>           They're gonna do a job. Three million\n           dollars, maybe more.\n\nKeaton is speechless. Verbal sits on the couch again.\n\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                41.\n</b>\n<b>                        VERBAL (CONT'D)\n</b>           They sent me to offer you a cut. We could\n           use a fifth man - a driver - That's all\n           you'll do.\n\nEdie walks in with a glass of ice water and hands it to\nVerbal.\n\n<b>                       VERBAL (CONT'D)\n</b>           Thank you.\n\nVerbal drinks slowly. Edie stands over him, her face blank.\nIt is an awkward moment. She deliberately makes Verbal\nuncomfortable.\n\n<b>LONG PAUSE - FINALLY:\n</b>\n\n<b>                              EDIE\n</b>           So what is it you do, Mr. Kint?\n\n<b>                            VERBAL\n</b>           Umm ...\n\n<b>                              EDIE\n</b>           A hijacker like Dean, here? Or something\n           more creative?\n\n<b>                            KEATON\n</b>           That's enough, Edie.\n\n<b>                              EDIE\n</b>                             (Angry)\n           I don't know what you came here for, but\n           we won't have any part of it.\n\n<b>                            KEATON\n</b>           Edie, please.\n\nKeaton takes Edie by the arm and tries to guide her toward\nthe other room. She pulls away, anger turning to rage.\n\n<b>                              EDIE\n</b>           I've spent the last year of my life\n           putting his back together again - I won't\n           have you come in here and - What makes\n           you think - GET OUT. GET OUT OF m HOME.\n<b>           HOW DARE YOU COME HERE?\n</b>\nKeaton is pulling her now. She yanks her arm away and shoves\nhim.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              42.\n</b>\n<b>                             EDIE\n</b>           Don't touch me. Just don't,\n\nShe turns and walks out of the room. Somewhere in the back of\nthe apartment, a door slams.\n\nKeaton turns and glares at Verbal. Verbal cringes.\n\n<b>                            KEATON\n</b>           Get out.\n\n<b>                            VERBAL\n</b>           If you'll just let me -\n\nSUDDENLY, KEATON LUNGES. He grabs Verbal by the lapels and\nlifts him off the couch, moving him effortlessly across the\nroom and slamming him into the wall next to the front door.\nHe opens it.\n\n<b>                       VERBAL (CONT'D)\n</b>           Don't hurt me.\n\n<b>                             KEATON\n</b>                           (Seething)\n           Hurt you, you sonofabitch? I could kill\n           you.\n\nKeaton starts to shove Verbal out the door.\n\n\n<b>                             VERBAL\n</b>                           (Quickly)\n           They're going to hit the Taxi Service.\n\nKeaton freezes. LONG PAUSE.\n\n\n<b>                             VERBAL\n</b>           New York's Finest Taxi Service.\n\n\n<b>                             KEATON\n</b>           They - That's bullshit. They don't\n           operate anymore.\n\n<b>                             VERBAL\n</b>           McManus has a friend in the Fourteenth\n           Precinct. They're coming out for one job\n           - Thursday. They're picking up a guy\n           smuggling emeralds out of South America.\n           Fenster and McManus have a fence set to\n           take the stuff.\n\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              43.\n</b>\n<b>                            KEATON\n</b>           What fence? Who?\n\n<b>                             VERBAL\n</b>           Some guy in California. His name is\n           Redfoot.\n\n<b>                            KEATON\n</b>           Never heard of him.\n\nKeaton moves to throw Verbal out. Verbal grabs Keaton and\nholds tight.\n\n<b>                            VERBAL\n</b>           You have to come.\n\n<b>                             KEATON\n</b>           What's with you? What do you care whether\n           I come or not?\n\n\n<b>                             VERBAL\n</b>           They - They don't know me. You do. They\n           won't take me unless you go. Look at me.\n           I need this.\n\n<b>                            KEATON\n</b>           Tough break.\n\n<b>                             VERBAL\n</b>           Don't tell me you don't need this. Is\n           this your place?\n\nKeaton is unable to answer.\n\n\n<b>                        VERBAL (CONT'D)\n</b>           They're never going to stop with us, you\n           know that. This way we hit the cops where\n           it hurts and get well in the mean time.\n\nKeaton lets Verbal go and steps back, thinking.\n\n<b>                        VERBAL (CONT'D)\n</b>           As clean as you could ever get, they'll\n           never let you go now.\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                44.\n</b>                        VERBAL (cont'd)\n           I'm not knocking you. You look like\n           you've got a good little seam going with\n           this lawyer -\n\nWHAM. Keaton punches Verbal in the stomach and drops him to\none knee. Verbal coughs and tries to find his breath.\n\n<b>                             KEATON\n</b>           You watch your mouth.\n\n<b>                             VERBAL\n</b>                            (Gasping)\n           Okay, okay. You say it's the real thing?\n           That's cool.\n\nKeaton reaches for Verbal. Verbal flinches. Keaton gently\nhelps him up and guides him to the couch. They bath sit.\n\nKeaton reaches for a pack of cigarettes and lights one for\neach of them.\n\n<b>                            KEATON\n</b>           I apologize.\n\nVerbal takes one and has a few drags, catching his breath and\nrubbing his stomach in pain.\n\n<b>FINALLY:\n</b>\n<b>                            VERBAL\n</b>           I was out of line.\n\n<b>                             KEATON\n</b>           You okay?\n\n<b>                            VERBAL\n</b>           I'11 be alright.\n\n<b>                             KEATON\n</b>           Well, I'm sorry.\n\n<b>                             VERBAL\n</b>           Forget it.\n                             (Beat)\n           I'11 probably shit blood tonight.\n\nKeaton laughs. Verbal thinks about it for a moment and laughs\nwith him.\n\nKeaton's laughter trails off. He thinks for a moment.\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                      45.\n</b>\n<b>                                   KEATON\n</b>                 How are they going to do it?\n\n<b>                                   VERBAL\n</b>                 McManus wants to go in shooting. I said\n                 no way.\n\n<b>                                  KEATON\n</b>                 Fenster and Hockney?\n\n<b>                                   VERBAL\n</b>                 They're pretty pissed off. They'll do\n                 anything. Now I got a way to do it\n                 without killing anyone:\n                                           but like I said,\n                 they won't let me in without you.\n\n<b>                                   KEATON\n</b>                 Three million?\n\n<b>                                  VERBAL\n</b>                 Maybe more.\n\n<b>                                   KEATON\n</b>                 No killing?\n\n<b>                                  VERBAL\n</b>                 Not if we do it my way.\n\n<b>     LONG PAUSE\n</b>\n\n<b>                                   KEATON\n</b>                             (Lost in thought)\n                 I swore I'd live above myself.\n\n     Verbal smiles, knowing he has him.\n\n<b>33 EXT. KENNEDY AIRPORT - DAY                                          33\n</b>\n\n<b>                              VERBAL (V.O.)\n</b>                 New York's finest Taxi Service was not\n                 your normal taxi service. It was a ring\n                 of corrupt cops in the N.Y.P.D. that ran\n                 a high-profit racket, driving smugglers\n                 and drug dealers all over the city. For a\n                 few hundred dollars a mile, you got your\n                 own black and white and a police escort.\n                 They even had their own business cards.\n\n     OSCAR WHITEHEAD, a tall gray-haired man in his fifties comes\n     out of the international terminal in a white linen suit. He\n     holds a large suitcase in his right hand.\n\n<b>                                                 BLUE 06/01/94\n</b>\n<b>                                                                     46.\n</b>\n<b>                              VERBAL (V.O.)\n</b>                After a while, somebody started asking\n                questions and the taxi service shut down.\n                Ever since then, Internal Affairs had\n                been waiting to catch them in the act.\n\n     Oscar stands on the curb long enough to light a cigarette.\n     After a moment, a POLICE CRUISER pulls up to him. He opens\n     the back door and gets in.\n\n<b>                              VERBAL (V.O.)\n</b>                And that was how we started. McManus came\n                to us with the job; Fenster got the vans;\n                Hockney supplied the hardware; 'I came\n                through with how to do it so no one got\n                killed - but Keaton - Keaton put on the\n                finishing touch. A little \"Fuck you\" from\n                the five of us to the N.Y.P.D.\n\n     The car drives out of the airport. A VAN follows at a                \n     distance.\n\n<b>34    INT. POLICE CAR                                                      34\n</b>\n     SERGEANT JIM STRAUSZ, a meaty, imposing looking man in his\n     forties drives the car. Beside him is a thin, greasy looking\n     PATROLMAN, STEVE RIZZI. They are two drivers for New York's\n     Finest Taxi Service.\n\n<b>                                  RIZZI\n</b>                How was the flight?\n\n     Oscar hands Rizzi a thick envelope.\n\n<b>                                   OSCAR\n</b>                Will that get me to the Pierre?\n\n     Rizzi counts the stack of hundred dollar bills in the\n     envelope .\n\n<b>                                  RIZZI\n</b>                That'll get you to Cape God.\n\n     The two men laugh. Strausz watches the road, expressionless.\n<b>35 EXT. HIGHWAY                                                            35\n</b>     The cruiser heads towards the heart of Manhattan.\n\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                    47.\n</b>\n<b>36 EXT. STREET - LATER\n</b><b>                                                                            36\n</b>\n      The police car makes its way down a wide, abandoned street. A\n      WHITE MINIVAN pulls out behind it and heads the same way.\n\n<b>37 INT. POLICE CAR\n</b><b>                                                                            37\n</b>\n      Strausz looks in the rear-view mirror. The white minivan is\n      flashing his high-beams.\n\n<b>                                  STRAUSZ\n</b>                 What the\n\n<b>                                   RIZZI\n</b><b>                 LOOK OUT.\n</b>\n      Strausz looks in front of him. A green minivan swerves in\n      front of them from out of nowhere. Strausz slams on the\n      brakes and skids to a halt. The white minivan rams them from\n      behind.\n\n      Strausz and Rizzi are stunned for a moment as two more vans\n      screech up on either side of the cruiser, boxing it in with\n      only a few inches between them.\n\n      The cruiser is surrounded on all sides.\n\n      SUDDENLY, SHOTGUN BARRELS come through the open windows. They\n      come to rest, one on Strausz's left temple one on Rizzi's\n      right. RIZZI looks out of the corner of his eye.\n\n      He sees the driver of the van next to him holding the shotgun\n      with one hand. A stocking is over the driver's head.\n\n      Strausz looks straight ahead. The minivan in front of them is\n      missing a back window. Another man with a stocking on his\n      head aims a sub-machine gun at them from inside.\n\n      By the twisted right hand holding the front of the gun, we\n      know it is Verbal.\n\n      Strausz and Rizzi raise their hands without being asked.\n\n<b>38    EXT. STREET                                                           38\n</b>\n      The driver of the white van gets out with a gallon jug in one\n      hand and a sledge hammer in the other.\n\n      Moving like lightning, he jumps onto the roof of the police\n      car\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                      48.\n</b>\n     'He stands on the front of the roof and swings the hammer\n     down.\n\n<b>39 INT. POLICE CAR\n</b><b>                                                                            39\n</b>\n\n<b>     SMASH\n</b>\n     The hammer punches three huge holes in the windshield and\n     finally caves it in. Strausz and Rizzi are covered with\n     pebbles of broken glass. Whitehead clutches his bag in the\n     back seat. He trembles in terror.\n\n     The man standing on the roof doubles over and sticks a gun in\n     Strausz's face. His face hangs upside down and looks gruesome\n     - covered from the mouth up in a stocking. By the voice, we\n     know it is McManus.\n\n                                  McManus\n<b>                 GIVE ME THE SHIT.\n</b>\n<b>                                  STRAUSZ\n</b>                 Give it up.\n\n     Oscar hands the suitcase up front and Strausz passes it to\n     McManus.\n\n<b>40 INT. FRONT VAN\n</b><b>                                                                            40\n</b>\n     Through the front windshield of the front van we see Keaton\n     at the wheel. Verbal is behind him leaning out the back\n     window.\n\n     Beneath Keaton's stocking mask we see he is trembling and\n     sweating - sickened by what he is doing.\n\n     He glances up at the rear-view mirror and looks at the scene\n     outside. He looks down at the floor in shame, shaking his\n     head.\n\n<b>41 INT. POLICE CAR                                                       41\n</b>\n                                  McMANUS\n                 The money.\n\n     Strausz looks at Rizzi.\n\n                             McMAMJS (CONT'D)\n<b>                 THE MONEY. LET'S HAVE IT.\n</b>\n     Rizzi hands the money through the remains of the windshield.\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   49.\n</b>\n      McManus takes the money and stuffs it in his jacket. He steps\n      back and takes the cap off of the gallon jug. He quickly\n      pours some kind of liquid all over the roof of the car.\n\n<b>                                  STRAUSZ\n</b>                 Do you know who I am?\n\n      A hand reaches into the driver's side window and rips\n      Strausz's badge off of his shirt.\n\n      Strausz dares to turn his head right at the shotgun pointing\n      at him through the window. On the other end is a masked and\n      smiling Todd Hockney.\n\n<b>                                  HOCKNEY\n</b>                 We db now, Jerk-off.\n\n      McManus lights a pack of matches and drops them on the roof\n      of the car as he jumps off. THE LIQUID IGNITES, the roof of\n      the car is instantly in flames.\n\n      Strausz and Rizzi attempt to bail out, but the vans are too\n      close for them to open the doors.\n\n      The vans pull away.\n      Strausz and Rizzi escape from the car.\n      Oscar is trapped inside, SCREAMING.\n      Strausz and Rizzi stop, each expecting the other to go let\n      Oscar out.\n\n<b>42    EXT. STREET - LATER                                                  42\n</b>\n      The scene is swarming with fresh police cars. Strausz and\n      Rizzi are fielding questions from a dozen other cops.\n\n      Photographers are everywhere.\n\n<b>                              VERBAL (V.O.)\n</b>                 The papers got Keaton's call that day and                  \n                 were on the scene before the cops were.\n                 Strausz and Rizzi were indicted three\n                 days later. Within a few weeks, fifty\n                 more cops went down with them. It was\n                 beautiful. Everybody got it right in the\n                 ass, from the chief on down.\n\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   50.\n</b>\n<b>43 INT. GARAGE - NIGHT\n</b><b>                                                                           43\n</b>\n     Hockney, Fenster, McManus and Verbal are all laughing in a\n     secluded garage. They are still in their black clothes from\n     the robbery. Hockney is throwing everyone a can of beer.\n\n     Keaton sits off by himself. He watches the others, unable to\n     join in the festivities.\n\n     The others sit around a cheap card table. It is covered with\n     emeralds. Dozens of them. Everyone is in awe.\n\n                                 McManus\n                There's more than I thought.\n\n<b>                                 HOCKNEY\n</b>                When does the fence come?\n\n                                 McMANUS\n                Redfoot? He never comes to see me. I have\n                to go see him.\n\n<b>                                 VERBAL\n</b>                In California?\n\n                                 McMANUS\n                Yeah. It'll take a few days. Me and\n                Fenster\n\n<b>                                 HOCKNEY\n</b>                Hold the fuckin' phone. You and Fenster?\n                No, no, no.\n\n                                 McMANUS\n                Guys, come on.\n\n<b>                                 HOCKNEY\n</b>                I'm sure you can understand my\n                hesitation.\n\n<b>                                 FENSTER\n</b>                Then who goes?\n\n<b>                                 HOCKNEY\n</b>                We all go. How about it, Keaton?\n\n     All eyes turn to Keaton. He comes out of his trance.\n\n<b>                                 KEATON\n</b>                We need to lay low for a while.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   51.\n</b>\n                                 McMANUS\n                Fine with me.\n\n<b>     PAUSE\n</b>\n     Everyone looks at each other, their moment of distrust\n     blowing over. All eyes drift back to the emeralds on the\n     table.\n\n     Hockney begins to snicker, then McManus, then Fenster. Verbal\n     joins in at last.\n\n     McManus grabs Verbal and hugs him, shaking him violently.\n\n                            McMANUS (CONT'D)\n                My boy with the plan.\n\n     SUDDENLY, everyone yells and pours beer over Verbal's head.\n     He laughs as he is drenched in white foam, nearly choking as\n     the others chant his name.\n\n     Keaton watches from across the room, trying to smile in vain.\n<b>44   SCENE DELETED                                                      44'\n</b><b>45   INT. WAITING ROOM - LAW OFFICE - DAY                               45'\n</b>     Keaton and Verbal sit side by side on a sofa. A sign on the\n     door behind them reads: MONTGOMERY and LaGUARDIA - ATTORNEYS  \n<b>     AT LAW.\n</b>\n<b>                                  VERBAL\n</b>                We're going to miss the flight.\n\n<b>                                  KEATON\n</b>                We'll make it.\n\n<b>                                  VERBAL\n</b>                Don't do this. Send her a card -\n                something.\n\n<b>                                  KEATON\n</b>                We'll make it.\n\n<b>                               VOICE (O.S.)\n</b>                Ms. Finneran will be with you in a                          \n                moment.\n\n     Keaton stands and paces across the waiting room. He comes to\n     a set of glass doors and looks through them.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n                                                             51a.\n\nKeaton realizes he is standing on a balcony overlooking a\nlibrary below.                                                        \n\nHe sees Edie working in the library with an old woman. The\ntwo women talk for a moment.                                          \n\nSUDDENLY, Keaton turns with a start. Verbal is standing\nbehind him.\n\n<b>                            VERBAL                                     \n</b>           We're gonna miss the plane.                                \n                             (beat)\n           She'll understand.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   52.\n</b>\n      Edie is smiling and laughing with the old woman.                   \n      Keaton's face is marked with guilt and anguish.\n      Keaton turns and walks out of the waiting room. Verbal takes        \n      one last glance at Edie and turns back to Keaton.                   \n\n<b>                                                                           46\n</b><b>46    INT. LIBRARY\n</b>\n\n      Edie seems to sense something behind her. She turns and looks\n      through the glass doors and up into the waiting room.\n\n      NOTHING IS THERE. She goes back to chatting with the old\n      woman.\n\n\n<b>47    INT. RABIN'S OFFICE -DAY - LOS ANGELES - PRESENT                 47\n</b>\n\n<b>                                  KUJAN\n</b>                Heartwarming. Really, I feel weepy.\n\n<b>                                  VERBAL\n</b>                You wanted to know what happened after\n                the line-up, I'm telling you.\n\n<b>                                  KUJAN\n</b>                Oh come on, Verbal. Who do you think\n                you're talking to? You really expect me\n                to believe he retired? For a woman?\n                Bullshit. He was using her.\n\n<b>                                 VERBAL\n</b>                He loved her.\n\n<b>                                  KUJAN\n</b>                Sure. And I'm supposed to believe that\n                hitting the Taxi Service wasn't his idea\n\n                either.\n\n<b>                                  VERBAL\n</b>                That was all Fenster and McManus.\n\n<b>                                  KUJAN\n</b>                Come on. Keaton was a cop for four years.\n                Who else would know the Taxi Service\n\n<b>                                           PINK 06/07/94\n</b>\n<b>                                                                53.\n</b>                        KUJAN (cont'd)\n          better? That job had his name all over\n          it.\n\n<b>                            VERBAL\n</b>          You keep trying to lay this whole ride on                 t\n          Keaton. It wasn't like that. Sure he                       \n          knew, but Edie had him all turned around.                 r\n          I'm telling you straight, I swear.                        +\n\n<b>                            KUJAN\n</b>          Let me tell you something. I know Dean                     \n          Keaton. I've been investigating him for                    \n          three years. The guy I know is a cold-                    +\n          blooded bastard. L.A.P.D. indicted him on                   \n          three counts of murder before he was                       \n          kicked off the force, so don't sell me                     \n          the hooker with the heart of gold.                        +\n\n<b>                           VERBAL\n</b>          You got him wrong.\n\n<b>                            KUJAN\n</b>          Do I? Keaton was under indictment a total                 +\n          of seven times when he was on the force.                  +\n          In every case, witnesses either reversed                  +\n          their testimony to the grand jury or died                 +\n          before they could testify. When they                      t\n          finally did nail him for fraud, he spent                  +\n          five years in Sing Sing. He killed three                   \n          prisoners inside - one with a knife in                     \n          the tailbone while he strangled him to                    \n          death. Of course I can't prove this but I                  \n          can't prove the best part either.                          \n\nKujan pauses to drink some coffee.\n\n<b>                        KUJAN (CONT'D)\n</b>          Dean Keaton was dead. Did you know that?                  r\n          He died in a fire two years ago during an\n          investigation into the murder of a                         \n          witness who was going to testify against                   \n          him. Two people saw Keaton enter a\n          warehouse he owned just before it went\n\n          up. They said he had gone in to check a                   +\n          leaking gas main. It blew up and took all\n          of Dean Keaton with it. Within three\n          months of the explosion, the two\n          witnesses were dead, one killed himself\n          in his car and the other fell down an\n          open elevator shaft.\n\n<b>                                                 PINK 06/07/94\n</b>\n<b>                                                                      53A.\n</b>\n\n<b>                                                                           48 \n</b><b>48    SCENE DELETED\n</b>\n\n<b>49    SCENE DELETED/DIALOGUE MOVED - BOTTOM SCENE 47                    49\n</b>\n<b>                                                 PINK 06/07/94\n</b>\n\n<b>                                                                      54.\n</b>\n<b>50 INT. WORKSHOP                                                        50\n</b>     Rabin and Louis look at one another as they listen.                   \n                           KUJAN (On Speaker)\n                Six weeks ago I get an anonymous call\n                telling me I can find Keaton eating at\n                Mondino's with his lawyer, and there he\n                is. Now because he never profited from\n                his alleged death and because someone\n                else was convicted for the murder we\n                tried to pin on Keaton, we had to let him\n\n                go.\n\n<b>51 INT. RABIN'S OFFICE                                                  51\n</b>\n<b>                              KUJAN (CONT'D)\n</b>                He was dead just long enough for a murder\n                rap to blow over, then he had lunch.\n\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                55.\n</b>\n<b>                            VERBAL\n</b>           I don't know about that.\n\n<b>                             KUJAN\n</b>           I don't think you do. But you say you saw\n           Keaton die. I think you're covering his\n           ass and he's still out there somewhere. I\n           think he was behind that whole circus in\n           the harbor. My bet is he's using you\n           because you're stupid and you think he's\n           your friend. You tell me he's dead, so be\n           it. I want to make sure he's dead before\n           I go back to New York.\n\n<b>                             VERBAL\n</b>                           (Blurting)\n           He wasn't behind anything. It was the\n           lawyer.\n\n<b>                             KUJAN\n</b>           What lawyer?\n\n<b>PAUSE\n</b>\n<b>                        KUJAN (CONT'D)\n</b>           What lawyer, Verbal?\n\nVerbal stammers for a moment, looking around wildly.\n\n<b>                             VERBAL\n</b>           Back when I was in that barber shop\n           quartet in Skokie, Illinois I used to\n           have\n\nKujan grabs Verbal's shirt and yanks him half out of his\nseat.\n\n<b>                             KUJAN\n</b>           You think I don't know you held out on\n           the D.A.? What did you leave out of that\n           testimony? I can be on the phone to Ruby\n           Deemer in ten minutes.\n\n<b>                            VERBAL\n</b>           The D.A. gave me immunity.\n\n<b>                             KUJAN\n</b><b>           NOT FROM ME, YOU PIECE OF SHIT. THERE IS\n</b>           NO IMMUNITY FROM ME. You atone with me or\n           the world you live in becomes the hell\n           you fear in the back of your tiny mind.\n           Every criminal I have put in prison,\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                  56.\n</b>                              KUJAN (cont'd)\n\n                every cop who owes me a favor, every\n                creeping scumbag that works the street\n                for a living, will know the name of\n                Verbal Kint. You'll be the lowest sort of\n                rat, the prince of snitches, the loudest\n                cooing stool pigeon that ever grabbed his\n                ankles for the man. Now you talk to me,\n                or that precious immunity they've seen so\n                fit to grant you won't be worth the paper\n                the contract put out on your life is\n                printed on.\n\n      Verbal looks at Kujan with utter contempt.\n\n<b>                                 VERBAL\n</b>                There was a lawyer. Kobayashi.\n\n<b>                                  KUJAN\n</b>                Is he the one that killed Keaton?\n\n<b>                                  VERBAL\n</b>                No. But I'm sure Keaton's dead.\n\n<b>                                  KUJAN\n</b>                Convince me. Tell me every last detail.\n<b>52    SCENE DELETED                                                              52\n</b><b>      53    INT. HOSPITAL - DAY                                                  53\n</b>      (&lt;&lt;  &gt;&gt; DENOTES LINES SPOKEN IN HUNGARIAN)                        +\n      Kovash's room is now filled with people. Jack Baer stands\n      next to DANIEL METZHEISER, a balding man in his forties. Next\n      to him is Doctor Plumber. Across from her is Ridgly Waiters.\n\n      Sitting beside the bed is TRACY FITZGERALD, a casually\n      dressed woman in her late twenties. She holds a 15x20 inch\n      drawing pad on her lap.\n\n      Police fill the hall. People are talking loudly outside.\n      LIONEL BODI, a cop in his mid-twenties pushes his way in.\n\n<b>                                   BAER\n</b>                Are you the translator?\n\n<b>                                  BODI\n</b>                Patrolman Lionel Bodi, sir.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              57.\n</b>\n<b>                             PLUMBER\n</b>           Agent Beer, this is getting out of hand.\n\n<b>                              BAER\n</b>           I'11 see to it we're gone before he blows\n           his porch light, Doctor.\n\nBaer gestures to Tracy.\n\n<b>                              BAER\n</b>                             (To Bodi)\n           This is Tracy Fitzgerald. She's a\n           composite sketch artist from county.\n\nThe young couple smile at one another nervously.\n\n<b>                              BODI\n</b>           Hi.\n\n<b>                             TRACY\n</b>           Hi.\n\n<b>                           METZHEISER\n</b>                          (Impatient)\n           I've got a noon meeting, Baer.\n\n<b>                            PLUMBER\n</b>           Agent Baer, please.\n\n<b>                              BAER\n</b>           Everyone calm down.\n                           (To Bodi)\n           Ask this man about the shoot-out in the\n           harbor.\n\n<b>                              BODI\n</b>           &lt;&lt;My name is Bodi. How are you'&gt;&gt;\n\nKovash smiles with relief when he hears his own language.\n\n<b>                             KOVASH\n</b>           &lt;&lt;How am 17 You are as stupid as that\n           one, but at least I can talk to you.&gt;&gt;\n\n\n<b>                              BODI  \n</b>           &lt;&lt;You'll be alright. He is from the\n           F.B.I. He is here to help you. He wants\n           to know what happened in the harbor.&gt;&gt;\n\n\n<b>                            KOVASH                                    \n</b>           &lt;&lt;We were there to buy a man and take him                  \n           back to Hungary.&gt;&gt;\n\n<b>                               YELLOW 06/11/94\n</b>\n<b>                                                  57A.\n</b>\n<b>                  \t        BODI\n</b>           He says they were buying It doesn't\n           make sense. I'm sorry, I'm a little\n           rusty. They were there to buy something.\n\n<b>                            BAER\n</b>           Dope, we know.\n\n<b>                            KOVASH +\n</b>           &lt;&lt;You don't understand me either? God\n           help me, they are all idiots.                             s\n                       (talking slowly)                              +\n           We were there to buy a man, you simple\n           boy. A witness. I don't know his name. A\n           witness who knew the Devil.&gt;&gt;                              \n\n<b>                              BODI\n</b>           Not dope. Something else. Some what?.. He\n           doesn't knob what they were buying. But\n           not dope... people.\n\n<b>                            KOVASH                                    \n</b>           &lt;&lt;I'll tell you everything. I'11 even say                  \n           it slow enough for you to understand it.\n           Just tell this man I want protection.                      \n           Real protection.&gt;&gt;                                         \n\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              58.\n</b>\n<b>                          METZHEISER\n</b>           Your witness is whacked, Baer.\n\n<b>                              BODI\n</b>           He says he'll tell us everything he knows\n           if we protect him.\n\n<b>                             .BAER\n</b>           Tell him fine.\n\n<b>                             BODI  \n</b>           &lt;&lt;He says that is fine.&gt;&gt;\n\n\n<b>                            KOVASH  \n</b>           &lt;&lt;No, no, no. I need a guarantee from the\n           ridiculous man. I am going to be killed.\n           I have seen the Devil and looked him in\n           the eye.&gt;&gt;                                               \n\n<b>                              BODI\n</b>           No good. He needs guarantees. He says...\n           his life is in danger... He has seen the\n           Devil... looked him in the eye.\n\n<b>                          METZHEISER\n</b>           I'11 be on my way.\n\nBaer grabs Metzheiser by the arm.\n\n<b>                              BAER\n</b>                            (To Bodi)\n           Tell him to tell this man what he was\n           telling me before. Who is the Devil? Who\n           did he see?\n\n<b>                              BODI  \n</b>           &lt;&lt;Who is this Devil you keep talking\n           about?&gt;&gt;  \n\n<b>                             KOVASH\n</b>           Keyser Soze He was in the harbor                         \n           shooting everyone in sight.&gt;&gt;                            \n\nMetzheiser is suddenly interested.                                  \n\n<b>                              BODI\n</b>           He says he saw him in the harbor. He was\n           shooting... Killing... Killing many men.\n\n<b>                            METZHEISER\n</b>           Did he say Keyser Soze? He saw Keyser\n           Soze\n\n<b>                               YELLOW 06/11/94\n</b>\n\n<b>                                                  58A.\n</b>\n<b>                              BODI\n</b>           He says he saw him in the harbor. He was\n           shooting... Killing... Killing many men.\n\n<b>                           METZHEISER\n</b>           Did he say Keyser Soze? He saw Keyser\n           Soze.\n\n<b>                             KOVASH\n</b>           &lt;&lt;Keyser Soze. Keyser Sate. I've seen his\n           face. I see it when I close my eyes.&gt;&gt;\n\n<b>                   BODI\n</b>           He says he knows his face. He sees it\n           when he closes his eyes.\n<b>           \n</b><b>                              YELLOW 06/11/94\n</b>\n\n<b>                                                                   59.\n</b>\n<b>                                METZHEISER\n</b>                Ask him what this Devil looks like.\n\n<b>                                   BAER\n</b>                                (To Tracy)\n                Ready?\n\n     Tracy holds up her pad and pencil. She nods.\n\n<b>54 EXT. LOS ANGELES SKYLINE - DAY - FIVE WEEKS PRIOR\n</b><b>                                                                            54\n</b>\n\n<b>                              VERBAL (V.O.)\n</b>                McManus' fence was this guy named\n                Redfoot. He had a good reputation around\n                L.A. Seemed like a good guy - Looked like\n                a cowhide full of thumbtacks.\n\n<b>55    EXT. FRIENDSHIP BELL - NIGHT                                    55'\n</b>     All five guys stand in a group. It is utterly quiet.\n     An old but well kept Cadillac creeps into the lot from the\n     far end and idles up to them. The windows are tinted too much\n     to see in. The car passes within a few feet of them and\n     drives on.\n\n     A moment later, a chrome and leather monster of a Harley\n     Davidson pulls into the lot. The rider is dressed in an\n     almost comical array of leather, silver and suede.\n\n     He waves to the Caddy as it parks a few yards from Keaton and\n     the others. It sits quietly, almost menacing.\n\n     As he gets closer, we can see he is wearing one black boot\n     and one red. Keaton is still looking at them when the bike\n     pulls up to them and stops.\n\n     REDFOOT and McManus shake hands.\n\n<b>                                 REDFOOT\n</b>                How've you been?\n\n                                 McMANUS\n                Good. You?\n\n<b>                                 REDFOOT\n</b>                Alright. How's it going, Fenster?\n\n<b>                                 FENSTER\n</b>                Getting by.\n\n\n<b>                                              SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                60.\n</b>\n<b>                            REDFOOT\n</b>           You got it?\n\nMcManus holds up a briefcase.\n\nRedfoot takes it and gets off the bike. He walks over to the\nCaddy. The door of the Caddy opens. Redfoot hands the case to\nSomeone inside that we cannot see. The door closes.\n\n<b>                             KEATON\n</b>                          (Whispering)\n           Snazzy dresser this guy.\n\nA moment later, the door of the Caddy opens again. Someone\nhands Redfoot a different briefcase and he walks back over to\nMcManus.\n\nHe hands him the case.\n\nMcManus hands the case back to Hockney. Hockney opens it,\nrevealing the stacks of money inside.\n\n<b>                            REDFOOT\n</b>           You must be Keaton.\n\n                             McMANUS\n           Jesus, I'm sorry. Redfoot, this is Dean\n           Keaton, that's Todd Hockney, and that's\n           Verbal Kint.\n\n<b>                             REDFOOT\n</b>                          (To Verbal)\n           The man with the plan.\n\nVerbal smiles.\n\n<b>                       REDFOOT (CONT'D)\n</b>           Are you guys interested in more work?\n\nMcManus moves to answer, but Keaton cuts him off.\n\n<b>                             KEATON\n</b>           We're on vacation.\n\n<b>                             REDFOOT\n</b>           I've got a ton of work and no good\n           people.\n\n                            McMANUS\n           What's the job?\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                61.\n</b>\nKeaton shoots McManus a foul look. McManus pretends not to\nnotice.\n\n<b>                             REDFOOT\n</b>           A jeweler out of Texas named Saul. He\n           rents a suite at a hotel downtown and\n           does free appraisals. Buys whatever he\n           can. Word is he moves with a lot of cash.\n           I'11 take the merchandise, you keep the\n           green.\n\n<b>                            HOCKNEY\n</b>           Security?\n\n<b>                            REDFOOT\n</b>           Two bodyguards. Pretty good.\n\n                             McMANUS\n           Give us time to check it out?\n\n<b>                            REDFOOT\n</b>           I'd expect nothing less.\n\n                            McMANUS\n           We'll call you.\n\n<b>                            REDFOOT\n</b>           Take your time. Enjoy L.A.\n\n<b>                             KEATON\n</b>           A friend of mine in New York tells me you\n           knew Spook Hollis.\n\n<b>                             REDFOOT\n</b>           I hear you did time with old Spook. Yeah,\n           he was a good egg. I used to run a lot of\n           dope for him. Fuckin' shame he got\n           shivved.\n\n<b>                            KEATON\n</b>           I shivved him.\n\nNow McManus is shooting the angry look at Keaton.\n\n<b>                        KEATON (CONT'D)\n</b>           Better you hear it from me now than\n           somebody else later.\n\n<b>                            REDFOOT\n</b>           Business or personal?\n\n<b>                                              SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                62.\n</b>\n<b>                            KEATON\n</b>           A little of both.\n\n<b>                            REDFOOT\n</b>           Ain't it a crime? Call if you're\n           interested.\n\nRedfoot fires up his bike and takes off with the Caddy close\nbehind.\n\n                            McMANUS\n                          (To Keaton)\n           What's your fucking problem?\n\n<b>                            KEATON\n</b>           One job, that was the deal.\n\n                            McMANUS\n           Take it as it comes, brother.\n\n<b>                            KEATON\n</b>           This is bullshit.\n\nMcManus laughs and walks away. Fenster and Hockney follow.\nVerbal turns to Keaton.\n<b>                            VERBAL\n</b>           What is it Keaton?\n\n<b>                            KEATON\n</b>                            (Distant)\n           Something - I don't know.\n                       (Shaking himself)\n           I ever tell you about the restaurant I\n           wanted to open?\n\nKeaton walks off. Verbal follows him in confusion.\n\n<b>                         VERBAL (V.O.)\n</b>           L.A., was good for about two hours. We\n           were from New York. There's no place to\n           eat after one; you can't get a pizza that\n           doesn't taste like a fried fruit-bat, and\n           the broads don't want to know you if you\n           don't look like a broad. Within a few\n           days the last of us was ready to go back\n           to N.Y., but Keaton wouldn't have it, so\n           he really didn't have a choice. We went\n           to work.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   63.\n</b>\n<b>                                                                          56\n</b><b>56   INT. PARKING GARAGE - NIGHT\n</b>\n     McManus walks along a line of cars. He comes across a black\n     Mercedes and stops. He looks down at the license plate and\n     walks over to the next car, a green Honda. He pulls a slim-\n     jim out of his jacket and pops the lock an the Honda. He\n     reaches in and opens the hood. He walks around and sticks his\n     head in the engine.\n\n<b>57   INT. VAN                                                             57\n</b>\n     Verbal sits behind the wheel. Keaton is beside him. Hockney\n     and Fenster are in the back. They all watch McManus from\n     where they are parked a few dozen yards away.\n\n<b>58   INT. PARKING GARAGE                                                  58\n</b><b>     DING-DING\n</b>     The elevator bell sounds at the far end of the garage. The\n     doors open. Two men in ill-fitting suits get out and look\n     around cautiously. The first is TUCCI, a big bellied, white\n     haired menace. The other is HIGHAM, lean and bad skinned.\n     They are bodyguards and give it away by their every careful\n     move.\n\n     They turn back to the elevator and motion to someone inside.\n\n     Out walks SAUL BERG, a slightly overweight man in his forties\n     with an open collar silk shirt and a thick gold chain on his\n     hairy chest. He carries a LARGE ALUMINUM BRIEFCASE.\n\n     He lets his guards do the worrying. He walks straight to his\n     car.\n     Saul passes McManus under the hood of the Honda. He takes out\n     his keys and pushes a button on his key chain. The Mercedes\n     beeps three times and tells Saul his alarm is off.\n\n     Tucci keeps an eye on McManus. Higham watches Saul.\n\n     McManus pretends to tinker with the car's engine. He has put  \n     a pistol just inside the grill and keeps it within reach.\n\n     The van on the other side of the garage starts and pulls out\n     of the spot. It cruises over toward the Mercedes.\n\n     Tucci sees the van. He and Higham are suddenly busy trying to\n     keep track. They hear laughing behind them and turn around.\n\n<b>                                           YELLOW 06/11/94\n</b>\n\n<b>                                                              64.\n</b>\nFENSTER and HOCKNEY are walking towards them. They are\nsporting mustaches and sunglasses in addition to matching\nsuits, each with loud plaid sport coats, decades out of\nstyle. Saul glances at Tucci and Higham.\n\n<b>                            HIGHAM\n</b>           Just get in the car Saul.\n\nUnder the hood of the Honda and out of sight, McManus pulls\non a black ski mask.\n\nThe van gets closer.\n\n<b>                             HOCKNEY\n</b>           I get out of the car, and man if the\n           thing wasn't wrecked. And I see this\n           broad in the back seat with nothing on.\n\nSaul gets in the car quickly but calmly as Fenster and\nHockney laugh and talk louder. They look drunk - The desired\neffect.\n\n<b>                       HOCKNEY (CONT'D)\n</b>           I'm laughing so hard I can't breathe -\n\nTucci and Higham try to take it all in stride. Saul's reverse\nlights come on and he begins to back out of the spot.\n\n<b>                       HOCKNEY (CONT'D)\n</b>           ...And the fat guy comes out of the car\n           with his pants on backwards and says -\n\nSUDDENLY, the van revs and screeches to a halt behind Saul's\nMercedes, blocking him in. Hockney and Fenster drop the drunk\nact and snap to. They both pull out guns and start screaming.\n\n<b>                       HOCKNEY (CONT'D)\n</b><b>           DON'T MOVE, YOU FUCKERS.\n</b>\n<b>                            FENSTER\n</b><b>           RIGHT THERE. FREEZE.\n</b>\nMcManus comes up from under the hood.                                  \n\nTucci and Higham throw their hands in the air. Hockney and\nFenster grab them and reach into their belts to get their\nguns .\n\nKeaton jumps out of the van and runs up to Saul's car, his\nface covered in a ski mask. He yanks on the door handle but\nit is locked. Saul sits in terror behind the wheel. Keaton\npulls out a pistol and smashes the window with it.\n\n<b>                                           YELLOW 06/11/94\n</b>\n\n<b>                                                              65.\n</b>\n<b>                             KEATON\n</b>            Give me the case.\n\n\nSaul reaches over for the case. Keaton trains the gun on him.\n\nSUDDENLY, Saul comes up with a pistol and points it at\nKeaton. Keaton sidesteps and grabs his wrist. The gun goes\noff into the fender of the Honda.\n\nHockney and Fenster both look over at the sound of the gun.\n\nTucci and Higham seize the opportunity. Tucci grabs Hockney,\nHigham grabs Fenster. The four men grapple for the guns.\n\nFenster's gun falls to the floor. McManus picks it up. He\ntrains a pistol on each bodyguard and takes a breath. They\nare some ten feet apart and moving erratically. Hockney and\nFenster constantly fall in the line of fire.\n\nMcManus walks around the four men, keeping a pistol trained\non each of the guards. Finally he comes to an angle where\nthey are all in front of him. One guard is a few feet away,\nthe other is ten feet past him.\n\nMcMANUS' P.O.V.\n\nThe closer of the two moves in and out of the sights of the\npistol in McManus' right hand, the one farther away does the\nsame with the left.\n\nVerbal gets out of the van and moves towards them to help.\n<b>BOOM\n</b>Both of McManus' guns go off like one shot. Tucci and Higham\ncollapse, each with a bullet in his head\n\n\n<b>PAUSE\n</b>\nThe only sound is Saul grappling with Keaton for the gun. His\narm is halfway out the window. His elbow rests in the door\nframe.\n\nKeaton cannot get the gun out of his hand. Finally, he pushes\ndown with all his weight. Saul's elbow breaks backwards on\nthe door frame. He screams in agony. The gun falls from his\nhand.\n\n<b>                                                  BLUE 06/01/94\n</b>\n\n<b>                                                                     66.\n</b>\n      All five of the men look at each other for an impossibly long\n      moment. The confusion is only aggravated by Saul's screaming.\n\n      SLOWLY, Keaton raises his pistol and aims it at Saul. His\n      hand trembles, his eyes squint to near slits. His finger\n      tenses and slacks off over and over again on the trigger.\n\n<b>      BOOM\n</b>\n      VERBAL SHOOTS SAUL. Keaton looks at him in surprise. Verbal\n      trembles more than he does.\n\n      The garage is silent.\n\n<b>                                 HOCKNEY\n</b>                What the hell?\n\n                                 McManus\n                Bad day. Fuck it.\n\n<b>      DING-DING\n</b>\n\n      The elevator light comes on. All five men look.\n\n<b>                                 KEATON\n</b>                Move.\n\n      Keaton reaches into the car and grabs Saul's case. Everyone\n      else piles into the van. Keaton gets in as Verbal is driving\n      for the exit.\n\n<b>59    INT. VAN                                                             59\n</b>\n      The mood in the van is grim. Everyone is silent. Keaton pops\n      the clasps on the case and opens it.\n\n<b>                                 KEATON\n</b>                Son of a bitch.\n\n      Everyone looks in the case. It is filled with cash on one\n      side. The other side is filled with clear plastic bags of\n<b>      WHITE POWDER.\n</b>\n<b>60    EXT. PARKING LOT - NIGHT                                             60\n</b>\n      Keaton and the others stand in silhouette in front of the\n      lights of an oncoming car in the distance. We can make out\n      McManus loading a gun.                                                 +\n\n<b>                                  KEATON                                      \n</b>                What are you doing?                                           \n\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              67.\n</b>\n\n                             McMANUS\n           What does it look like? I'm going to kill\n           him.\n\n<b>                             KEATON\n</b>           We did it your way. Now I'11 deal with\n           him.\n\n<b>                            MCMANUS\n</b>           You gonna kill him?\n\n<b>                            KEATON\n</b>           I'm going to deal with him.\n\nThe car, Redfoot's escort Caddy, is now in front of them.\nThe horn lets out three short blasts.\n\nRedfoot comes around from behind the Caddy on his motorcycle.\nHe gets off the bike, trying to hide a faint smile.\nMcManus throws Saul's case on the ground in front of him.\n\n                             McMANUS\n           What the fuck is this, Redfoot?\n\n<b>                            REDFOOT\n</b>           Get a grip. I didn't know.\n\n<b>                             KEATON\n</b>           You didn't know.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              68.\n</b>\n<b>                            REDFOOT\n</b>           The job got thrown to me by this lawyer.\n\n<b>                            KEATON\n</b>           Who is he?\n\n<b>                            REDFOOT\n</b>           Some Limey. He's a middle-man for\n           somebody. He doesn't say and I don't ask.\n\n<b>                            KEATON\n</b>           We want to meet him.\n\n<b>                            REDFOOT\n</b>           He wants to meet you. He called last\n           night and asked me to set it up. What do\n           I tell him'\n\n<b>                            KEATON\n</b>           Tell him we'll meet.\n\n                            McMANUS\n           If you're lying, Redfoot...\n\n<b>                            REDFOOT\n</b>           McManus, you're a real bad-ass, but get\n           off my tip.\n\nMcManus lunges for Redfoot.\n\nThe Caddy doors instantly pop open and rifle barrels come\ninto view from within.\n\nFenster and Hockney draw guns and aim at the Caddy.\nKeaton and Verbal grab McManus and hold him back.\nRedfoot gets on his Harley, smiling defiantly.\n<b>                       REDFOOT (CONT'D)\n</b>           Real shame about Saul getting whacked.\n           Lot's of cops looking for the guys that\n           did it. I'm sure They'll get around to\n           asking me.\n\nHe starts his bike.\n\n<b>                                               YELLOW 06/11/94\n</b>\n<b>                                                                   69.\n</b>\n                                  McMANUS\n                 Fuck you.\n\n     Redfoot drives off..The Caddy waits until he is completely\n     out of sight before following.\n\n<b>61 INT. RABIN'S OFFICE - DAY - PRESENT                                61\n</b>\n<b>                                   KUJAN\n</b>                 So this lawyer...\n\n<b>                                  VERBAL\n</b>                 Kobayashi.\n\n<b>                                   KUJAN\n</b>                 Came from Redfoot.\n\n<b>                                  VERBAL\n</b>                 Right.\n\n<b>                                   KUJAN\n</b>                 And why leave this out when you talked to\n                 the D.A.?\n\n<b>     A KNOCK AT THE DOOR\n</b>     Rabin sticks his head in.\n<b>                                   RAB IN\n</b>                 Someone to see you, Agent Kujan.\n\n     Kujan steps out into the hall, shutting the door behind him.\n\n<b>62    INT. OUTSIDE RABIN'S OFFICE                                     62\n</b>\n     Kujan smiles instantly, recognizing the man standing with\n     Rabin.  \n\n\n<b>                                   KUJAN\n</b>                 Jack. What are you doing here?\n\n<b>                                   BAER\n</b>                 I've been looking all over for you. You\n                 still after the coke that walked out of\n                 that blood bath in the harbor?\n\n<b>                                   KUJAN\n</b>                 Yeah.\n\n<b>                                   BAER\n</b>                 You can stop looking. There was no coke.\n                 I've been in L.A. county with a guy they\n\n<b>                                                PINK 06/07/94\n</b>\n<b>                                                                     70.\n</b>                             BAER (cont'd)\n               pulled out of a drainpipe in San Pedro\n               yesterday after the shoot-out. He came to                 +\n               this morning and started talking. He was\n               part of a Hungarian mob there to do a\n               deal with a bunch of goats from\n               Argentina. He says it was definitely not\n               a dope deal.\n\n<b>                                  KUJAN\n</b>               There was ninety-one million -\n\n<b>                                  BAER\n</b>               We know, but our man says no way on the\n               dope. This Hungarian tells me the whole\n               bunch was pulling stumps for Turkey the\n               next' day. They had no time to negotiate\n               that kind of product and no means to move\n               it.\n\n<b>                                 KUJAN\n</b>               What was the money for?\n\n<b>                                  BAER\n</b>               He didn't know. No one doing the deal\n               knew except a few key people. This guy\n               says they were real hush about it.\n               Whatever it was it was highly sensitive.\n\n<b>                                 KUJAN\n</b>               I don't get it.\n\n<b>                                   BAER\n</b>               They tell me you got the cripple from New\n               York in there. He mention Keyser Soze\n\n<b>                                 KUJAN\n</b>               Who ?\n\n<b>                                  BAER\n</b>               Bear with me here...\n\n<b>                                                                            63\n</b><b>63 INT. RABIN'S OFFICE - LATER\n</b>\n\n     BOOM - The door bursts open.\n\n<b>                                 KUJAN\n</b>               Who is Keyser Soze\n\n     Verbal looks up in shock. He drops his cigarette and trembles\n     at the mere mention of the name.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   71.\n</b>\n<b>                                 VERBAL\n</b>                Ahhh fuck.\n\n<b>64 INT. HOLLYWOOD ATHLETIC CLUB - DAY - TWO WEEKS PRIOR              64'\n</b>     Keaton stands while the rest sit and listen.\n<b>                                  KEATON\n</b>                So I need to know if anyone can think of\n                anybody. Somebody with power. Enough to\n                possibly track us from New York.\n\n                                  McMANUS\n                Look. We've been over it for an hour now.\n                I say we pack up and run. Let's go back\n                to New York. At least get out of L.A.\n\n     SUDDENLY, The sound of a man clearing his throat.\n     Everyone turns to the door behind them.\n     MR. KOBAYASHI a tall, slim, well groomed man stands in the\n     hall. He has a briefcase in his hand. He smiles politely.\n\n\n<b>                                KOBAYASHI\n</b>                Mr. Keaton?\n\n     Keaton stands back and lets him in. Kobayashi looks them\n     over.\n\n<b>                           KOBAYASHI (CONT'D)\n</b>                I am Mr. Kobayashi. I've been asked by my\n                employer to bring a proposal to you\n                gentlemen. That must be Mr. Hockney. I\n                recognize Mr. Fenster from his mug shot,\n                as well as Mr. McManus.\n                               (To Verbal)\n                I can only assume that you are Mr. Kint.\n                I believe you were the one who disposed\n                of Saul. My employer sends his gratitude.\n                A most unexpected benefit.\n\n     Everyone looks at one another in shock that he would know\n     this.\n\n<b>                                 KEATON\n</b>                What can we do for you?\n\n<b>                                            BLUE 06/01/94\n</b>\n<b>                                                                72.\n</b>\n<b>                           KOBAYASHI\n</b>           My employer requires your services. One\n           job. One day's work. Very dangerous. I\n           don't expect all of you to live, but\n           those who do will have ninety-one million\n           dollars to divide any way they see fit.\n\n<b>                            KEATON\n</b>           Who's your boss?\n\n<b>                           KOBAYASHI\n</b>           My employer wishes to remain anonymous.\n\n<b>                             KEATON\n</b>           Don't jerk me off. We all know what this\n           is. You don't work with me if I work with\n           you without knowing who I'm working for.\n           Now let's cut the shit. Who's the man?\n\n<b>                           KOBAYASHI\n</b>           I work for Keyser Sate.                                   \n\nA strange look crosses Keaton's face. Skepticism, mockery and\njust a hint of fear. Hockney, McManus and Fenster all share\nsimilar looks.\n\n<b>                            KEATON\n</b>           What is this?\n\n<b>                             VERBAL\n</b>           Who's Keyser Soze?                                        \n\n<b>                           KOBAYASHI\n</b>           I am sure you've heard a number of tall\n           tales, myths and legends about Mr. Soze                   \n           I can assure you gentlemen, most of them\n           are true.\n\n\n<b>                             VERBAL\n</b>           Who's Keyser Soze?                                        \n\n<b>                           KOBAYASHI\n</b>           Judging by the sudden change in mood, I\n           am sure the rest of your associates can\n           tell you, Mr. Kint. I have come with an\n           offer directly from Mr. Soze. An order                   \n           actually.\n\n<b>                             KEATON\n</b>           An order.\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                73.\n</b>\n<b>                           KOBAYASHI\n</b>           In nineteen-eighty one, Mr. Keaton, you\n           participated in the hijacking of a truck\n           in Buffalo, New York. The cargo was raw\n           steel. Steel that belonged to Mr. Soze\n           and was destined for Pakistan to be used\n           in a Nuclear reactor. A very profitable\n           violation of U.N. Regulations. You had no\n           way of knowing this, because the man\n           shipping the steel was working for Mr.\n           Sate without his knowledge.                               +\n                             (Beat)\n           Mr. Fenster and Mr. McManus hijacked a\n           twin-prop cargo flight earlier this year\n           out of Newark airport. The plane was\n           carrying platinum and gold wiring. Also\n           set for Pakistan.\n\nKobayashi turns and points at Hockney.\n\n<b>                      KOBAYASHI (CONT'D)\n</b>           Two months ago, Mr. Hockney stole a truck\n           carrying gun parts through Queens -\n\nEveryone looks at Hockney. He smiles shyly. It occurs to them\nall that he robbed the truck for which they were all arrested\nin the first place.\n\n<b>                      KOBAYASHI (CONT'D)\n</b>           - guns allegedly set to be destroyed by\n           the state of New York. They were to be\n           \"lost\" in a weigh station and routed to\n           Belfast. Again, Mr. Sate using pawns who                   \n           had no knowledge.\n                      (turning to Verbal)\n           Which brings us to Mr. Kint.\n\nVerbal crumbles under his stare.\n\n<b>                      KOBAYASHI (CONT'D)\n</b>           Nine months ago, one of Mr. Soze less                      \n           than intelligent couriers was taken in a\n           complicated confidence seam by a cripple.\n           He was relieved of sixty-two thousand\n           dollars. Now\n                        (To all of them)\n           - It has taken us some time to find you.\n           Our intention was to approach you after\n           your apprehension in New York.\n\n\n<b>                                 BLUE 06/01/94\n</b>\n\n<b>                                                    74.\n</b>\n<b>                            KEATON\n</b>           You set up the line-up.\n\n<b>                            KOBAYASHI\n</b>           Mr. Soze made a few calls, yes. You were                   \n           not to be released until I came to see\n           you. It seems Mr. Keaton's attorney, Ms.\n           Finneran, was a bit too effective in\n           expediting his release. Holding the rest\n           of you became a moot point.\n\n<b>                            KEATON\n</b>           What about Redfoot?\n\n<b>                            KOBAYASHI\n</b>           Mr. Redfoot knew nothing. Mr. Soze rarely                 t\n           works with the same people for very long,\n           and they never know who they're working\n           for. One cannot be betrayed if one has no\n           people.\n\n<b>                            FENSTER\n</b>           So why tell us?\n\n<b>                           KOBAYASHI\n</b>           Because you have stolen from Mr. Soze.                    \n           That you did not know you stole from him\n           is the only reason you are still alive,\n           but he feels you owe him. You will repay\n           your debt.\n<b>           \n</b><b>                            HOCKNEY\n</b>           Who is this guy? How do we know you work\n           for Soze\n\n\n<b>                           KOBAYASHI\n</b>           I don't think that is relevant, Mr.\n           Hockney. The five of you are responsible\n           for the murder of Saul Berg and his\n           bodyguards. Mr. Redfoot can attest to\n           your involvement, and we can see to it\n           that he will. He is not of your\n           \"superior\" breed.\n\n<b>                            MCMANUS\n</b>           This is a load of shit.\n\n<b>                           KOBAYASHI\n</b>           The offer is this, gentlemen. Mr. Soze's\n           primary interest, as I am sure you all\n           know, is narcotics. He's been - competing\n           shall we say, with a group of\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                              75.\n</b>                       KOBAYASHI (cont'd)\n           Argentinians for several years. Competing\n           with Mr. Soze has taken its toll. These\n           Argentinians are negotiating the sale of\n           ninety-one million dollars in cocaine in\n           three days time. Needless to say, this\n           purchase will revitalize the diminishing\n           strength of their organization. Mr. Soze\n           wants you to stop the deal. If you\n           choose, you may wait until the buy.\n           Whatever money changes hands is yours.\n           The transaction will take place on a boat\n           in San Pedro. Mr. Soze wants you to get\n           to the boat and destroy the cocaine on\n           board. Then you are free of your\n           obligation to Mr. Soze.\n\n<b>                             KEATON\n</b>           Give me one good reason why I shouldn't\n           kill you right now.\n\nKobayashi smiles and puts his briefcase on the table in front\nof him.\n\n<b>                          KOBAYASHI\n</b>           A gift from Mr. Soze gentlemen.\n\nHe turns and walks out of the room.\n\nKeaton walks over to the case and opens it. He reaches in and\npulls out five thick manila envelopes, each marked in bold\nblack letters. \"KEATON\", \"McMANUS\", \"HOCKNEY\", \"FENSTER\" and\n\"KINT\"\n\nKeaton pulls out the files, revealing a map underneath.\n\nKeaton hands each man his file. He opens his first. He pulls\nout a thick stack of papers and thumbs through them.\n\n<b>                             KEATON\n</b>           Jesus Christ. Open them.\n\nAll of the men open their files. Inside are mug shots of each\nman in his respective file as well as a printout of his\ncriminal record. But there is more.\n\n<b>                            HOCKNEY\n</b>           They know everything.\n\n                             McMANUS\n           This is my life in here. Everything I've\n           done since I was eighteen.\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                76.\n</b>\n<b>                            FENSTER\n</b>           Everybody I ever worked with, did time\n           with.\n\n<b>                            HOCKNEY\n</b>           They fucking know everything.\n\nKeaton pulls out a large black and white photograph of\nhimself and his lawyer EDIE FINNERAN. They are laughing arm\nin arm by a fountain in New York. He hides the photo from the\nothers.\n\n<b>                            KEATON\n</b>           This is not right.\n\n<b>                            FENSTER\n</b>           I don't know. Who was that guy that used\n           to talk about Soze in New York?                            \n\n                            McMANUS\n           Bricks Marlin.\n\n<b>                            FENSTER\n</b>           Yeah. He said he did jobs for him.\n           Indirect stuff. Always five times more\n           money than the job was worth.\n\n<b>                            KEATON\n</b>           Come on. The guy is a pipe dream. This\n           Kobayashi is using him for window\n           dressing .\n\n<b>                            FENSTER\n</b>           I don't know. This is bad.\n\n<b>                            HOCKNEY\n</b>           It's bullshit. This guy could be L.A.P.D.\n           I think it's a setup.\n\n<b>                            FENSTER\n</b>           The way I hear it, Soze is some kind of                    \n           butcher. No pity.\n\n<b>                            KEATON\n</b>           There' is no Keyser Soze\n\nVerbal thumbs through his file. A long list of names,\nnumbers, addresses. It is a detailed portfolio of his entire\ncriminal and personal life. He looks up at Keaton.\n\n<b>                                                 BLUE 06/01/94\n</b>\n\n<b>                                                                     77.\n</b>\n<b>                                 VERBAL\n</b>                Who is Keyser Soze\n\n<b>65 INT. RABIN'S OFFICE - DAY - PRESENT                                 65\n</b>     Kujan leans into Verbal's face. He hangs on his every word.\n<b>                                  VERBAL\n</b>                He is supposed to be Turkish. Some say                   r\n                his father was German. Nobody believed he                 \n                was real. Nobody ever saw him or knew                     \n                anybody that ever worked directly for                     \n                him, but to hear Kobayashi tell it,                       \n                anybody could have worked for Soze. You                  \n                never knew. That was his power. The                       \n                greatest trick the Devil ever pulled was                  \n                convincing the world he didn't exist. One                  \n                story the guys told me - the story I                      \n                believe - was from his days in Turkey.                    \n                There was a petty gang of Hungarians that                 \n                wanted their own mob. They realized that                  \n                to be in power you didn't need guns or                    \n                money or even numbers. You just needed                   +\n                the will to do what the other guy                         \n                wouldn't. After a while they come to                      \n                power, and then they come after Soze He                   \n                was small time then, just running dope,                   \n                they say...\n\n<b>66   SCENE DELETED                                                     66 \n</b><b>67   INT. SOZE'S HOME - DAY                                            67 \n</b>     Three of the Hungarians come bursting into Keyser Soze's            +\n     home. They grab his five children and round them up in the\n     front room. One of the men grabs his wife and back-hands her\n     across the face.\n\n<b>                                                 BLUE 06/01/94\n</b>\n<b>                                                                     78.\n</b>\n<b>                              VERBAL (V.O.)\n</b>                They come to his home in the afternoon\n                looking for his business. They find his\n                wife and kids in the house and decide to\n                wait for Sate.\n\n<b>68    INT. SOZE'S HOME - LATER                                            68'\n</b>\n     The front door opens and in walks Keyser Sate. We are never         t\n     allowed to see his face.\n\n     Sate's wife lies in the corner, beaten and bruised. Her dress\n     is tattered to shreds. She cannot look up at her husband.\n\n     The three Hungarians stand to greet him. Two hold guns in\n     their hands. The third holds a straight razor. He grabs\n     Soze youngest boy and holds the razor to his throat.\n\n<b>                              VERBAL (V.O.)\n</b>                He comes home to his wife raped and his\n                children screaming. The Hungarians knew\n                Soze was tough. Not to be trifled with.                   \n                So they let him know they meant business.\n\n     The Hungarian smiles. Soze's wife SCREAMS IN HORROR.                \n     The Hungarian holds up a BLOOD SOAKED RAZOR.\n     SUDDENLY, he grabs another child. A little girl no older than\n     six.\n\n<b>                              VERBAL (V.O.)\n</b>                They tell Soze they want his territory -                  \n                all his business. Soze looks over the                    +\n                faces of his family... Then he showed\n                these men of will what will really was.\n\n     SUDDENLY, Soze pulls out a pistol and shoots the two men with  \n     guns. He turns and aims at the third man holding his child.\n\n     The man threatens to cut the child's throat, slicing just\n     enough to draw blood.\n\n<b>     SOZE FIRES.\n</b>\n     The stunned Hungarian watches the child fall from his arms.\n\n     Sate turns the pistol on the next child, then the next and  \n     the next. He kills his children one by one in front of the\n     Hungarian.\n\n<b>                                                PINK 06/07/94\n</b>\n<b>                                                                     79.\n</b>\n\n<b>                             VERBAL (V.O.)\n</b>                He tells him he would rather' see his\n                family dead than live another day after\n                this.\n\n    SOZE walks over to his wife, crying and beaten on the floor\n    and holds up her head. She gives him the strangest look. One\n    of trust perhaps, saturated with fear and humiliation.\n\n    He puts the gun between her eyes and fires.\n\n<b>                             VERBAL (V.O.)\n</b>                He lets the last Hungarian go, and he\n                goes running. He waits until his wife and\n                kids are in the ground and he goes after\n                the rest of the mob. He kills their kids,\n                he kills their wives, he kills their\n                parents and their parents' friends.\n\n    A dark and looming figure of a man walks in front of a wall\n    of fire - a black shadow blurred by waves of heat.\n\n<b>                             VERBAL (V.O.)\n</b>                He burns down the houses they live in and\n                the stores they work in, he kills people\n                that owe them money. And like that he was\n                gone. Underground. No one has ever seen\n                him again. He becomes a myth, a spook\n                story that criminals tell their kids at\n                night. If you rat on your pop, Keyser\n                Sate will get you. And nobody really ever\n                believes.\n\n<b>                                                                            69\n</b><b>69 INT. RABIN'S OFFICE - DAY\n</b>\n\n<b>                                  KUJAN\n</b>                Do you believe in him, Verbal?\n\n<b>                                  VERBAL\n</b>                Keaton always said: \"I don't believe in\n                God, but I'm afraid of him.\" Well I\n                believe in God, and the only thing that\n                scares me is Keyser SOZE.\n\n<b>                                                                            70\n</b><b>70    INT. WORKSHOP\n</b>\n\n    Jack Baer and Rabin listen to Verbal on the speaker with one  \n    ear.\n<b>                                  RAB IN\n</b>                You give this any weight, Agent Baer?\n\n<b>                                                 PINK 06/07/94\n</b>\n\n<b>                                                                     80.\n</b>\n\n<b>                                   BAER\n</b>                I can introduce you to Dan Metzheiser\n                from Justice. He has a file on Sate in\n                D.C. It's been a hobby of his for a few\n                years. A lot of guys equate him to that\n                reporter on the Incredible Hulk.\n\n<b>                                  RABIN                                     \n</b>                Had you heard of him before?                                \n\n<b>                                   BAER\n</b>                On the street? A few times. Outside\n                stuff. Somebody was working for a guy who\n                was working for a guy who got money\n                through Keyser Soze. That kind of shit.\n                Could be an old badge. A hex sign to keep\n                people from fucking with you back when a\n                name meant something.\n\n<b>                                  RAB IN\n</b>                But you're here.\n\n<b>                                   BAER\n</b>                Shit yeah. I got a guy trying to walk out\n                of the hospital on d fried drumstick to\n                get away from SOZE. I'11 run it up the\n                flagpole.\n\n<b>71 INT. RABIN'S OFFICE                                                  71\n</b>\n<b>                                   VERBAL\n</b>                I came clean. I told it like it happened\n                on the boat. So what if I left out how I\n                got there? It's got so many holes in it,\n                the D.A. would've told me to blow amnesty\n                out my ass. So you got what you wanted\n                out of me. Big fucking deal.\n\n<b>                                   KUJAN\n</b>                And this is why you never told the D.A.\n\n<b>                                   VERBAL\n</b>                You tell me, Agent Kujan. If I told you\n                the Loch Ness Monster hired me to hit the\n                harbor, what would you say?\n\n<b>                                   KUJAN\n</b>                Turn state's evidence. Take the stand on\n                this and we'll hear it out.\n\n<b>                                                  BLUE 06/01/94\n</b>\n<b>                                                                     81.\n</b>\n<b>                                  VERBAL\n</b>                 I've got immunity now. What can you\n                 possibly offer me?\n\n<b>                                  KUJAN\n</b>                 If there is a Keyser Soze he'll be\n                 looking for you.\n\n<b>                                  VERBAL\n</b>                 Where's your head, Agent Kujan? Where do\n                 you think the pressure's coming from?\n                 Keyser Soze - or whatever you want to\n                 call him - knows where I am right now.\n                 He's got the front burner under' your ass\n                 to let me go so he can scoop me up ten\n                 minutes later. Immunity was just to deal\n                 with you assholes. I got a whole new\n                 problem when I post bail.\n\n<b>                                  KUJAN\n</b>                 So why play into his hands? We can\n                 protect you.\n\n<b>                                  VERBAL\n</b>                 Gee, thanks, Dave. Bang-up job so far.\n                 Extortion, coercion. You'll pardon me if\n                 I ask you to kiss my pucker. The same\n                 fuckers that rounded us up and sank us\n                 into this mess are telling me They'll\n                 bail me out? Fuck you. You think you can\n                 catch Keyser Soze? You think a guy like\n                 that comes this close to getting fingered\n                 and sticks his head out? If he comes up\n                 for anything, it will be to get rid of\n                 me.\n                                  (beat)\n                 After that, my guess is you'll never hear\n                 from him again.\n\n<b>72    INT. HALLWAY OUTSIDE HOSPITAL ROOM - DAY                           72\n</b>     Doctor Plumber watches from out in the hall.                         +\n     Kovash spits out a constant river of Hungarian while Bodi\n     tries to keep up, relaying everything to Tracy Fitzgerald.\n\n     She sketches frantically while Daniel Metzheiser looks on.\n\n     The composite sketch of Keyser SOZE is taking form.                   \n\n<b>                                           BLUE 06/01/94\n</b>\n<b>                                                               81A.\n</b>\n\n(&lt;&lt; &gt;&gt; Denotes liners spoken in Hungarian.)\n\n                            BODI                                     c\n          &lt;&lt;What sort of nose did he have?&gt;&gt;                          \n\n<b>                           KOVASH                                     \n</b>          &lt;&lt;It was smaller than that. Sharper.&gt;&gt;                      \n\n<b>                             BODI\n</b>                          (To Tracy)                                 +\n          The nose is sharper. Smaller too.                          +\n                    (To Arkosh in Hung.)                              \n          &lt;&lt;And what about the hair? You said                         \n          something earlier about it.&gt;&gt;                               \n\n<b>                             KOVASH\n</b>          &lt;&lt;It is longer than that. And not so                        \n          dark. &gt;&gt;\n\n<b>                            BODI  \n</b>          &lt;&lt;Are you sure?&gt;&gt;\n\n<b>                             KOVASH\n</b>          &lt;&lt;Don't be stupid.&gt;&gt;                                        \n\n<b>                             BODI\n</b>                          (To Tracy)                                  \n          He says the hair is longer and lighter.                     \n\n<b>                                                 PINK 06/07/94\n</b>\n<b>                                                                      82.\n</b>\n\n<b>                                                                           73\n</b><b>73   EXT. BEACH - DAY\n</b>\n\n     Waves pound across a stone jetty. A MAN sits fishing while\n     his young son, BRANDO strolls toward the open sea. He pokes\n     at rocks and seaweed with a fishing pole. He glances down at\n     Something wedged between the rocks beneath his feet. He\n\n     pokes at it. He notes the checkered pattern of the fabric\n     entwined with the twisted mess. It is the bloated carcass of\n     THE MAN IN THE CHECKERED BATHROBE. BRANDO pokes it's eye\n     with the fishing pole. It pops.\n\n<b>                                                                           74 \n</b><b>74 SCENE DELETED/DIALOGUE MOVED\n</b>\n<b>                                                 PINK 06/07/94\n</b>\n<b>                                                                      83.\n</b>\n\n<b>                                                                           75\n</b><b>75 INT RABIN'S OFFICE\n</b>\n\n<b>                                  VERBAL\n</b>                That was how I ended up in a barber shop                   \n                quartet in Skokie, Illinois.\n\n<b>                                  KUJAN\n</b>                This is totally irrelevant.\n\n<b>                                  VERBAL\n</b>                Oh, but it's not. If I hadn't been\n                nailed in Illinois for running a three\n                card monte in between sets, I never would\n                have took off for New York. I never\n                would have met Keaton, see. That barber\n                shop quartet was the reason for\n                everything.\n\n<b>                                  KUJAN\n</b>                Can we just get back to Kobayashi?\n\n<b>                                  VERBAL\n</b>                The quartet is part of the bit about\n                Kobayashi. The quartet was in my file,\n                along with every other thing I had done\n                since high school, see? Aliases, middle-\n                men. They knew me better than I did.\n                They knew all of us.\n\n      Kujan looks at his watch.\n\n<b>                                  KUJAN\n</b>                You're stalling, Verbal.\n\n<b>                                 VERBAL\n</b>                Give a guy a break, huh?\n\n<b>                                  KUJAN\n</b>                What happened?\n\n      Verbal slumps a bit. He realizes his stalling tactic has\n      failed.\n<b>                                   VERBAL\n</b>                We woke up the next morning and Fenster\n                was gone. He couldn't handle the idea of\n                slumming for SOZE. He left a note wishing\n                us good luck and took a chunk of the\n                money we'd scraped together.\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                     84.\n</b>\n<b>                                  KUJAN\n</b>                Then what?\n\n<b>                                  VERBAL\n</b>                McManus was furious. He was talking about\n                tracking him down and ripping his heart\n                out and all sorts of shit. That night we\n                got the call.\n\n<b>                                  KUJAN\n</b>                What call?\n\n<b>                                  VERBAL\n</b>                Kobayashi told us where we could find\n                Fenster.\n\n<b>76 EXT. BEACH - NIGHT - TWO WEEKS PRIOR                               76\n</b>     Keaton looks out over the ocean and smokes a cigarette.\n<b>                                  KEATON\n</b>                What do you want to do with him?\n\n     McManus kneels in the sand. Hockney and Verbal stand behind\n     him, staring at something in front of them.\n\n     It is the body of Fred Fenster, literally peppered with\n     bullet holes. McManus stares at him, fighting any flicker of\n     emotion.\n\n                                  McMAMJS\n                I worked five years with Fenster. More\n                jobs, more money than I can count.\n\n<b>                                 KEATON\n</b>                I'm sorry, McManus.\n\n                                 McMANUS\n                I want to bury him.\n\n<b>                                  KEATON\n</b>                No time.\n\n     McManus springs to his feet and points a pistol at Keaton.\n     Keaton turns to face him and raises his head. McManus might\n     as well be pointing a feather-duster.\n\n                                  McMANUS\n                YOU WILL FIND TIME. You're not the only\n                one with debts, man.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   85.\n</b>\n<b>                                 KEATON\n</b>                No shovel.\n\n                                 McMANUS\n<b>                WITH OUR HANDS.\n</b>\n<b>77   MT. BEACH                                                            77'\n</b>\n     Everyone digs in the sand on the deserted beach with their\n     hands. They are up to their waists in the hole they have\n     scooped out. Fenster's body is a few feet away.\n\n<b>                                 HOCKNEY\n</b>                This is nuts.\n\n                                 McMANUS\n                Dig.\n\n<b>                                 HOCKNEY\n</b>                This is fucking dry sand, man. When he\n                rots, the surfers'll smell him from a\n                hundred yards out.\n\n                                 McMANUS\n<b>                DIG, YOU FUCKER.\n</b>\n     Hockney can see that McManus has truly gone over the edge for\n     now. Keaton gives him a look that says don't argue.\n\n<b>                                 HOCKNEY\n</b>                Keaton, we gotta go. They're gonna find\n                him.\n\n<b>                                 KEATON\n</b>                Dig.\n\n<b>                                 VERBAL\n</b>                What are we gonna do?\n\n<b>                                 HOCKNEY\n</b>                I can run. I got no problem with that.\n\n<b>                                 KEATON\n</b>                They don't seem to have a problem with it\n                either.\n\n                                 McMANUS\n                Nobody runs.\n\n<b>                                 HOCKNEY\n</b>                This ain't my boy we're burying. I don't\n                owe anybody.\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                     86.\n</b>\n                                 McMANUS\n                We got a deal here.\n\n<b>                                 HOCKNEY\n</b>                Since when?\n\n                                  McMANUS\n                Since tonight.                                             +\n\n<b>                                  HOCKNEY\n</b>                Fuck that.                                                  \n\n                                 McMANIJS\n                It's payback.\n\n<b>                                  KEATON\n</b>                IT'S NOT PAYBACK. I don't answer to you.                   +\n                It's precaution. You want payback? You\n                want to run? I don't care. I'm going to\n                finish this thing. Not for Fenster, not\n                for anybody else, but\n                for me. This Kobayashi cocksucker isn't\n                going to stand over me.\n                                   (Beat)\n                All of you can go to hell.\n\n\n     Keaton turns and digs furiously with both hands. Hockney\n     takes a moment and slowly starts to do the same.\n\n     The four men dig for Fenster. The first to find some rest.\n<b>     \n</b><b>78 INT. RABIN'S OFFICE - DAY - PRESENT                                 78\n</b>\n     Verbal smokes with his good hand shaking badly.\n<b>     \n</b><b>                                   KUJAN\n</b>                And after they killed Fenster nobody\n                would run?\n\n\n<b>                                  VERBAL\n</b>                I wanted to. I thought we could make it.\n\n<b>                                   KUJAN\n</b>                Why didn't you say anything?\n\n<b>                                  VERBAL\n</b>                I tried, believe me, but Keaton wouldn't\n                have it. It was too far-fetched for him.\n                Keaton was a grounded guy. An ex-cop. To\n                a cop, the explanation is never that\n                complicated. It's always simple. There's\n\n<b>                                                 PINK 06/07/94\n</b>\n<b>                                                                      87.\n</b>                             VERBAL (cont'd)\n                no mystery on the street, no arch-\n                criminal behind it all. If you got a dead\n                guy and you think his brother did it,\n                you're going to find out you're right.\n                Nobody argued with Keaton. They just set\n                their minds on whacking Kobayashi.\n\n<b>79   EXT. PARKING LOT - NIGHT - TWO WEEKS PRIOR                         79\n</b>\n     Redfoot's Harley rests on the roof of the Caddy in a mangled\n     heap. The body of the Caddy is riddled with bullet holes.\n\n     Redfoot's dead body has been shoved head-first through a hole\n     in the windshield up to his waist, recognizable only by the\n     trademark red boot.\n\n\n<b>                                                                           80\n</b><b>80   INT. OFFICE BUILDING - DAY\n</b>\n\n     Kobayashi walks through the front door of a plush office\n\n     tower followed by two bodyguards. He heads toward the\n     elevator, failing to notice Hockney a few feet away, reading\n     a newspaper.\n\n     We see a wire running from Hockney's ear to his collar.\n\n<b>                                 HOCKNEY\n</b>                He's coming up.\n\n<b>                                                                            81\n</b><b>81   INT. HALLWAY - FORTIETH FLOOR\n</b>\n\n     Keaton, McManus and Verbal stand by the six elevators on the\n     fortieth floor. They are all wearing khaki overalls and tool\n     belts with walkie-talkies. They look like servicemen.\n\n\n     All of the elevators have been propped open and stranded.\n\n     McManus moves into one of the elevators. As the doors close         i\n     behind him, he scrambles for the ceiling hatch.                      \n\n<b>                                                                            82 \n</b><b>82 SCENE DELETED\n</b>\n<b>                                                 PINK 06/07/94\n</b>\n\n<b>                                                                      88.\n</b>\n\n                                                                           83f\n<b>83 SCENE DELETED\n</b>\n\n<b>                                                                           84 \n</b><b>84 SCENE DELETED\n</b>\n\n<b>                                                                           85 \n</b><b>85 SCENE DELETED\n</b>\n\n<b>                                                                           86 \n</b><b>86 INT. HALLWAY\n</b>\n\n     Keaton and Verbal listen for anything on the radio.\n\n\n<b>                                                                            87 \n</b><b>87 SCENE DELETED\n</b>\n\n<b>                                                                            88 \n</b><b>88 SCENE DELETED\n</b>\n<b>                                                 PINK 06/07/94\n</b>\n<b>                                                                      89.\n</b>\n\n<b>                                                                           89 \n</b><b>89    INT. LOBBY\n</b>\n\n      The elevator opens. Kobayashi and his bodyguards get on the\n      elevator.\n<b>                                                                           90\n</b><b>90    INT. ELEVATOR\n</b>\n\n      The elevator is empty except for the three men. McManus has\n      vanished. Kobayashi presses a button and they are on the way.\n\n\n      SUDDENLY, the ceiling hatch opens and McManus' arm comes out.\n\n      POP - POP. Two shots from a suppressed pistol and the guards\n      drop to the floor, DEAD.\n      Kobayashi looks up with surprising calm into McManus' barrel.\n\n                                  McManus\n                 Press forty.\n\n<b>                                                                            91\n</b><b>91    INT. HALLWAY - FORTIETH FLOOR\n</b>\n\n      The elevator opens and Kobayashi is greeted by Keaton and\n      Verbal. McManus drops from the ceiling hatch and pushes him\n\n      out.\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                90.\n</b>\nVerbal and McManus grab the dead bodies and drag them out of\nthe elevator. They drag them to the next elevator which has\nbeen forced open, revealing an empty shaft.\n\n<b>                            KEATON\n</b>           The answer is no.\n\n<b>                           KOBAYASHI\n</b>           Mr. Soze will be most -\n\n<b>                             KEATON\n</b>           Listen to me, cocksucker. There is no\n           Keyser Sate. If you say his name again,\n           I'11 kill you right here.\n\n<b>                           KOBAYASHI\n</b>           A strange threat. I can only assume\n           you're here to kill me anyway. Pity about\n           Mr. Redfoot.\n\n                            McMANUS\n           Fair trade for Fenster.\n\nThe elevator opens and Hockney steps out.\n\n<b>                           KOBAYASHI\n</b>           Ahh, Mr. Hockney. Do join us.\n\n<b>                             KEATON\n</b>           We know you can get to us, and now you\n           know we can get to you. I'm offering you\n           the chance to call this off.\n\n<b>                           KOBAYASHI\n</b>           Mr. So- My employer has made up his mind.\n           He does not change it.\n\n<b>                             KEATON\n</b>           Neither do we.\n\n                             McMANUS\n           You got Fenster, you may get more, but\n           you won't get us all. Not before one of\n           us gets to you.\n\n<b>                           KOBAYASHI\n</b>           I believe you, Mr. McManus. I quite\n           sincerely do. You would not have been\n           chosen if you were not so capable, but I\n           cannot make this decision. Whatever you\n           can threaten me with is... ludicrous in\n           comparison to what will be done to me if\n\n<b>                                                 BLUE 06/01/94\n</b>\n<b>                                                                     91.\n</b>\n\n                                 McMANUS\n                Just so you know. I'm the guy. I'm the\n                one that's gonna get through to you.\n\n<b>                               KOBAYASHI\n</b>                I am sorry, Mr. McManus.\n                               (To Keaton)\n                f implore you to believe me, Mr. Keaton.\n                Mr. Soze is very real and very                             +\n                determined.\n\n<b>                                 KEATON\n</b>                We'll see.\n\n     McManus holds a pistol to Kobayashi's chin. The lawyer's cool\n     eyes never falter'.\n\n<b>                                 KOBAYASHI\n</b>                Before you do me in, you will let me\n                finish my business with Ms. Finneran\n                first, won't you?\n\n     SUDDENLY, Keaton grabs McManus' hand and pulls the gun away\n     before he can shoot.\n\n<b>                                 KEATON\n</b>                What did you say?\n\n<b>                                 KOBAYASHI\n</b>                Edie Finneran. She is upstairs in my\n                office for an extradition deposition. I\n                requested she be put on the case\n                personally. She flew out yesterday.\n\n     Everyone looks at Keaton.\n\n<b>                           KOBAYASHI (CONT'D)\n</b>                No matter. Kill away, Mr. McManus.\n\n<b>                                 KEATON\n</b>                You're lying.\n\n<b>                                KOBAYASHI\n</b>                Am I?\n<b>                                                                            92\n</b><b>92    INT. HALLWAY - FIFTIETH FLOOR\n</b>\n\n     Everyone follows Kobayashi quietly down a dimly lit, oak-\n     lined hallway. Verbal holds a small pistol discreetly in the\n     small of Kobayashi's back.\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                     92.\n</b>\n     They come to a glass office foyer. Kobayashi gestures and\n     everyone looks through the glass into the lobby beyond.\n\n     EDIE FINNERAN is talking casually with the receptionist.\n<b>     \n</b><b>93    INT. LOBBY                                                            93\n</b>     Edie glances toward the men in the hall.\n     Keaton turns quickly on his heels, facing the others. From\n     where Edie stands, it looks as though Kobayashi is talking to\n     a group of harmless maintenance men.\n\n     They see A LARGE MAN dressed very much like the two dead\n     bodies left in the hall downstairs. The man notices Kobayashi\n     and the others. He stands and stares menacingly.\n\n<b>                                KOBAYASHI\n</b>                Ms. Finneran's escort in Los Angeles.\n                Never leaves her for a moment. I thought\n                you'd like to know she was in good hands.\n\n     Keaton's mind races for an alternative. He can find none.\n     Verbal lowers his gun without being told.\n<b>                           KOBAYASHI (CONT'D)\n</b>                Get your rest, Gentlemen. The boat will\n                be ready for you on Friday. If I see you\n                or your friends before then, or fail to\n                check in every half hour with that\n                unpleasant looking man in there, Ms.\n                Finneran will find herself the victim of\n                a gruesome violation before she dies. As\n                will your father, Mr. Hockney. and your\n                Uncle Randall in Arizona, Mr. Kint. I\n                might only castrate Mr. McManus' nephew,\n                David. Do I make myself clear?\n\n     All of the men surround Kobayashi, aching to kill him.\n\n<b>                                KOBAYASHI\n</b>                I'11 take care of the dead men\n                downstairs. We'll add them to the cost of\n                Mr. Fenster. Now if you'll excuse me.\n\n     Kobayashi walks into the office. Edie turns to greet him.\n     Keaton slowly turns and watches as they shake hands and talk.\n     Kobayashi says something they cannot hear and Edie laughs,\n     her back to the window.\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n<b>                                                                    93.\n</b>     Kobayashi smiles over her shoulder at Keaton.\n     All the while, the bodyguard watches Keaton. He nods politely\n     before Keaton and the others leave. Verbal watches for a\n     moment more and follows.\n\n<b>94    EXT. HILLSIDE ROAD - DAY                                            94'\n</b>\n     Keaton, Verbal, Hockney and McManus sit in a rented sedan\n     overlooking San Pedro harbor.\n\n     Another file from Kobayashi's briefcase is laid out on the\n     dashboard. This has a map and a good fifty pages of                  \n     information in it.\n\n<b>                                  KEATON\n</b>                It's a logistical nightmare. Close\n                quarters, no advance layout, ten men,\n                maybe twenty.\n\n<b>                                 HOCKNEY\n</b>                Can we stealth these guys?\n\n<b>                                  KEATON\n</b>                Doubtful. With all that coke, they'll be\n                ready - which brings me to sunny spot\n                number two. Even if one of us gets\n                through and jacks the boat, we get\n                nothing.\n\n                                  McMANUS\n                And if we wait for the money?\n\n<b>                                  KEATON\n</b>                Ten more men at least. In my opinion, it\n                can't be done. Anyone who walks into this\n                won't come out alive.\n\n                                  McMANUS\n                I'm for waiting for the money.\n\n<b>                                 HOCKNEY\n</b>                Me too.\n\n<b>                                  VERBAL\n</b>                Did you hear what he just said?\n\n<b>                                  HOCKNEY\n</b>                If I'm going in, I want a stake.\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   94.\n</b>\n                                  McMANUS\n                 So do I.\n\n      Verbal is shocked by what he is hearing. He looks at Keaton\n      as if to ask him for his decision.\n\n      Keaton's cold stare is all the answer Verbal needs. He slumps\n      in his seat, resigned to the others.\n\n<b>                                  VERBAL\n</b>                 I just can't believe we're just gonna\n                 walk into certain death.\n\n<b>      PAUSE\n</b>      They all suddenly realize the weight of their situation.\n<b>      FINALLY:\n</b>                                  McMANUS\n                 News said it's raining in New York.\n\n      No one knows quite how to respond.\n\n<b>95    EXT, PIER - SAN PEDRO - NIGHT                                       95\n</b>\n      A large boat, sleek and yacht-like, but without finesse. This\n      is a boat for business - heavy and fast. It is moored to the\n      pier.\n\n      A large crane hoists a pallet of fuel drums from the dock. It\n      swings slowly over the boat. A man on the dock yells in\n      Spanish to the crane operator.                                          \n\n<b>96    EXT. BOATHOUSE                                                      96\n</b>\n      Behind an old and weathered boat in dry-dock, Keaton and\n      Verbal watch the boat from the shadows.\n\n<b>                                  VERBAL\n</b>                 What-are they speaking?\n\n<b>                                  KEATON\n</b>                 Russian, I think. I don't know.\n\n<b>                                  VERBAL\n</b>                 Hungarian?\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   95.\n</b>\n<b>                                 KEATON\n</b>                Knock it off.\n\n<b>      DOLLY OVER TO REVEAL:\n</b>\n\n      McManus climbing up the side of the boathouse.\n\n      CONTINUE PAST HIM TO REVEAL:                                        r\n\n\n      A large boat. A very large boat.\n\n<b>97    EXT. BARGE                                                          97 \n</b>\n      Hockney maneuvers through a mesh of twisted steel, arriving\n      at a vantage point near the stern of the large boat.                 \n\n<b>      HOCKNEY'S P.O.V.                                                     \n</b>\n      A black van pulls up and parks near the crane. Four men in\n      suits get out. One remains with the van and the other three          \n      walk toward the boat.                                                \n\n      On the boat, five men come up from below deck. They are tense        \n      and cautious around the men in suits. Someone speaks in\n      Spanish and someone else in Russian. It takes a moment before\n      anyone speaks the same tongue. They settle on French for both\n      negotiators.\n\n      Hockney sits in the van. He handles a large shoulder bag            +\n      stuffed with plastique. He tests a timer on top.                     \n\n      He picks up a walkie-talkie.\n\n<b>                                 HOCKNEY                                   \n</b>                Are we ready, kids?                                        \n\n<b>98    SCENE DELETED                                                       98 \n</b><b>99    SCENE DELETED/MOVED TO BOTTOM SCENE 97                              99 \n</b><b>100   EXT. BOATHOUSE.-- ROOF                                              100 \n</b>      McManus is positioning himself on the roof of the boathouse.         \n      He stops and grabs his radio.                                        \n\n                                  McMANUS\n                If I didn't have to stop and answer you,\n                I would be.\n\n<b>                                               YELLOW 06/11/94\n</b>\n<b>                                                                   95A.\n</b>\n<b>101 MT. BOATHOUSE                                                      101'\n</b>\n<b>                                  KEATON\n</b>                               (into radio)\n                Everyone shut up. I'm ready. McManus, you\n                better be set up in ten seconds.\n\n                                  McMANUS\n                                (On radio)\n                I'm there.\n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   96.\n</b>\n<b>                                  KEATON\n</b>                                (To Verbal)\n                 I want you to stay here. Understand?\n\n<b>                                  VERBAL                                 +\n</b>                 But I'm supposed to -                                    \n\n<b>                                  KEATON\n</b>                 If we don't make it out, I want you to                   \n                 take the money and go.\n\n<b>                                  VERBAL\n</b>                                 (Confused)\n                 Keaton, I can't just -\n\n<b>                                  KEATON\n</b>                 I want you to find Edie. Both of you find\n                 some place safe. Tell her what happened -\n                 Everything. She knows people. She'll know\n                 what to do. If we can't get Kobayashi my\n                 way, she'll get him her way.\n\n<b>                                  VERBAL\n</b>                 What if I\n\n<b>                                  KEATON\n</b>                 Just do what I tell you.\n\n     Keaton turns and takes a few steps. He stops and looks back,\n     his face marked with guilt and agony.\n\n<b>                             KEATON (CONT'D)\n</b>                 Tell her I... Tell her I tried.\n\n     Keaton leaves before Verbal can respond. He walks down a ramp  \n     toward the boat.\n\n     He is no more than a few yards out of the shadows before the  \n     first man sees him.\n\n<b>102   EXT. DOCK                                                        102'\n</b>\n     One of the men in suits starts to yell to the others. Men\n     pull out guns and try to look as cool as they can.\n\n     Keaton walks right into the face of all of these men,\n     undaunted. His hands are in his pockets.\n\n     Above him, in the darkness, McManus pokes his head out and           \n\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   97.\n</b>\n     spies Keaton. He pulls his head back and sticks out the\n     barrel of the rifle.\n\n     Keaton comes to a stop about twenty feet from fifteen men all\n     together.\n\n<b>103  EXT. BOATHOUSE - ROOF                                               103'\n</b>     McMANUS'S P.O.V.\n     McManus stares through the scope of his rifle at the scene.\n     The cross-hairs breeze past Keaton and find a target. A man\n     in a suit.\n\n                                  McMANUS\n                 Pow.\n\n     He moves to another and then another, picking up speed and\n     mock-shooting the men. He is steady and quick. It is clear he\n     could take all fifteen in a few seconds.\n\n                             McMANUS (CONT'D)\n                 Pow-pow-pow-pow-pow-pow . Oswald was a\n                 fag.\n\n<b>104  EXT. DOCK                                                           104'\n</b>\n\n     The men shout questions at Keaton in a number of languages.\n<b>105  EXT. BARGE                                                          105'\n</b><b>     HOCKNEY'S P.O.V.                                                         \n</b>     A few men standing on the dock near the stern of the large\n     boat, move towards the commotion.\n\n     Hockney bails out and runs quickly and quietly through the\n     shadows, bringing the bomb with him.\n\n<b>106  EXT. BOATHOUSE''                                                    106'\n</b>\n     Verbal remains in the darkness, looking frightened.\n107  INT. BOATHOUSE - ROOF                                               107a\n     McManus still wanders with his scope.\n                                  McMANUS\n                 Old McDonald had a farm, ee-aye, ee-aye,\n                 oh. And on this farm he shot some guys.\n                 Ba-da-bip, ba-da-bing, bang-boom.\n\n<b>                                               YELLOW 06/11/94\n</b>\n<b>                                                                   98.\n</b>\n<b>108  EXT. DOCK                                                           108'\n</b>\n     Finally two men walk right towards Keaton. The rest train\n     guns on him. They reach for his arms, pointing their guns\n     right at him.\n\n     At the far end of the dock, Hockney throws his bomb onto the\n     stern of the large boat.\n\n<b>     IT EXPLODES                                                          \n</b>     The men surrounding Keaton, are distracted.\n     Keaton pulls a pistol out of each pocket and shoots the two\n     men closest to him.                                                  \n\n<b>109  EXT. BOATHOUSE - ROOF                                               109'\n</b>\n                                 McMANUS\n<b>                ELVIS HAS LEFT THE BUILDING.\n</b>\n     He fires as fast as he can.\n\n<b>110  EXT. PIER                                                           110\n</b>\n     The men from the boat and the men in suits try to peg Keaton,\n     but McManus' sniping has them running.\n\n<b>111  INT. CRANE                                                          111\n</b>\n     The crane operator opens the door to bails out, leaving the\n     crane in motion.,,\n\n<b>112  EXT. BOATHOUSE - ROOF                                               112'\n</b>\n     McManus runs across the roof of the boathouse and jumps down\n     to the pier. He arrives at a thick mooring cable and climbs\n     across to the boat.                                                 i\n\n<b>     MEANWHILE ON THE DOCK:                                               \n</b>\n     Keaton climbs up onto a small lifeboat hanging from the side         \n     of the larger boat. From this he climbs aboard the large             \n     boat.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   99.\n</b>113   EXT. DOCK                                                            113f\n      Hockney is firing in all directions.\n      SUDDENLY, he realizes no one is left on the dock.\n\n<b>      PAUSE  \n</b>\n      FINALLY, he turns and runs back for the van parked on the\n      pier above. He finds a ramp leading from the dock to the\n      pier.  \n\n      At the van, he finds the one man who has stayed behind to\n      protect it.                                 I                       i\n\n      The man hears Hockney coming and raises his gun. Hockney runs       i\n      straight at him, screaming frantically.                             i\n\n<b>                                  HOCKNEY                                  \n</b>                               (In Spanish)\n                &lt;&lt;DON'T SHOOT, DON'T SHOOT. LET'S GET THE                 +\n                FUCK OUT OF HERE. EVERYONE IS DEAD.&gt;&gt;                      \n\n      BOOM                                                                i\n\n      He shoots the man point blank in the face and runs over his\n      body as it falls.\n\n      He gets to the back door of the van and yanks it open.\n\n      The inside is stacked with large wooden crates.\n\n<b>114   INT. VAN                                                             114\n</b>\n      Hockney, suddenly oblivious to the sound of gunfire, opens\n      one of the crates and looks inside.\n\n      IT IS FILLED WITH MONEY. Cash and negotiable bonds of all\n      kinds.\n\n      He smiles.\n<b>      BOOM\n</b>      BLOOD sprays all over the money. Hockney looks at it,\n      puzzled.\n\n      Hockney raises a blood-soaked hand from his belly.                   \n      He turns and stares in horror.                                       \n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   99A.\n</b>\n     BOOM - Another shot takes off the top of his head.\n\n<b>115  EXT. PIER                                                            115\n</b>\n     McManus runs like a wild man across the deck, heading for the\n     hatch .\n\n     He shoots in all directions as though he has eyes in the back\n     of his head. He sees Keaton climbing onto the deck of the\n     boat.\n\n<b>                                                YELLOW 06/11/34\n</b>\n\n<b>                                                                   100.\n</b>\n<b>116  EXT. WAREHOUSE                                                      116\n</b>\n     Verbal is wrestling with what to do. He finally makes a break\n     for the other side of the boathouse.\n\n<b>117  EXT. BOAT DECK                                                      117'\n</b>     The crane continues to swing.\n     A single bullet hits one of the barrels on the suspended\n     pellet.\n\n     Gasoline pours out through the bullet-hole.\n118  SCENE DELETED                              '                        118f\n<b>119  EXT. BOAT                                                           119\n</b>     Keaton finds the hatch and goes below, shooting a man on his\n     way up the stairs. McManus jumps on board and runs down\n     behind him.\n\n<b>120  EXT'. PIER                                                          120'\n</b>\n     Verbal arrives at the top of the ramp leading from the dock\n     to the pier.                                                        +\n     He ducks down behind a guardrail beside the ramp.                    \n     He turns and sees Hockney's dead body next to the van.               \n     He looks around frantically, frozen in terror.                       \n     It is quiet, except for the sounds of screaming, far off in\n     the bowels of the boat and the hum of the crane.                     \n\n<b>121  INT. RABIN'S OFFICE - DAY - PRESENT                                 121\n</b>\n<b>                                  KUJAN\n</b>                Why didn't you run?\n\n<b>                                                 PINK 06/07/94\n</b>\n\n<b>                                                                      101.\n</b>\n\n<b>                                  VERBAL\n</b>                I froze up. I thought about Fenster and\n                how he looked when we buried him, then I\n                thought about Keaton. It looked like he\n                might pull it off.\n\n<b>     A KNOCK ON THE DOOR.\n</b>\n     Rabin steps in and motions for Kujan to come outside.\n\n\n<b>                                                                          122'\n</b><b>122  INT.HALLWAY\n</b>\n\n     Rabin and Jack Baer are in the hall. Rabin hands Kujan a             \n     thick manila folder. Kujan thumbs through it.                        \n\n<b>                                   BAER\n</b>                A boy came across a body on the beach\n                this morning. Thrown clear when the boat                  \n                burned. Shot once in the head. Two guys                   \n                from the F.B.I. just identified him.                     +\n\n<b>                                  KUJAN\n</b>                And ?\n\n<b>                                  RABIN\n</b>                His name was Arturo Marquez. A petty\n                smuggler out of Argentina. He was\n                arrested in New York last year for\n                trafficking. He escaped to California and\n                got picked up in Long Beach. They were\n                setting up his extradition when he\n                escaped again. Get this - Edie Finneran\n                was called in to advise the proceedings.\n\n<b>                                  KUJAN\n</b>                Kobayashi.\n\n     Bear nods.\n\n<b>                                   RAB IN\n</b>                I called New York County and they fared\n                me a copy of Marquez's testimony. He was\n                a rat.\n\n     Kujan pulls out page after page from the file.\n\n<b>                                  KUJAN\n</b>                A big fucking rat.\n\n<b>                                                 PINK 06/07/94\n</b>\n\n<b>                                                                     102.\n</b>\n<b>                                  RABIN +\n</b>                Arturo was strongly opposed 'to going back\n                to prison. So much so that he informed on\n                close to fifty guys. Guess who he names\n                for a finale?\n\n     Kujan finds one sheet and notices a paragraph is highlighted.\n\n<b>                                  KUJAN\n</b>                Keyser Soze\n\n<b>                                  BAER\n</b>                There's more.\n\n<b>123 INT. RABIN'S OFFICE - MOMENTS LATER                               123\n</b>     Kujan walks in and sits down in front of Verbal. He smiles.\n<b>                                  KUJAN\n</b>                I'11 tell you what I know. Stop me when\n                it sounds familiar.\n\n     Verbal is confused.\n\n<b>                                  KUJAN\n</b>                There was no dope on that boat.\n\n<b>124  INT. BOAT - NIGHT - ONE WEEK PRIOR                               124\n</b>\n     Keaton is weaving through tight, low-ceiling corridors,\n     looking in every cabin, working his way towards the bottom of\n     the boat.\n\n     ELSEWHERE IN THE BOAT, McManus is tearing though the\n     corridors, seemingly less interested in securing the cargo as\n     he is in killing everyone on board.\n\n     He screams like a lunatic, shooting everything in his path,\n     killing some men with his bare hands, shooting others,\n     stabbing others still with a knife he has brought along.\n\n<b>                                                                      125\n</b><b>125  INT. CORRIDOR\n</b>\n\n     JAIME, one of the men from the boat, is half-pushing, half-\n     helping a thin and sweaty looking MAN IN A CHECKERED BATHROBE\n     towards a cabin at the end of the hall.\n\n     The man in the robe is trembling. He seems stricken with\n     fear.\n\n<b>                                                 BLUE 06/01/94\n</b>\n\n<b>                                                                     103.\n</b>\n<b>                              MAN IN ROBE\n</b>                He's here. I saw him on deck.\n\n     Jaime pushes him inside the cabin and shuts the door.\n\n     A stereo playing softly in the room mixes with the man's\n     panicked breathing.\n\n     The man in the robe screams through the closed door, his\n     voice echoing off of the metal bulkheads.\n\n<b>                               MAN IN ROBE\n</b><b>                                 (CONT'D)\n</b><b>                I'M TELLING YOU IT'S KEYSER SOZE.                           \n</b>\n     Jaime stands outside the door of the cabin and turns to face\n     down the hall. Off in some other part of the boat, he can\n     hear McManus wailing like a banshee and the ever-less\n     frequent sound of gunshots.\n\n<b>126   INT. HOLD                                                            126\n</b>\n     Keaton has come to the four-foot-high door to the hold. The\n     door is open slightly. Keaton finds this strange. He pushes\n     the door open and steps inside. The hold is empty.\n\n     He hears a noise behind him. He wheels around to fire. He\n     sees McManus in the door. His face is covered with blood.\n\n                                 McMANUS\n                Did you hear what I heard?\n\n<b>                                 KEATON\n</b>                What happened to you?\n\n                                 McMANUS\n                Keyser Soze is on the boat.                                 \n\n<b>                                 KEATON\n</b>                What?\n\n                                 McMANUS\n                I heard somebody screaming his nuts off.\n                He said Keyser Soze was on the boat.                        \n\n<b>                                 KEATON\n</b>                Are you alright?\n\n     McManus rubs some of the blood off with his sleeve.\n\n<b>                                                    SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                     104.\n</b>\n                                 McMANUS\n                Huh? Oh, It's not mine.\n\n<b>                                  KEATON\n</b>                There's no coke.\n\n     McManus looks around the hold as though he'll see four and a\n     half tons of dope in some corner where Keaton might have\n     missed it.\n\n     The two men look at one another. There is a long, pregnant\n     silence.\n\n                                  McMANUS\n                Let's get the fuck out of here.\n\n<b>                                  KEATON\n</b>                Right behind you.\n\n<b>127   INT. CORRIDOR                                                     127\n</b>\n     Keaton and McManus step out of the hold, walking slowly and\n     cautiously back from where they came. They hear the sounds of\n     footsteps running on the deck above and the occasional\n     hollered sentence in Spanish.\n\n<b>                                  KEATON\n</b>                Where's Hockney?\n\n                                  McMANUS\n                I don't think he made it to the boat.\n\n     They come to a corner. They can go left or right.\n\n<b>                                  KEATON\n</b>                I can't remember which way.\n\n                                 McMANUS\n                Right -\n\n<b>     BOOM - BOOM\n</b>\n     Gunshots fill the hallway from behind them. They do not stop\n     to turn around. Keaton goes left, McManus goes right. They\n     run in opposite directions with the sound of gunfire right\n     behind them.\n\n<b>128 INT. HALLWAY - CABIN                                                128\n</b>     Jaime squints and cocks his head.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   105.\n</b>\n      SOMEONE IS COMING. He raises a pistol and crouches by the\n      door.\n\n<b>129   INT. CABIN                                                         129\n</b>\n      The man in the bathrobe sits on the foot of the bed watching\n      the door. He hears the sounds of fighting somewhere not too\n      far away.\n\n      He crawls over the bed and squeezes between it and the\n      bulkhead. Only the top of his head is visible. He starts to\n      cry.\n\n      BOOM - BOOM - Two shots just outside in the hall.\n\n      SUDDENLY, the door bursts open. Jaime collapses in a heap on\n      the floor, a bullet hole in his eye.\n\n<b>      A FIGURE LOOMS IN THE DOOR\n</b>\n      The man in the bathrobe looks up at the figure. We cannot see\n      him.\n\n<b>                               MAN IN ROBE\n</b>                I told them nothing.\n\n<b>      BOOM\n</b>\n\n      The man in the robe falls dead.\n<b>130   EXT. DECK - MOMENTS LATER                                          130\n</b>      The boat is quiet now. Keaton walks out onto the deck.\n      He looks out over the pier and sees Verbal standing in the\n      middle of the carnage, frozen. Their eyes meet. Keaton waves\n      at him as if to shoe him away.\n\n<b>131   EXT. PIER - TOP OF RAMP                                            131\n</b>\n      Verbal hesitates and finally moves towards the van with the\n      money. He looks back over his shoulder and sees Keaton.\n      Keaton sees him looking and waves again, hurrying him along.  \n\n      Verbal turns away and focuses on the van.\n\n\n<b>                                                                         132\n</b><b>132   EXT. DECK\n</b>\n\n      Keaton hears a noise behind him. He swings around and points\n      his gun at McManus again. He puts the gun down.\n\n<b>                                                YELLOW 06/11/94\n</b>\n<b>                                                                   106.\n</b>\n      McManus smiles. He walks slowly across the deck towards\n      Keaton. Something is not right about him.\n\n                                  McMANUS\n                 Strangest thing...\n\n      He slumps to the deck. Keaton rushes over to him. He kneels\n      down and sees a pipe sticking out of the back of McManus's\n      neck.\n\n<b>133   EXT. PIER                                                            133'\n</b>\n      Verbal approaches the van, stepping over Hockney's body. He\n      closes the back doors of the van.         ,                          \n\n      He looks to his left at the huge loading crane. He glances\n      upward along the giant' arm as it swings steadily on.\n\n      Somewhere, off in the distance, the sound of SIRENS can be\n      heard.\n\n<b>134   EXT. DECK                                                            134\n</b>\n      Keaton kneels by McManus, trembling with rage. After a moment\n      he stands, looking down at McManus' dead body.\n\n<b>135   EXT. PIER                                                            135\n</b>\n      SUDDENLY, Verbal realizes something. He turns and goes to\n      call out a warning to Keaton. He is too late.\n\n<b>136   EXT. DECK                                                            136\n</b>      Keaton never sees the crane coming.\n<b>      WHAM\n</b>\n      The pellet of barrels hits him square in the back and sends\n      him flying into the wheel house of the boat.\n\n      Keaton is still for a moment. Finally, he tries to get up,\n      but finds he cannot move his legs.                                   \n\n<b>137   EXT. PIER                                                            137\n</b>\n      Verbal runs down the ramp as fast as he can. He comes to a           \n      rope ladder hanging down the side of the boat.                      +\n\n      SUDDENLY, he stops dead in his tracks, looking up at the\n      boat.\n\n<b>                                          YELLOW 06/11/94\n</b>\n\n<b>                                                             106A.\n</b>\n&gt;From where he stands, he can just make out the figure of a\nTAU, THIN MAN walking along the edge of the deck. He moves\nquietly and calmly in the shadows towards the crane, looking\nout of place in his expensive suit.\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   107.\n</b>\n     Something about this man terrifies him.\n<b>138  SCENE DELETED                                                     '  138'\n</b><b>139  INT. RABIN'S OFFICE - DAY - PRESENT                        .         139\n</b><b>                                  KUJAN\n</b>                And that's when you say in your statement\n                that you saw...\n\n     Kujan picks up his copy of Verbal's statement to the D.A.\n\n<b>                              KUJAN (CONT'D)\n</b>                A man in a suit with a slim build. Tall.\n\n<b>                                 VERBAL\n</b>                Wait a minute.\n\n<b>                                  KUJAN\n</b>                            (Looking at watch)\n                I don't have a minute. Are you saying it\n                was Keyser Soze? You told the D.A. you\n                didn't know who it was.\n\n     Verbal is drowning in Kujan's interrogation. He looks dazed.\n\n\n<b>                                  VERBAL\n</b>                I - there had to be dope there.\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                                108.\n</b>\n<b>                             KUJAN\n</b>           Don't shine me, Verbal. No more stalling.\n           You know what I'm getting at.\n\n<b>                            VERBAL\n</b>           I don't.\n\n<b>                             KUJAN\n</b><b>           YES YOU DO. YOU KNOW WHAT I'M GETTING AT.\n</b><b>           THE TRUTH. TRY TO TELL ME YOU DIDN'T\n</b><b>           KNOW. TRY TO TELL ME YOU SAW SOMEONE KILL\n</b><b>           KEATON .\n</b>\nFor the first time, Verbal stands and tries to move away from\nKujan, but Kujan stays in his face, backing him into a\ncorner. Verbal shields himself with his hands and shuts his\n\neyes.\n\n<b>                        KUJAN (CONT'D)\n</b><b>           TRY TO REEF LYING TO ME NOW. I KNOW\n</b><b>           EVERYTHING .\n</b>\n<b>                             VERBAL\n</b>           I don't know what you're talking about.\n\n<b>                             KUJAN\n</b><b>           YOU KNOW. YOU'VE KNOWN THIS WHOLE FUCKING\n</b><b>           TIME. GIVE IT TO ME.\n</b>\nVerbal looks into Kujan's eyes with genuine terror. Kujan's\nface is red, his body trembles. His locomotive breathing is\nthe only sound in the room.\n\n<b>                             VERBAL\n</b>           I don't understand what you're saying. I\n           saw Keaton get shot, I swear to you.\n\n<b>                             KUJAN\n</b>           Then why didn't you help him?\n\n<b>                             VERBAL\n</b>           I WAS AFRAID, OKAY? Somehow, I was sure\n           it was Keyser Soze at that point. I                        \n           couldn't bring myself to raise my gun to\n           him.\n\n<b>                             KUJAN\n</b>           But Keaton...\n\n<b>                             VERBAL\n</b>           It was Keyser Soze, Agent Kujan. I mean                    \n           the Devil himself. How do you shoot the\n           Devil in the back?\n\n<b>                                               YELLOW 06/11/94\n</b><b>                                                                  109.\n</b>     Verbal holds up a shaking, twisted hand.\n<b>                            VERBAL (CONT'D)\n</b>                What if you miss?\n\n<b>140  EXT. BARGE - NIGHT - ONE WEEK PRIOR                               140'\n</b>\n     Verbal is hiding in the tangle of girders and cables on the\n     barge.\n\n<b>     VERBAL'S P.O.V.\n</b>\n\n     Keaton's body is completely obscured.\n     The man in a suit strides across the deck over to Keaton,\n     stopping to relieve himself on a small fire on the deck.\n     He walks up and stands over Keaton. The two men exchange\n     words and the man in the suit pulls out a pistol. He points\n     it at Keaton.\n\n<b>     RED AND BLUE LIGHTS FLASH BEHIND VERBAL\n</b>\n     Verbal turns. He can just make out police cars coming in the\n     distance.\n\n<b>     BANG\n</b>\n     Verbal hears a shot from the deck of the boat. He turns in\n     time to see the man in the suit running across the deck\n     toward the gangway.\n\n     Verbal can barely see the man from where he is now. The man\n     in the suit is covered by shadows and the poor angle from the\n     barge. Verbal strains to see but he cannot.\n\n     The man in the suit stops long enough to pull out a lighter.\n     He turns and walks back across the deck and out of sight.\n     A moment later flames leap up from on the deck.\n     The mesh of steel and rubber leaves a dark and open cocoon at\n     its base.                                                            \n\n<b>     MOVE INTO THE DARKNESS.                                              \n</b>\n     Sirens are close now. Almost here. The sound of fire raging\n     out of control.\n\n<b>     SIRENS BLARING. TIRES SQUEALING. CAR DOORS OPENING. FEET             \n</b><b>     POUNDING THE PAVEMENT.\n</b>\n<b>                                          YELLOW 06/11/94\n</b><b>                                                             109A.\n</b><b>MOVE FURTHER, SLOWER, INTO THE DARKNESS.\n</b>Voices yelling. New light flickering in the surrounding\ndarkness.\n\n<b>                                                 BLUE 06/01/94\n</b><b>                                                                     110.\n</b><b>141 INT. RABIN'S OFFICE - DAY - PRESENT                               141\n</b><b>                                  KUJAN\n</b>                Arturo Marquez. Ever hear of him?\n\n<b>                                 VERBAL\n</b>                Wha- No.\n\n<b>                                  KUJAN\n</b>                He was a stool pigeon for the Justice\n                Department. He swore out a statement to\n                Federal Marshals that he had seen and\n                could positively identify one Keyser Soze\n                and had intimate knowledge of his\n                business, including, but not exclusive\n                to, drug trafficking and murder.\n\n<b>                                 VERBAL\n</b>                I never heard of him.\n\n<b>                                  KUJAN\n</b>                His own people were selling him to a gang\n                of Hungarians. Most likely the same\n                Hungarians that Sate all but wiped out\n                back in Turkey. The money wasn't there\n                for dope. The Hungarians were going to\n                buy the one guy that could finger Soze\n                for them.\n\n<b>                                  VERBAL\n</b>                I said I never heard of him.\n\n\n<b>                                  KUJAN\n</b>                But Keaton had. Edie Finneran was his\n                extradition advisor. She knew who he was\n                and what he knew.\n\n<b>                                 VERBAL\n</b>                I don't\n\n<b>                                  KUJAN\n</b>                There were no drugs on that boat. It was\n                a hit. A suicide mission to whack out the\n                one man that could finger Keyser Soze so                  \n                Sate had a few thieves put to it. Men he\n                knew he could march into certain death.\n\n<b>                                  VERBAL\n</b>                But how - wait. You're saying SOZE sent                  t\n                us to kill someone?\n\n\n<b>                                            BLUE 06/01/94\n</b>\n<b>                                                                111.\n</b>\n<b>                             KUJAN\n</b>           I'm saying Keaton did.\n\nVerbal cannot grasp this. He squints, trying to understand.\n\n<b>                        KUJAN (CONT'D)\n</b>           Verbal, he left you behind for a reason.\n           If you all knew Soze could find you\n           anywhere, why was he ready to send you\n           off with the money when he could have\n           used you to take the boat?\n\n<b>                            VERBAL\n</b>           He wanted me to live.\n\n<b>                             KUJAN\n</b>           Why did he want you to live? A one-time                     \n           dirty cop without a loyalty in the world\n           finds it in his heart to save a worthless\n           rat-cripple? No, sir. Why'\n\n<b>                            VERBAL\n</b>           Edie.\n\n<b>                             KUJAN\n</b>           I don't buy that reform story for a\n           minute. And even if I did, I certainly\n           don't believe he would send you to\n           protect her. So why?\n\n<b>                            VERBAL\n</b>           Because he was my friend.\n\n<b>                             KUJAN\n</b>           No, Verbal. You weren't friends. Keaton\n           didn't have friends. He saved you because\n           he wanted it that way. It was his will.\n\nVerbal grinds to a mental halt, trying to grasp the\nimplication .\n\n<b>SUDDENLY:\n</b>\n<b>                            VERBAL\n</b>           No...\n\n<b>                             KUJAN\n</b>           Keaton was Keyser Soze\n\n<b>                            VERBAL\n</b><b>           NO.\n</b>\n<b>                                              SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                112.\n</b>\n<b>                             KUJAN\n</b>           The kind of guy who could wrangle the\n           wills of men like Hockney and McManus.\n           The kind of man who could engineer a\n           police line-up from all his years of\n           contacts in N.Y.P.D.\n\nVerbal stands on wobbly legs, shaking with anger.\n\n<b>                            VERBAL\n</b><b>           NO, NO, NO, NO, NO.\n</b>\n<b>                             KUJAN\n</b><b>           THE KIND OF MAN THAT COULD HAVE KILLED\n</b><b>           EDIE FINNERAN.\n</b>\nA strange look crosses Verbal's face. Shock perhaps, or\nrevelation.\n\n<b>                        KUJAN (CONT'D)\n</b>           They found her yesterday in a hotel in\n           Pennsylvania. Shot twice in the head.\n\nIt starts to sink in with Verbal. His eyes swell.\n\n<b>                            VERBAL\n</b>           Edie...\n\n<b>                             KUJAN\n</b>           He used all of you to get him on that\n           boat. He couldn't get on alone and he had\n           to pull the trigger himself to make sure\n           he got his man. The one man that could\n           identify him.\n\n<b>                            VERBAL\n</b>           This is all bullshit.\n\n<b>                             KUJAN\n</b>           He left you to stay behind and tell us he\n           was dead. You saw him die, right? Or did\n           you? You had to hide when the first\n           police cars showed up. You heard the\n           shot, just before the fire but you didn't\n           see him die.\n\n<b>                             VERBAL\n</b>           I knew him. He would never -\n\n<b>                             KUJAN\n</b>           He programmed you to tell us just what he\n           wanted you to. Customs has been\n\n<b>                                               SCRIPT DATE 5/25/94\n</b>\n\n<b>                                                                113.\n</b>                         KUJAN (cont'd)\n           investigating him for years. He knew we\n           were close. You said it yourself. Where\n           is the political pressure coming from?\n           Why are you being protected? It's Keaton\n           making sure you tell us what you're\n           supposed to. Immunity is your reward.\n\n\n<b>                             VERBAL\n</b><b>           BUT WHY ME? WHY NOT HOCKNEY OR FENSTER OR\n</b>           McMANUS? I'm a cripple. I'm stupid. Why\n           me?\n\nVerbal hears the weight of his words and falls back in his\nchair, Kujan looks at him with some pity,; but he is too far\n\nin to stop.\n\n<b>                             KUJAN\n</b>           Because you're a cripple, Verbal. Because\n           you're stupid. Because you were weaker\n           than them. Because you couldn't see far\n           enough into him to know the truth.\n\nVerbal is crying now. He shakes his head, eyes closed.\n\n<b>                         KUJAN (CONT'D)\n</b>           If he's dead, Verbal - if what you say is\n           true, then it won't matter. It was his\n           idea to hit the Taxi Service in New York,\n           wasn't it? Tell me the truth.\n\n<b>                             VERBAL\n</b>                           (Sobbing)\n           It was all Keaton. We followed him from\n           the beginning.\n\nKujan smiles with triumphant satisfaction.\n\n<b>                         VERBAL (CONT'D)\n</b>           I didn't know. I saw him die. I believe\n           he's dead. Christ\n\n<b>                             KUJAN\n</b>           Why lie about everything else, then?\n\n<b>                             VERBAL\n</b>           You know what it's like, Agent Kujan, to\n           know you'll never be good? Not good like\n           you. You got good all fucked around. I\n           mean a stand up guy. I grew up knowing I\n           was never going to be good at anything\n           'cause I was a cripple. Shit, I wasn't\n\n<b>                                            BLUE 06/01/94\n</b>\n\n<b>                                                               114.\n</b>                        VERBAL (cont'd)\n\n           even a good thief. But I thought the one\n           thing I could be good at was a keeping my\n           mouth shut - keeping the code. I didn't\n           want to tell you for my dignity, that's\n           all, and you robbed me, Agent Kujan. You\n           robbed me.\n\nKujan pulls the microphone out from under his tie and puts it +\non the desk. Verbal actually manages to snort a laugh, but\nonly briefly, overcome by an apparent wave of nausea.\n\n<b>                             KUJAN\n</b>           You're not safe on your own.\n\n<b>                            VERBAL\n</b>           You think he's..?\n\n<b>                             KUJAN\n</b>           Is he Keyser Soze I don't know, Verbal.                    \n           It seems to me that Keyser Sate is a\n           shield. Like you said, a spook story, but\n           I know Keaton - and someone out there is\n           pulling strings for you. Stay here and\n           let us protect you.\n\n<b>                             VERBAL\n</b>           I'm not bait. No way. I post today.\n\n<b>                             KUJAN\n</b>           You posted twenty minutes ago. Captain\n           Leo wants you out of here a.s.a.p.,\n           unless you turn state's.\n\n<b>                             VERBAL\n</b>           I'11 take my chances, thank you. It's\n           tougher to buy the cheapest bag-man than\n           it is to buy a cop.\n\n<b>                             KUJAN\n</b>           Where are you going to go, Verbal? You\n           gonna run? Turn states evidence. You\n           might never see trial. If somebody wants\n           to get you, you know They'll get you out\n           there.\n\n<b>                             VERBAL\n</b>           Maybe so, but I'm no rat, Agent Kujan.\n           You tricked me, that's all. I won't keep\n           my mouth shut 'cause I'm scared. I'11\n           keep it shut 'cause I let Keaton down by\n           getting caught - Edie Finneran too. And\n           if they kill me, it's\n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   115.\n</b>                             VERBAL (cont'd)\n                because They'll hear I dropped dime.\n                They'll probably hear it from you.\n\n     Verbal stands, mustering his shattered dignity and walks\n     towards the door. Rabin opens it for him from outside.\n\n     For once Kujan cannot bring himself to look at Verbal.\n     Verbal turns to the door, stopping to look Rabin in the eye.\n<b>                            VERBAL (CONT'D)\n</b>                Fuckin' cops.\n\n     He steps out of the room and into the hall. Rabin follows\n     him.\n\n<b>142  INT. HOSPITAL - DAY                                                142\n</b>\n     Daniel Metzheiser comes out of Arkosh Kovash's room with a\n     single sheet of 15x20 inch paper in his hand. He inspects the\n     sketch with great interest. He folds the edges of the paper\n     back to make it smaller.\n\n<b>143  INT. HOSPITAL RECEPTION ROOM                                       143\n</b>\n     Metzheiser walks behind the reception desk without asking the\n     nurse for permission and helps himself to the fax machine.\n\n<b>144  INT. DEPOT - LATER                                                 144\n</b>\n     Verbal is downstairs in the depot of the police station\n     picking up his personal belongings.\n\n     A FAT, WHITE-HAIRED COP is checking off the items as he takes\n     them out of the tray in which they are kept.\n\n<b>                                    COP\n</b>                One watch: gold. One cigarette lighter:\n                gold. One wallet: brown. One pack of                       \n                cigarettes.\n\n     Verbal collects his personal items and shuffles on his lame\n     leg toward the exit.\n\n<b>145 INT. DISPATCHER'S OFFICE                                            145\n</b>\n     Jack Baer stands by a fax machine. A green light comes on\n     next to a digital display.\n\n     The display reads: RECEIVING\n\n<b>                                                 BLUE 06/01/94\n</b><b>                                                                     116.\n</b><b>146   INT. RABIN'S OFFICE                                                 146\n</b>     Kujan stares solemnly at the bulletin board, drinking from\n     Rabin's coffee cup. Rabin sits at the desk, sifting through\n     the mound of gapers as though considering organizing them\n     once and for all.\n\n<b>                                  RAB IN\n</b>                You still don't know shit.\n\n<b>                                  KUJAN\n</b>                I know what I wanted to know about\n                Keaton.\n\n<b>                                  RAB IN\n</b>                Which is shit.\n\n<b>                                  KUJAN\n</b>                No matter. He'll have to know how close\n                we came.\n\n<b>                                  RAB IN\n</b>                Keyser Sate or not, if Keaton's alive\n                he'll never come up again.\n\n<b>                                  KUJAN\n</b>                I'11 find him.\n\n<b>                                  RAB IN\n</b>                Waste of time.\n\n<b>                                  KUJAN\n</b>                               (To himself)\n                A rumor is not a rumor that doesn't die.\n\n<b>                                  RAB IN\n</b>                What?\n\n<b>                                  KUJAN\n</b>                Nothing. Something I - forget it.\n\n     Kujan shakes his head. He gestures to the desk.\n\n<b>                             KUJAN (CONT'D)\n</b>                Man, you're a fucking slob.\n\n     Rabin regards the mess of his office.\n\n<b>                                  RAB IN\n</b>                Yeah. It's got it's own system though. It\n                all makes sense when you look at it\n                right. You just have to step back from\n\n\n<b>                                                 BLUE 06/01/94\n</b>\n<b>                                                                     117.\n</b>                              RABIN (cont'd)\n                it, you know? You should see my garage,\n                now that's a horror show...                               \n\n     Kujan is not listening. He has been staring at the bulletin\n     board, lost in thought, his unfocused eyes drifting across\n     the mess of papers, not looking at anything at all.\n\n<b>147  EXT. STREET                                                         147\n</b>\n     Verbal steps out into the sunlight, putting on a pair of\n     cheap sunglasses. He looks up and down the crowded street.\n     People on their way to and from lunch, no doubt.\n\n     Cars choke the street in front of the police department as\n     they wait for pedestrians to clear the way.\n\n<b>148  INT. DISPATCHER'S OFFICE                                    - 148\n</b>\n     A single sheet of paper comes out of the fax machine, face\n     down.\n\n<b>149  INT. RABIN'S OFFICE                                                 149\n</b>\n     Kujan still stares at the bulletin board.\n\n     SUDDENLY, Kujan's face changes. He leans in closer to the\n     bulletin board and squints his eyes. His face changes again.\n\n     First a look of puzzlement, then confusion - finally\n     realization.\n\n     The coffee cup tumbles from his hand. It hits the floor with\n     the SMASH of cheap porcelain. Coffee splatters everywhere.\n\n     Rabin snaps out of his droning and looks up in surprise.\n\n<b>     KUJAN'S P.O.V.\n</b>\n     Kujan is staring not at what is on the bulletin board, but at\n     the bulletin board itself.\n\n     His eyes follow the aluminum frame, mounted firmly to the\n     wall. One might note it's sturdy construction and it's\n     convenient size. Big enough to hold a lifetime of forgotten\n     and disregarded notes and facts. Years of police trivia that\n     has been hung and forgotten with the intention of finding a\n     use for it all someday. One might want such a bulletin board\n     for one's self. One would look to see who makes such a               \n     bulletin board.\n     Kujan's eyes are locked on a metal plate bearing the\n     manufacturer's name.\n\n<b>                                               YELLOW 06/11/94\n</b><b>                                                                  118.\n</b>      It reads: QUARTET - SKOKIE, ILLINOIS\n      Kujan's eyes flash all' over the bulletin board. He finds a\n      picture of Rabin in the far corner. He stands beside a scale\n      in fishing gear. He proudly holds a hand out to his freshly\n      caught marlin. His eyes skim quickly over and stop on an\n      eight and a half by eleven inch fax sheet of what must be a\n      THREE HUNDRED POUND BLACK MAN. Kujan glazes over his name, it\n      is irrelevant. His aliases stand out.\n\n      Slavin, BRICKS, Shank, REDFOOT, Thee, Rooster...\n\n      KUJAN'S EYES WIDEN with sudden realization. He runs for the\n      door.\n\n      His foot crushes the broken pieces of Rabin's coffee cup. The\n      cup that hovered over Verbal's head for two hours.\n\n      Kujan is in too much of a hurry to notice the two words\n      printed on the jagged piece that had been the bottom of the\n      cheap mug.\n\n<b>                           KOBAYASHI PORCELAIN.\n</b>\n<b>150   EXT. HALLWAY                                                          150\n</b>\n      Kujan is sprinting wildly down the hall for the stairs.\n\n<b>151   EXT. STREET                                                           151\n</b>\n      Verbal looks behind him and sees ANOTHER COP standing just          \n      inside the doorway, lighting a cigarette. The cop notices\n      Verbal and watches him in the way that cops look at people\n      they cannot place in the category of idiot citizen, or stupid\n      criminal.\n\n      Verbal smiles politely, meekly at the cop and walks down the\n      steps into the moving throng.\n\n<b>152   INT. DEPOT                                                            152\n</b>\n      Kujan runs up to the desk where Verbal had only moments\n      before picked up his belongings. Rabin is right behind him, a\n      look of absolute confusion on his face.\n\n<b>                                   KUJAN\n</b>                WHERE IS HE? DID YOU SEE HIM?                             t\n\n<b>                                    COP\n</b>                The Cripple? He went that way.                             \n\n<b>                                               YELLOW 06/11/94\n</b>\n\n<b>                                                                   118A.\n</b>\n     The cog gestures towards the door.\n\n     Kujan runs outside looking around frantically.\n\n<b>153 SCENE DELETED                                                       153'\n</b>\n<b>                                                YELLOW 06/11/94\n</b>\n\n<b>                                                                   119.\n</b>\n\n<b>154  EXT. SIDEWALK                                                       154\n</b>\n     Verbal limps his way carefully across the sidewalk, avoiding\n     people as best as he can.\n\n     He looks over his shoulder, getting farther away from the\n     police station. He can see Rabin and the cop on the steps,\n     looking around with strange, lost expressions on their faces.\n\n     He does not notice the car creeping along the curb beside\n     him.\n\n<b>155  INT. CAR                                                            155\n</b><b>     DRIVER'S P.O.V.\n</b>     The driver's hands tap the wheel patiently. His eyes follow\n     Verbal as he fumbles through the crowd.\n\n<b>156  EXT. SIDEWALK                                                       156\n</b>\n     Kujan pushes and shoves, looking this way and that.\n<b>157  EXT. STREET                                                         157\n</b>     LOW ANGLE on the feet of dozens of people.\n     Verbal's feet emerge from the crowd on the far side. They\n     hobble along the curb.\n\n     SUDDENLY, the right foot seems to relax a little, the inward\n     angle straightens itself out in a few paces and the limp\n     ceases as though the leg has grown another inch.\n\n<b>     CRANE UP VERBAL'S BODY\n</b>\n     Verbal's hands are rummaging around in his pockets. The good\n     left hand comes up with a pack of cigarettes, the bad right\n     hand comes up with a lighter. The right hand flexes with all\n\n<b>                                                       BLUE 06/01/94\n</b>\n<b>                                                                           120.\n</b>\n<b>I-\n</b>           of the grace and coordination of a sculptor's, flicking the\n           clasp on the antique lighter with the thumb, striking the\n           flint with the index finger. It is a fluid motion, somewhat\n           showy.\n\n           Verbal lights a cigarette and smiles to himself. He turns and\n           sees the car running alongside.\n\n<b>     158   INT. DISPATCHER'S OFFICE                                           158\n</b>\n\n           Jack Beer pulls the sheet out of the fax machine and turns it\n           over, revealing the composite sketch of Keyser SOZE.                  \n\n           Though crude and distorted, one cannot help but notice how\n           much it leaks like VERBAL KINT.\n\n<b>     159   EXT. STREET                                                        159\n</b>           The car stops. The driver gets out.\n           IT IS KOBAYASHI, or the man we have come to know as such. He\n           smiles to Verbal. Verbal steps off of the curb, returning the\n           smile as he opens the passenger door and gets in.\n\n           The man called Kobayashi gets in the driver's seat and pulls\n           away .\n           A moment later, Agent David Kujan of U.S. Customs wanders\n           into the frame, looking around much in the way a child would\n           when lost at the circus. He takes no notice of the car\n           pulling out into traffic, blending in with the rest of the\n           cars filled with people on their way back to work.\n\n<b>           BLACK\n</b>\n<b>                  \n</b>\n\n\n\n\n<b></b></pre>\n\n<b>\n</b><b>\n</b><b></b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Usual Suspects, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Christopher McQuarrie\" title=\"Scripts by Christopher McQuarrie\">Christopher McQuarrie</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Mystery\" title=\"Mystery Scripts\">Mystery</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Usual Suspects, The Script.html#comments\" title=\"Usual Suspects, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:19:07.977402"}