{"title": "Village, The", "film_link": "/Movie Scripts/Village, The Script.html", "script_link": "/scripts/Village,-The.html", "info_raw": "\n\nVillage, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.38 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  M. Night Shyamalan\nGenres  Drama  Mystery  Thriller\nMovie Release Date : July 2004\n\nRead \"Village, The\" Script\n\n\n", "script": "\n\n                         THE VILLAGE\n\n\nTranscribed by Kendra (dzerted_island_grrrl@hotmail.com)\n\n\n\nThe Village is copyrighted by Buena Vista Home Entertainment and Touchstone Home Entertainment, among others.  This \ntranscript was made solely for my own entertainment and enlightenment, and for the entertainment and enlightenment of \nothers.  No profit was made from the transcribing of this movie, and it is not being distributed for profit.  If you \npaid for this copy of it, you got screwed.\n\n\nThe opening credits roll over shots of the woods.  At a cemetery, people are gathered for a funeral.  A grave has \nbeen dug, and a small, plain coffin, rests near it.  A man leans on the coffin, weeping a prayer.  \n\n\nAugust Nicholson:  Who'll pinch me to wake me up?  Who will laugh at me when I fall?  Whose breath will I listen for, \nso that I may sleep?  Whose hand will I hold, so that I may walk?  \n\n\nA small, plain headstone, reads \"Here Lies Daniel Nicholson, Beloved son of August Nicholson, June 17, 1890, October 3, \n1897.\"  He was just seven years old.  \n\n\n---\n\nEdward Walker (off-screen):  We may question ourselves, at moments such as these.  Did we make the right decision to \nsettle here?\n\n\nA banquet has been laid on polished wooden tables, outdoors.  The attendees are all dressed somberly.  Many women wear \nbonnets or hats.  Some of the men are bearded, and some are not.  Some have long hair, others, short hair.  All the \nwomen wear their hair tied back in some way.  The dress confirms that it is the late 1800's.  The surroundings reveal \nit to be a small village in a shallow valley, surrounded by forests.  Many houses are made of stone, some of wood.  The \nbanquet includes bread, corn, greens, potatoes... a bounty from the recent harvest.  Edward Walker, unofficial town \nleader, stands, making a speech before the feast.  His hair is reddish, but going gray, and he wears a beard.  \nAugust takes his hand.\n\n\nEdward Walker:  We are grateful for the time we have been given.\n\n\nHe sits, and the villagers begin to eat.  From the woods, a moaning sound, sorrowful.  The villagers quiet, and are \nstill.  Noah Percy begins to laugh and clap and stands up.  He is perhaps twenty-five, but has the mind of a small \nchild.  A young man seated next to him calms him down, and gets him to sit.\n\n\n---\n\nTwo young girls use brushes to scrub the dishes in an outdoor trough, while an older sister uses a green hand-pump to \nget water from the underground well, so the dishes can be rinsed.  The younger girls giggle and splash each other.\n\n\n---\n\nA woman in a gray skirt and a blue untucked blouse leads a flock of sheep into their barn.\n\n\n---\n\nMen and women work side-by-side in a glass greenhouse, cultivating lettuce, rhubarb, and other foods for the winter.  \nThe ladies wear simple print dresses, with some petticoats underneath, and back-buttoned aprons over their dresses.  \nThe men wear pants, shirts, vests, and many wear hats.  This is a simple village of working people.  Fancy clothes \nare worn only at weddings and other celebrations.\n\n\n---\n\nTwo sisters sweep the front porch of their simple home.  They wear plain boots, not fancy shoes.  They swirl their \nbrooms around, light-hearted.  The older sister spots something at the edge of the porch and puts her broom down.  It \nis a red flower.  Making haste, they pluck the flower, take it some yards from their home, and bury it.  They return \nto their chores, but are subdued.  The color of the flower, red, has spooked them, for it is the bad color.\n\n\n---\n\nAt night, a bearded young man in a yellow cloak watches the woods from a watchtower, one of two, at the edge of the \nvillage.  There is a bell in the tower, which can be rung as a warning.  There are yellow penants and burning torches \nall around the edge of the forest.  A low, moaning, rumbling sound comes from the trees.\n\n\n---\n\nAt a creek in the woods, a reflection off the water shows a swaying, red-cloaked figure walking ponderously by.\n\n\n---\n\nIt is morning.  Edward Walker, the school-teacher, approaches a group of children outside the schoolhouse.  They are \ngathered in a circle around something.\n\n\nEdward:  What manner of spectacle has attracted your attention so splendidly?  I ought to carry it in my pocket to \nhelp me teach.\n\n\nHe stands at the edge of the group and looks down.  Flies are buzzing.\n\n\nEdward:  Who came upon this?  Philip, did you move this?\n\n\nPhilip:  No, Mr. Walker.\n\n\nThe flies buzz louder and louder.  We see what they are looking at.  It is a small animal, probably a fox.  It has \nbeen killed and skinned, but the meat is still on its bones.  \n\n\n---\n\nInside the class, a girl in a light blue dress and pigtails speaks.  \n\n\nGirl:  I inspected it carefully.  Its head was twisted back, and much of its fur removed.\n\n\nEdward:  I see.\n\n\nBoy:  It was murdered.\n\n\nEdward:  But who is the culprit?  Who has done this heinous act?  \n\n\nThe girl who spoke before hesitates, but she decides to voice what is in all their minds.\n\n\nGirl:  Those We Don't Speak Of killed it.\n\n\nEdward:  There it is.  Why would such a notion come into your mind?\n\n\nBoy:  They're meat-eaters.\n\n\nEdward nods at him.  A different girl speaks.\n\n\nGirl:  They have large claws.\n\n\nEdward:  Children...  Those We Don't Speak Of, have not breached our borders in many years.  We do NOT go into THEIR \nwoods, they do NOT come into OUR valley.  It is a truce.  We do not threaten them.  Why would they do this?\n\n\n---\n\nAt a meeting of the Council of Elders, Vivian Percy is speaking.  She is there, with her husband, Robert, August \nNicholson, Victor, Edward and Tabitha Walker, Alice Hunt, Mrs. Clack, three other men, and one other woman.  The women \nare knitting, since their hands are not needed for the meeting, and they smile and giggle.\n\n\nVivian:  And we ought not to.... overlook The Flight of the Birds.  We didn't have it last year, and I, for one, \nmissed it desperately.  And I know your wife missed the children, dressed in feathers and such.\n\n\nTabitha:  I am fond of it.\n\n\nShe looks hopefully at her husband.\n\n\nEdward:  I do not have a say in this matter.  August Nicholson is chair of today's meeting.\n\n\nA door opens at the end of the meeting hall, and all turn to see who has come in.  It is a man with his hat in his \nhands, respectful.\n\n\nMan:  There is a young man who has requested a word with the elders.\n\n\nAugust:  Well, do have him come forward.\n\n\nThe young man is Lucius Hunt, only son of the widow Alice Hunt.  She jumps a bit when she sees him, but smiles.  He \nwears denim work-pants, a gray shirt, and a brown jacket.  His hair is a bit curly, but short, and there is a scar on \nhis lip.  He is clearly nervous and sways from one foot to the other.  He holds a note, which he reads aloud.  \n\n\nAugust:  Hello, Lucius.\n\n\nLucius:  My mother is unaware of the reason for my visit today.  She did not give her consent, or consult me in any \nform.  The passing of little Daniel Nicholson, from illness, and other events, have weighed on my thoughts.  I ask \npermission to cross into the forbidden woods and travel to the nearest town.  I will gather medicines, and I will \nreturn.  With regards to Those We Don't Speak Of, I am certain they will let me pass.  Creatures can sense emotion \nand fear.  They will see I am pure of intention, and not afraid.  The end.  \n\n\nHis voice has been shaky throughout.  It is clear that such a long speech from him is an unheard-of, thing, and that \nhe is normally so quiet that people ask him to speak up.  The elders stare at him.  The wind moans past the watchtower.\n\n\n---\n\nAlice (off-screen):  What goes on in that head of yours?  \n\n\nInside their house, all is simple.  The beams of the loft are visible.  The floor is plain wood.  Alice stands in an \nankle-length nightgown, in the doorway of her bedroom.  An oil-lamp and some candles are lit.  There is no electricity, \nrunning water, or flush toilets in this village, although such things are available in other parts of the world.  Lucius \nsits on the stairs, tying his boot-laces.\n\n\nAlice:  Say something, Lucius.\n\n\nLucius:  Finton Coin is in the tower, and I've promised to sit with him.\n\n\nAlice:  Hmm.\n\n\n---\n\nIn the watchtower, we see Finton Coin, a broad-faced, light-haired young man with Grecian features, wearing a yellow \ncloak.  Lucius sits on the floor near a lamp.\n\n\nLucius:  Do you ever think of the towns, Finton?\n\n\nFinton:  The towns?  What for?  They're wicked places where wicked people live.  That's all.  \n\n\nHe pauses for a few moments.\n\n\nFinton:  Thank you Lucius.  You're a good friend.  I do hope no one saw you.\n\n\n---\n\nIn the orchard, several women stand, staring at a spectacle.  It is another skinned fox.\n\n\n---\n\nThere is a brief meeting in the meeting hall.  Alice stands at the front, ahead of the elders, and speaks to the \nvillagers' concerns.  \n\n\nAlice:  What we SEEM to have amongst us, is a predator of some type, most likely a coyote, or a wolf.  Its manner of... \nof killing and removing the fur, but leaving the flesh torn, may be a sign that this animal suffers from madness.  And \nfor the next fortnight we should be vigilant for sightings of this coyote.  Keep careful watch over our little ones, \nas they play on the hills.  As for the other notion...  We do not believe our boundary has been breached.  Those We \nDon't Speak Of are much...  LARGER creatures than coyotes.  And we would know, if they had been here.\n\n\nThe villagers murmur.  \n\n\n---\n\nOutside, villagers stride away, back to their work.  Edward walks with his eldest daughter, Kitty.  She is beautiful, \nwith red hair and fair skin, very slender and willowy.\n\n\nKitty:  Ahhh, it's frightful, this business of the coyote, is it not, Papa?  \n\n\nEdward:  Do not feel worried, Kitty.\n\n\nKitty:  You are not troubled?\n\n\nEdward:  I am certain it will all end soon.\n\n\nKitty (slyly):  Can we speak on other matters, then?\n\n\nEdward:  It would be a relief.\n\n\nKitty (giggly):  I'm in love!  \n\n\nThey stand behind a house, possibly their own.\n\n\nKitty:  I want your permission to marry, Papa!  \n\n\nEdward is incredulous that his daughter would come to him and ask to marry, without her supposed-fiance present.\n\n\nEdward:  There's a proper manner in which these things are supposed to happen, such as the boy would normally be \nstanding next to you, in a moment such as this!  Where is the BOY in all this, Kitty?!\n\n\nKitty:  I haven't spoken to him as of yet.\n\n\nEdward:  The young man is unaware of your intentions?!\n\n\nKitty:  He has a... quiet way.  I was going to talk with him, Papa, but not without your blessings.  I WON'T talk with \nhim without your blessings, Papa.\n\n\nEdward:  Kitty!\n\n\nKitty:  It's Lucius Hunt.\n\n\nEdward pauses for a moment.\n\n\nEdward:  Lucius.\n\n\nKitty:  You think badly of him?  \n\n\nEdward:  No.  No, I have been thinking about him.\n\n\nKitty:  He's not LIKE the other boys, Papa.  He- he- he doesn't joke, or, or bounce about.\n\n\nEdward:  No, he certainly does not.  \n\n\nKitty:  I have your blessings, then?\n\n\nEdward sighs and can't help a smile.  Kitty jumps into his arms, joyful.\n\n\nEdward:  Look, do me one favor first.  Do NOT tell anyone else of your burstings until you have spoken with the young \nman.\n\n\n---\n\nLucius is in the workshop, sharpening a tool.  Kitty approaches him, wearing a pretty yellow dress.  Her voice is \nslightly coy at the begining, but as she goes on, she becomes more wild.  It is clear, however, that she has rehearsed \nher speech.  She can't seem to help smiling and giggling, and she's probably very nervous.\n\n\nKitty:  Good afternoon, Lucius.\n\n\nLucius stands up and turns to face her, wary, leaning back slightly.\n\n\n\nKitty:  I wanted to, to... to tell you something.  I love you, Lucius.  I love you like the day is long!  I love you \nmore than the sun and the moon together!  And if you feel the same way, then we should not hide it any longer.  It's \na gift, love is.  We should be thankful!  We should bellow it out with all the breath in our lungs!  Thank you!  \nThank you!  Thank you!\n\n\nShe stops waving her arms about and smooths her skirt, smiling at him.  He looks at her strangely, almost expressionless.\n\n\n---\n\nKitty lays on her bed, sobbing and screaming.  Her younger sister, Ivy, sits at her side, stroking her shoulder and \nsinging a lullaby.  She has reddish hair, too, but wears it comparatively short, about shoulder-length, barely any \nlonger than some of the boys in the village.  She wears a pretty blue denim dress.\n\n\nIvy:  Shhh.  Shhh.  Baby, sleep, gently sleep, life is long is long and love is deep.  Time will be sweet for thee.  \nAll the world to see.  Time to look about and know, how the shadows come and go.  How the breeze stirs the trees, how \nthe blossoms grow.\n\n\nWe see their parents, and the four youngest of the six walker daughters, standing about at the entrance to the room.  \nIt is clear that that is Kitty and Ivy's space, that they are close together in age (perhaps twenty-one and nineteen \nrespectively), while their younger sisters are all between about three and ten or so.\n\n\n---\n\nLucius brings firewood to August.  The oil lamp is burning dimly. \n\n\nAugust:  I often wondered if yu and my son bonded because neither of you were fond of speaking.  You're very kind.  \nYou must pardon my manners, I haven't slept in many nights.  \n\n\n---\n\nSome of the boys are at a place called \"The Stump,\" where they are playing a game.  Sort of like a test of manhood, \nthey stand on the stump with their back to the woods at night, and see how long they can stay without getting scared.  \nTonight it it Jamison's turn.\n\n\nChristop Crane:  You are doing capital, Jamison!  Just a few more moments, huh?  Gather your bravery.  \n\n\nThe other boys press in close.  \n\n\nChristop:  Do not jostle about so!  You'll ruin my shirt.\n\n\nJamison whimpers, and there is a moaning from the woods.\n\n\nJamison (whispering):  They made a sound when I made a sound!  And they mimic before they attack!\n\n\nChristop:  Have courage, man.  That's a wives' tale.  It isn't true.  Do not falter!  Steel yourself.\n\n\n---\n\nAt August's house, he is still speaking to Lucius, who is loading his wood-box.\n\n\nAugust:  You know, like a dog can smell you.\n\n\nLucius:  Pardon me, Mr. Nicholson?\n\n\nAugust:  You may run from sorrow, as we have.  Sorrow will find you.  It can smell you.\n\n\nHe looks at the space under the stairs.  There is a strange box there, made of wood, but stained dark black, and \nwith a lock for its lid.  Lucius looks at it strangely.\n\n\n---\n\nJamison breathes heavily, as the woods rustle.  There is the sound of footsteps, and a strange growl that you or I \nmight associate with a weed-whacker.  Jamison hops off the stump and rushes toward the boys, and they run back to the \nvillage, panting and chuckling.  They arrive in the safe area of the village and slow down.\n\n\nChristop:  I didn't know you could run so fast!\n\n\nJamison:  We're still for running and staying- hey!  \n\n\nChristop pulls Jamison's hat from his head and pushes him further towards home.\n\n\n---\n\nIt is daytime, a view of the village from the woods.  \n\n\nKitty (off-screen):  Noah ought to be punished.  He whacked little Joseph with a stick again.\n\n\nNoah and some boys are fighting.  Noah laughs and hits them as they say \"ow.\"  \n\n\nChildren:  No more hitting!\n\n\nGirl:  Why don't they grab it?\n\n\n---\n\nIvy sits in a pretty blue dress on a bench outside a building.  Her head is turned to the side and she is listening.  \nShe hears distant shouting.  It is clear once she stands up that she is blind.  She takes a lovely wooden cane and \nswings it back and forth, using this method to guide herself toward the sounds of the fight.\n\n\n---\n\nIvy (off-screen; forceful):  Noah Percy.\n\n\nThe fighting slows a bit.\n\n\nIvy:  Stop your fussing, right this moment.\n\n\nThe kids murmur and laugh.  He disentangles himself, and jumps up, following her away.\n\n\n--\n\nThey stand at the door of the \"Quiet Room,\" a place children are sent when they misbehave.  There is a lamp, several \nchairs, a coat-rack, and not much else.\n\n\nIvy:  You're in trouble, you know.\n\n\nNoah:  No hitting.  No hitting.\n\n\nIvy:  I'm to place you in the quiet room.\n\n\nNoah:  Um, I'll cry quarts.\n\n\nIvy:  What if we strike a deal?\n\n\nNoah:  Yeah, capital idea.\n\n\nIvy:  It would be prudent to keep our deal a secret, can you do that?\n\n\nNoah (whispers):  Can I keep a secret?  (Normal voice) Like a church mouse.\n\n\nIvy:  You needent go to the quiet room if you take an oath to never strike any person again.\n\n\nNoah:  No hitting.\n\n\nIvy:  No, no hitting.\n\n\nNoah:  No hitting.\n\n\nIvy:  No hitting.\n\n\nThey shake hands.  Ivy leans slightly and taps her cheek, and Noah kisses it.\n\n\nIvy:  The deal is struck.\n\n\nShe closes the door of the quiet room and goes down the steps to the ground.\n\n\nIvy:  We ought not to return right away, hmm?  What shall we do with our stolen time?  \n\n\nNoah:  Hmm.\n\n\nIvy:  Hmmm.\n\n\nNoah:  Hmmm.\n\n\nIvy:  Hmmm.  Shall we have a foot race?\n\n\nNoah:  Yes.\n\n\nIvy (excited):  Up the hill to the resting rock!\n\n\nNoah (grinning):  No cheating.\n\n\nIvy (offended):  What a deeply scandalous thing to say.  I insist you take that back.  Is that the school bell?\n\n\nNoah turns to look at the school and Ivy takes off running the other direction.  She knows her way around very well.  \nNoah turns back, looks at her, looks down and smiles, then runs after her.\n\n\nNoah:  Arrhhhh!  Ivy, you cheated!\n\n\nIvy:  I know!  I'm sorry!\n\n\nThey laugh and run all the way to the resting rock.  Ivy is very fast, but no match for Noah's long legs, and he barely \nbeats her there.  Lucius hunt is sitting there, eating a muffin, which he shares with Noah.  Ivy sits down, catching \nher breath.  \n\n\nIvy:  My sister cried a lot.\n\n\nLucius seems somewhat surprised that she knows he is there, given that she is blind.  She moves her head and eyes like \na sighted person, but only because she did not lose her sight until several years into her life.  Noah runs off \nsomewhere.\n\n\nIvy:  You wonder how I recognized you?  \n\n\nShe nodds and leans on her cane.\n\n\nIvy:  Some people - just a handful, mind you - give off the tiniest color.  It's faint, like a haze.  It's the only \nthing I ever see in the darkness.  Papa has it, too.  Do you wonder what your color is?  Well, that I won't tell you.  \nIt's not ladylike to speak of such things.  You shouldn't even have asked.\n\n\nShe is making a joke for herself, and smiles at it.  It is clear that she is very strange, running like a boy, wearing \nher hair short, making jokes to herself, and her strangeness seems directly tied-in with the fact that she is blind.\n\n\nLucius:  You run like a boy.\n\n\nIvy:  Thank you.  \n\n\nShe pauses a moment, shyly, but then continues.\n\n\nIvy:  I know why you deny my sister.  When I was younger...  You used to hold my arm when I walked.  Then suddenly \nyou stopped.  One day, I even tripped in your presense, and almost fell.  I was faking, of course.  But still, you did \nnot hold me.\n\n\nShe whispers, almost sensually.\n\n\nIvy:  Sometimes we don't do things we want to do, so that others won't know we want to do them.\n\n\nNoah returns with something in his hands.  He shows it to Lucius, motioning him to be quiet.  He sits next to Ivy and \nlifts her hand, placing a frog in it.\n\n\nIvy:  What?\n\n\nThe frog ribbets.  She yelps and laughs, tossing the frog back at him.  He takes a twig of berries from his pocket, \nloosening feathers in the process.  The berries, he places in Ivy's hands.\n\n\nIvy:  What's this?  Oh, berries.  What a splendid present.\n\n\nLucius:  Be cautious.  You are holding the bad color.\n\n\nIvy goes still, and cups a hand over the berries.  The fun, sunshiny atmosphere is spoiled by rich, thick fear.\n\n\nIvy:  This color attracts Those We Don't Speak Of, we must bury it.  You ought not to pick that color berry anymore.\n\n\nLucius (whispering):  He picked it from his pocket.  \n\n\nIvy:  What's wrong?  Your breathing has changed.\n\n\nLucius:  I've never set eyes on these before.  You did not pick that now.  Where did you find this?  \n\n\nNoah takes his hand and leads him around the side of the rock.  He is mentally retarded, but he knows that something \nhas changed this afternoon.\n\n\n---\n\nAt the meeting house, Lucius reads another note to the elders.\n\n\nLucius:  Today at Resting Rock, Noah Percy handed Ivy Walker berries of the bad color.  When asked where he found these \nberries, for they were not like others I have seen, he pointed to the drawing upon resting rock.\n\n\nWe see Lucius, Ivy, and Noah staring at the side of the rock (although Ivy does not see it).  There is a drawing of a \nstrange, reddish-colored creature, with skeletons all around it.\n\n\nLucius (off-screen):  It is my belief that Noah Percy has entered the woods, and has done so on many occasions.  It is \nalso my belief that, because of his innocence, those creatures who reside in the woods did not harm him.  \n\n\nBack in the meeting house, he continues to read.  The circle is in a slightly different order today, more mixed up, and \nfacing a different direction.\n\n\nLucius:  This strengthens my feeling that they will let me pass if they sense I am not a threat.\n\n\n---\n\nAlice (off-screen, later in the day):  We shall speak of the town, just this once, and we shall never speak of it again.\n\n\nShe sits, knitting yarn that is wound around Lucius's hands.\n\n\nAlice:  Your father left for the market on a Tuesday, at a quarter past nine in the morning.  He was found, robbed and \nnaked, in the filthy river, two days later.\n\n\nLucius begins to shake, and tears stream down his face.  \n\n\nLucius:  Why'd you tell me this blackness?\n\n\nAlice:  So you will know the nature of what you desire.\n\n\nLucius:  I do not desire it.  (Angry) My intentions are true to my word. I think of NOTHING but the people of this \nvillage.\n\n\nAlice:  Forgive me.  I am but scared for my only son's life.\n\n\nLucius:  I am not the one with secrets.\n\n\nAlice:  What is your meaning?\n\n\nLucius:  There are secrets of every corner of this village.  Do you not feel it?  Do you not see it?\n\n\nHe points at the black box in the corner of the living room.\n\n\nAlice:  That is for my own well-being, so the evil things from my past are kept close and not forgotten.  Forgetting \nwould be to let them be born again in another form.\n\n\nLucius (standing):  Then let us open it.\n\n\nAlice (final):  No.  Perhaps we should speak with Edward Walker together.  He may be able-\n\n\nLucius:  He hides, too.  He hides his feelings for you.\n\n\nAlice:  Oh!\n\n\nExasperated and startled, she turns and walks to her bedroom.  He follows her.\n\n\nLucius:  Sometimes, we don't do things, yet others know we want to do things, so we don't do them.\n\n\nRealizing he bungled that statement badly, he hangs his head a bit and makes a sort of \"oh, darn!\" motion with his \nhand.  Alice returns to her bedroom door.\n\n\nAlice:  What nonsense are you saying?\n\n\nLucius:  You needent worry.  Nothing will happen to me.\n\n\nAlice:  You remind me of a colt sometimes.  \n\nShe pauses a moment.\n\nAlice:  What makes you think he has feelings for me?\n\n\nLucius (whispering):  He never touches you.\n\n\n---\n\nLucius and some other boys walk around the perimeter of the village, painting yellow marks on tall poles.  They wear \ncloaks of yellow wool, the safe color.  Lucius sets down his paint bucket and pushes his hood back, then slowly, \npurposefully, he walks into the woods.  He does not go far, just to a bush where there are red berries.  He plucks a \nbranch of them.  He is very solemn.  There is a creaking noise, a crack, and a growl, then some rustling.  Lucius \nsees movement out of the corner of his eyes.  He turns and leaves the woods slowly.\n\n\n---\n\nIt is night.  Ivy is crouched, and she stands.\n\n\nIvy:  There's no escape!\n\n\nShe turns and perceives Lucius by his \"color,\" as she calls the haze she sees around him when he is near her.  She is \nsurprised.\n\n\nIvy:  Oh, hellO!  I was just playing a game with Noah.  The rascal must have gone to hide in my house again.\n\n\nShe crouches to retrieve her cane, then stands.\n\n\nIvy (loudly):  Houses are agaist the rules!  (whispering) He knows that.  (normal) Are you all right?\n\n\nShe looks at Lucius with some concern, for he is more solemn than usual.  He walks her to her front porch.\n\n\nIvy:  We're tending to the children tonight, Kitty and I.  I should be with her.  Be well.\n\n\nShe steps on to the porch, then turns, steps back down, and looks at him, hands perched on her cane.\n\n\nIvy:  I heard my parents speaking of you.  I know of your request to go to the towns.  I think it is noble, but I do \nnot think it is right.\n\n\nLucius:  Are you not angry you have no sight?\n\n\nShe smiles and leans a bit towards him, whispering.\n\n\nIvy:  I see the world, Lucius Hunt.  Just not as you see it.\n\n\nLucius:  What of Noah, then?  What if there are medicines for Noah that could help him be still and to learn?\n\n\nIvy:  May we stop speaking of this?  It is putting knots in my stomach.\n\n\nShe steps back on to the porch, and turns to talk to him from there.\n\n\nIvy (whispering):  Kitty is to be married.  She's found love... again.  With Christop Crane.  You think it an odd \nchoice, right?  You know, he won't sit back in his chair for fear of setting wrinkles on his shirts.  But he does have \na gentlemanly way about him.  And he does care for my sister, deeply.  I think Kitty is blessed.\n\n\nShe pauses, nervous, but continues.\n\n\nIvy:  I am blessed as well.  My older sister is now spoken for.  I am now free to receive intrest from anyone... who \nmight have interest.\n\n\nShe raises her tone at the end, almost like a question, and very hopeful-sounding.  Lucius' face is still solemn, but \nthere is something almost like a smile about his mouth.  Children are laughing in the house.  She turns and walks to \nthe door, waving her cane in front of her, and goes inside.\n\n\nKitty:  I'm going to get you!  Oh!  I got you!  I got you.  Can you fetch a blanket for me?\n\n\nIvy:  Have you seen Noah?\n\n\nIvy walks to a closet, and opens it.  Inside, Noah is hiding.  She does not know that he is there, and he laughs \nsilently as she takes a blanket and closes the door.\n\n\n---\n\nFinton Coin is in the watchtower again, wearing his yellow cloak.  There is a lamp lit, sitting on the edge of the \nhatch.  There is a bump, and the lamp wiggles.\n\n\nFinton:  Lucius?  Lucius?  \n\n\nHe crawls to the hatch and opens it, peering down.  There is a flash of red as a creature walks by, spikey needles \nsticking out the back.  Finton drops the hatch on his head, lets it fall into place, and latches it.  He sits \nwhimpering in pain for a moment, then gets up and rings a warning bell over and over again, a steady clanging.\n\n\n---\n\nAll around the village, people hurry into their homes, exclaiming in fright.  Lucius marches steadily through them, \nhelping people inside, but he his making his way towards one place, the Walker home.  \n\n\n---\n\nKitty, Ivy, and their four younger sisters are sitting on a sofa in their living room, when they hear the bells.  Noah \nruns through the door, happy and excited, clapping and waving his arms.\n\n\nNoah:  They're coming.  They're coming!\n\n\nKitty:  Close the door.  Noah, close the door, okay?  Close the door.\n\n\nKitty bustles around, putting the edge of the door in Noah's hands, and getting her littlest sisters down into the \nceller, where they can lock the hatch and keep safe from the creatures.  She does a good job of maintaining a calm \ndemeanor.  Noah keeps clapping and shouting.\n\n\nKitty:  Noah, come on inside!\n\n\nNoah:  Come on inside!\n\n\n---\n\nOutside, the last villagers are getting into their homes, shouting.  Lucius helps a woman bolt her shutters, then \nquickly dashes around the corner as a creature comes up to the door.  The creature wears a red, hooded robe with wide \nsleeves, almost monk-like.  There are brown spines growing in a bunch out of a hump on its back.  It has long claws.  \nThe face is a snout sticking out of the hood.  It makes a strange growling noise, almost a vooooomph.  It scratches \nthe door.\n\n\n---\n\nIvy stands at the front door of her house, waiting.\n\n\nNoah:  They're coming.  Come on in!\n\n\nKitty:  Let's close the door.\n\n\nKitty manages to get everyone except Ivy inside the celler.\n\n\nIvy:  Lucius is outside, walking.\n\n\nNoah:  They're coming!\n\n\nKitty is getting desperate.  The longer the door is open, the more danger they are in.\n\n\nKitty:  He's inside safe somewhere!  Please, close the door!\n\n\nIvy is shaking, badly frightened, but determined and sure that Lucius will come to her.\n\n\nIvy:  He'll come back to make sure we're safe.\n\n\nKitty:  Ivy!  Ivy, please.\n\n\nIvy turns back to the door and slowly raises her arm, her hand outstretched, waiting.  There is a scratching and \ngrowling at the side of the house.  \n\n\nKitty (whispering):  Please.\n\n\nIvy (trembling):  No.\n\n\nKitty (whispering):  Don't let them in.\n\n\nIvy stands, shaking, tears in her eyes, waiting for Lucius.  A creature comes up from the side, growling.  Just as the \ncreature reaches for Ivy's hand, it is firmly clasped in Lucius's, as they dash into the house.  Everything slows down \nas they bolt the door, hands clasped, and run into the celler.  Noah continues to invite the creatures in.  This is a \ngame to him.  The girls are all in various states of crying and silent prayer.  There is a thumping, and the creatures \nenter the house, growling.  Ivy looks down to see her hand clasped in Lucius's.  He hasn't let go.\n\n\n---\n\nIn every home in the village, families tremble in their cellers, fearing the inevitible bump-thump, and growl, as the \ncreatures enter their homes.  They cover their ears and lower their heads, praying, waiting.\n\n\n---\n\nThe next morning, the breeze is high, blowing autumn leaves off the trees.  There are red slashes on the doors of every \nbuilding in the village.  In the meeting house, Edward is talking, as we look at the red slashes everywhere.\n\n\nEdward (off-screen):  By the markings we find this morning on our homes...  I feel they were warning us.  They acted as \nif threatened.  \n\n\nAugust (off-screen):  Creatures have never attacked us without reason.  Does anyone here know of a reason why these \nevents may have occured?\n\n\nA woman approaches the elders, who sit in a line at the front of the meeting house.  She hands a note to Vivian Percy, \nNoah's mother.  \n\n\nVivian:  Who has written this note?  \n\n\nNo one answers.  She stands, clears her throat, and reads it aloud.\n\n\nVivian:  Please read so that all may hear.  I have brought this burden upon us.  On the day before last, I crossed \nthe forbidden line into Covington Woods...\n\n\nThe villagers gasp aloud, and murmur.\n\n\nVivian:  ... and was witnessed there by Those We Don't Speak Of.  I am deeply sorry.  I have shamed myself and my \nfamily.  I pray that my actions will cause no further pains.  With deepest sorrow...... Lucius Hunt.\n\n\nShe sits.  The crowd murmurs.  The elders take each others hands.  Everyone turns to look at Lucius in the back, as \nEdward walks back to talk to him.  Many stand up.  Noah follows Edward, giggling, and has to be led back by one of \nthe men.  Edward walks right up to Lucius, who has tears in his eyes, and does not raise them from the floor.\n\n\nEdward (kindly):  Do not fret.  \n\n\nEdward crouches, and Lucius slowly looks into his eyes.\n\n\nEdward:  You are fearless in a way that I shall never know.  Lucius shakes badly, but manages the tiny beginnings of \na smile.\n\n\n---\n\nOutside, tables are set up for a banquet.  It is Kitty's wedding day.  She sits next to her father, wearing a filmy \nwhite gown and veil, holding his hand.  Her husband-to-be is next to her, followed by Ivy, and Noah.  At least \nninety-five people live in this village, probably more, and all have turned out for the wedding.\n\n\nEdward:  We are grateful... for the time we have been given.\n\n\nThere are quiet cheers, and the crowd begins to talk and pass food around.\n\n\n---\n\nTwo young men in yellow cloaks, their hoods drawn about their faces, bear a litter between them.  On this litter, \ncovered by a yellow flowered cloth and white and yellow daisies, is a large hunk of lamb, almost half of one of the \nanimals.  They set their burden down, uncover it, lift it, and toss it onto a rock at the edge of the forest, \nsomething like a sacrificial offering.  They leave the litter, turn and go.\n\n\n---\n\nIvy sits on the ground in a pink dress so pale it looks almost white.  Next to her is Mrs. clack, wearing a creamy dress, \nalmost yellow, and a knitted shawl around her shoulders.  Both have flowers in their hair.  Mrs. Clack smokes a pipe.\n\n\nMrs. Clack:  I had an elder sister.\n\n\nIvy (surprised):  Mrs. Clack, you've been keeping secrets!\n\n\nBoth chuckle a bit.\n\n\nMrs. Clack:  Oh, Kitty reminds me of her, so!\n\n\nIvy:  What manner of person was she?\n\n\nMrs. Clack:  Saucy.  And we fought endlessly.\n\n\nIvy nods.  They both laugh.\n\n\nIvy:  May I ask her name?\n\n\nThere is a pause.  Mrs. Clack does not answer.  \n\n\nIvy (serious):  Why did she not come to Covington Woods?\n\n\nMrs. Clack:  My sister did not live past her twenty-third birthday.  A group of men took her life in an alley by our \nhome.  \n\n\nThey are both sad, but August Nicholson comes out of the greenhouse and asks everyone to follow him inside.  \n\n\nIt has been prepared as a place to have a party, to sing and dance and eat.  There is music playing.  Ivy approaches her \nsister shakily.  She seems to want to be on better footing with her, lest she die as young as Mrs. Clack's sister.  \nShe hugs her tightly.  Both have tears in their eyes.  Christop backs away a bit.  Kitty has deep bags under her eyes.  \nIt appears she has not slept much recently.\n\n\nChristop:  She's not going to squeeze my shirt like that, is she?\n\n\nKitty looks at him with reproach, and then both smile, to put on a good face for their neighbors.  \n\n\n---\n\nA line of people have formed to congratulate Edward and Tabitha.  Victor leaves the line, and Alice Hunt enters it, \nfacing Edward.  \n\n\nAlice:  Many blessings on this most joyous of days.\n\n\nEdward:  It was a rare and lovely ceremony, was it not?  \n\n\nAlice:  Glorious.  I saw your hand move to your eyes on more than one occasion.  \n\n\nEdward (sheepish):  It must have been dust of some matter.\n\n\nShe holds out her hand, but he does not take it.  She balls it into a fist, smiles, and moves on.  When she turns back, \nEdward is clasping Mrs. Percy's hand and arm and talking with her.  She gives a startled smile, but seems pleased.\n\n\n---\n\nThe young people, and some of the older ones, are dancing in rings around each other.  Kitty grabs Ivy and pulls her \nin to dance, weaving her in and out.  Everyone is laughing and enjoying themselves.  A more complicated dance begins, \nwith several circles of people, and people ducking in and out.  A woman plays a complicated tune on the piano.  Ivy, \nwith her sensitive hearing, hears what others cannot:  Two children screaming for Mr. Walker outside.  Eventually the \nrest of the villagers hear it, too.  Ivy holds out her arm and makes her way for the end of the greenhouse.  Everything \nis in confusion, but Lucius's arm reaches up and he grabs Ivy's hand, leading her the rest of the way.  Everyone \ngathers around Mr. Walker, and two young boys, about seven and nine years old.\n\n\nEdward (gravely; gently):  Speak up.  \n\n\nOlder boy:  They're in the village.  They left more warnings.\n\n\nThere is shock all around.\n\n\nYounger boy:  They wish us to leave.\n\n\nEdward (despairing):  That cannot be.\n\n\nOlder boy:  One saw us.  It ran off into the darkness.\n\n\nEdward:  You are certain?  \n\n\nThey nod.\n\n\nEdward:  Can you boys stay close to Ivy, here?  She'll tell you some funny stories and have you laughing soon.\n\n\nIvy reaches out her hands to the boys, smiling reassuringly, but as soon as they have turned to face Mr. Walker, her \nface becomes serious, and she clutches them in her arms.  \n\n\nEdward:  We will go together.\n\n\n---\n\nThey set out in a double line, some carrying lanterns.  As they reach the houses, people branch off to enter their \nhomes.  They slow down.  On the ground are many, many animal corpses, skinned and broken like the first.  Some are \nstrung up in doorways.  It is horrific.  Christop ushers his new wife away from them, breaking their terrible, \nhypnotic spell.  \n\n\n---\n\nEdward and Alice stand outside the barn.  Alice is what we would call \"freaked out.\"  Edward is calmer, but still \nconcerned.\n\n\nAlice (whispering):  Livestock has been taken, and skinned.  The hides and feathers are missing.  There are marks on \nthe door where it was opened.  The marks are high.  Coyotes cannot reach that height.  \n\n\nEdward holds up his hand where the marks are on the barn door.  They are man-height.  Only a creature could have \ndone this.\n\n\n---\n\nTwo men stand guard at each watchtower.  The party decorations are dangling askew.  The candle-lanterns are still lit.  \n\n\n---\n\nIn the middle of the night, Ivy lays in bed with her eyes open.  She is unused to sleeping in Kitty's bed.  Suddenly \nshe sits up in bed, gasping.  She walks out on the porch, using memory and touch to guide her to where Lucius is \nsitting.  She sits down next to him.  They are perhaps four inches apart.  They speak in low voices, so as not to \nwake Ivy's family.\n\n\nIvy:  The elders are going to have an inquiry tomorrow.  Each member of the village is to be questioned in the meeting \nhall.\n\n\nLucius:  To see how the border was breached?\n\n\nIvy:  Yes.\n\n\nThere is a pause.\n\n\nLucius.  It is cold outside.  You ought to go in.  \n\n\nIvy:  Why are you on this porch?  \n\n\nLucius:  It is not safe.\n\n\nIvy:  There are other porches.  Do you find me too much of a tomboy?  I do long to do boy things.  Like that game the \nboys play at the stump.  They put their backs to the woods, and see how long they can wait before getting scared.  \nThat's so exciting.  I understand you hold the record.  It will never be broken, they say.\n\n\nLucius:  It's just children's games.\n\n\nIvy:  How is it you are brave when all the rest of us shake in our boots?  \n\n\nLucius:  I do not worry about what will happen, only what needs to be done.  How did you know I was here?  \n\n\nIvy:  I saw you out the window.  \n\n\nLucius is stunned.  He looks at her strangely.\n\n\nIvy:  No... I won't tell you your color.  Stop asking.  \n\n\nShe pauses, and then ventures something VERY daring, never betraying how much she is risking by what she says.\n\n\nIvy:  When we are married, will you dance with me?  I find dancing very agreeable.\n\n\nLucius is stunned again.  Ivy has just proposed marriage to him, or rather, she has stated that it is inevitable.  He is \nshocked into honesty.  \n\n\nIvy:  Why can you not say what is in your head?\n\n\nLucius:  Why can you not stop saying what is in yours?  Why must you lead, when I want to lead?  If I want to dance, I \nwill ask you to dance.  If I want to speak, I will open my mouth and speak.  Everyone is forever plaguing me to speak \nfurther.  Why?  What... good is it to tell you you are in my every thought from the time I wake?  What good can come \nfrom my saying I-- I sometimes cannot think clearly, or- or do my work properly?  What gain can rise from my telling \nyou... the only time I feel fear as others do, is when I think of you in harm?  That is why I am on this porch, Ivy \nWalker.  I fear for your safety above all others.  And yes...  I will dance with you on our wedding night.  \n\n\nHe has been shaking and she has been calm, but now she starts to shake and tears fall from her cheeks.  He takes her \nface in his hand, and they gently kiss.  \n\n\n---\n\nBeatrice (off-screen):  I had been to the storage shed twice to fetch food prior to the wedding ceremony.\n\n\nAlice (off-screen):  And the livestock was untouched at that time?  \n\n\nBeatrice (off-screen):  Yes, Mrs. Hunt.  All was as it should be.\n\n\nBeatrice stands inside the meeting house, facing the elders.  She is young and pretty.\n\n\nAlice:  Thank you, Beatrice.\n\n\nBeatrice looks like she wants to say more, but she turns and starts to walk away.  Then she turns back.\n\n\nBeatrice:  I beg your pardon.  Is it true... about Lucius and Ivy?  There are whispers all over the village.\n\n\nAlice leans out to look at her and smiles.\n\n\nAlice:  We were informed early this morning of their intentions.\n\n\nBeatrice:  It is amazing to witness which two people love chooses to unite.  It follows no rules.\n\n\nThis touches Alice deeply.\n\n\n---\n\nAt the Walker home, Ivy, and the newly-married Kitty, sit on the bed that used to be Kitty's.  Ivy seems somewhat \nnervous.  She knows that Kitty is not over her love of Lucius.\n\n\nIvy:  Kitty... I wanted to speak with you first.  I would not want you to feel pain, in any fashion.  You are my \ncherished one.  If you were to feel badly about Lucius, I would not have it.  One love to sacrifice another love is \nnot right.\n\n\nKitty:  There is nothing you could do that would sacrifice my love for you.  You are my cherished one as well.  God \nbless you and your life together.\n\n\nIt is obviously hard for her to say this, and she seems like she doesn't entirely believe her own words.  She takes \nIvy's hand and wipes the tears from her face.\n\n\n---\n\nThere is a knock on the door of Lucius's workshop.  Lucius is reading a letter as he unlatches the door.  Noah stands \noutside on a lower step.  His eyes are bright red from crying, and he is crying still.  His hair is tangled and he is \nunkempt.  Something has upset him greatly.  This startles Lucius, who immediately thinks of his Ivy.\n\n\nLucius:  What's happened?\n\n\nNoah steps inside.  He tries to say something, but his mouth won't make the words.  \n\n\nLucius:  Is this about Ivy and myself?  \n\n\nHe turns and walks to his desk, and starts to speak.  \n\n\nLucius:  I know you are very fond of her.  And I know she is fond of you.  There are different types of love.\n\n\nAs he turns toward Noah, he stops, startled, and looks down.  Noah's hand is clutched against Lucius's belly.  He \npulls a bloody knife out of Lucius's belly.  \n\n\nNoah:  Ohhhh....\n\n\nLucius falls to the floor, groaning for God and for Ivy.  Noah can't seem to make up his mind about what to do.  He \nputs down the knife, then takes it up again and stabs Lucius several more times.  \n\n\n---\n\nMr. and Mrs. Percy are getting ready for a meeting.  There is a thump as Noah sits down on the porch.\n\n\nVivian:  Noah?  You'll be late for the meeting hall.  Would you like your father to walk you there?  Noah?\n\n\nThey exit and look at him.  He looks normal, until they come closer and he turns from his seat in the rocking chair, \nand they see blood all over his hands and clothes.\n\n\nNoah:  Oh, the bad... the bad color.  Oh.  Bad color.  Bad color!  Bad color!  \n\n\nHe drools and taps at himself, distraught.\n\n\nNoah:  Mama!\n\n\n---\n\nA man bursts into te inquiries at the meeting hall and strides toward the elders.\n\n\nMan:  I beg your pardon.\n\n\nEdward:  What is it?\n\n\nMan:  There's been an accident.\n\n\n---\n\nIvy and Kitty are smiling and chuckling as they leave the Walker home.  They pause when they see two young women \ndashing up to them.  One gasps for breath as she speaks to them.\n\n\nGirl:  Noah Percy was found with quarts of blood upon his clothes and hands.  The blood was not his own and he will \nnot speak as to whose it is.  \n\n\nKitty:  God in heaven!\n\n\nIvy runs off.\n\n\nKitty:  Ivy!\n\n\n---\n\nThe villagers run about, checking into each others homes, asking if anyone is injured.  Ivy has her cane.  Her shawl \nslips from her shoulders, her heart beats in her ears, as she whispers the numbers of the steps to Lucius's workshop.  \nShe reaches the steps, drops her cane, and scrambles up the steps and in the door.  She knocks.  No answer.\n\n\nIvy:  Lucius?  Lucius Hunt?!  (stern) You answer me right this moment!\n\n\nShe runs into something soft, and crouches down.  She begins to shake as she feels him there.  A man runs up the steps \nand sees her.  He shouts for Mr. Walker, who runs inside the workshop.  Ivy clutches at Lucius, running her hands \nthrough his hair frantically, eyes wide.\n\n\nIvy:  Papa... I cannot see his color.\n\n\nEdward:  Ivy.  Come away.  COme away.\n\n\nShe shrieks as he drags her gently off of Lucius and hands her to another man.\n\n\nEdward:  Take her!!!  Take her!!!\n\n\n---\n\nMrs. Clack stands in front of the medical building, her shawl clutched around her shoulders.  Many of the villagers \nstand there, waiting for news of Lucius.  \n\n\nMrs. Clack:  He has suffered a great deal.  He may pass at any time.  Please give him all your prayers and good \nthoughts.  He will hear them.  \n\n\nIvy stands off to one side, blood smeared across the front of her blouse, her face expressionless.  Many of the vilagers \nlook at her, and give her her distance.  She sways back and forth on her cane.  She begins to shake.\n\n\n---\n\nInside the quiet room, Noah sits in his long underwear and trousers.  The bloody clothes have been taken from him for \ncleaning.  The door unlocks.  Mr. Percy lets a stern-faced Ivy inside.  She hands her cane to him, and walks straight \nforward to Noah, grasping him so she knows where he is.  Then she slaps him, again and again and again.  Mr. Percy \ngrabs her and leads her out of the quiet room.  Noah begins to shriek in rage and confusion.  Ivy has told him not \nto hit, and yet here she is, hitting him.  Mr. Percy shuts and locks the door from the outside, and Noah shouts and \nbangs about.\n\n\n---\n\nIvy sits in her living room facing her father, shaky but firm, as usual.  \n\n\nIvy:  I am in love.\n\n\nEdward:  I know.  \n\n\nIvy:  He is in love with me.\n\n\nEdward:  I know.\n\n\nIvy:  If he dies... all that is life to me will die with him.  I ask permission... to travel through Covington Woods... \nand go to the towns... to retrieve medicines... that may save... Lucius Hunt.  You are my father.  I will listen to \nyou in all things.  I will trust your decision.  \n\n\n---\n\nOutside the medical building, Victor is speaking with Edward and Tabitha.\n\n\nVictor (off-screen):  I've done what I can to close the wounds.  There's an infection.\n\n\nEdward:  What can be done to mend him?\n\n\nVictor:  We can only pray.\n\n\nEdward:  If there were no limitations, what could be done?\n\n\nVictor:  Hmmm?  What are you asking me?\n\n\nEdward:  Is there anything at all that can be done to mend the boy?  Please, Victor, would you be so kind as to answer \nmy question.  \n\n\nVictor is stunned.  He says nothing for a moment.\n\n\nVictor:  If the infection is contained, he may still survive.\n\n\n---\n\nTabitha takes Edward out behind the gardens of winter vegetables.\n\n\nTabitha:  I must speak up.  You have a restless spirit.  I know the thing that is in your head.  You're thinking of \ngoing to the towns.  Tell me I'm wrong.  You have made an oath, Edward, as all have, never to go back.  It is a \npainful bargain, but no good can come without sacrifice.  These are your words I'm saying.  You cannot break the oath.  \nIt is sacred.\n\n\nEdward:  It is a crime, what has happened to Lucius.  \n\n\nTabitha:  YOU have taken the oath, you and the rest of the elders, are you listening to me?  YOU.... have taken the oath.\n\n\nAll at once, her peculiar emphasis of the word \"you\" hits him, and he almost smiles.  She looks relieved that he has \ngotten the message.  They both cry, and hug.  \n\n\n---\n\nEdward approaches Ivy, who sits in a rocking chair on their front porch.  She has a shawl around her shoulders, for \nthe day is chill.\n\n\nEdward:  The moment I heard my daughter's vision had finally failed her, and that she would forever be blind, I was \nsitting in that very chair.  I was so ashamed.  \n\n\n---\n\nEdward and Ivy walk along the edge of a pasture, toward the very edge of the village.\n\n\nEdward:  What do you know about your grandfather?\n\n\nIvy is unsure, but she answers as best she can.\n\n\nIvy:  He was the wealthiest man in the towns?\n\n\nEdward:  That he was, he had a gift for that.  If he was given one dollar, in less than a fortnight, he would have \nturned it into five.  You do not know of money.  It is not part of our life here.  Money can be a wicked thing.  It \ncan turn men's hearts black.  Good men's hearts.  My father could not see this, for all his gifts.  He was a poor \njudge of a man's character.  Your grandfather WAS a good man, Ivy.  He had a laugh that could be heard three houses \naway.  He used to hold my hand as I hold yours.  He taught me strength, and showed me love, and told me to lead when \nothers would only follow.  Your grandfather, James Walker, died in his sleep.  A man put a gun to his head and shot \nhim while he dreamed.  I tell you this so you will understand some of the reasons for my actions, and the actions of \nothers.  You are a strong one, Ivy.  You lead when others would only follow.  You see light, when there is only \ndarkness.  I trust you.  I trust you among all others.\n\n\nIvy:  Thank you, father.\n\n\nThey stop walking.  Ivy has tears on her face.  Edward holds her by her shoulders.\n\n\nEdward:  Ivy, do you know where you are?\n\n\nIvy (uncomfortable):  At the old shed that is not to be used.\n\n\nEdward smiles at his daughter's sense of direction and goes to open the padlock on the door.\n\n\nEdward:  Yeah.  Ivy.\n\n\nIvy:  Yes, Father?\n\n\nEdward:  Do your very best not to scream.\n\n\nIvy:  What?\n\n\nIvy is full of trepidation.  That sounded very ominous, especially coming from her father.\n\n\n---\n\nIn the Walker home, Ivy is shoving her yellow safe cloak into a large sack, along with various other items, including a \ngold pocket watch.  She wears a pretty blue gingham dress.  Her hair is disheveled.  Edward paces outside her room.\n\n\n---\n\nIn the medical building, Edward guards the door as Ivy says goodbye to Lucius.  \n\n\nIvy:  I am leaving, to fetch you medicines.\n\n\n---\n\nThe elders are gathered behind a building in town.  August is the last to join them.\n\n\nAugust:  I had a difficult time getting away.  What is it?\n\n\nEdward takes a moment, and he sighs before he speaks.\n\n\nEdward:  Ivy... has asked... to go to the towns... for medicines.  \n\n\nThe elders are shocked.\n\n\n---\n\nIvy sits on resting rock in her safe cloak, waiting.  There are footsteps as two young men approach her, one bearing a \nbundle and a torch, and both wearing safe cloaks.  She stands to meet them, holding her cane.\n\n\n---\n\nIvy, Christop, and Finton approach the edge of the woods.  Ivy holds up a small sack bulging with rocks, and then sets \nher head, and leads the two men into the woods, swinging her cane back and forth to guide her.  They follow with \ntrepidation, not at all comfortable with being in the woods.  Finton grabs her shoulder to stop her.\n\n\nFinton:  Christop.\n\n\nShe turns.  Christop has stopped, and is not moving further.  Ivy wants him to stay, and not to be afraid, but she is \nshaking badly herself.\n\n\nIvy:  Christop... you needent be scared.  We have the magic rocks.  They will keep us safe.\n\n\nChristop:  Why have we not heard of these rocks before?  \n\n\nFinton:  Christop, please, do not leave us.\n\n\nIvy:  There is nothing to fear.\n\n\nChristop:  Then why do you wear the cloak of the safe color?\n\n\nIvy:  We will light torches.  It will be safe.\n\n\nChristop:  It is forbidden.\n\n\nFinton:  Christop...\n\n\nChristop turns and leaves.\n\n\n---\n\nIvy and Finton stretch a tarp between some trees.  It is raining hard.  They sit underneath the tarp, waiting for \nthe rain to stop.  There are noises from around them in the woods.  The rain freezes on the branches.  The forest \nis bare.\n\n\nFinton:  Ivy...  There's something in these woods.  It turns my stomach to rot.\n\n\n\nHe takes her hand and puts it on the bag of magic rocks.\n\n\nFinton:  You will be safe.  They will not harm you, because you cannot see.  They will take pity on you, the way they \ntook pity on Noah, when... when he ventured into the woods.  They will kill me, Ivy.  I cannot stay.  You're better \nin these woods than most boys.  Anyone would say so.\n\n\nIvy:  It is MY burden, Finton.  You may go.\n\n\nFinton:  Come with me?\n\n\nIt is obvious now that he finds Ivy attractive.  She says nothing, so he turns and slowly leaves.  The rain has \nstopped.  When he is gone, she turns the bag over and dumps the rocks on the ground.\n\n\n---\n\nEdward (off-screen; a memory):  Do your very best not to scream.\n\n\nA door opens, and Edward leads Ivy into the old shed.\n\n\nIvy:  There is an odd smell.\n\n\nEdward:  It is ahead of you.\n\n\nIvy:  What is it?\n\n\nEdward:  I cannot explain in words.  It is just a few steps.  \n\n\nShe steps carefully forward with her hand out, and touches something, long and spiky.  She brings her fingers down to \nthe bottom.  It is part of one of the creatures.  She gasps loudly and steps back.  Edward holds her.  \n\n\nIvy:  Those We Don't Speak Of!\n\n\nEdward:  Do not be frightened.  It is only... farce.  Do not be frightened.\n\n\nShe slowly begins to calm.  There are three \"creatures\" hanging from the ceiling of the shed.  They have boar-like \nmasks inside their robes, and clawed hands.  They are costumes.  \n\n\n---\n\nEdward and Ivy sit outside the shed, leaning against its stone wall.  Edward is trying to explain to her, in terms she \nwill understand, why things are as they are.\n\n\nEdward:  There did exist rumors of creatures in these woods.  It is one of the history books I used to teach in the \ntowns.\n\n\nIvy:  The screams?  From the woods?\n\n\nEdward:  We created those sounds.\n\n\nIvy:  The Ceremony of Meat?\n\n\nEdward:  We remove it ourselves.  An elder is always assigned.\n\n\nIvy is beginning to get angry.\n\n\nIvy:  The drills... they are farce, too?\n\n\nEdward:  We did not want anyone to go to the towns, Ivy.\n\n\nIvy:  What about the animals.... the skinned ones?  Are the elders responsible for that, too?\n\n\nEdward:  I BELIEVE ONE of the elders is responsible.  It will not happen again.  There is no one in this village who \nhas not lost someone irreplaceable, who has nt felt loss so deeply that they questioned the very merit of living at all.\n\n\nThis strikes a chord with Ivy; it is exactly what she is going through.  \n\n\nEdward:  It is a darkness I wished... you would never know.\n\n\nHe is distraught.\n\n\nEdward:  Forgive us our silly lies, Ivy.  They were not meant to harm.  \n\n\nEdward holds her.  She seems to come to a decision.\n\n\nIvy:  I am... sad for you, Papa.  For all the elders.  \n\n\nEdward places a gold pocket-watch into her hands, and hands her a folded sheet of paper.  He speaks urgently to her.  \nThere are tears in her eyes, and they spill down her cheeks as he speaks to her of what she must do.\n\n\nEdward:  On this paper has been written a tool of medicine.  It is common in the towns.  You will go... with two \nescorts.  Follow the sounds of a stream.  A half-day's journey will bring you to a hidden road.  At this hidden road, \nthe two escorts will wait as you continue.  You alone will follow the road... and leave Covington Woods.  You are to \ntell no one in the towns where we are... and return with haste.  I cannot come with you.  You gave your heart to \nthis boy.  He is in need.  Are you ready to take this burden, which by right, is yours and yours alone?\n\n\n---\n\nEdward approaches the home of Alice Hunt.  She is boiling strips of cloth to use as bandages.  He comes in.  She looks \nat him.\n\n\nAlice:  I am making fresh clothes for Lucius.  He needs them.\n\n\nEdward:  Alice, I've sent for help.  \n\n\nAlice turns to him, hopeful.\n\n\nEdward:  I've sent Ivy to the towns.  \n\n\nAlice:  You cannot...\n\n\nEdward:  It is all that I can give you.  It is all that I can give you.\n\n\nAlice:  I accept.  \n\n\nHe has stepped closer to her.  She makes to kiss him, but he turns his face.  She makes to put her head on his shoulder, \nbut he leaves.  He understands the feeling that exists between them, but at the same time, without words, he is telling \nher that the feeling cannot be given voice or motion.\n\n\n---\n\nBack with the elders behind the building.  They are still in shock from this news.\n\n\nMrs. Clack:  What have you done?\n\n\nEdward:  He is the victim of a crime.  \n\n\nMrs. Clack:  We have agreed NEVER to go back, NEVER.\n\n\nEdward:  What was the purpose of our leaving?  Let us not forget it was out of hope of something good and right.\n\n\nRobert Percy:  You should not have made this decision without us.  You have gone too far.\n\n\nEdward:  I'm guilty, Robert!  I made a decion of the heart!  I cannot look into another's eyes and see the same look I \nsee in August's without justification!  It is too painful, I cannot bear it!  \n\n\nMrs. Clack:  You have jeopardized everything we've made.  \n\n\nEdward (reproachful):  Who do you think will continue this place, this life?  Do you plan to live forever?  It is in \nthem that our future lies!  It is in Ivy and Lucius that this... this way of life will continue.  Yes, I have risked.  I \nhope I am always able to risk everything for the just and right cause!  If we did not make this decision, we could never \nagain call ourselves innocent.  And that, in the end, is what we have protected here!  Innocence!  That, I'm not ready \nto give up.  \n\n\nAugust:  Let her go.  If it ends, it ends.  We can move towards hope, it's what's beautiful about this place.  We must \nnot run from heartache.  You know, my brother was slain in the towns.  The rest of my family died here.  Heartache is \na part of life.  We know that now.  Ivy's running toward hope, let her run.  If this place is worthy, she'll be \nsuccessful in her quest.  \n\n\nMrs. Clack:  How could you have sent HER?  She's blind.\n\n\nEdward:  She's more capable than most in this village... and she is led by love.  The world moves for love.  It kneels \nbefore it in awe.  \n\n\n---\n\nIvy sits under the tarp in the dark, her hands over her ears.  Shakily, she sings the lullabye she sang to Kitty after \nLucius refused her marriage proposal.  All around her, the forest is creaking and groaning.  \n\n\nIvy:  ... all the world to see.  Time look about and know.  How the shadows come and go.  How the breeze stirs the \ntrees.  How the blossoms grow.  Sleep, baby, sleep.  Sleep gently sleep...\n\n\n---\n\nDaylight.  Ivy walks through the now-muddy forest, swinging her cane back and forth, her cloak smeared brown at the \nbottom, and smudges all over.  She walks forward to a ledge, and feeling no way beyond it, she turns to go back.  The \nground gives way.  She shrieks, but manages to hold the edge.  The mud is too slippery to hold it for long.  She slips \nfurther into the hole, but she has caught her hands in some roots.  She whimpers, but manages to swing her bundle and \ncane up onto solid ground, and then she hauls herself, grunting, out of the hole.  It is very deep.  She is covered \nin mud.  Gasping, she makes her way around the hole, to a strange stumps sticking out of the ground.  The mud is all \nover her cloak.\n\n\nEdward (off-screen):  There did exist rumors of creatures in these woods.  It is in one of the history books I used \nto teach in the towns.  \n\n\nGrunting, crying, she tries to wipe the mud from her cloak and arms, but it is everywhere.  She cannot get it off.\n\n\n---\n\nLater in the day, she has let her cloak dry, and much of the mud has caked and fallen off, though there is still some.  \nShe swings her cane back and forth, checking for obstacles.  There is a crack.  She taps her cane again.  It is \nbroken.  She pulls it apart and drops it.  There is a rustling from the woods around her.  She searches with her hands \nfor a rock, and tosses it in the direction of the sound.  The rustling comes from another direction now, louder and \nlouder.  She stumbles off in a random direction, panting and whimpering, whacking branches away from her face, but \nthe sound is getting closer.  She s crying now.  She stops in a small clearing.  There are red berries all around her, \nand bits of snow on the ground.  She cannot see them.  There is a growl.  She turns slowly around.  One of the \ncreatures stands just at the edge of the clearing.  \n\n\nIvy:  It is not real.  It is not real.\n\n\nShe backs up and reaches a tree, and edges her way around it, facing away from the creature.  She listens around the \nedge she came from.  The creature is close, only three or four feet away.  She starts walking away, as quietly as she \ncan, hoping the creature hasn't spotted her.  She gets some distance away, and then there's a crack and a roar.  It \nHAS spotted her.  She stares for some moments in the direction of the creature.  Neither move.  Then it lunges for \nher, charging.  She screams.  It slashes at her, knocking her down, but not doing any damage.  It pauses, then turns.  \nShe has stood up.  It roars again, and chases her.  \n\n\nShe keeps running, but she is losing strength.  She slows to a fast walk, not hearing the creature around her.  \nSuddenly she bumps into something.  It is the stump she felt before, when she crawled out of the hole.  She feels it \nto be sure, then gets an idea.  She drops her pack, puts her hood up, and stands just by the edge of the hole with \nher arms up.  The creature comes charging at her, roaring.  She jumps out of the way just in time.  It falls into the \nhole without a sound.  \n\n\n---\n\nAt the quiet room, Noah's parents have brought him lunch on a tray.\n\n\nVivian:  Noah?\n\n\nShe drops the tray in shock and puts her hands to her face.  \n\n\nVivan:  Oh my God, what is this?\n\n\nRobert:  What is this?  \n\n\nVivian:  Where is HE?\n\n\nThe floor of the quiet room has been pried up in one specific spot.  There are feathers underneath, and animal bones, \nand skins.  There is a bloody piece of a safe-cloak.  \n\n\nRobert:  He found one of the suits we kept under the floorboards.\n\n\nVivian:  Oh, no.  Oh, God.  The animals!\n\n\nAt the window, the mesh screen and wooden shutters have been pried off.  Noah has escaped.\n\n\n---\n\nIn the hole in the ground, Noah lays whimpering in a creature-suit, modified with feathers, skins, and bones \neverywhere.  He is bleeding, badly injured.  He whimpers and groans and cries, and finally, with the side of his face \ntwitching, he dies.  \n\n\n---\n\nIvy strides up to the edge of the hole, with a sturdy, pointed stick in her hands.  She holds it threateningly, but \nthere are no sounds from the hole.  She lowers it.  \n\n\n---\n\nThe elders gather around Lucius in the sick-room.  He is pale, and his skin is mottled.  His mouth hangs open with his \nbreathing.\n\n\nEdward:  His will to live is very strong.  \n\n\n---\n\nIvy strides through the forest, using the stick as a cane, tapping it against trees and ground.  Suddenly the texture \nchanges.  There are rocks underfoot.  She goes back and forth to check and be sure, then drops her sack and pulls the \nwatch and list out of it.  She takes off her cloak, and starts jogging down the road, using the stick to check and make \nsure she is still on the stone path.  \n\n\nEdward (off-screen; memory):  A half day's journey will bring you to a hidden road.  You alone will follow the road, and \nleave Covington woods.  You are to tell no one in the towns where we are, and return with haste.  \n\n\n---\n\nA fire burns in the Walker home.  Edward and Tabitha hold hands, standing by the door.  They seem to come to a decision.  \nTabitha locks the door, and she and Edward walk into another part of the house.\n\n\n---\n\nIvy is still jogging down the road, checking every few feet to make sure she is on the right path.  She yelps, as she \nslams into an ivy-covered obstacle that flexes back and forth.  She drops the cane and checks down the sides of this \nwall to see if there is another point to get up it from.  There isn't.  She steadies herself, and grunts as she jumps \nonto the wall and climbs up.  \n\n\n---\n\nEdward sets the locked black box down on a table, takes a key from his pocket, and opens it, reverently.  He takes a \nbundle of some kind out and hands it to Tabitha, and then a piece of a newspaper that reads, 'Billionaire Walker Shot \nto Death.'\n\n\nMrs. Clack (voice-over):  My sister did not live past her 23rd birthday.  A group of men raped and killed her.  They \nstuffed her in a dumpster, three blocks rom our apartment.\n\n\nNow we see some of the contents of the box.  There are books, papers, oil certificates, and photographs.  Edward pulls \none particular photograph out, and holds it up to look at it.  \n\n\nAugust:  My brother worked in an emergency room downtown.  A drug addict came in with a wound to his ribs.  My brother \ntried to dress the wound.  He pulled a gun from his jacket, then he shot my brother through his left eye.\n\n\nWe see the photo now.  It is a shot of most of the elders, and the year appears to be 1980, maybe a little earlier.  \nAlice Hunt is there, holding baby Lucius in her arms.  Edward and Tabitha are there, Tabitha pregnant with Kitty.  \nMrs. Clack and Victor stand in the background, shyly.  Robert and Vivian Percy are there.  Little Noah is not with them, \nthough he probably is older than Lucius.  And August Nicholson and his wife stand off to the side.\n\n\nAlice:  My husband, Michael, left for the supermarket at a quarter past nine in the morning.  He was found with no \nmoney and no clothes, in the East River, three days later.\n\n\nEdward:  My father was shot by a business partner, who then hanged himself in my father's closet.  They had argued \nover money.  I am a professor.  I teach American History at the University of Pennsylvania.  I have an idea that I \nwould like to talk to you about.  \n\n\n---\n\nThere is a siren.  We see a view from the inside of a vehicle.  Ivy has just managed the climb to to top of the wall, \nand has dropped down on the other side.  The driver of the vehicle talks through a walkie-talkie.\n\n\nDriver:  Mile 27.  There's a girl.  I'm gonna check it out.  \n\n\nHe drives up to her, whooping his siren a few times.  She looks about in confusion.  The side of the truck reads \nWalker Wildlife Preserve.  The driver gets out and approaches, her, tidying his brown uniform.  He looks about \ntwenty-two or twenty-three.  We only see him.\n\n\nDriver (stern):  You're not allowed to go in there.  Please return to your vehicle.\n\n\nIvy (shaky):  What was that noise?  \n\n\nDriver (confused):  What are you doing out here?  How- how'd you get here?\n\n\nIvy:  Are you from the towns?\n\n\nDriver:  Uh...  Where are you from?  \n\n\nFinally, we see Ivy.  There is some dirt on the edges of her sleeves and the bottom of her dress.  She clasps her \nbruised and bleeding hands together in front of her.  Her eyes are held low.  \n\n\nIvy:  The woods.\n\n\nDriver:  You came from the woods?  In there?\n\n\nIvy:  Will you help me?  I need to find a doctor of medicine.  I must find these things, we must make haste.  \n\n\nShe takes the list out of the waist of her dress.\n\n\nDriver:  Listen, ma'am.  I'm just supposed to...\n\n\nHe trails off.  Ivy looks very sad, but she holds the paper out to him in her hands.  He sighs and takes it from her, \nand looks at it.  \n\n\nDriver (concerned):  Is someone hurt?\n\n\nIvy (near tears):  Please, sir, we must make haste.\n\n\nDriver:  Well you... you live in there?\n\n\nIvy:  I do, sir.\n\n\nWalkie-talkie:  Breaker.\n\n\nThe driver picks up his radio and brings it to his face, about to check in.\n\n\nIvy:  What is your name?\n\n\nDriver:  Kevin.\n\n\nIvy:  Kevin.  You have kindness in your voice.  I did not expect that.  \n\n\nKevin pauses a moment, but then he seems to come to a decision.  It is the right one.\n\n\nKevin:  We have guard shacks every ten miles around the perimeter of the preserve.  We keep medical supplies in there \nin case of animal bites or related injuries.  \n\n\nIvy is hopeful, almost stunned.\n\n\nIvy:  You can find the things written on the paper?  \n\n\nKevin nods, but she does not see it.  He may not yet have realized that she is blind.\n\n\nKevin:  You have to wait here.\n\n\nIvy:  Please, sir.  Please... take this as payment.  \n\n\nShe holds out her father's pocket-watch to the young man.  He kind of smiles, wary, and looks around.\n\n\nKevin:  Wait... wait you're not... you're not trickin' me are you?\n\n\nIvy:  I do not understand.\n\n\nKevin:  What's your name?\n\n\nIvy:  Ivy.  Ivy Elizabeth Walker.\n\n\n---\n\nInside the guard shack, the man on the walkie-talkie sits reading a newspaper.  It is full of horrible stories about \nmurdered chldren, people dying in combat, and serial killers.  There are bad stories on the radio, too.  Kevin drives \nup.  The man looks at Kevin as he comes in.  \n\n\nMan:  What's with the girl?  I tried calling you back on the walkie, you didn't answer.\n\n\nKevin:  OH, it was just some teenagers.  They were lost.\n\n\nMan:  Can I give you some advice?  Don't get into conversations.  You start talkin', you start gettin' into how some \nestate is payin' all of us, and no one's allowed to go in there and disturb the animal sanctuary.  People's interest \ngets piqued.  It's a really easy gig, Kevin.  Maintain and protect the border.  A few years ago, it got out in the \npapers that some government guys had been paid off to keep plane routes from flying over this place.  That was a very \nstresful time for me.  Don't cause me any troubles.  Do not get into conversations.  \n\n\nThe man goes back to his newspaper.  Kevin walks over to the side table and munches on some snacks, all the while \nputting the items on Ivy's list in his pocket, including antibiotics.  He walks to the door, then as an afterthought, \nhe turns back to his boss.\n\n\nKevin:  Hey, Jay, where's the maintenance ladder?  I n-need to fix a sign.  \n\n\nJay:  It's in the back.\n\n\n---\n\nIvy makes her way back through the forest, using her stick as a guide.  She is near the stream she was told to follow.  \nThe forest is quiet now.  No creatures live here.  \n\n\n---\n\nThere is a beeping from Kevin's jeep.  The door is open, and a ladder is propped on the side.  The watch is hanging \nfrom his rearview mirror.  He sits there, in the middle of the road, stunned.\n\n\n---\n\nThe elders have gathered in the sick room, keeping vigil over his frail body.  The villagers dash about outside, \nexcited.  A boy runs up to the door to deliver a message.\n\n\nBoy:  Ivy has returned with medicines from the towns.  She was attacked by a creature and killed it.  \n\n\nHe dashes off.  Vivian begins to sob over her lost son.\n\n\nVivian:  Noah.  Oh, God.\n\n\nEdward:  We will find him.  We will give him... a proper burial.  We will tell the others... he was killed by the \ncreatures.  Your son has made our stories real.  Noah has given us a chance to continue this place.  If that is \nsomething... we still wish for.\n\n\nOne by one, the elders stand.  Robert stands, too, and then Vivian.  There son's sacrifice will not be in vain.\n\n\nIvy, cloak gone, makes her way inside, and hands the sack with medicines to August.  She is led to Lucius, and takes \nhis hand, crying.\n\n\nIvy:  I'm back, Lucius.  \n\n\nShe smiles.\n\n\n\n---\n\n\n\nEnd credits roll.  \n\n\n\n\n\n\nVillage, The\nWriters :   M. Night Shyamalan\nGenres :   Drama  Mystery  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:00.836586"}