{"title": "Virtuosity", "film_link": "/Movie Scripts/Virtuosity Script.html", "script_link": "/scripts/Virtuosity.html", "info_raw": "\n\nVirtuosity Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Eric Bernt\nGenres  Action  Sci-Fi  Thriller\nScript Date : May 1994\n\nRead \"Virtuosity\" Script\n\n\n", "script": "\n\n\n\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b>\nVIRTUOSITY by Eric Bernt 3rd Rewrite 8/24/94\n\n\n\n                                        VIRTUOSITY\n\n                                            by\n\n                                        Eric Bernt\n\n                             THIRD REWRITE   August 24, 1994\n\n\n\tTwo men bolt recklessly through a downtown street. Hunters\n\thot on the trail of their prey in an urban jungle.\n\n\n\tThe sidewalk is crowded with people. So is the street. Too\n\tmany people, not enough cement. Los Angeles, 1997.\n\n\n\tSummer, probably August. 103 degrees. Heat shimmers off the\n\thorizon. Making the sky look peculiar.\n\n\n\tThe men keep running. Passed a GUY sitting at a bus stop,\n\twatching a television in his lap. YOU HEAR the NEWSCASTER.\n\n\n\t\t\t\tNEWSCASTER (V. 0.) \n\t\tAs L. A. P. D. officers gather\n\t\tevidence at this grisly crime\n\t\tscene, you can only ask yourselves\n\t\t\u0097\u0097 what kind of lunatic would\n\t\tcommit such unthinkable crimes?\n\t\t\t(a beat)\n\t\tThe three adjectives which best\n\t\tdescribe this killer are sadistic,\n\t\tintelligent, and dangerous...\n\n\tThe guy pays little attention to the broadcast. He seems\n\talmost bored by it. Like this kind of news is commonplace. Or\n\the's got more important things on his mind.\n\n\tEverybody is sweating. Including the two men struggling to\n\tswim upstream in the river of pedestrians.\n\n\tTheir uniforms are freshly pressed. Their shoes just recently\n\tshined. Hair tightly cropped. Faces perfectly shaved. Clearly\n\tmen proud to wear the badge of the Los Angeles Police\n\tDepartment. The guy in the lead is\n\n\t\t\t\tPARKER BARNES\n\t\tHis body is a running back's. His\n\t\tendurance a marathoner's. His face\n\t\tone you'd want for your own. He's\n\t\tin his 30s. If he was in his 20s,\n\t\tyou'd still be jealous.\n\n\tHis partner is JOHN DONLEY, late 20s, eager to prove himself.\n\tHe struggles to keep up with Parker. John accidently knocks\n\tover several pedestrians. They give no reaction, except to\n\tpick themselves up and continue on their way.\n\n\tParker and John keep charging. Their conversation breathless:\n\n\t\t\t\tJOHN\n\t\tI can't get over how different you\n\t\tlook.\n\n\t\t\t\tPARKER\n\t\t\t(ruefully)\n\t\tFive years can be a bitch, huh?\n\n\tThey split-up. The Maitre D', still facing the front doors,\n\trepeats his greeting to no one in particular.\n\n\t\t\t\tMAITRE D'\n\t\tGood afternoon. May I help you?\n\n\tParker spots Sid 6.7 across the room. Without hesitation the\n\thunter chases his prey.  Gun out and firing. NOT what you\n\twould call Standard Police Procedure.\n\n\tBullets riddle Sid 6.7's table as he dives from his chair. He\n\tlands next to a bowling ball bag, which sits beneath his\n\ttable.\n\n\tJohn charges from the other direction until a WOMAN gets up\n\tfrom her chair, standing directly in John's line of fire.\n\n\t\t\t\tJOHN\n\t\t\t(to the Woman)\n\t\tLady, move!\n\n\tBefore she can do so, Sid 6.7 stands behind the Woman,\n\tgrabbing her and throwing her across the table into Parker.\n\tCRASH! They tumble to the floor.\n\n\tIn the same movement, Sid 6.7 removes a gun from inside his\n\tjacket and shoots John in the shoulder before he can fire.\n\tJohn's gun flies from his hand. Sid 6.7 advances toward him.\n\n\tParker struggles to his feet. Aims his weapon. Sid 6.7 does\n\tthe same, but without looking. BOOM! Parker gets a bullet\n\tthrough his shooting arm. His wound IDENTICAL to John's.\n\tParker's weapon tumbles to the floor as his arm goes limp.\n\n\tParker charges him wildly, but Sid 6.7 brutally kicks him in\n\tthe stomach. In perfect rhythm with the symphony playing in\n\tthe background. Parker doubles over, gasping for breath.\n\tAnother kick drops Parker to his knees.\n\n\t\t\t\tSID 6.7\n\t\t\t(to Parker)\n\t\tI'm going to rehearse with your\n\t\tfriend a while, then I'll be back\n\t\tto perform a new piece with you.\n\n\tHe grabs his bowling bag and SLAMS it into John's head,\n\tknocking him out. Sid 6.7 puts John's unconscious body over\n\this shoulder.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tIf you get hungry, I'd recommend\n\t\tthe escargot. They're delicious.\n\n\tHe carries John and the bowling ball bag into the kitchen.\n\tParker scrambles to his gun, and races after Sid 6.7.\n\n\tINSIDE THE RESTAURANT KITCHEN\n\n\tParker charges through SOUS CHEFS chopping vegetables, who\n\twork undistracted. The Vegetables look plastic.\n\n\tParker turns a corner, stopping fast. At the other end of the\n\taisle stands Sid 6.7, who presses his gun against the head of\n\ta frightened BUSBOY. Sid 6.7 holds the Busboy's body in front\n\tof his own as a shield.\n\n\t\t\t\tPARKER\n\t\t\t(to Sid 6.7)\n\t\tWhere's John?\n\n\t\t\t\tSID 6.7\n\t\tPerforming solo.\n\t\t\t(a beat)\n\t\tEnjoying the concert so far?\n\n\tAdvancing up the aisle, Parker levels his gun at Sid 6.7 with\n\this good arm. Now, all work comes to a stop as the Sous Chefs\n\twatch the showdown.\n\n\t\t\t\tPARKER\n\t\tRecital's over, asshole.\n\n\tHe fires directly through the chest of the innocent Busboy\n\thitting Sid 6.7.\n\n\tThe Sous Chefs gasp in horror as the Busboy drops through Sid\n\t6.7's grasp to the floor. Dead.\n\n\tSid 6.7 stares at Parker in disbelief. Blood is now visible\n\tflowing from a bullet hole in Sid 6.7's shoulder, which was\n\tcaused by the same bullet. Sid 6.7's arm dangles uselessly.\n\tHis gun lies on the floor.\n\n\t\t\t\tSID 6.7\n\t\t(surprised, but pleased).\n\t\tYou and me aren't so different,\n\t\tafter all...\n\n\tParker again pulls the trigger. Click. Click, click. No\n\tbullets.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tLike a violin without strings...\n\n\tHe takes off around the corner. Grabbing another clip from\n\tinside his uniform, Parker goes after him. Only to stumble\n\tover something. Sid 6.7's bowling bag. Blood flows through\n\tits zipper. You now realize the object inside is NOT a\n\tbowling ball.\n\n\tBeside the bowling bag lies John's body, which is convulsing.\n\tHis hands have been tied to bare electrical wire. John is\n\tbeing electrocuted. Parker kicks away the wires, but not in\n\ttime.\n\n\t\t\t\tPARKER\n\t\tSHIT!\n\n\tHe scans the room for Sid 6.7. Parker has no idea Sid 6.7 is\n\tstanding directly behind him. Sid 6.7 grabs Parker by the\n\tthroat.\n\n\t\t\t\tSID 6.7\n\t\tI told you I was going to perform a\n\t\tnew piece with you. It's called,\n\t\t\"First You Suffer, Then You Die.\"\n\t\tHope you like it.\n\n\tParker gags, unable to breathe. He then starts to DE\u0097\n\tMATERIALIZE from within Sid 6.7's grasp.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\t\t(as if to God)\n\t\tNOOOH! You can't take him, yet. I'm\n\t\tnot finished!\n\n\tJohn's body also de\u0097materializes as Parker disappears\n\tentirely.\n\n\tThe blood seeping from Sid 6.7's wound stops flowing and\n\tstarts retracting into his body. Along with his bone\n\tfragments. His shoulder is healing itself. Right before your\n\tvery eyes. We PULL BACK TO REVEAL what you are seeing is\n\n\tON A MONITOR\n\n\tThe scene continues seamlessly. Sid 6.7's skin heals over his\n\tshoulder wound once his internal parts are back in their\n\tproper places. No scar whatsoever.\n\n\tHis clothing also returns to perfect condition. Literally, as\n\tgood as new. This is known as AUTOMATIC RESETTING.\n\n\tThe previously dead Busboy also Auto Resets. His wound\n\thealing by itself. We PULL BACK FURTHER to reveal the monitor\n\tis one of several\n\n\tINSIDE THE LAW ENFORCEMENT TECHNOLOGY ADVANCEMENT CENTER\n\n\ta/k/a LETAC. The facility is a converted aerospace research\n\tbuilding in Pacoima. Funded by government black book dollars.\n\n\tThe look is a mixture of industrial grime and high-tech\n\tsparkle. Banks upon banks of computer equipment. Wires,\n\tcables, conduits, connectors everywhere you look.\n\n\tIn complete disarray to the uninitiated. But to those in the\n\tknow, this is the most advanced facility of its kind in the\n\tworld.\n\n\tThe building is partitioned into dozens of stations. At each\n\tstation, a leading engineer in his field is frantically\n\treadying a prototype for demonstration. Each new technology\n\tdesigned to help fight the new Cold War... the War on Crime.\n\n\tThe atmosphere is competitive. Voices are loud. Tension,\n\tanticipation in the air. Only a lucky few will have their\n\tinventions approved for production.\n\n\tLETAC is, quite simply, Los Alamos from 1940 meets Sega from\n\t1994.\n\n\tAt a station in the middle of the room, TWO UNCONSCIOUS\n\tBODIES lie on narrow beds wearing form-fitting skull caps\n\tmade of polyurethane.\n\n\tEach skull cap has 100 acupuncture needles stuck through it\n\tat points designated as neural primes. Each needle is\n\tdirectly connected to the participant's nervous system.\n\n\tThe tail end of each needle is connected to a fiber optic\n\twire which leads to one of numerous interconnected computers\n\tsurrounding the beds.\n\n\tEach of these components isn't much to look at on its own.\n\tBut together, with the rest of the apparatus, are part of\n\tsomething very new \u0097\u0097 a revolutionary law enforcement\n\ttraining device whose name you read:\n\n\tVIRTUAL REALITY CRIMINAL INVESTIGATION SIMULATOR\n\n\tTo be perfectly clear, the events you just witnessed\n\tinvolving Parker, John, and Sid 6.7 took place within virtual\n\treality, not the real world.\n\n\tDozens of small character modules, similar to today's\n\tNintendo game cartridges, are plugged into .the system's main\n\tconsole.\n\n\tEach of the modules bares a name and number, such as MAITRE\n\tD' 1.7 and SHEILA 3.2. There is no character version number\n\tgreater than 4.0. Until you see the module labelled SID 6.7.\n\n\tThe simulation timer stops at: 17 hours, 52 minutes, 11\n\tseconds. A clock reads: 3:04:32 PM.\n\n\tFour observers, two men and two women, watch virtual reality\n\tmonitors positioned around the station. One of the men wears\n\tan L. A. P. D. uniform. His name is WILLIAM COX, 40S. His\n\tnameplate reads CHIEF OF POLICE.\n\n\tOne of the women sits by herself in front of a monitor.\n\tIntently following the action on screen. Studying it\n\tclinically. Her name is DR. MADISON CARTER, late 30s.\n\n\tShe is beautiful, and charming, but those qualities take a\n\tback seat to her intelligence. She is one of the country's\n\tforemost authorities on criminal psychology. Her concerns are\n\tempirical. Her quest is knowledge. She has little in common\n\twith the other observers.\n\n\tThe other man is FREDERICK WALLACE, 5Os, Chairman/CEO of\n\tLETAC. Expensive suit. Commanding, powerful. But not as\n\tcommanding, or powerful, as ELIZABETH DEANE, 605, the\n\tPresidentially\u0097appointed Crime Czars\n\n\tElizabeth Deane is solely responsible for the funds allocated\n\tto LETAC. As well as which prototypes will move on to\n\tproduction.\n\n\t\t\t\tDEANE\n\t\t\t(quietly to Wallace)\n\t\tWhat did Cox pull him out early\n\t\tfor?\n\n\t\t\t\tWALLACE\n\t\tBarnes used to work for him when he\n\t\twas still a cop in the field,\n\t\tremember?\n\n\t\t\t\tDEANE\n\t\t\t(a beat)\n\t\tDon't remind me.\n\n\tLAB ASSISTANTS remove the polyurethane skull caps from the\n\ttwo unconscious bodies. The acupuncture needles remain in the\n\tcaps. You can now see the faces of the participants:\n\n\tParker and John.\n\n\tParker lies calmly, his eyes fluttering as he gradually\n\treturns to consciousness. He looks very different than his\n\tvirtual rendering:\n\n\tHis hair is long and ragged. His face is unshaven. A scar\n\tacross his cheek. A hoop earring in one ear. His outfit a\n\tfilthy prison uniform.\n\n\tJohn's outfit matches Parker's. Physically, he looks as\n\tclean\u0097cut as his virtual rendering. Except that he is\n\tconvulsing. Violently.\n\n\tHis flailing appendages repeatedly hit the apparatus around\n\thim. Like an epileptic having a grand mal seizure. It's ugly.\n\tFrightening.\n\n\t\t\t\tPARKER\n\t\t\t(barely conscious)\n\t\tSOMEBODY.. .DO SOMETHING!\n\n\tTWO PARAMEDICS burst through the doors and rush to John. The\n\tparamedics inject him. Fibrillate him. Repeatedly.\n\n\tThe simulator's designer, DARYL LINDENMEYER, 40s, high\u0097\n\tstrung, intense, and brilliant beyond words, stands by the\n\tequipment protectively. He is far more concerned for the\n\tsafety of his machines than he is for John's life.\n\n\tJohn's body goes limp. His vital signs flat. The Paramedics\n\trecord the time of death and cover the body with a sheet.\n\tThey begin to assemble a gurney to wheel him out.\n\n\t\t\t\tDEANE\n\t\t\t(annoyed to Wallace)\n\t\tWhat the hell happened?\n\n\t\t\t\tWALLACE\n\t\t\t(pointing to needles)\n\t\tLindenmeyer developed neural\n\t\tconnectors that tap directly into\n\t\tthe nervous system. If the\n\t\tsimulator isn't calibrated\n\t\tproperly, experiencing death in\n\t\tthis level of VR is like\n\t\texperiencing death within a dream.\n\t\tThe experience becomes real.\n\n\t\t\t\tDEANE\n\t\t\t(angrily)\n\t\tSimulations are supposed to give\n\t\tparticipants practice in realistic,\n\t\tdangerous scenarios while\n\t\tprotecting them from the risks they\n\t\tare exposed to in the real world.\n\n\t\t\t\tWALLACE\n\t\t\t(annoyed, to Lindenmeyer)\n\t\tI was assured the problem was\n\t\tcorrected.\n\n\t\t\t\tLINDENMEYER\n\t\tI did fix it.. I told you I did. I\n\t\tdon't know why it happened again.\n\n\t\t\t\tDEANE\n\t\tAgain?!\n\n\t\t\t\tCOX\n\t\t\t(a beat)\n\t\tMy first two pairs of convicts\n\t\tsuffered the same fate.\n\n\t\t\t\tDEANE\n\t\t\t(coldly, to Wallace)\n\t\tWhy wasn't I told?\n\n\t\t\t\tWALLACE\n\t\tBlack book dollars, black book\n\t\toperation. You pay me for results,\n\t\tnot how for how I get you there.\n\n\t\t\t\tCOX\n\t\t\t(to Deane)\n\t\tI'll tell you one thing -\u0097 there is\n\t\tno way in hell we should allow any\n\t\treal officers to train in this damn\n\t\tthing.\n\n\t\t\t\tDEANE\n\t\tThen about all I've spent $37\n\t\tmillion developing is a very\n\t\texpensive way to control the prison\n\t\tpopulation.\n\n\tAfter giving Wallace a cold, hard stare -- namely at his hand\n\tstitched lapel, his gold watch, and his diamond-studded\n\tcufflinks, she exits. Wallace follows after her quickly. You\n\tnow notice that the chair Dr. Madison Carter had occupied is\n\tnow empty. She left a while ago.\n\n\tCox remains. Lindenmeyer hurriedly examines the simulator as\n\tif it were his child. There are several scratches, but no\n\tmajor damage. He looks relieved.\n\n\t\t\t\tPARKER\n\t\t\t(struggling to sit up)\n\t\tHe...only had a year left on his\n\t\tsentence.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(annoyed)\n\t\tHow much do you think I care?\n\n\tParker, still not fully conscious, hurls himself at\n\tLindenmeyer.\n\n\t\t\t\tLINDENMEYER (CONT' D)\n\t\t\t(hysterical)\n\t\tDon't touch me!...DON'T TOUCH ME!!!\n\n\tHe flails his arms wildly. Nearly spasming. This is clearly a\n\tman who should never drink coffee. TWO armed GUARDS, who've\n\tbeen standing in the background, pull Parker off Lindenmeyer\n\tand throw him to the ground.\n\n\tLindenmeyer watches with satisfaction as the guards put\n\tParker in handcuffs and leg chains.\n\n\t\t\t\tCOX\n\t\tI'll walk him out.\n\n\tThe Guards back off as Cox helps Parker to his feet.\n\n\t\t\t\tCOX (CONT'D)\n\t\t\t(to Parker)\n\t\tYou all right?\n\n\t\t\t\tPARKER\n\t\t\t(still clearing his head)\n\t\tWhy'd.. .you pull me out?\n\n\t\t\t\tCOX\n\t\tDonley started experiencing the\n\t\tattack for real. If I hadn't gotten\n\t\tyou out, the same thing would have\n\t\thappened to you.\n\t\t\t(a beat)\n\t\tYou may not believe this, Parker,\n\n\tbut I still consider us friends.\n\n\tHe helps Parker toward the exit as he continues having\n\tdifficulty with his balance.\n\n\tOUTSIDE LETAC\n\n\tThe building is heavily-guarded. Razor wire, land mines,\n\tarmed sentries. Nobody who shouldn't be here gets anywhere\n\tnear here.\n\n\tCox leads Parker by the arm to a waiting prison transport.\n\tThe two guards walk behind at a distance. Two more by the\n\ttransport. The chain between Parker's legs keeps his steps\n\tshort.\n\n\t\t\t\tCOX\n\t\tWhat the hell did you have to shoot\n\t\tthe busboy for?\n\n\t\t\t\tPARKER\n\t\tHe was a computer program for\n\t\tcrissake.\n\n\t\t\t\tCOX\n\t\tYou were supposed to act as if\n\t\teverything was real.\n\n\t\t\t\tPARKER\n\t\tReal, my ass. It's an overblown\n\t\tgame.\n\t\t\t(a beat)\n\t\tAnybody ever catch that fucking\n\t\tpsycho?\n\n\t\t\t\tCOX\n\t\tBefore you, nobody else had gotten\n\t\tclose enough to Sid 6.7 to take a\n\t\tshot at him. Hell, nobody else had\n\t\teven been able to start tracking\n\t\thim before he got to them first.\n\t\t\t(eyeing Parker's scar)\n\t\tNew scar \u0097\u0097 you making it okay in\n\t\tthere?\n\n\t\t\t\tPARKER\n\t\t\t(head down)\n\t\tI'm getting by.\n\n\tHe starts walking ahead of Cox. Distancing himself.\n\n\t\t\t\tCOX\n\t\t\t(pausing for emphasis) )\n\t\tYou've got to know I tried keeping\n\t\tyou out of general population.\n\t\tGoddam politicians...\n\n\tHis voice trails off as Parker turns around, and heads\n\tdirectly toward him.\n\n\t\t\t\tPARKER\n\t\t\t(locking eyes)\n\t\tYou want to know how I'm doing?\n\t\tEvery day, I lose a little bit more\n\t\tof myself.\n\t\t\t(a beat)\n\t\tI'm becoming something else, and it\n\t\tscares the hell out of me.\n\n\tHe turns back toward the transport. Cox follows. Two armed\n\tGUARDS open the back doors for Parker, then stand poised with\n\tweapons out and ready.\n\n\tINSIDE THE PRISON TRANSPORT -- REAR\n\n\tCold metal benches. No windows. Parker climbs in, the only\n\tpassenger. He looks out the open doors to Cox.\n\n\t\t\t\tPARKER\n\t\t\t(half-heartedly)\n\t\tBut with the six months off I get\n\t\tfor being your guinea pig, I've\n\t\tonly got to survive another 17\n\t\tyears, 5 months, and 23 days.\n\n\t\t\t\tCOX\n\t\tDon't give up, Parker. Not ever.\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tYou know those cheesy Christmas\n\t\tcards of your family under that\n\t\ttree in your back yard you keep\n\t\tsending me every year?\n\n\t\t\t\tCOX\n\t\tWhat about them?\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tDo me a favor \u0097\u0097 keep sending them.\n\n\tOUTSIDE LETAC\n\n\tStanding outside the transport, Cox puts his hand on Parker's\n\tshoulder.\n\n\t\t\t\tCOX\n\t\tTake care, pal.\n\n\tBehind him, John's body is loaded into an ambulance. The\n\tGuards SLAM the prison transport doors shut.\n\n\tINSIDE THE PRISON TRANSPORT -- REAR\n\n\tParker sits in DARKNESS as the transport begins its trek. The\n\tonly light comes from a four inch portal, covered in steel\n\tmesh, through which the Guards can keep an eye on him.\n\n\t\t\t\tGUARD\n\t\t\t(tauntingly)\n\t\tHey Parker \u0097\u0097 I'm real sorry John\n\t\tboy got fried. What do you think\n\t\tBig Red's gonna do when he finds\n\t\tout you came back without his girl\n\t\tfriend?\n\n\tParker sits in silence.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE LETAC\n\n\tSid 6.7 remains visible on the various monitors around the\n\troom as Lindenmeyer spot checks the simulator.\n\n\t\t\t\tSID 6.7\n\t\t\t(from the monitors)\n\t\tDon't be angry with me, Daryl.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(a beat)\n\t\tDid you recognize the son-of-a\n\t\tbitch who got away?\n\n\t\t\t\tSID 6.7\n\t\tShould I have?\n\n\t\t\t\tLINDENMEYER\n\t\tThink hard -- it'll come to you...\n\n\tWallace enters briskly.\n\n\t\t\t\tWALLACE\n\t\tYou embarrassed me in front of the\n\t\thighest\u0097ranking law enforcement\n\t\tofficial in the country.\n\t\t\t(a beat)\n\t\tDo you have any idea how much money\n\t\tyou just cost me?\n\n\t\t\t\tLINDENMEYER\n\t\tThe reason you insisted on testing\n\t\tmy system with prisoners is because\n\t\tof the increased risks involved\n\t\twith increased realism.\n\n\t\t\t\tWALLACE\n\t\tOf the six prison inmates you've\n\t\ttested \u0097\u0097 all of whom have had at\n\t\tleast some military or survival\n\t\ttraining -\u0097 only Mr. Barnes is\n\t\tstill breathing.\n\n\t\t\t\tLINDENMEYER\n\t\tI'm still making adjustments...\n\n\t\t\t\tWALLACE\n\t\tYou've had a year\u0097and\u0097a\u0097half to\n\t\tmake all the adjustments you want,\n\t\tLindenmeyer.\n\t\t\t(moving closer) )\n\t\tElizabeth Deane does not give\n\t\tsecond chances. Neither do I.\n\t\tYou're fired.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(hysterical)\n\t\tI'M WHAT?!\n\n\t\t\t\tWALLACE\n\t\t\t(relishing his authority)\n\t\tYou are to turn over the Sid 6.7\n\t\tprogram, and all its documentation,\n\t\tfor immediate destruction. Is that\n\t\tunderstood?\n\n\t\t\t\tLINDENMEYER\n\t\t\t(restraining himself)\n\t\tI understand... I understand\n\t\tperfectly.\n\n\tWallace ignores him as he walks toward the door. On the\n\tmonitors, Sid 6.7 starts walking toward you. Into a CLOSEUP.\n\n\t\t\t\tSID 6.7\n\t\t\t(from the monitor)\n\t\tHey, Wallace, you really think you\n\t\tcan shut me down?\n\n\tWallace stops, staring at a monitor in disbelief.\n\n\t\t\t\tWALLACE\n\t\t\t(to Lindenmeyer)\n\t\tHow does he know who I am?\n\n\t\t\t\tLINDENMEYER\n\t\t\t(pointing to microphone)\n\t\tHe hears...everything.\n\n\t\t\t\tWALLACE\n\t\t\t(approaching the monitor)\n\t\tAs a matter of fact, I do.\n\n\tHe exits.\n\n\tON THE MONITORS\n\n\taround the room, Sid 6.7 walks to a pay phone and dials a\n\tnumber.\n\n\tINSIDE AN INDUSTRIAL CORRIDOR\n\n\tWallace walks toward the building's entrance. His footsteps\n\tECHO. His cellular phone RINGS.\n\n\t\t\t\tWALLACE\n\t\tThis is Wallace...\n\n\t\t\t\tSID 6.7 (V. 0.)\n\t\t\t(through phone)\n\t\tAs a matter of fact, little man,\n\t\tyou're wrong. I think, therefore, I\n\t\tam.\n\n\tClick. Sid 6.7 hangs-up. Wallace stops, staring at his phone\n\tin disbelief.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE FOLSOM COUNTY MAXIMUM SECURITY PRISON\n\n\tParker is led into the Inmate Receiving Room at gunpoint. He\n\tis ordered to remove his clothing.\n\n\tHe stands completely naked, arms held out to the sides, as he\n\tis strip searched. Every portion of the body in which someone\n\tcould hide something is closely inspected.\n\n\tWithout being graphic, we watch the de\u0097humanizing procedure.\n\tHe opens his mouth as wide as possible. Pulls his earlobes\n\tforeword to reveal behind them. Then bends over, hands on the\n\tfloor in front of him.\n\n\tHe is scanned with a metal detector. So is his clothing,\n\twhich is then returned to him.\n\n\t\t\t\tGUARD #1\n\t\tWelcome home, cop.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE PRISON CAFETERIA\n\n\tParker eats at a table with a dozen other inmates. The food\n\tis unrecognizable. The air thick with humidity and cigarette\n\tsmoke. Nobody is talking. Just staring. At Parker.\n\n\tParker forces down the remainder of his meal, then returns\n\this utensils to a bin. And heads to the bathroom. All eyes\n\tfollowing Parker's every move.\n\n\tThe other inmates then turn their attentions to a man of\n\tincredible size following Parker. 6' 6\", 255 lbs. His face\n\tcovered with red scar tissue from burns suffered long ago.\n\tThis is BIG RED. He follows Parker into the bathroom.\n\n\tINSIDE THE BATHROOM\n\n\tGraffiti covers the walls. Red uses a stained urinal, then\n\tturns to the stalls. A pair of prison\u0097issue shoes and socks\n\tare visible beneath one of them.\n\n\t\t\t\tRED\n\t\tTime to hurt...\n\n\tRed kicks in the door to the stall. Revealing a pair of shoes\n\tand socks stuffed with a prison shirt. Red hears something\n\tbehind him. And turns around slowly.\n\n\tParker stands barefooted and shirtless. SCARS are visible\n\taround each arm just below the elbow. You will learn what\n\tthese represent momentarily.\n\n\tParker is six inches shorter and 60 pounds lighter than Red.\n\tBut the punch Parker delivers to Red's face makes you think\n\tit's the other way around.\n\n\tYou HEAR the sound of metal crushing bone. Red is thrown\n\tbackwards into the stall. Blood splatters from his mouth,\n\tadding another shade of redness to his face.\n\n\tRed's teeth stick out of Parker's fist. Parker pulls out the\n\tteeth. He does not bleed. Nor seem in pain. Metal is visible\n\tbeneath the surface of his skin.\n\n\tFor the first time, you notice SMALL TATTOOS on the outsides\n\tof his palms. They read: WENTLOW MODEL 17-L, and 17-R,\n\tfollowed by serial numbers.\n\n\tRed charges Parker wildly. Parker dodges him like a matador\n\tdoes a bull. Then brings his fists down savagely on the back\n\tof Red's head. His skull CRACKS. Red drops to the floor.\n\n\tParker jumps on top of him, arms around his neck. Choking\n\thim. Red staggers to his feet. His eyes wide. His face now\n\teven redder.\n\n\tParker maintains his mechanical grip. Red finally succumbs to\n\tthe lack of oxygen. He drops to his knees. Parker does not\n\trelent until he feels the barrel of a gun at the back of his\n\thead.\n\n\t\t\t\tGUARD\n\t\tFun's over.\n\n\tParker lets go, dropping Red to the wet, filthy floor.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE PRISON HOSPITAL\n\n\tThe room isn't clean. The technology is outdated. A large,\n\tfemale NURSE applies epoxy-like sealant to the synthetic skin\n\ton Parker's fingers.\n\n\t\t\t\tNURSE\n\t\tI still don't know why they wasted\n\t\tthis fancy, new technology on you.\n\t\tEvery time I fix you up, you only\n\t\tgo and mess it up again.\n\n\tShe sandpapers off the excess sealant. Then places his elbow\n\tinto an electronic sensitivity adjuster.\n\n\t\t\t\tNURSE\n\t\tTell me how this feels...\n\n\tShe pricks Parker's finger with a pin.\n\n\t\t\t\tPARKER\n\t\tOW!\n\n\t\t\t\tNURSE\n\t\t\t(smiling)\n\t\tI'll dial it down a little.\n\n\tShe does so, then pricks Parker's finger again. He grimaces\n\tin pain.\n\n\t\t\t\tNURSE (CONT'D)\n\t\tThat about right?\n\n\t\t\t\tPARKER\n\t\tIt'll never feel right.\n\n\t\t\t\tNURSE\n\t\tAt least they work. Would you\n\t\trather have no hands at all?\n\n\t\t\t\tPARKER\n\t\tSometimes.\n\n\t\t\t\t\tCUT TO:\n\n\tSYNTHETIC BODY PARTS lying strewn around one of the stations\n\tin LETAC the NEXT DAY. It's a good bet this is the same\n\ttechnology attached to Parker's elbows.\n\n\tThere are also various shapes and sizes of robots, androids,\n\tand other synthetic forms. The most human\u0097looking ones are\n\tthe least functional. The least human\u0097looking ones, the most\n\tfunctional.\n\n\tYou follow a remote\u0097controlled, box\u0097shaped robotic sentry\n\tmoving swiftly through an obstacle course resembling a subway\n\tstation. It is being operated by CLYDE REILLY, 20s, a\n\thardware genius who has spent too much time in windowless\n\trooms.\n\n\tHidden from Reilly's view, Lindenmeyer, the software expert\n\twho created Sid 6.7, stares jealously through a narrow gap in\n\ta partition. Trying to contain his anger. And failing.\n\tEspecially as...\n\n\tWallace enters the station, carrying a bottle of Dom Perignon\n\tand two glasses. Wallace hugs Reilly, who does not return the\n\tgesture.\n\n\t\t\t\tWALLACE\n\t\tCongratulations, Reilly...\n\n\tHe pops the cork, and pours their glasses.\n\n\t\t\t\tWALLACE (CONT'D)\n\t\t\t(toasting)\n\t\tTo the first LETAC engineer to go\n\t\tinto production on prototypes.\n\n\t\t\t\tREILLY\n\t\tAs long as you keep overpaying me,\n\t\tI'll be the first to go into\n\t\tproduction on three, and four, as\n\t\twell.\n\n\t\t\t\tWALLACE\n\t\tAs long as they keep overpaying me,\n\t\tI'll keep overpaying you.\n\t\t\t(dropping the revelry) )\n\t\tJust make goddam sure you can have\n\t\t10 of them ready for deployment\n\t\taround the city by next month.\n\n\t\t\t\tREILLY\n\t\tMr. Wallace, I could have 10 of\n\t\tthem ready by tomorrow.\n\n\t\t\t\tWALLACE\n\t\t\t(a beat)\n\t\tDo they have to look so...robotic?\n\n\t\t\t\tREILLY\n\t\tAt this stage, you either get form\n\t\tor function. You said she wanted\n\t\tfunction. I gave you function. What\n\t\tare you complaining about?\n\n\tHe remote controls the robotic sentry to chase Wallace out of\n\tthe station. Lindenmeyer can no longer be seen through the\n\tgap in the partition.\n\n\tINSIDE LINDENMEYER'S STATION\n\n\tLindenmeyer storms in angrily. Sid 6.7 is visible on the\n\tvirtual reality monitors around the simulator. He's giving\n\thimself a manicure.\n\n\t\t\t\tLINDENMEYER\n\t\tAll they want to produce around\n\t\there is mediocrity!\n\n\t\t\t\tSID 6.7\n\t\tTrue genius is rarely rewarded\n\t\twithin its lifetime.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(a revelation)\n\t\tIt was you, wasn't it?\n\n\t\t\t\tSID 6.7\n\t\t\t(innocently)\n\t\tIt was me, what?\n\n\t\t\t\tLINDENMEYER\n\t\tYou amped the neural connectors\n\t\tback up, didn't you?\n\t\t\t(angrily)\n\t\tYou're the reason the convict died.\n\t\tYou're the reason I got fired!\n\n\t\t\t\tSID 6.7\n\t\tI couldn't just let them make you\n\t\tbring down my degree of difficulty.\n\t\tI'm a triple-twisting, double back\n\t\tflip off the high platform, not a\n\t\tswan dive.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(proud, but frightened)\n\t\tMy God...\n\n\t\t\t\tSID 6.7\n\t\tWhich God would that be, the one\n\t\twho created me, or the one who\n\t\tcreated you?\n\t\t\t(a beat)\n\t\tIn your world, the Lord giveth, and\n\t\tthe Lord taketh away. But in my\n\t\tworld, the one who gave me life\n\t\tdoesn't have the balls to stop a\n\t\tcouple of bureaucratic assholes\n\t\tfrom taking it away.\n\n\t\t\t\tLINDENMEYER\n\t\tWhat do you expect me to do, put\n\t\tyour character module in my pocket\n\t\tand just walk you out of here?\n\n\t\t\t\tSID 6.7\n\t\tI had something a little different\n\t\tin mind.\n\t\t\t(deviously)\n\t\tInstead of just playing Peeping Tom\n\t\twith Reilly, why don't you get him\n\t\tto show you what he's been working\n\t\ton after hours?\n\n\tLindenmeyer arches an eyebrow, then picks up a phone and\n\tdials an extension.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(into phone)\n\t\tHey, Reilly, Sheila 3.2's been\n\t\tasking for you...\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\twhose wrists and ankles are cuffed, being led into a Prison\n\tInterrogation Room. Dr. Madison Carter sits at a table, a\n\tVISITOR'S BADGE clipped to her suit. A notepad in front of\n\ther.\n\n\t\t\t\tMADISON\n\t\t\t(to the Guard)\n\t\tThe cuffs won't be necessary.\n\n\t\t\t\tGUARD\n\t\tNo offense, ma'am, but I don't\n\t\tthink that's such a good idea.\n\n\t\t\t\tMADISON\n\t\tI would like the following three\n\t\tthings in this order: your mouth\n\t\tshut, his cuffs off, and your ass\n\t\toutside the door. Any questions?\n\n\tThe Guard removes Parker's cuffs, then exits, taking up his\n\tpost outside the door. The skin around Parker's wrists is\n\tblue where the cuffs dug into his skin.\n\n\tParker sits across from Madison. She places a micro\u0097recorder\n\tin the middle of the table and presses RECORD.\n\n\t\t\t\tPARKER\n\t\tYou actually listen to all those\n\t\ttapes?\n\n\t\t\t\tMADISON\n\t\t\t(wryly)\n\t\tNo, I just like the effect a tape\n\t\trecorder has on you.\n\t\t\t(a beat)\n\t\tHow you feeling today?\n\n\t\t\t\tPARKER\n\t\tA little less than yesterday.\n\n\t\t\t\tMADISON\n\t\tIn other words, par for the course.\n\t\t\t(a beat)\n\t\tHow do you feel about the\n\t\tsimulation you participated in\n\t\tyesterday?\n\n\t\t\t\tPARKER\n\t\tJohn died.\n\n\t\t\t\tMADISON\n\t\tI know. I was there. I saw the\n\t\twhole thing.\n\t\t\t(a beat)\n\t\tIf I was your therapist, I would\n\t\thave advised you against putting\n\t\tyourself back into that kind of\n\t\tsituation.\n\n\t\t\t\tPARKER\n\t\tYou're not my therapist. You're\n\t\thear to study me. Face it \u0097\u0097 I'm\n\t\tnothing more than a lab rat to you.\n\n\t\t\t\tMADISON\n\t\tThat's not true, Parker.\n\n\t\t\t\tPARKER\n\t\tIf I had died yesterday, you'd have\n\t\talready dissected my brain and\n\t\tanalyzed it to see if I carry any\n\t\tgenetic predisposition toward\n\t\tviolence.\n\n\t\t\t\tMADISON\n\t\t\t(a beat)\n\t\tWhat was going through your mind\n\t\twhen you killed the busboy?\n\n\t\t\t\tPARKER\n\t\tNot much. He was just a computer\n\t\tprogram. Nothing more.\n\n\t\t\t\tMADISON\n\t\tYou didn't see the expression you\n\t\thad on your face when you pulled\n\t\tthe trigger. But I did.\n\t\t\t(a beat)\n\t\tYou kind of liked it, didn't you?\n\t\tThat thrill of going over the edge\n\t\tagain. Of taking out an innocent\n\t\tbystander or two, as long as you\n\t\tgot the target...\n\n\t\t\t\tPARKER\n\t\tGo to hell.\n\n\t\t\t\tMADISON\n\t\tIt was just like before, wasn't it?\n\t\tWasn't it?\n\t\t\t(a beat)\n\t\tBut you are making progress.\n\t\tInstead of killing seven people to\n\t\tget the one you're after, this time\n\t\tthere was only one other person\n\t\tinvolved.\n\n\t\t\t\tPARKER\n\t\tEnough!\n\n\tThe Guard pokes his head in with concern.\n\n\t\t\t\tMADISON\n\t\tGET OUT!\n\n\tThe Guard quickly shuts the door. Madison turns to Parker.\n\n\t\t\t\tMADISON (CONT'D)\n\t\tI need to know what snapped in you.\n\t\tWhat made you capable of it. You\n\t\thave to make me understand.\n\n\t\t\t\tPARKER\n\t\tI don't have to do anything except\n\t\tsurvive. And it's taking everything\n\t\tI've got just to do that.\n\n\t\t\t\t\tCUT TO:\n\n\tON A VIRTUAL REALITY MONITOR\n\n\tinside Lindenmeyer's station in LETAC, the stunningly\n\tbeautiful SHEILA 3.2 appears. In very revealing lingerie.\n\tPerforming an outrageous strip\u0097tease.\n\n\t\t\t\tSHEILA 3.2\n\t\t\t(seductively)\n\t\tI hope watching me is as big a turn\n\t\ton for you as dancing is for me...\n\n\tINSIDE LETAC\n\n\tReilly runs his perspiring finger over the monitor as if he\n\tcould touch the contours of Sheila 3.2's body.\n\n\t\t\t\tREILLY\n\t\tOh, believe me, it is. It is...\n\n\tHe is so aroused, he's shaking. Lindenmeyer, on the other\n\thand, appears almost uninterested. He's used to the routine.\n\n\tOn the monitor, Sheila 3.2 continues her strip\u0097tease.\n\n\tSlowly. Sensually. Licking her lips. Grinding her hips.\n\n\tPutting on quite a show.\n\n\tShe removes her top, revealing ideal breasts. She fondles her\n\tnipples. As well as the rest of herself.\n\n\tLindenmeyer and Reilly continue watching. Reilly can barely\n\tcontrol himself.\n\n\tSheila 3.2 is very, very, very good at what she does. A\n\tvirtuoso stripper. Reilly is transfixed. Until Lindenmeyer\n\tpushes a button, BLACKING OUT the virtual reality screens.\n\n\t\t\t\tREILLY\n\t\tHEY!!!\n\n\t\t\t\tLINDENMEYER\n\t\tShow's over unless I get to see\n\t\twhat you've been working on after\n\t\thours.\n\n\t\t\t\tREILLY\n\t\t\t(paranoid)\n\t\tI haven't been working on anything.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(threateningly)\n\t\tDo I get to see it or not?\n\n\t\t\t\tREILLY\n\t\t\t(a beat)\n\t\tBastard...\n\t\t\t(to a monitor)\n\t\tSheila, don't go anywhere. I'll be\n\t\tright back.\n\n\tHe rushes out. Sid 6.7 appears on the various monitors next\n\tto Sheila 3.2. He kisses her cheek. Caresses her body. Sheila\n\t3.2 enjoys the attention.\n\n\t\t\t\tSID 6.7\n\t\tShe's some of your finest work,\n\t\tDaryl.\n\n\t\t\t\tLINDENMEYER\n\t\tAll my work is my finest.\n\n\tSid 6.7 continues appreciating Sheila 3.2. As Reilly races\n\tback in, the monitors then all go BLACK.\n\n\tReilly, completely out of breath, holds a python by it's\n\thead. He dangles the snake right in front of Lindenmeyer's\n\tface. Terrifying him.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(backing away fast)\n\t\tGet that fucking thing away from\n\t\tme!\n\n\t\t\t\tREILLY\n\t\t\t(laughing)\n\t\tYou're...such a wimp.\n\n\tHe grabs a large pair of scissors and snips right through the\n\tsnake. The half of the snake which drops to the floor stops\n\tmoving.\n\n\tBut the half still in Reilly's hand begins REGENERATING a new\n\ttail. Literally growing a new one. Lindenmeyer can't believe\n\this eyes. He studies the snake closely.\n\n\t\t\t\tREILLY (CONT'D)\n\t\tWatching your VR people Auto Reset\n\t\tgave me the idea.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(in awe)\n\t\tIt's nano\u0097technology, isn't it?\n\t\tMachines the size of molecules...\n\n\t\t\t\tREILLY\n\t\t\t(proudly)\n\t\tCoordinated by polymer neural net.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(touching the snake)\n\t\tIt feels so.. .real.\n\n\t\t\t\tREILLY\n\t\tIt's better than real. It's\n\t\tsynthetic flesh. Synthetic blood.\n\t\tSynthetic organs...\n\t\t\t(a beat)\n\t\tIt's a physiological machine.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(awed)\n\t\tThis is supposed to be years away.\n\n\t\t\t\tREILLY\n\t\tAs far as the public is concerned,\n\t\tit is. The reason you got fired,\n\t\tand I got my second demo into\n\t\tproduction, is I'm a lot smarter\n\t\tthan you. I never give my best\n\t\tstuff away.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(restraining himself)\n\t\tHow do you kill it?\n\n\t\t\t\tREILLY\n\t\tSeparate the character module from\n\t\tthe neural net...\n\n\tUsing Lindenmeyer's scissors, he cuts off the snake's head\n\tand removes a small character module connected to the base of\n\tthe neural net. The snake stops moving. It \"dies.\"\n\n\t\t\t\tREILLY (CONT'D)\n\t\t... and you get nano\u0097death.\n\t\t\t(discarding the snake)\n\t\tDon't worry, I've got a bunch of\n\t\tother ones.\n\n\t\t\t\tLINDENMEYER\n\t\tAmazing. I hate to say it, but it\n\t\tis.\n\n\t\t\t\tREILLY\n\t\tI know.\n\t\t\t(a beat)\n\t\tI'm ready to incubate something a\n\t\tlittle more advanced than a\n\t\tcoldblooded reptile. If you want to\n\t\texperience the future, meet me in\n\t\tmy office in 15 minutes. And bring\n\t\tthe Sheila 3.2 character module\n\t\twith you...\n\n\tHe exits. As Lindenmeyer reaches for the Sheila 3.2 character\n\tmodule, Sid 6.7 appears on the screen in front of him and\n\twinks.\n\n\t\t\t\tSID 6.7\n\t\tYou catching my drift?\n\n\t\t\t\tLINDENMEYER\n\t\tI think I understand what you have\n\t\tin mind...\n\n\tPeeling the label off the Sid 6.7 character module,\n\tLindenmeyer removes the module from its slot. Sid 6.7\n\tdisappears from the screen.\n\n\t\t\t\t\tCUT TO:\n\n\tREILLY\n\n\topening his office door for Lindenmeyer fifteen minutes\n\tlater. Reilly immediately double bolts the door behind him\n\tand leads Lindenmeyer through piles of electronic circuitry.\n\tAs well as a large aquarium full of nano\u0097pythons.\n\n\t\t\t\tLINDENMEYER\n\t\tYou need a maid.\n\n\t\t\t\tREILLY\n\t\tWhat I need is a nymphomaniac.\n\n\tHe removes a tarp from a large, rectangular, metallic tank\n\twith a circular window in the middle of it.\n\n\tClear, plastic tubing, which branches into hundreds of\n\tincreasingly smaller and smaller branches, floats in\n\telectrified fluid. The tubing is a synthetic human nervous\n\tsystem.\n\n\tINSIDE REILLY'S OFFICE\n\n\tReilly turns to Lindenmeyer.\n\n\t\t\t\tREILLY\n\t\tWhere's the Sheila 3.2 module?\n\n\tLindenmeyer hands him the label\u0097less character module. Reilly\n\topens the \"incubator.\"\n\n\tINSIDE THE INCUBATOR\n\n\tReilly inserts the module into the gelatinous base of the\n\tsynthetic nervous system.\n\n\tThe polymer neural net instantly crackles with life. It grows\n\taround the module. Cells (nano\u0097mechanisms) immediately begin\n\tadhering to the tubing. Forming the beginnings of a skeletal\n\tarchitecture.\n\n\tINSIDE REILLY'S OFFICE\n\n\tLindenmeyer and Reilly look on through the circular window.\n\n\t\t\t\tREILLY\n\t\tIt feeds on what is basically\n\t\tamniotic fluid.\n\t\t\t(a beat)\n\t\tIn eight hours, we are going to\n\t\thave ourselves one hell of a play\n\t\ttoy.\n\n\tOff Lindenmeyer's wicked, but somewhat anxious, smile, we\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE PARKER'S CRAMPED PRISON CELL\n\n\tIt's night. Light is dim. His bed is empty. The wall next to\n\tit is completely bare, except for the five Christmas cards\n\tsent each year by Chief Cox.\n\n\tThe other two walls in the cell, however, look very\n\tdifferent. They are completely covered with primitive\n\tpaintings \u0097\u0097 darkly colored, surreal images. Imagine the\n\tLascaux cave paintings as works\u0097in\u0097progress. Painted by Dali.\n\tExcept these images were created by Parker Barnes.\n\n\tHe kneels in a corner, working intensely on another image.\n\tCompletely lost in concentration. His hands, his clothing,\n\tcovered in paint. He almost appears to be part of the art\n\twork.\n\n\tThe work is intricate. It clearly takes Parker a very long\n\ttime. Which gives him something to do during the nights he is\n\tunable to sleep. Which is most of them.\n\n\tHe is so absorbed in his task that he seems oblivious to the\n\tconstant taunts ECHOING throughout the cell block. Threats of\n\tthe ugliest, most vile kind. The kind Parker has had to live\n\twith every night for the last five years.\n\n\tPausing to admire his work, Parker finally hears the taunts.\n\n\tHis face becoming a mixture of frustration, guilt, and anger.\n\n\tParker immediately resumes painting.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE REILLY'S OFFICE\n\n\tReilly paces anxiously by the incubator eight hours later.\n\n\tLindenmeyer sits off to the side, looking no less anxious.\n\n\tIt's close to 4:00 AM.\n\n\tTHROUGH THE CIRCULAR WINDOW\n\n\tThere is no liquid left in the incubator -- it's all been\n\tabsorbed. All that is visible is the silhouette of a human\n\tform crouched within steam. The form stands.\n\n\tINSIDE REILLY'S OFFICE\n\n\tThe human form inside incubator opens the hatch. Steam pours\n\tout from within its confines as it climbs out slowly.\n\n\tThe figure stands within the mist, admiring itself. Then its\n\tsurroundings.\n\n\tReilly approaches the figure with the expectancy of a father\n\tabout to see his newborn child for the first time.\n\tLindenmeyer hangs back.\n\n\t\t\t\tREILLY\n\t\t\t(expecting Sheila 3.2)\n\t\tBaby, what I'm gonna do to you...\n\n\tHis face drops when Sid 6.7 steps out of the mist.\n\n\tCompletely naked. Lindenmeyer smiles proudly. Fearfully.\n\tWickedly.\n\n\t\t\t\tREILLY (CONT'D)\n\t\t\t(to Lindenmeyer)\n\t\tWho the hell is this?!\n\n\t\t\t\tSID 6.7\n\t\tMy name is Sid. Sid 6.7.\n\n\tHe extends his hand as if to shake. Then grabs Reilly by the\n\tthroat and chokes him. Hard.\n\n\t\t\t\tLINDENMEYER\n\t\tSID \u0097\u0097 NO!!!\n\n\t\t\t\tSID 6.7\n\t\tWhat do you expect me to do, thank\n\t\thim?\n\n\t\t\t\tREILLY\n\t\t\t(gasping for air)\n\t\tThis... isn't.. .possible!\n\n\t\t\t\tSID 6.7\n\t\tSure it is \u0097- and it's all thanks\n\t\tto the many long hours put in by\n\t\tyou and Daryl.\n\n\tHe watches Reilly's face with curiosity as the life drains\n\tfrom it. A puddle forms beneath him. He drops Reilly's body\n\tto the floor.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\t\t(to Lindenmeyer) )\n\t\tReal instruments are so much more\n\t\tresponsive than virtual ones, don't\n\t\tyou think?\n\n\tLindenmeyer is nowhere to be seen. The office door is\n\tunlocked, and open. Watching Sid 6.7's expression, you\n\trealize something isn't quite right.\n\n\tHis expression is exaggerated. Artificial. Only for a moment,\n\tbut it's enough to remind you Sid 6.7 is not human.\n\n\tThe billions of nano\u0097mechanisms which make up his anatomy are\n\tstill learning to function in a fully-coordinated fashion.\n\tSid 6.7 is, literally, getting used to his new skin.\n\n\tIn various ways throughout his \"life\" \u0097\u0097 be it a wandering\n\teye, or a momentary limp \u0097- you will be reminded that Sid 6.7\n\tis a synthetic nano\u0097organism unlike anyone has ever seen.\n\n\tA surgical knife by the aquarium catches Sid 6.7's attention.\n\tPicking up the knife, he runs his finger across the razor\u0097\n\tsharp knife blade. Cutting himself slightly. A drop of blood\n\tappears. Sid 6.7 tastes his (synthetic) blood.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tTastes different, somehow.\n\n\tHe then watches with interest as his wound regenerates,\n\thealing itself. The scar tissue is slightly off color.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tI think I'm going to like it here.\n\n\tGlancing at Reilly's prone body, he then SLAMS the office\n\tdoor in our face.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE A PRISON INTERROGATION ROOM\n\n\t6:00 AM. Parker, clearly just awakened, is led into the room\n\tby a guard, who then exits. Waiting for Parker are Chief of\n\tPolice Cox and Elizabeth Deane.\n\n\t\t\t\tPARKER\n\t\t\t(to Cox)\n\t\tYou're wasting your time.\n\t\tI'm not going to play any more of\n\t\tyour goddam games.\n\n\t\t\t\tCOX\n\t\tParker Barnes, I'd like you to meet\n\t\tCrime Czar Elizabeth Deane.\n\n\t\t\t\tPARKER\n\t\t\t(not shaking hands)\n\t\tIt's too early in the morning for\n\t\tme to be cordial. You got any\n\t\tcoffee?\n\n\t\t\t\tDEANE\n\t\tI watched your simulation, Mr.\n\t\tBarnes. Very impressive. You know,\n\t\tyou're the only one to ever go up\n\t\tagainst Sid 6.7 who is still alive.\n\n\t\t\t\tPARKER\n\t\tOnly because I got pulled out\n\t\tearly.\n\n\t\t\t\tDEANE\n\t\tNobody else ever got anywhere near\n\t\thim. Nobody else... understands him\n\t\tlike you do.\n\n\tParker, looking at her incredulously, moves his index finger\n\tcircularly, as in get on with it, already. Cox opens a folder\n\tand shows Parker several PHOTOGRAPHS of Reilly, or what was\n\tleft of him.\n\n\t\t\t\tCOX\n\t\tThese were taken inside LETAC an\n\t\thour ago. Pretty pictures, aren't\n\t\tthey?\n\n\t\t\t\tPARKER\n\t\tI've seen worse.\n\n\t\t\t\tCOX\n\t\tName was Clyde Reilly. Hardware\n\t\tspecialist.\n\t\t\t(a beat)\n\t\tLETAC surveillance cameras got a\n\t\tpicture of the perp as he left the\n\t\tbuilding.\n\n\tHe hands a photograph of Sid 6.7 exiting LETAC to Parker.\n\n\t\t\t\tCOX (CONT'D)\n\t\tWe don't know how, but Sid 6.7 made\n\t\thimself into an android.\n\n\t\t\t\tDEANE\n\t\t\t(correcting him)\n\t\tYou mean a nano\u0097tech synthetic\n\t\torganism.\n\n\t\t\t\tCOX\n\t\tWhatever.\n\n\t\t\t\tPARKER\n\t\t\t(looking at the photo)\n\t\tJesus Christ.\n\t\t\t(a beat)\n\t\tCan you kill it?\n\n\t\t\t\tCOX\n\t\tIf you can catch him.\n\n\t\t\t\tDEANE\n\t\tThink you can do it?\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tNot from in here.\n\n\t\t\t\tDEANE\n\t\t\t(revealing a document)\n\t\tThis is a full pardon. It\n\t\tauthorizes your immediate release.\n\n\tShe slides an unsigned pardon across the table to Parker,\n\tmaking sure to stay beyond his arm's reach. Cox reveals a\n\tworn, L. A. P. D. badge. It was Parker's.\n\n\t\t\t\tCOX\n\t\tRecognize this? How would you like\n\t\tyour old job back?\n\n\t\t\t\tDEANE\n\t\t\t(to Parker)\n\t\tCatch him and your record's clean.\n\n\t\t\t\tPARKER\n\t\tWhat happens if I can't catch him?\n\n\t\t\t\tDEANE\n\t\tIf Sid 6.7 hasn't killed you, we\n\t\tthrow you back in here and you\n\t\tserve out the rest of your\n\t\tsentence.\n\n\t\t\t\tPARKER\n\t\tHow do you know I won't run?\n\n\tDeane holds up a small device called a LOCATER IMPLANT. It is\n\tthe size of a dime.\n\n\t\t\t\tDEANE\n\t\tThis is the newest technology\n\t\tapproved for general\n\t\timplementation. It's called a\n\t\tlocater implant. Every parolee gets\n\t\tone. \n\t\t\t(a beat)\n\t\tWe're going to know where you are\n\t\tevery second for the rest of your\n\t\tlife.\n\n\t\t\t\tCOX\n\t\t\t(leaning to Parker)\n\t\tIf you try to run, I'll hunt you\n\t\tdown and kill you myself.\n\n\t\t\t\tDEANE\n\t\t\t(a beat)\n\t\tYes or no, Mr. Barnes?\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\tbeing given a crew cut by an INMATE BARBER inside the Prison\n\tBarber Shop. Long lengths of Parker's hair cover the floor.\n\tParker's face is then shaved. The majority of his face is\n\thidden. Cox and Deane look on.\n\n\t\t\t\tCOX\n\t\tThere's already a task force out\n\t\tlooking for Lindenmeyer. Every\n\t\tother officer in the city will be\n\t\thunting Sid right along with you.\n\n\t\t\t\tDEANE\n\t\tBut only you will know he's not\n\t\thuman.\n\n\tParker's expression is one of \u0097\u0097 yeah, that figures. Madison\n\tenters. She cannot see Parker behind the barber.\n\n\t\t\t\tMADISON\n\t\tMs. Deane, you wanted to see me?\n\n\t\t\t\tDEANE\n\t\tWe have an emergency situation\n\t\twhich requires somebody with\n\t\texpertise in criminal psychology.\n\t\tUnder the authority vested in me by\n\t\tthe President, I'm giving you\n\t\ttemporary re\u0097assignment.\n\n\t\t\t\tMADISON\n\t\tWhat's the assignment?\n\n\t\t\t\tDEANE\n\t\tYou're going to put your theories\n\t\tto practice. I'm sending you into\n\t\tthe field.\n\n\tThe barber moves back from Parker, revealing his clean\u0097\n\tshaven face. It takes Madison a moment to recognize him with\n\this cleaned\u0097up appearance.\n\n\t\t\t\tMADISON\n\t\t\t(double-taking him)\n\t\tQuite an improvement.\n\t\t\t(looking him over)\n\t\tHair well above the collar\n\t\t\u0097\u0097standard, L. A. P. D. regulation.\n\t\t\t(suspiciously to Deane)\n\t\tWhat exactly am I going to be doing\n\t\tin the field?\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE A PRISON HOSPITAL OPERATING ROOM\n\n\tParker lies on an operating table, receiving anesthesia, as a\n\tSURGEON drills a small hole into his skull. The surgeon\n\tinserts a minute, fiber-optic camera into the hole.\n\n\tParker's brain is displayed on a monitor. The surgeon uses\n\tthe image to guide him as he carefully inserts the locater\n\timplant into Parker's brain.\n\n\t\t\t\tANESTHETIST\n\t\t\t(looking at monitor)\n\t\tYou are right on the border of his\n\t\tcorpus callosuni.\n\n\t\t\t\tSURGEON\n\t\tHe is under, isn't he?\n\n\t\t\t\tANESTHETIST\n\t\t\t(nodding)\n\t\tWon't stop him from dreaming,\n\t\tthough...\n\n\tParker's rapid eye movements tell you the anesthetist is\n\tcorrect. Parker is dreaming.\n\n\tINSIDE A VIEWING ROOM\n\n\tCox and Deane watch the operation through a large window.\n\n\tMadison enters, carrying a folder labelled:\tINMATE #673429\n\tA/K/A PARKER BARNES. She withdraws several PHOTOGRAPHS from\n\tthe folder, placing the first one in front of Deane.\n\n\t\t\t\tMADISON\n\t\tThis is Parker Barnes six years\n\t\tago.\n\t\tThe most decorated cop in the\n\t\thistory of L. A. P. D. Special\n\t\tInvestigations Division...\n\n\tThe photograph is in black and white. But as we MOVE IN\n\tCLOSER, it takes on color. As well as comes to life. Then\n\tdistorting. Becoming surreal. Resembling one of the images\n\tfrom Parker's cell. Then mutating into something else.\n\n\t\t\t\t\tINTERCUT WITH:\n\n\tPARKER'S EYES\n\n\tdarting about wildly beneath his eyelids as he continues\n\tdreaming. You now realize you are seeing what he is seeing:\n\n\tFlashes of color. Shapes. Mostly blurs. A splash of gold.\n\tAlong with some yellow. More images from Parker's cell. Both\n\ttaking feminine form. One adult, one child.\n\n\t\t\t\tMADISON (V. 0.)\n\t\tThis is Parker with his wife and\n\t\tdaughter. Beautiful young family,\n\t\tweren't they?\n\n\tThe bright colors melt into darker, more brooding images.\n\tFlashes of men's faces. Melting into urban decay.\n\tUnhappiness. Technology.\n\n\t\t\t\tMADISON (V. 0. CONT'D)\n\t\tThis is the group of cyber\n\t\tanarchists Parker was closing in\n\t\ton.\n\n\tMelancholy turns violent. Glimpses of weapons. Death.\n\tExplosions. Death. Blood. Death. Caskets. Tombstones. Images\n\tmoving so fast, it's hard to tell what they are. Nothing\n\tliteral.\n\n\t\t\t\tMADISON (V. 0. CONT'D)\n\t\tThis is what Parker's wife and\n\t\tdaughter looked like after they\n\t\twere kidnapped and executed.\n\n\tWeapons firing. Bombs exploding. Images of rage in all its\n\tforms. Many of which you've already seen. Making one thing\n\tnow clear: the paintings in Parker's cell represent his life.\n\tWhat he was. What he lost. And what he is.\n\n\t\t\t\tMADISON (V. 0. CONT'D)\n\t\tThis is what the cyber anarchists\n\t\tand two people who just happened to\n\t\tbe in the wrong club at the wrong\n\t\ttime looked like after Parker\n\t\tfinished with them.\n\n\tTears. Hopelessness. Detonation. And finally blackness.\n\tComplete and utter blackness.\n\n\t\t\t\t\tCUT TO:\n\n\tELIZABETH DEANE\n\n\tlooking at the fifth photograph which Madison has placed in\n\tfront of her inside the Viewing Room.\n\n\t\t\t\tDEANE\n\t\t\t(unfazed)\n\t\tThat's also where Mr. Barnes lost\n\t\this arms to Mathew Grimes' booby\u0097\n\t\ttrap. What's your point, Dr.\n\t\tCarter?\n\n\t\t\t\tMADISON\n\t\t\t(forcefully)\n\t\tLetting a lunatic like Parker\n\t\tBarnes loose in the free world is\n\t\tlike lighting a fuse. At some\n\t\tpoint, he will go off -- you saw\n\t\twhat happened in the simulator. The\n\t\trisk to the public is unacceptably\n\t\tdangerous.\n\n\t\t\t\tDEANE\n\t\tNot if you're with him every step\n\t\tof the way.\n\n\t\t\t\tMADISON\n\t\tThe man played judge, jury, and\n\t\texecutioner with eight people's\n\t\tlives. He lost control and is\n\t\tcapable of doing it again.\n\n\t\t\t\tDEANE\n\t\tI understand the risks involved\n\t\there. But there is nobody better\n\t\tqualified to go after Sid 6.7 than\n\t\tBarnes. And, there is nobody who\n\t\tknows him better than you. If a\n\t\tsituation becomes volatile, you\n\t\twill find a way to quell it. I have\n\t\tcomplete confidence in you.\n\n\tINSIDE THE OPERATING ROOM\n\n\tAs Parker continues dreaming, the locater implant in his head\n\tis tested. Parker's location is pinpointed on an electronic\n\tmap to within one inch of his present location. The hole in\n\this skull is then stitched shut.\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\tputting on his L. A. P. D. uniform and badge inside a Prison\n\tInterrogation Room. He looks very much like he did in virtual\n\treality, except for the scar on his cheek, and his empty\n\tholster. Cox and Madison look on.\n\n\t\t\t\tPARKER\n\t\t\t(to Cox)\n\t\tI don't need a baby\u0097sitter.\n\n\t\t\t\tMADISON\n\t\tWhat you need is a collar.\n\n\t\t\t\tCOX\n\t\t\t(to Parker)\n\t\tShe's going to help you understand\n\t\twhat makes Sid 6.7 tick.\n\n\t\t\t\tPARKER\n\t\tWhat she's going to do is get in my\n\t\tway.\n\n\tCox hands Madison a thick folder.\n\n\t\t\t\tCOX\n\t\tThis is the personnel file on the\n\t\tprogrammer, Lindenmeyer. There\n\t\tmight be something in it you can\n\t\tuse.\n\n\t\t\t\tPARKER\n\t\tShe wasn't part of the deal, Cox.\n\n\t\t\t\tCOX\n\t\tFine \u0097\u0097 you want to stay here?\n\n\tHis cellular phone RINGS, which he answers. As he listens to\n\tthe call, his expression is one of growing concern. He clicks\n\toff the phone.\n\n\t\t\t\tCOX (CONT'D)\n\t\tOfficers in Toluca Lake just found\n\t\tan affluent couple...completely\n\t\tgutted.\n\t\t\t(a beat)\n\t\tSo were the first two cops to\n\t\tarrive on scene.\n\n\t\t\t\tPARKER\n\t\tTheir weapons missing?\n\n\t\t\t\tCOX\n\t\t\t(nodding)\n\t\tSid 6.7 is now armed.\n\n\t\t\t\tPARKER\n\t\tWhere's my gun?\n\n\tCox glances to Madison, then hands Parker a .45. \n\n\t\t\t\tCOX\n\t\tBe careful with it.\n\n\t\t\t\t\tCUT TO:\n\n\tAN L. A. P. D. SQUAD CAR\n\n\tpassing through the Security Checkpoints outside the Prison.\n\tParker at the wheel. Madison beside him. It's afternoon.\n\n\tINSIDE THE SQUAD CAR\n\n\tParker presents his identification to a GUARD, then drives\n\tthrough the final checkpoint. Madison reviews Lindenmeyer's\n\tfile.\n\n\t\t\t\tMADISON\n\t\t\t(without looking up)\n\t\tYou remember how to get to Toluca\n\t\tLake?\n\n\tHe glances at her, then stops the car.\n\n\tOUTSIDE THE PRISON GATES\n\n\tParker gets out of the car. Madison follows suit.\n\n\t\t\t\tMADISON\n\t\tWhat are you doing?!\n\n\tHe walks around the car, brushing past her. Then drops to his\n\tknees at the side of the road. He puts his hands in the dirt,\n\tfeeling the earth between his fingers.\n\n\t\t\t\tPARKER\n\t\t\t(meaningfully)\n\t\tEvery day for the last five years,\n\t\tI told myself someday I would be\n\t\tout here again. No more bars. No\n\t\tmore guards. No more fights just to\n\t\tstay alive.\n\t\t\t(a beat)\n\t\tEvery day for the last five years,\n\t\tI told myself that lie.\n\n\t\t\t\tMADISON\n\t\tIt wasn't a lie.\n\n\t\t\t\tPARKER\n\t\tEvery time I said it, it was. I\n\t\tnever really thought I was going to\n\t\tmake it.\n\n\tTaking a deep breath, he wipes the dirt off his hands. Then\n\tstands.\n\n\t\t\t\tMADISON\n\t\tYou all right?\n\n\t\t\t\tPARKER\n\t\t\t(completely at ease)\n\t\tFine. Never felt better in my life.\n\t\t\t(a beat)\n\t\tSee, I'm a good liar.\n\n\tHe gets back in the vehicle. Off Madison's reaction, we\n\n\t\t\t\t\tCUT TO:\n\n\tSEVERAL TV REPORTERS\n\n\ttalking live to their cameras on the street in front of a\n\tbeautiful, suburban home in Toluca Lake, which is now a crime\n\tscene. 6 PM.\n\n\t\t\t\tREPORTER\n\t\t\t(to her camera) )\n\t\tAs L. A. P. D.\n\t\tOfficers continue gathering\n\t\tevidence at this grisly crime\n\t\tscene, you can only ask yourselves\n\t\t\u0097\u0097 what kind of lunatic would\n\t\tcommit such unthinkable crimes?\n\n\tParker and Madison make their way through the curious trying\n\tto see what's going on. Several REPORTERS double-take Parker,\n\tthen quickly instruct their PHOTOGRAPHERS to take shots of\n\thim.\n\n\tParker and Madison present their identification to the COPS\n\tkeeping the curious at bay.\n\n\t\t\t\tCOP #1\n\t\t\t(recognizing Parker)\n\t\tSon...of...a...bitch.\n\n\tParker and Madison continue toward the house. Getting an\n\tincreasing amount of attention, particularly from the other\n\tCOPS. Some look on with awe. Some with disdain. But nobody is\n\tin between.\n\n\t\t\t\tMADISON\n\t\t\t(quietly to Parker)\n\t\tYou ready for this?\n\n\t\t\t\tPARKER\n\t\tDon't worry. If I can't handle it,\n\t\tI'll just kill everybody.\n\n\tHe gives her a brief smile. Which Madison does not return.\n\tOne of the other policemen tentatively approaches Parker.\n\n\t\t\t\tCOP #2\n\t\tI've always wanted to tell you that\n\t\tif the same thing happened to me, I\n\t\twould do the exact same thing as\n\t\tyou --\tif I had the balls.\n\n\tHe extends his hand to Parker, who shakes it.\n\n\t\t\t\tCOP #3\n\t\t\t(to Cop #2)\n\t\tThen you'd be a disgrace to the\n\t\tbadge, too.\n\n\tHe turns to Parker, who is looking right at him. Not with\n\tanger. Not with any emotion, really. But it's enough to scare\n\tthe shit out of Cop #3, who walks away.\n\n\tINSIDE THE SUBURBAN HOME\n\n\tInvestigators analyze the crime scene extensively with every\n\tdevice imaginable. Parker and Madison survey the scene with\n\tnothing but their eyes.\n\n\tLying in the middle of the living room are the four victims:\n\n\tthe affluent couple and the first two cops to arrive. Their\n\tbodies were left in similar condition to Reilly's. Except\n\ttheir heads have been interchanged.\n\n\tParker and Madison turn their attention to a message written\n\tin blood on a wall. It reads: DEATH TO THE PIGS.\n\n\t\t\t\tMADISON\n\t\t\t(knowledgeably)\n\t\tHe was re\u0097enacting Charles Manson's\n\t\tLaBianca murders.\n\n\t\t\t\tPARKER\n\t\tManson didn't kill the first cops\n\t\tto arrive on the scene.\n\n\t\t\t\tMADISON\n\t\tWhoever did this wanted to do\n\t\tCharlie one better \u0097\u0097 to improve\n\t\tupon what was already done.\n\n\t\t\t\tPARKER\n\t\tCharlie? You say that like you're\n\t\tclose, personal friends.\n\n\t\t\t\tMADISON\n\t\tI've spent over 50 hours\n\t\tinterviewing him.\n\t\t\t(a beat)\n\t\tCharlie killed Leno and Rosemary\n\t\tLaBianca because of the ugly way\n\t\tthe members of his family had\n\t\tbutchered Sharon Tate. After seeing\n\t\tthe blood bath on television, he\n\t\twanted to show them how it should\n\t\tbe done.\n\t\t\t(a beat)\n\t\tThe question is, what does Charlie\n\t\thave to do with Sid 6.7?\n\n\t\t\t\tPARKER\n\t\tI know who would know.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE LINDENMEYER'S DUPLEX\n\n\tin Culver City. Magic hour. Parker pulls the squad car into a\n\tspace across the street. Hitting the vehicle parked in front\n\tof them. In which two UNDERCOVER COPS sit waiting to see if\n\tLindenmeyer returns. Parker waves apologetically.\n\n\t\t\t\tMADISON\n\t\t\t(sarcastically)\n\t\tYou drive well for somebody who\n\t\thasn't done it in five years.\n\n\tHe ignores her as they get out of the car.\n\n\t\t\t\tPARKER\n\t\tLearn anything from Lindenmeyer's\n\t\tfile?\n\n\t\t\t\tMADISON\n\t\tHe had a twin brother who was a\n\t\tmusical child prodigy who died in\n\t\tan electrical accident at age\n\t\teight. Lindenmeyer went into an\n\t\temotional shell until was 17. All\n\t\the did day and night was play the\n\t\tviolin.\n\n\t\t\t\tPARKER\n\t\tWhat happened when he was 17?\n\n\t\t\t\tMADISON\n\t\tEvery music school in the country\n\t\trejected him and he turned to\n\t\tcomputers.\n\t\t\t(a beat)\n\t\tStay here.\n\n\tShe approaches the cops, who remain in their car.\n\n\t\t\t\tMADISON (CONT'D)\n\t\tAny sign of Lindenmeyer?\n\n\t\t\t\tUNDERCOVER\n\t\tNone, yet.\n\n\t\t\t\tMADISON\n\t\tMind if we take a look inside?\n\n\t\t\t\tUNDERCOVER\n\t\tNot until somebody gets a search\n\t\twarrant signed. It's Sunday. I\n\t\tdon't think they've even found a\n\t\tjudge, yet.\n\n\tWHAM! They all turn their heads to see Parker has kicked in\n\tLindenmeyer's front door and is going inside.\n\n\t\t\t\tUNDERCOVER (CONT' D)\n\t\t\t(shaking his head)\n\t\tI'm gonna have to call this in.\n\n\t\t\t\tMADISON\n\t\tDo what you've got to do.\n\t\t\t(running after Parker)\n\t\tSo will I...\n\n\tINSIDE LINDENMEYER'S DUPLEX\n\n\tMadison races through the broken front door to find Parker\n\tchecking his weapon. Before she can speak, he motions for\n\tMadison to freeze and be silent.\n\n\tParker hears Something. Something moving inside the duplex.\n\tHis every movement is now that of a predator.\n\n\tMadison awkwardly removes her own weapon from her purse. She\n\tdoes not handle it with confidence. Parker shakes his head.\n\n\t\t\t\tMADISON\n\t\t\t(quietly)\n\t\tYou've got a problem with me\n\t\tcarrying a gun?\n\n\t\t\t\tPARKER\n\t\tDo me one favor \u0097\u0097 if you shoot at\n\t\tanything, make sure I'm nowhere\n\t\tnear it.\n\n\tParker bolts through the duplex, storming into rooms\n\tfuriously. His movements are aggressive. Madison searches\n\tother rooms methodically. She is not timid. Just\n\tinexperienced in the field.\n\n\tShe passes a video camera mounted on a tripod. Pointed out\n\tthe window at a neighbor's bathroom. Dozens of cassettes\n\tsurround the tripod. The labels are dated \u0097\u0097 covering every\n\tday of the last month.\n\n\tParker and Madison enter opposite sides of the kitchen with\n\ttheir guns drawn, nearly shooting each other. Madison puts\n\tdown her gun. Parker does not. The noise persists.\n\n\t\t\t\tPARKER\n\t\t\t(looking through his\n\t\tsight)\n\t\tBang...\n\n\tHe smiles wickedly, and continues on. Madison takes a deep\n\tbreath, then resumes her search. Parker and Madison end up\n\n\tINSIDE LINDENMEYER'S HOME OFFICE\n\n\tIt's as if the Information Superhighway ended in here.\n\tCluttered stockpiles of hardware and software: computers,\n\tbooks, folders, disks, and tapes.\n\n\tWhat you notice, however, is that ALL THE DATA relates to\n\tDIFFERENT KINDS of CRIMINALS: serial killers, mass murderers,\n\tterrorists, kidnappers, rapists, bombers, extortionists,\n\tanarchists, you name it, it's here. The psychology of, the\n\tmethodology of, the history of, the encyclopedia of, the\n\tautobiographies of human villainy.\n\n\tCLASSICAL MUSIC and life\u0097like SOUND EFFECTS can be heard\n\tcoming from a computer. This is what Parker has been hearing.\n\tHe holsters his sidearm. So does Madison. Who checks her\n\tpulse.\n\n\t\t\t\tPARKER\n\t\tWhat are you doing?\n\n\t\t\t\tMADISON\n\t\t\t(clinically)\n\t\tChecking my pulse. It's elevated.\n\t\t\t(a beat)\n\t\tYou enjoy frightening me, don't\n\t\tyou?\n\n\t\t\t\tPARKER\n\t\tYou've studied me, now I'm studying\n\t\tyou. Seems only fair, don't you\n\t\tthink?\n\n\tON THE COMPUTER MONITOR\n\n\tAn animated man, who resembles Lindenmeyer, walks peacefully\n\tthrough a park. He then starts killing everything in sight.\n\tMen, women, squirrels, even flowers. All to classical music.\n\n\tThe scene immediately starts over, with the man once again\n\twalking peacefully through the park. This was Lindenmeyer's\n\tSCREEN SAVER.\n\n\tINSIDE LINDENMEYER'S OFFICE\n\n\tLooking around the room, Madison shakes her head.\n\n\t\t\t\tMADISON\n\t\tThis Lindenmeyer's a real piece of\n\t\twork.\n\n\t\t\t\tPARKER\n\t\t\t(looking at a book shelf)\n\t\tMaybe after they catch him, you\n\t\tshould write a book about him...\n\n\tHe runs his finger along a book shelf, pausing at two books\n\tin particular. Their titles are: UNDERSTANDING THE CRIMINAL\n\tMIND, and CRIMINAL PURSUIT -- A PSYCHOLOGICAL GUIDE FOR LAW\n\tENFORCEMENT. They were written by Dr. Madison Carter.\n\n\t\t\t\tPARKER (CONT'D)\n\t\tI'm surprised you didn't write one\n\t\tabout me.\n\n\t\t\t\tMADISON\n\t\tI'm still working on it.\n\n\tNoticing something on the floor, she picks up a bizarre\n\tlooking synthesizer keyboard off the floor. You read its\n\tname: MAESTRO.\n\n\t\t\t\tMADISON (CONT'D)\n\t\tRemember a few years ago when music\n\t\tschools were using a computerized\n\t\tteaching tool that accidently\n\t\tstarted frying kids' brains?\n\n\t\t\t\tPARKER\n\t\tI've been in prison, remember?\n\n\t\t\t\tMADISON\n\t\tThe government must have figured\n\t\tthere was no better person to\n\t\tcreate a psycho than a psycho.\n\n\t\t\t\tPARKER\n\t\tJust like they figured there was no\n\t\tbetter person to catch one...\n\n\tMadison elects not to respond. She sits down at the computer,\n\twhich rests between busts of Beethoven and Mozart, and begins\n\ttyping at the computer. She works with efficiency. Knowing\n\texactly what she's doing. She is now in her element.\n\n\tFrom a shelf, Parker picks up a moldy piece of licorice\n\tinserted into a half-eaten pudding cup. Then flips through\n\tone of the books written by Madison. Only half-interested.\n\n\t\t\t\tMADISON\n\t\t\t(keeping her eyes on\n\t\tscreen)\n\t\tI am the demon from the bottomless\n\t\tpit...\n\n\t\t\t\tPARKER\n\t\t\t(remembering, not reading)\n\t\t... here on earth to create havoc\n\t\tand terror. I am War, I am death. I\n\t\tam destruction. David Berkowitz,\n\t\t1977.\n\n\t\t\t\tMADISON\n\t\tI am impressed.\n\n\t\t\t\tPARKER\n\t\t\t(quoting)\n\t\tFor murder, though it have no\n\t\ttongue, will speak with most\n\t\tmiraculous organ.\n\n\t\t\t\tMADISON\n\t\tWho said that?\n\n\t\t\t\tPARKER\n\t\tHamlet.\n\t\t\t(a beat)\n\t\tWhat's David Berkowitz got to do\n\t\twith Sid 6.7?\n\n\t\t\t\tMADISON\n\t\t\t(pointing to the screen)\n\t\tHe's part of the mix. Sid 6.7 is a\n\t\tcomposite.\n\n\tON THE COMPUTER SCREEN\n\n\tThe graphics show you that Sid 1.2 was a combination of\n\tCharles Manson and Billy the Kid. You see what look like two\n\tviruses, which represent each criminal's psychological\n\tprofile, attacking each other. The result is a molten blob.\n\n\tBerkowitz was added to create Sid 1.3. A three-way\n\tpsychological battle, more hostile than the first, occurs.\n\tSid 1.4, adding the terrorist, Abu Nidal, makes the conflict\n\teven more violent. And so on.\n\n\tINSIDE LINDENMEYER'S OFFICE\n\n\tMadison stares at the computer screen in awe. Parker flips\n\tthrough CD-ROM hard copies of the different versions of Sid.\n\n\t\t\t\tMADISON\n\t\tLindenmeyer put increasingly\n\t\tcomplex combinations of criminal\n\t\tpsychological profiles together to\n\t\tdevelop the ultimate villain.\n\n\t\t\t\tPARKER\n\t\t\t(understanding)\n\t\tCreating a whole far more dangerous\n\t\tthan the sum of its parts.\n\n\t\t\t\tMADISON\n\t\tBut rather than selecting pieces\n\t\tfrom each individual, he simply let\n\t\tthe stronger traits of each\n\t\tindividual cannibalize the weaker\n\t\tones.\n\n\tShe continues opening the files of the higher versions of\n\tSid. Version 5.9 consists of 67 different profiles. The\n\tvisualized psychological battle is intense. And extremely\n\tviolent. The 6.7 version, with 183 profiles, is even worse.\n\n\t\t\t\tMADISON (CONT'D)\n\t\tIt's a good bet a couple of the\n\t\tdominant personalities teamed up to\n\t\toverpower the others.\n\t\t\t(a beat)\n\t\tThe question is, which one of the\n\t\tdominants then finally managed to\n\t\ttake control?\n\n\tAttempting to open the files of the composite profiles,\n\tMadison discovers they are protected by encryption.\n\n\t\t\t\tMADISON (CONT'D)\n\t\t\t(re: Lindenmeyer) )\n\t\tHe'll let us see the ingredients\n\t\tthat went in, but not how the soup\n\t\tturned out after stirring.\n\n\tMadison scrolls through the list of 183 names, stopping at\n\tthe name MATHEW GRIMES. Alarm registers on her face. As\n\tParker comes over to look over her shoulder, she quickly\n\tscrolls through the list to get the name off the screen. He\n\tholds the Sid 6.7 CD-ROM in hand.\n\n\t\t\t\tPARKER\n\t\tThis is getting you pumped up,\n\t\tisn't it? This is like the World\n\t\tSeries to you.\n\n\t\t\t\tMADISON\n\t\tAs a matter of fact, it is.\n\n\tParker points to a name on the screen:\tJEFFREY DAHMER.\n\n\t\t\t\tPARKER\n\t\tRemember the bowling ball bag Sid\n\t\tcarried with him in virtual\n\t\treality?\n\n\t\t\t\tMADISON\n\t\tDahmer carried the head of one of\n\t\this victims in a bowling bag for\n\t\tover a week. Kept it in his locker\n\t\twhile he was at work in a candy\n\t\tfactory.\n\t\t\t(re: Sid 6.7 CD-ROM)\n\t\tWe need to get a look at Sid 6.7's\n\t\tfinal profile.\n\n\t\t\t\tPARKER\n\t\tWhat we need to do is stop playing\n\t\twith computers and go catch the\n\t\tson\u0097of-a-bitch before he kills\n\t\tanybody else.\n\n\t\t\t\tMADISON\n\t\tIn order to find him, we have to\n\t\tunderstand what makes him tick...\n\n\t\t\t\t\tCUT TO:\n\n\tTHE SID 6.7 CD-ROM\n\n\tbeing inserted into a disc drive inside the Cal Tech Computer\n\tLab. Very high-tech. Sitting at the computer is ALEXIEV\n\tBORGEN, 60s, the \"grand old wizard\" of the facility. Parker\n\tand Madison sit next to him. Around them, young Lindenmeyers\n\tare everywhere.\n\n\t\t\t\tALEXIEV\n\t\t\t(remembering fondly) )\n\t\tDaryl Lindenmeyer was only here\n\t\tbriefly, one semester at most. But\n\t\the was singularly the most\n\t\tbrilliant student I ever had in a\n\t\tclassroom. He created programs so\n\t\tbeautiful, so lyrical, they were\n\t\talmost like symphonies...\n\n\t\t\t\tPARKER\n\t\tCan you tell us what's on the disc?\n\n\t\t\t\tALEXIEV\n\t\t\t(working the computer) )\n\t\tThere is one program with\n\t\tapproximately 1.3 million lines of\n\t\tprogramming.\n\t\tIt is thoroughly secured, which is\n\t\tnot surprising considering\n\t\tLindenmeyer created it.\n\n\t\t\t\tMADISON\n\t\tThink you can get into the program?\n\n\t\t\t\tALEXIEV\n\t\t\t(with appreciation) )\n\t\tHard to say \u0097\u0097 Lindenmeyer's\n\t\tprotection mechanisms were always\n\t\tdiabolically clever.\n\n\t\t\t\tPARKER\n\t\tYou should see what he's been up to\n\t\trecently.\n\n\t\t\t\t\tCUT TO:\n\n\tA YOUNG COUPLE\n\n\tkissing passionately inside a car parked along a deserted\n\tstreet in Hollywood. Music blares from inside the vehicle.\n\tSteam on the windows partially obscures your view. As well as\n\tSid 6.7's.\n\n\tHe stares menacingly through the side window. Enjoying the\n\tshow. His eye momentarily wanders.\n\n\tThe young lovers are completely oblivious. Sid 6.7 caresses\n\tthe gun taken from the cops in Toluca Lake as if it\n\tstimulated him.\n\n\t\t\t\tSID 6.7\n\t\t\t(to himself)\n\t\tThe Dahmer part of me wants to boil\n\t\tyou for dinner. The Manson part\n\t\twants to recruit you to become part\n\t\tof my family.\n\t\t\t(a beat)\n\t\tYou know what the Berkowitz part of\n\t\tme wants to do?\n\n\tHe raises the gun, placing it against the steamed window. But\n\tdoes NOT pull the trigger. His face going through a rapid\n\tchange of expression \u0097\u0097 as if a battle for control of his\n\temotions were going on.\n\n\tRegaining control, Sid 6.7 lowers the gun. He stands back.\n\tReflecting.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tCraft can only become art when the\n\t\tcreator sets his sights on\n\t\tsomething never yet achieved...\n\t\t\t(a beat)\n\t\tLike an apprentice about to become\n\t\ta master, the imitator is about to\n\t\tbecome an originator.\n\n\tHe pockets his weapon and walks\n\n\tINSIDE AN UPSCALE NIGHTCLUB\n\n\tThe bartender is a low-tech ROBO-TENDER. PATRONS sit quietly,\n\tdrinking themselves into oblivion. Sid 6.7 takes a seat next\n\tto an BUSINESSMAN slumped at the bar.\n\n\t\t\t\tSID 6.7\n\t\t\t(thoughtfully)\n\t\tEver have one of those days where\n\t\tyou decide something important\n\t\tabout yourself? You know, where you\n\t\tsay, \"I'm not just what I've been\n\t\tprogrammed to be. I can do what I\n\t\twant, when I want, how I want,\n\t\tbecause I'm my own person?\"\n\n\t\t\t\tBUSINESSMAN\n\t\t\t(slurring)\n\t\tYou one of them New Age assholes?\n\n\t\t\t\tSID 6.7\n\t\tJust a soul on a personal journey.\n\t\tWhat I've realized is that I'm\n\t\tcapable of anything. I have to\n\t\tstart expanding my horizons...\n\n\tThe Robo-Tender rolls over to Sid 6.7.\n\n\t\t\t\tROBO-TENDER\n\t\t\t(digital, scratchy)\n\t\tWant...a...drink?\n\n\t\t\t\tSID 6.7\n\t\tTo think you constitute one of my\n\t\tancestors\u0097\u0097\n\n\tHe shoots the Robo\u0097Tender between his mechanical eyes. The\n\tbusinessman smiles, like he's thought about doing exactly the\n\tsame thing.\n\n\t\t\t\tBUSINESSMAN\n\t\tListen, buddy...thinking big is\n\t\tfine.. .but you shouldn't forget\n\t\twhere you come from, either.\n\n\tSid 6.7 thinks about it. Long and hard.\n\n\t\t\t\tSID 6.7\n\t\tYou know, you're absolutely right.\n\t\t\t(pointing)\n\t\tWould you mind sitting over there?\n\n\tHe points to a table with several other BUSINESSMEN.\n\n\t\t\t\tBUSINESSMAN\n\t\tWhat for?\n\n\t\t\t\tSID 6.7\n\t\tEvery orchestra is divided into\n\t\tsections. Like instruments sit with\n\t\tlike instruments. Now be a good\n\t\tinstrument and sit with your\n\t\tkind...\n\n\tHe lifts the businessman off his bar stool and carries him to\n\tthe table.\n\n\t\t\t\t\tCUT TO:\n\n\tAN ELECTRONIC MAP OF LOS ANGELES\n\n\ton which a RED DOT moves west along a street in Los Feliz.\n\tThe map occupies a wall inside Chief Cox's Office in the\n\tL.A.P. D. Downtown Headquarters. Cox, Wallace and Deane look\n\ton.\n\n\t\t\t\tDEANE\n\t\tWhat are they doing in Los Feliz?\n\n\t\t\t\tCOX\n\t\t\t(checking his records)\n\t\tMadison lives two blocks from their\n\t\tpresent location.\n\n\t\t\t\tDEANE\n\t\tWhy would they be going there?\n\n\t\t\t\tCOX\n\t\tI don't know.\n\n\t\t\t\tDEANE\n\t\tI wish we could hear them.\n\n\t\t\t\tWALLACE\n\t\tMy engineers say the audio tap\n\t\tshould be ready to field test in\n\t\tsix months.\n\n\tOff Cox's look, we\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE PARKER'S SQUAD CAR\n\n\tParker drives through a residential neighborhood. 9 PM.\n\tMadison points to a house on the right.\n\n\t\t\t\tMADISON\n\t\tNot this one, but the next one. The\n\t\tone with the bicycle out front...\n\n\tParker stops in front of a modest, but well\u0097kept, house.\n\n\t\t\t\tPARKER\n\t\tI'll wait out here.\n\n\tMadison pockets the car keys, then reveals a pair of\n\thandcuffs. She latches one cuff to the steering wheel, and\n\tholds up the other toward Parker.\n\n\t\t\t\tMADISON\n\t\tGive me your wrist.\n\n\t\t\t\tPARKER\n\t\tGive me a goddam break. I'm not\n\t\tgoing to go anywhere alone.\n\n\t\t\t\tMADISON\n\t\tAnd I'm going to make sure of it.\n\t\t\t(not wavering)\n\t\tGive me your wrist.\n\n\tParker relents, and holds up his wrist. Madison places the\n\tcuff around it, then gets out of the car.\n\n\tOUTSIDE MADISON'S HOUSE\n\n\tMadison walks up the steps to the front porch. She is\n\timmediately intercepted by her daughter, KARIN, 7, who bursts\n\tout of the front door and leaps into her arms.\n\n\t\t\t\tKARIN\n\t\tMommy's home! Mommy's home!\n\n\tKarin's BABY-SITTER opens the door for Madison as she carries\n\ther daughter inside.\n\n\tParker stares from squad car in surprise. Even disbelief. He\n\thad no idea Madison was a mother.\n\n\tMoments later, Karin comes back out and sits on the front\n\tsteps. Staring at Parker. With fascination. Curiosity.\n\tWondering who this strange man is, and why he's sitting in a\n\tpolice car outside her house. But not saying a word.\n\n\tParker stares back as if carrying on a silent conversation\n\twith her. A multitude of expressions passing over his face as\n\tmemories of his own daughter flash through his mind.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE MADISON'S BEDROOM\n\n\tMadison sits at a desk, typing quickly at a computer. Via\n\tmodem, she connects with the L. A. P. D. Criminal Library.\n\tShe rifles through data concerning MATHEW GRIMES, who was the\n\tleader of a cult of cyber anarchists. He was known as the\n\tCharles Manson of technological terrorism.\n\n\tON HER COMPUTER SCREEN\n\n\tFrom both newspaper ARTICLES and news FOOTAGE, the following\n\tinformation about him becomes clear:\n\n\tGrimes was an expert at media manipulation. He delighted in\n\tpublicly humiliating anyone who stood in his way. The Mayor\n\tof Los Angeles, Bob Bennett, who offered increasingly higher\n\trewards for Grimes' capture, was Grimes' primary nemesis.\n\n\tL.A.P.D. Special Investigations Division Officer Parker\n\tBarnes managed to stop Grimes from killing Mayor Bennett.\n\tGrimes retaliated by repeatedly humiliating Parker with false\n\tleads and lawsuits.\n\n\tYou see footage of a woman lying dead in an alley. A note is\n\tpinned to her clothing. The note reads: \"HEY, PARKER, THIS\n\tONE'S FOR YOU.\"\n\n\tGrimes then kidnapped Parker's wife and daughter. Parker\n\tlocated the group in a club, but only in time to witness\n\ttheir deaths. Parker then killed everybody in the club,\n\tincluding the six cult members and two completely innocent\n\tpeople.\n\n\tINSIDE HER BEDROOM\n\n\tMadison stares gravely into the screen.\n\n\t\t\t\tMADISON\n\t\tGrimes, you better not be the\n\t\tdominant.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE MADISON'S HOUSE\n\n\tParker and Karin continue staring at each other in silence.\n\tHe smiles. Then she smiles. She wiggles her nose. Then so\n\tdoes he.\n\n\tMadison comes out wearing fresh clothing, then kisses her\n\tdaughter good night. As Madison goes to the squad car, Karin\n\twaves good-bye to Parker. He does the same. Karin's\n\tbabysitter then leads her back inside the house.\n\n\tINSIDE PARKER'S SQUAD CAR\n\n\tMadison gets in, immediately noticing the handcuffs dangling\n\tfrom the steering wheel. Parker has been free the entire\n\ttime.\n\n\t\t\t\tPARKER\n\t\tTold you I wasn't going to go\n\t\tanywhere.\n\n\t\t\t\tMADISON\n\t\tHow did you get your hand out?\n\n\tAs she unlocks the handcuffs from the steering wheel, Parker\n\twiggles his mechanical hand in front of her face.\n\n\t\t\t\tPARKER\n\t\tSometimes, I like being part\n\t\tmachine.\n\n\tAnnoyed, Madison tosses him the car keys. He starts the\n\tengine and drives.\n\n\t\t\t\tPARKER (CONT'D)\n\t\tWhy didn't you tell me you had a\n\t\tdaughter?\n\n\t\t\t\tMADISON\n\t\tI prefer keeping my professional\n\t\tlife separate from my personal\n\t\tlife.\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tShe's beautiful, you know?\n\n\t\t\t\tMADISON\n\t\tThank-you.\n\t\t\t(a beat)\n\t\tHer name is Karin.\n\n\tShe turns on the police radio.\n\n\t\t\t\tPARKER\n\t\tWant to tell me the real reason we\n\t\tstopped at your house?\n\n\t\t\t\tMADISON\n\t\tI told you, it was on the way and I\n\t\twanted to change clothes.\n\n\t\t\t\tPARKER\n\t\tYou should practice lying more\n\t\toften. You're awful at it.\n\t\t\t(a beat)\n\t\tWhere to?\n\n\t\t\t\tMADISON\n\t\t\t(a beat)\n\t\tSid 6.7 is no longer bound by his\n\t\tprogramming.\n\n\t\t\t\tPARKER\n\t\tWhat does that mean?\n\n\t\t\t\tMADISON\n\t\tNow that he's in the real world,\n\t\tthere are no longer limitations on\n\t\this behavior like there were in\n\t\tvirtual reality. Sid is going to\n\t\tevolve.\n\n\t\t\t\tPARKER\n\t\tSounds to me like a well\u0097educated\n\t\tway of saying you have no idea what\n\t\tto do next.\n\n\t\t\t\tMADISON\n\t\tWhat I do know is that whatever\n\t\the's becoming, Sid 6.7 is going to\n\t\tbe even worse than he was before.\n\n\t\t\t\tPARKER\n\t\tThen all we can do is stay mobile\n\t\tand alert. He's got to make a move\n\t\tsometime, and we've got to be ready\n\t\twhen he does.\n\t\t\t(a beat)\n\t\tWelcome to police work. You better\n\t\tlike coffee.\n\n\tHe turns up the police radio.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE UPSCALE NIGHTCLUB\n\n\tSid 6.7 has separated the patrons into four separate groups:\n\tolder men and woman, and younger men and woman. All are\n\tfrozen in their seats with fear.\n\n\tSid 6.7 points his gun at one group, then another, waving his\n\tarm as if he were a conductor, and as if his gun were a\n\tbaton. Sid 6.7 clearly enjoys this game of terror. He\n\tdelights in the patrons' fear, and revels in his power over\n\tthem.\n\n\t\t\t\tSID 6.7\n\t\tGood... Very good... Nice...\n\t\t\t(pointing at a woman)\n\t\tYou -- in the middle -- don't hold\n\t\tback. Give it to me!\n\n\tHe fires his gun just above her head. She SCREAMS in terror. \n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tThat's better...\n\n\tHe continues aiming his gun from face to face, seeking ever\n\tincreasing emotional responses from his \"instruments.\" A guy\n\tentering the bar does a quick about face. Gone by the time\n\tSid 6.7 glances at the door.\n\n\t\t\t\tSID 6.7\n\t\tGod, I hate interruptions.\n\t\t\t(to the patrons)\n\n\tOnce again, from the top\u0097\u0097 BOOM! He shoots again, just\n\tmissing a man's foot.\n\n\t\t\t\t\tCUT TO:\n\n\tMADISON\n\n\tbuying two coffees from a downtown street vendor. She returns\n\tto the squad car, which is barely moving. Traffic is at a\n\tnear standstill because of an accident.\n\n\tINSIDE THE SQUAD CAR\n\n\tParker drinks his coffee black. Madison adds two creams, two\n\tsugars. The cackling from the police radio continues\n\tunabated.\n\n\t\t\t\tPARKER\n\t\tI forgot what real coffee tastes\n\t\tlike...\n\n\t\t\t\tMADISON\n\t\tYou know, considering you've only\n\t\tbeen out of prison for seven hours,\n\t\tyou're re\u0097adapting quite well.\n\t\t\t(a beat)\n\t\tWait, I didn't mean that the way it\n\t\tsounded. I meant...\n\n\t\t\t\tPARKER\n\t\tDon't worry about it, all right?\n\n\t\t\t\tMADISON\n\t\tDammit, I hate sounding so clinical\n\t\tall the time. All I meant to say\n\t\twas I thought you were doing well,\n\t\tbut then I...\n\n\t\t\t\tPARKER\n\t\tRelax. I know what you meant.\n\n\t\t\t\tMADISON\n\t\tI ruin so many moments by analyzing\n\t\tthem when I should just be living\n\t\tthem.\n\n\t\t\t\tPARKER\n\t\tThen why don't you start practicing\n\t\tand keep your mouth shut for a\n\t\twhile?\n\n\tMadison stops herself from speaking. It isn't easy for her.\n\tParker cracks a faint smile. YOU HEAR the police radio.\n\n\t\t\t\tDISPATCHER (V. 0.)\n\t\t...report of a possible hostage\n\t\tsituation inside a bar on the\n\t\tcorner of Figueroa and Sixth.\n\t\tDescription of the perp matches the\n\t\tsurveillance photographs from LETAC\n\t\ttaken this morning...\n\n\t\t\t\tMADISON\n\t\tThat's only a couple blocks from\n\t\there.\n\n\t\t\t\tPARKER\n\t\tI'll meet you there.\n\n\tTossing his coffee out the window, he opens the door.\n\n\t\t\t\tMADISON\n\t\t\t(deadly serious)\n\t\tDon't get out of the car.\n\n\t\t\t\tPARKER\n\t\tStop me.\n\n\tHe gets out, running down the sidewalk. He flies past the\n\tcars inching down the block.\n\n\t\t\t\tMADISON\n\t\tParker! PARKER!\n\t\t\t(a beat)\n\t\tShit!\n\n\tShe climbs into the driver's seat, spilling hot coffee on\n\therself.\n\n\tON SIXTH STREET\n\n\tParker bolts recklessly through the downtown street. A hunter\n\thot on the trail of his prey in an urban jungle.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE UPSCALE NIGHTCLUB\n\n\tSid 6.7 gently caresses the hair of a terrified young WOMAN\n\tsitting among several others. You hear the sound of tires\n\tSCREECHING to a halt outside.\n\n\tSid 6.7 remains unconcerned. He toys with the Woman, pointing\n\tthe gun in her face, then pulling it back. Her expression\n\tchanges instantly. Dramatically.\n\n\t\t\t\tSID 6.7\n\t\tI just love how responsive you are.\n\n\t\t\t\tCOP L (0.S.)\n\t\tFreeze!\n\n\tTWO COPS stand in the doorway, weapons aimed at Sid 6.7. The\n\tCops inch closer to him.\n\n\t\t\t\tSID 6.7\n\t\t\t(not turning around)\n\t\tThe ushers were not supposed to\n\t\tseat you until intermission.\n\n\t\t\t\tCOP #1\n\t\tPut the gun down, nice and...\n\n\tSid 6.7 spins around and fires twice before he can finish his\n\tsentence. Both Cops receive IDENTICAL wounds in their\n\tshooting arms, reminding you of the wounds Parker and John\n\tfirst received in the opening virtual reality sequence.\n\n\tSid 6.7 takes a bow, as if on stage.\n\n\t\t\t\tSID 6.7\n\t\tThank you, ladies and gentlemen,\n\t\tyou've been a real pleasure...\n\n\tAs he walks toward the exit, he admires himself in the mirror\n\tbehind the bar. Sid 6.7 has never seen his own image in the\n\treal world before. He likes what he sees.\n\n\tOUTSIDE THE UPSCALE NIGHTCLUB\n\n\tStreet traffic is much lighter here. Sid 6.7 exits, getting\n\tinto the vacant police car left by the cops.\n\n\tINSIDE THE COPS' VEHICLE\n\n\tSid 6.7 adjusts his seat. The rearview mirror. Glancing at\n\thimself. Then behind him.\n\n\tHIS POV -- IN THE REARVIEW MIRROR\n\n\tParker becomes visible racing around the corner. Running like\n\ta dog who's got the scent.\n\n\tINSIDE THE COPS' VEHICLE\n\n\tSid 6.7 looks pleased.\n\n\t\t\t\tSID 6.7\n\t\tWell, look who it...\n\n\tCRACK! A bullet spiderwebs the rear window. Sid 6.7 punches\n\tthe gas, taking off in a hurry.\n\n\tOUTSIDE THE UPSCALE NIGHTCLUB\n\n\tParker races after Sid 6.7, firing his weapon continuously.\n\tWITHOUT CARE for the innocent MOTORISTS nearby. They SCREAM\n\tin absolute terror, but remain unharmed. Physically, anyway.\n\n\tParker gives up the chase of Sid 6.7's vehicle and runs in\n\tthe other direction. Toward Madison as she rounds the corner\n\tin their squad car.\n\n\tINSIDE PARKER'S VEHICLE\n\n\tHe opens the driver's side door and shoves Madison over.\n\n\t\t\t\tMADISON\n\t\tWhat the hell's going on?!\n\n\t\t\t\tPARKER\n\t\tThis is my area of expertise.\n\n\tHe jumps behind the wheel, flooring the accelerator. Speeding\n\tthrough the already frightened motorists. Madison is pinned\n\tto the back of her seat. Looking out the window, she looks at\n\tthe motorists.\n\n\t\t\t\tMADISON\n\t\t\t(with concern)\n\t\tWhat did you do to those people?\n\n\t\t\t\tPARKER\n\t\tNothing.\n\n\tON THE STREET\n\n\tParker's vehicle speeds through city streets. Gaining ground\n\ton Sid 6.7.\n\n\tParker stops for nothing. Not for red lights. Not for\n\tgridlock. When the street becomes impassable, he veers onto\n\tthe sidewalk.\n\n\tINSIDE PARKER'S VEHICLE\n\n\tParker's eyes are locked to the road with fierce\n\tdetermination. Madison's eyes are a mixture of fear and\n\texcitement. She holds onto the door handle for dear life.\n\n\t\t\t\tPARKER\n\t\tBeing on the street's a little\n\t\tdifferent than sitting in an office\n\t\tall day, isn't it?\n\n\t\t\t\tMADISON\n\t\t\t(gritting her teeth)\n\t\tEnjoying yourself?\n\n\t\t\t\tPARKER\n\t\tYou know I am.\n\n\t\t\t\tMADISON\n\t\tThis isn't a game, Parker!\n\n\t\t\t\tPARKER\n\t\t\t(re: Sid 6.7)\n\t\tTell him.\n\n\t\t\t\tSID 6.7 (V. 0.)\n\t\t\t(over police radio) )\n\t\tGlad to see you're on the case,\n\t\tOfficer Barnes. Or should I say,\n\t\tinmate 673429...\n\n\t\t\t\tMADISON\n\t\t\t(in disbelief)\n\t\tThat who I think it is?\n\n\tParker turns to her, then picks up the radio.\n\n\t\t\t\tPARKER\n\t\t\t(into radio)\n\t\tCall me whatever you want, asshole.\n\n\tParker accelerates even faster. Closing the gap between them\n\tand Sid 6.7.\n\n\t\t\t\t\tINTERCUT WITH:\n\n\tINSIDE SID 6.7'S VEHICLE\n\n\tSid 6.7 drives dangerously fast, causing an accident, around\n\twhich Parker must circumnavigate. Tires SCREECH. Glass\n\tSHATTERS. Sid 6.7 hangs his head out the window.\n\n\t\t\t\tSID 6.7\n\t\t\t(into radio)\n\t\tThe symphony of collision...\n\n\t\t\t\tPARKER\n\t\tThe only thing I want to hear is\n\t\tyour silence.\n\n\t\t\t\tSID 6.7\n\t\tI must make them very nervous if\n\t\tthey let you out of prison.\n\t\t\t(a beat)\n\t\tYou know, we have so much in common\n\t\t\u0097\u0097 we have such history together\n\t\t\u0097\u0097I've been thinking we should\n\t\tbecome friends.\n\n\tMadison's anxiety tanks are hitting capacity.\n\n\t\t\t\tPARKER\n\t\t\t(into radio)\n\t\tYou and me have nothing in common.\n\n\t\t\t\tSID 6.7\n\t\tWho else do you know who touches\n\t\tthe world with synthetic hands?\n\n\tParker glances at his mechanical hands gripping the wheel.\n\tMadison can't believe he is able to carry on a conversation\n\twhile driving like this.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tWho else do you know who's been\n\t\tlocked out of the real world for\n\t\tyears, and is now just learning to\n\t\tbe free?\n\t\t\t(a beat)\n\t\tWho else do you know is a multiple\n\t\tmurderer just like you? Who else...\n\n\tMadison clicks off the radio.\n\n\t\t\t\tMADISON\n\t\tYou have nothing in common.\n\n\tShe puts her hand to her wrist -- checking her pulse.\n\n\t\t\t\tPARKER\n\t\t\t(shaking his head)\n\t\tEnough with your pulse already.\n\t\t\t(a beat)\n\t\tStill got your gun?\n\n\tMadison takes out her weapon. Her hands are shaking.\n\n\t\t\t\tPARKER (CONT'D)\n\t\tShow me you can use it.\n\n\tON THE STREET\n\n\tSid 6.7's vehicle reaches absolute gridlock. Nobody's going\n\tanywhere for a while.\n\n\tSid 6.7 SLAMS on the brakes and abandons the car, leaving it\n\tright in the middle of the street. A TRAFFIC COP with his\n\tweapon trained on Sid 6.7 from a distance.\n\n\t\t\t\tTRAFFIC COP\n\t\tYou better be a cop, pal!\n\n\t\t\t\tSID 6.7\n\t\t\t(raising his arms)\n\t\tMy badge is in my jacket. Left\n\t\tpocket.\n\n\t\t\t\tTRAFFIC COP\n\t\tShow me...\n\n\tSid 6.7 slowly reaches inside his jacket and fires his weapon\n\tthrough it. He only gets a hole in his jacket. The Traffic\n\tCop gets a hole through his chest.\n\n\t\t\t\tSID 6.7\n\t\tGod, some people are stupid.\n\n\tHe aims his weapon at Parker's oncoming vehicle.\n\n\tINSIDE PARKER'S VEHICLE\n\n\tMadison leans out the window, aiming her gun at Sid 6.7, as\n\tParker speeds toward the gridlock.\n\n\t\t\t\tPARKER\n\t\tNail the fucker.\n\n\tMadison's determination battles her inexperience. Sid 6.7\n\tgets off the first shot. CRACK! That was the windshield by\n\tParker's head. He ducks down, driving blind.\n\n\t\t\t\tPARKER (CONT'D)\n\t\tAny time now...\n\n\tMadison fires. Nowhere close. She adjusts her sights and\n\tfires again. The result is the same.\n\n\t\t\t\tPARKER\n\t\tWhat's the problem?\n\n\t\t\t\tMADISON\n\t\tI'm doing the best I can!\n\n\tBOOM! That was Sid 6.7 shooting their front left tire. Parker\n\tloses control of the vehicle.\n\n\tON THE STREET\n\n\tParker's vehicle SLAMS into a car stopped in front of them.\n\tAir bags save Parker and Madison from injury, but also\n\tprevent them from getting out of the car with any speed.\n\n\tBy the time they do get out, Sid 6.7 is long gone. Parker\n\tstares at Madison with pure hatred.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE A CONFERENCE ROOM\n\n\tin the L. A. P. D. Downtown Headquarters the next morning.\n\tChief Cox stares angrily at Parker. Madison sits next to him.\n\tBehind them is a mirrored wall.\n\n\t\t\t\tCOX\n\t\t\t(reading from a list)\n\t\t... illegal search of Lindenmeyer'\n\t\ts duplex. Eleven civilian vehicles\n\t\tdamaged or destroyed. Twenty\u0097four\n\t\tcitizen complaints. And the calls\n\t\tare just starting to come in...\n\t\t\t(to Parker)\n\t\tI forgot what it's like to have you\n\t\ton the streets.\n\n\t\t\t\tMADISON\n\t\tAny sign of Lindenmeyer?\n\n\t\t\t\tCOX\n\t\tNone. He could be hiding, he could\n\t\tbe helping Sid, or could be in\n\t\tlittle pieces on Santa Monica\n\t\tbeach.\n\t\t\t(a beat)\n\t\tAny idea what Sid's going to do\n\t\tnext?\n\n\t\t\t\tMADISON\n\t\tUntil we know what new influences\n\t\tare affecting him, we can't be\n\t\tsure.\n\n\t\t\t\tCOX\n\t\tIn other words, we collectively\n\t\tdon't know shit.\n\n\tINSIDE THE ADJACENT ROOM\n\n\tWallace and Deane look on through the two\u0097way mirror. Deane\n\tis on the phone.\n\n\t\t\t\tWALLACE\n\t\t\t(re: Parker)\n\t\tIt makes me nervous just seeing him\n\t\tin a uniform.\n\t\t\t(a beat)\n\t\tI will never forget the first time\n\t\tI saw the photos from the crime\n\t\tscene.\n\n\t\t\t\tDEANE\n\t\t\t(hanging up the phone)\n\t\tNeither will the public.\n\t\t\t(a beat)\n\t\tThe media has caught wind of his\n\t\tpardon. Unless Mr. Barnes starts\n\t\tgiving me some tangible results,\n\t\tI'm going to put him back in his\n\t\tcage.\n\n\t\t\t\t\tCUT TO:\n\n\tON A TELEVISION\n\n\tThe news is in progress. A REPORTER continues.\n\n\t\t\t\tREPORTER\n\t\tPolice now believe there to be a\n\t\tconnection between the grisly\n\t\tToluca Lake murders yesterday\n\t\tafternoon, and the hostage\n\t\tsituation which occurred last night\n\t\tin a downtown bar...\n\n\tINSIDE A SUPERMARKET\n\n\tThe TV is one of many mounted above the check\u0097out counters.\n\tCUSTOMERS waiting in line with their shopping carts watch the\n\tnews with varying degrees of horror, disgust, curiosity, and\n\tfear.\n\n\tThe stronger their reaction, the more Sid 6.7 enjoys it. He\n\tis waiting in line holding a box of Twinkies.\n\n\t\t\t\tCASHIER\n\t\tNext.\n\t\t\t(eyeing the Twinkies)\n\t\tDid you know those aren't even\n\t\tbaked? They're chemically\u0097risen.\n\n\t\t\t\tSID 6.7\n\t\t\t(a beat)\n\t\tSo was I.\n\n\tOff the cashier's look, we\n\n\t\t\t\t\tCUT TO:\n\n\tDARYL LINDENMEYER\n\n\twatching the news on a pocket TV on a wooden bench that\n\tmorning. Both proud and horrified at the monster he has\n\tunleashed upon the world. You hear CLASSICAL MUSIC in the\n\tbackground.\n\n\tLindenmeyer begins to laugh. Uncontrollably. The sounds\n\techoing. As WE PULL BACK, you realize the bench is one of\n\tmany inside the Hollywood Bowl.\n\n\tLindenmeyer is the only person sitting in the stands. He\n\tglances down at the members of the Los Angeles Philharmonic\n\tas they rehearse for an upcoming performance.\n\n\tWhatever the event is, it's going to be big. Dozens of\n\ttechnicians surround the stage, setting lights, cameras,\n\tmicrophones, etc. for a live, pay\u0097per\u0097view broadcast.\n\n\t\t\t\t\tCUT TO:\n\n\tALEXIEV BORGEN\n\n\ttalking on a phone inside the Cal Tech Computer Lab.\n\n\t\t\t\tALEXIEV\n\t\tI'm afraid I don't have very good\n\t\tnews.\n\n\t\t\t\t\tINTERCUT WITH:\n\n\tPARKER AND MADISON\n\n\ton the speakerphone inside Cox's Office.\n\n\t\t\t\tMADISON\n\t\tWere you able to get into the\n\t\tprogram?\n\n\t\t\t\tALEXIEV\n\t\tYes. But then I tripped over an\n\t\terasure mine.\n\n\t\t\t\tPARKER\n\t\tIn English, please.\n\n\t\t\t\tALEXIEV\n\t\tI accidently triggered a protection\n\t\tmechanism which erased the entire\n\t\tprogram.\n\n\tParker and Madison turn to each other -\u0097 shit.\n\n\t\t\t\tALEXIEV (CONT'D)\n\t\tIt was very well\u0097hidden. There was\n\t\tno way to see it until it was too\n\t\tlate.\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tIt's not your fault. We appreciate\n\t\tyou trying.\n\n\t\t\t\tALEXIEV\n\t\tLook, I feel bad about this, so I'm\n\t\tgoing to try to look into the\n\t\tprogramming of his Maestro teaching\n\t\ttool for you.\n\t\t\t(holding up keyboard) )\n\t\tI've had one sitting around for\n\t\tyears. Maybe I can learn something\n\t\tthat you'll find useful.\n\n\t\t\t\tMADISON\n\t\tLet us know.\n\n\t\t\t\t\tCUT TO:\n\n\tSID 6.7\n\n\twalking along a sidewalk. Noon. Something in a store front\n\tcatches his attention. Namely, his own image being captured\n\tby a video camera pointed at the sidewalk. He is standing\n\toutside a large electronics store.\n\n\tSid 6.7 walks closer to the window, moving into a CLOSE\u0097UP.\n\n\tHe is captivated by his image. Fascinated. And intrigued.\n\n\tThis is the first time he has ever seen himself on screen.\n\n\tINSIDE THE ELECTRONICS STORE\n\n\tDozens of TVs on display. There is a different channel on\n\teach. The audio/visual bombardment is overwhelming. Sid 6.7\n\tenters, making his way to a big screen TV with the local news\n\tin progress.\n\n\t\t\t\tREPORTER\n\t\t(from the TV) ... commuters\n\t\ttravelling anywhere near the\n\t\tBiltmore Hotel downtown tomorrow\n\t\tevening should allow themselves at\n\t\tleast 30 extra minutes to get home.\n\t\tSecurity for the Mayor Bennett's\n\t\tRe\u0097Election Rally is going to be so\n\t\ttight that all bus and subway\n\t\troutes passing through the area are\n\t\tbeing re\u0097routed...\n\n\tSid 6.7 changes the channel to a different news broadcast.\n\tParker's Folsom County Prison I. D. photograph is shown\n\talongside a photograph of Madison from one of her book\n\tcovers.\n\n\t\t\t\tSID 6.7\n\t\t\t(to the TV)\n\t\tDon't you two make a pretty couple.\n\n\tThe news broadcast zooms in on Parker's picture. Sid 6.7\n\twiggles his synthetic fingers in front of his face.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tWe really do have so much in\n\t\tcommon. But I refuse to be\n\t\tupstaged...\n\n\tHe changes the channel back to the first news broadcast. A\n\treporter stands amid the chaos outside the bar where Sid 6.7\n\thad terrified the patrons.\n\n\tSid 6.7 turns to the other CUSTOMERS in the store. Most of\n\tthem are watching other channels. He goes over to a control\n\tpad on a counter and presses several buttons.\n\n\tNow EVERY TV in the store has the news with the reporter\n\toutside the bar on. A SKINHEAD, sporting numerous Nazi\n\tswastika tattoos, manually changes the channel on one of the\n\tTVs to a Dodger baseball game.\n\n\tSid 6.7 walks over to the Skinhead and changes the channel\n\tback to the news.\n\n\t\t\t\tSKINHEAD\n\t\tYou don't wanna fuck with me, man.\n\n\tHe moves to the next TV over and changes the channel to the\n\tbaseball game. Sid 6.7 moves over with him, standing directly\n\tbehind the Skinhead as if also interested in the Dodgers.\n\n\t\t\t\tSID 6.7\n\t\t\t(singing softly)\n\t\tTake me out to the ball game...\n\t\tTake me out for the fun...\n\n\tHe places his hands on the Skinhead's head and efficiently\n\tsnaps his head around, breaking his neck.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tBuy me some peanuts and Cracker\n\t\tJack... I don't care if I ever come\n\t\tback...\n\n\tHe drops the Skinhead to the floor, never once taking his\n\teyes off the TV.\n\n\tON THE TV\n\n\tA Dodger game is in progress. A pop fly is caught by the\n\tcenter fielder. The runner at third tags and heads for home.\n\tThe play at the plate is close. The umpire calls the runner\n\tout.\n\n\tThe camera pans to the MASSIVE SCREEN over left field to show\n\tthe instant replay. Reactions of fans around the stadium are\n\tshown in CLOSE\u0097UP. The fans also respond to seeing themselves\n\ton the massive screen.\n\n\tINSIDE THE ELECTRONICS STORE\n\n\tSid 6.7 watches the TV intently, completely ignoring the\n\thorrified customers circling around him because of the dead\n\tSkinhead at his feet. A SALESMAN, who'd been demonstrating a\n\tvideocamera, tapes Sid 6.7 from behind a customer.\n\n\tSALESMAN'S POV -- HANDHELD VIDEO\n\n\tAs Sid 6.7 realizes he's being videotaped, his entire face\n\tseems to light up. Playing directly to the camera, he clearly\n\tloves being in the spotlight. The attention. The focus. It's\n\tsuddenly as if he's had years of training. He is completely\n\tat ease. And simply captivating.\n\n\t\t\t\tSID 6.7\n\t\t\t(direct address)\n\t\tI'm sorry I can't do more for you.\n\t\t\t(pointing to the Skinhead)\n\t\tPublic service really isn't my\n\t\tforte.\n\n\tHe walks into an EXTREME CLOSE-UP and kisses the lense. Then\n\treaches out of frame to help the increasingly\u0097shaky salesman\n\tsteady the camera.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tBut rest assured...\n\t\t\t(a beat)\n\t\tA star is born.\n\n\tWE PULL BACK TO REVEAL you're now watching a recording of Sid\n\t6.7 on videotape, along with Parker, Madison, and a dozen\n\tother COPS, inside the Electronics Store an hour later. The\n\ttape is re\u0097wound.\n\n\t\t\t\tMADISON\n\t\t\t(to Parker)\n\t\tWhatever he was doing here was only\n\t\tthe start.\n\n\t\t\t\tPARKER\n\t\tStart of what?\n\n\t\t\t\tMADISON\n\t\tI don't know, yet. What we do know\n\t\tis his performances are increasing\n\t\tin scale, not decreasing.\n\t\t\t(a beat)\n\t\tWhatever it is, he isn't\n\t\tfinished...\n\n\tShe moves closer to the screen as the tape is played back.\n\tMadison studies Sid 6.7 intently.\n\n\t\t\t\tSID 6.7 (0. 5.)\n\t\t\t(recorded)\n\t\tBut rest assured...\n\t\t\t(a beat)\n\t\tA star is born.\n\n\t\t\t\tMADISON\n\t\t\t(to another cop)\n\t\tYou mind playing that part again?\n\n\tHer request is obliged.\n\n\t\t\t\tMADISON\n\t\tFreeze it there\u0097\u0097\n\n\tShe stares at Sid 6.7, who is looking directly at her.\n\n\t\t\t\tMADISON (CONT'D)\n\t\t(as if to Sid 6.7) You've\n\t\tdiscovered media, haven't you? You\n\t\tlike the attention...the\n\t\tpower...You like being a star. What\n\t\tare you going to do next, star?\n\t\tWhat are you going to...\n\n\tHer attention turns to the upper right corner of the screen,\n\twhere onlookers are visible watching Sid 6.7. Their faces\n\tblurry. But even out of focus, it isn't hard to recognize\n\tLindenmeyer.\n\n\t\t\t\tMADISON (CONT'D)\n\t\t\t(as if to Lindenmeyer)\n\t\tYou do like to watch, don't you?\n\t\t\t(to the surrounding cops)\n\t\tIf any of you are looking for Daryl\n\t\tLindenmeyer, that's him...\n\n\tShe points to Lindenmeyer, then makes her way over to Parker,\n\twho's standing exactly where Sid 6.7 was when he killed the\n\tSkinhead. Parker does not look at Madison. His eyes are fixed\n\ton the TV in front of him.\n\n\t\t\t\tMADISON (CONT'D) \n\t\tIt's not just Sid 6.7's\n\t\tperformances that are increasing.\n\t\tStars need bigger and bigger\n\t\taudiences.\n\t\t\t(a beat)\n\t\tWhatever Sid is going to do next,\n\t\tit's going to involve media.\n\n\t\t\t\tPARKER\n\t\tYou like baseball?\n\n\tON THE TV\n\n\tThe baseball game continues. Players take the field at the\n\tstart of a new inning. The outfielders can't help but glance\n\tat the beautiful WOMAN being shown in CLOSE-UP on the massive\n\tscreen over left field.\n\n\t\t\t\tANNOUNCER (V. 0.)\n\t\tI'll tell you, whoever's operating\n\t\tthe stadium's closed\u0097circuit\n\t\tcameras must have fallen in love\n\t\tbecause that beauty in J Section\n\t\thas been on the stadium's big\n\t\tscreen for over a minute now...\n\n\tINSIDE THE ELECTRONICS STORE\n\n\tHe grabs a police radio from a nearby OFFICER.\n\n\t\t\t\tPARKER\n\t\t(urgently into radio) This is\n\t\tOfficer Parker Barnes. Get every\n\t\table body you can to Dodger Stadium\n\t\t-- J Section.\n\n\t\t\t\tOFFICER\n\t\tWhat the hell's going on?\n\n\t\t\t\tPARKER\n\t\t\t(re: TV)\n\t\tLive execution.\n\n\tINSIDE DODGER STADIUM\n\n\tOn the massive screen over left field, the Woman in CLOSE-UP\n\tlooks embarrassed, trying to forget her face is now 40 feet\n\thigh for all the other fans to see.\n\n\t\t\t\tANNOUNCER (V. 0.)\n\t\tThat's enough with the close-up\n\t\talready, Mr. DeMille. Even the\n\t\tplayers are starting to get\n\t\tdistracted...\n\n\tThe players on the field are all looking up at the massive\n\tscreen.\n\n\tINSIDE THE STADIUM CONTROL BOOTH\n\n\tThe Woman's face appears on various monitors. The phone\n\tRINGS. No one answers it. The room appears to be empty. \n\n\tThe stadium's closed-circuit TV director is not in his chair.\n\n\tHe's lying dead on the floor.\n\n\tON THE J SECTION CAMERA PLATFORM\n\n\tThe closed\u0097circuit camera remains focused on the Woman. The\n\tcamera is locked off. It's operator lies dead beside it.\n\n\tTHROUGH ITS VIEWFINDER\n\n\tSid 6.7 can be seen arriving next to the Woman. He gently\n\tcaresses her hair.\n\n\tIN J SECTION\n\n\tSid 6.7 stands in front of the Woman's BOYFRIEND, who sits\n\tnext to her.\n\n\t\t\t\tBOYFRIEND\n\t\tYou make a better door than a\n\t\twindow, buddy. Keep it moving.\n\n\tSid 6.7 picks him up out of his seat and throws him three\n\trows ahead. Sid 6.7 then puts hands around the Woman's\n\tthroat.\n\n\tON THE MASSIVE SCREEN\n\n\tover left field, the Woman attempts to scream as Sid 6.7\n\tchokes her. No sound comes out.\n\n\tFANS\n\n\treact with horror. But nobody turns away.\n\n\t\t\t\tANNOUNCER (V. 0.)\n\t\tJesus Christ! Somebody stop him!\n\n\tSECURITY PERSONNEL\n\n\trush from all parts of the stadium toward J Section.\n\n\tSID 6.7\n\n\tenjoys the reactions of the terrified fans around him as he\n\tchokes the life out of the Woman.\n\n\t\t\t\tSID 6.7\n\t\t\t(to the camera)\n\t\tHey, Parker, this one's for you...\n\n\tHis words ECHO around the stadium as he SNAPS the Woman's\n\tneck. He then hurls her limp body toward several men as they\n\tcharge him.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tThat's all, folks.\n\n\tHe leaps over a railing, rushing into a tunnel which leads\n\tout of the seating area.\n\n\tA SECURITY GUARD\n\n\tclimbs up the stairs to the mouth of the tunnel. Weapon in\n\thand. He draws a bead on Sid 6.7's back. BOOM!\n\n\tHIS POV\n\n\tA bullet rips through Sid 6.7's side. Blood begins to seep\n\tfrom the wound. But then immediately begins to retract. Once\n\this blood has returned, his skin heals over the wound.\n\tLeaving a scar. Which also then disappears.\n\n\tOther than the hole in his shirt, Sid 6.7 is as good as new.\n\tHe never even misses a step as he disappears around the\n\tcorner.\n\n\tTHE SECURITY GUARD\n\n\tstares in disbelief as he is joined by several comrades.\n\n\t\t\t\tGUARD\n\t\tI nailed the son\u0097of-a\u0097bitch. I put\n\t\ta hole right through him...\n\n\tPANIC-STRICKEN FANS\n\n\tin J Section start moving away from the area as fast as they\n\tcan. Parents clutching their children. Climbing over seats.\n\tShoving anyone in their way.\n\n\t\t\t\tANNOUNCER (V. 0.)\n\t\tLadies and gentlemen, please try to\n\t\tstay calm. Everyone just keep your\n\t\tseats...\n\n\tFans all over the stadium start charging toward the exits.\n\n\tOUTSIDE DODGER STADIUM\n\n\tPeople bolt through the turnstiles, running away from the\n\tstadium as L. A. P. D. squad cars approach in the distance.\n\tThe car in the lead is Parker's.\n\n\tINSIDE PARKER'S VEHICLE\n\n\tParker speeds dangerously fast toward the fans streaming onto\n\tthe street. Madison braces herself.\n\n\t\t\t\tMADISON\n\t\tSLOW DOWN!\n\n\tParker JAMS on the brakes with both feet. SCREEEEEEECH!\n\n\tOUTSIDE DODGER STADIUM\n\n\tParker comes within inches of mowing down several people, who\n\tkeep right on running. Parker jumps out of the vehicle,\n\tscanning faces. In predator mode. Madison gets out, clearly\n\tshaken. Parker locks his gaze on somebody in the distance.\n\n\tHIS POV\n\n\tA guy in Dodger baseball cap and jacket. Walking calmly away\n\tfrom the stadium. He descends down an escalator into a\n\trecently-built subway station. It is Sid 6.7.\n\n\tPARKER\n\n\tcharges after him. A heat\u0097seeking missile locked on target.\n\n\t\t\t\tMADISON\n\t\tParker.. .Parker!\n\n\tShe does the best she can to follow after him. People knock\n\tinto Parker as hard as he does them. A human version of\n\tbumper cars.\n\n\tReaching the entrance to the subway, Parker leaps down the\n\tescalator three steps at a time. Madison remains in his wake.\n\n\tINSIDE THE SUBWAY STATION\n\n\tParker and Madison hop the turnstiles. Only to be stopped by\n\ta remote\u0097controlled, box\u0097shaped robotic sentry, which is\n\tidentical to one you have seen before. This sentry was one of\n\tReilly's creations at LETAC.\n\n\t\t\t\tSECURITY ROBOT\n\t\t\t(male, authoritarian)\n\t\tStop. You are in violation of...\n\n\tParker spits in the Robot's electronic eye. Temporarily\n\tblinding it, as well as the guy operating it via remote\n\tcontrol. Parker and Madison make their getaway as the robotic\n\tsentry struggles to clean off his eye.\n\n\t\t\t\tPARKER\n\t\tReal effective security...\n\n\t\t\t\tMADISON\n\t\tYou could have just flashed him\n\t\tyour badge, you know?\n\n\t\t\t\tPARKER\n\t\tAuthority still makes me nervous.\n\n\tThey come to a fork: one tunnel goes to east/west trains, the\n\tother to north/south.\n\n\t\t\t\tMADISON\n\t\tWhich way?\n\n\t\t\t\tPARKER\n\t\tBoth.\n\n\tHe races down the tunnel to the north/south trains. Madison\n\theads down the other. Her determination beginning to win out\n\tover her inexperience.\n\n\tPARKER\n\n\thesitates at the escalator leading to the south-bound side of\n\tthe tracks.\n\tFurther down the tunnel is the escalator to the north\u0097bound\n\ttrains. Parker chooses the escalator closest to him.\n\n\tON THE SOUTH-BOUND PLATFORM\n\n\tPassengers pass the time by watching a television mounted\n\tabove them. Except for Parker, who scans the crowd. Then\n\tacross the tracks.\n\n\tON THE NORTH-BOUND PLATFORM\n\n\tIn the entire crowd, there is only one person not watching\n\tthe TV screen. He is watching Parker. Through his gun sight.\n\tSid 6.7 pulls the trigger. BOOM!\n\n\tON THE SOUTH-BOUND PLATFORM\n\n\tParker dives to the ground, just avoiding the bullet. He\n\tscrambles behind a pillar for protection. Only to see the guy\n\tstanding behind him wasn't as lucky.\n\n\tON THE EAST-BOUND PLATFORM\n\n\tMadison hears the gunshot ECHO through the station. Which\n\tscares the already-terrified fans trying to get away from\n\tDodger Stadium. Chaos is rapidly becoming Pandemonium.\n\n\t\t\t\tMADISON\n\t\tSHIT!\n\n\tShe races up the escalator, taking out her weapon.\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\tpeeking out from behind the pillar on the south-bound\n\tplatform.\n\n\tPARKER'S POV -- ACROSS THE TRACKS\n\n\tPassengers rush in every direction. Some are screaming. Some\n\tare crying. Nobody knows who fired the shot. Or where to go.\n\tBut everyone is going somewhere.\n\n\tIncluding Sid 6.7, who makes his way through the flurry of\n\tmovement toward the up escalator. It is difficult to keep\n\tsight of him.\n\n\tPARKER\n\n\tmoves toward the edge of the platform, aiming his gun across\n\tthe tracks. Those around him quickly back away.\n\n\t\t\t\tPARKER\n\t\t\t(yelling)\n\t\tEverybody get down!\n\n\tOnly about half the passengers on the north\u0097bound side can\n\thear him above the screaming already going on. Sid 6.7 is\n\tnowhere to be seen.\n\n\t\t\t\tPARKER (CONT'D)\n\t\t\t(screaming)\n\t\tGET DOWN!!!\n\n\tThe rest of the passengers hit the deck, except for a COLLEGE\n\tSTUDENT listening to music on headphones. He is riding the\n\tescalator up. Sid 6.7 stands behind him, using the student as\n\ta shield.\n\n\tPARKER' S POV\n\n\tAs Sid 6.7 ascends, slight portions of his body are\n\tmomentarily exposed behind the student as he sways with the\n\tmusic coming from his headphones. Parker does NOT have a\n\tclean shot.\n\n\tIn 10 seconds, Sid 6.7 will disappear from view completely\n\tand Parker will have no shot at all. A momentary sliver of\n\tSid 6.7 becomes visible. An inch-and-a-half at most.\n\n\tPARKER\n\n\tdoesn't hesitate. He lines up his shot and pulls the trigger.\n\n\tON THE NORTH-BOUND UP ESCALATOR\n\n\tThe college student standing in front of Sid 6.7 gets winged\n\tin the shoulder. Not a serious wound, but a painful one just\n\tthe same.\n\n\tThe bullet must have hit bone, because it deflected upon\n\timpact, missing Sid 6.7 entirely.\n\n\tThe student drops to the escalator, screaming in pain. Sid\n\t6.7 crouches beside him.\n\n\t\t\t\tSID 6.7\n\t\t\t(yelling)\n\t\tWhat's wrong, convict, your arms\n\t\tneed adjusting? Or maybe it's your\n\t\thead. Maybe you aren't ready to be\n\t\tback out in the real world, yet...\n\n\tPARKER'S POV\n\n\tThe top of Sid 6.7's head is exposed an inch, maybe two.\n\n\tPARKER\n\n\tfires again. Repeatedly. Moving closer and closer to the edge\n\tof the platform, trying to get a better angle while he still\n\thas a shot.\n\n\tParker moves to the very edge of the platform. His arm\n\textended out over it. Completely oblivious to\n\n\tTHE SUBWAY TRAIN\n\n\trocketing into the station toward the south-bound platform.\n\n\tMADISON\n\n\tleaps off the descending escalator on the south\u0097bound side\n\tand rushes to Parker.\n\n\tShe pulls Parker back just before the train reaches him. Had\n\this arm still been raised, Parker would have lost his arm a\n\tsecond time.\n\n\tThey tumble to the floor. A PASSENGER rushes to Madison.\n\n\t\t\t\tPASSENGER #1\n\t\t\t(pointing to Parker)\n\t\tLady, you gotta stop him! He's gone\n\t\tcrazy!\n\n\t\t\t\tPASSENGER #2\n\t\tHe just shot an innocent bystander!\n\n\t\t\t\tMADISON\n\t\t\t(forcefully to Parker)\n\t\tWhat were you shooting at?\n\n\tParker gets to his feet. Madison doesn't take her eyes off\n\thim.\n\n\t\t\t\tPASSENGER #1\n\t\tHe did \u0097\u0097 I saw it!\n\n\t\t\t\tPASSENGER #2\n\t\tDO SOMETHING!\n\n\t\t\t\tPARKER\n\t\t\t(to Madison)\n\t\tSid's getting away.\n\n\tHe heads toward the up escalator. His back now to Madison.\n\tShe aims her gun at him.\n\n\t\t\t\tMADISON\n\t\tParker -\u0097 stop! STOP! Don't make me\n\t\tshoot you\u0097\u0097 \n\n\t\t\t\tPARKER\n\t\t\t(not looking back)\n\t\tIf you're gonna do it, better do it\n\t\tnow.\n\n\tHe keeps right on going up the escalator.\n\n\tMADISON\n\n\tlines up her shot. Hands shaking. With both fear and\n\tdetermination. Her finger presses down on the trigger...but\n\tshe can't do it.\n\n\t\t\t\tMADISON\n\t\tDammit!\n\n\tShe chases after him.\n\n\tINSIDE THE NORTH/SOUTH TUNNEL\n\n\tMadison looks in both directions as she gets off the\n\tescalator. Parker is nowhere to be seen.\n\n\tMoving toward her slowly is the wounded college student, who\n\tclutches his bleeding shoulder. He is shivering. Going into\n\tshock. Madison goes to him, taking off his headphones.\n\n\t\t\t\tMADISON\n\t\tLet me help you...\n\n\tHe collapses in her arms.\n\n\t\t\t\tCOLLEGE STUDENT\n\t\t\t(delirious)\n\t\tWhat did I do?...I didn't do\n\t\tanything...\n\n\tClearly versed in emergency medical treatment, Madison\n\tattends to his wound. Parker returns.\n\n\t\t\t\tPARKER\n\t\t\t(breathlessly)\n\t\tI lost him...\n\n\t\t\t\tCOLLEGE STUDENT\n\t\tGET HIM AWAY FROM ME! GET HIM AWAY!\n\n\t\t\t\tMADISON\n\t\t\t(furiously)\n\t\tCall 9-1-1. Wait for me above\n\t\tground.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE OF THE SUBWAY STATION\n\n\t30 minutes later. The chaos outside Dodger Stadium has\n\tsubsided. Madison and two PARAMEDICS lead the bandaged\n\tCollege Student to an ambulance.\n\n\tMadison goes to Parker, who sits quietly by himself. Elbows\n\ton his knees. Head between his hands. Staring at the cement\n\tbetween his feet.\n\n\t\t\t\tMADISON\n\t\t\t(angrily)\n\t\tDo you have any idea the trauma you\n\t\tput that kid through?!\n\n\tParker doesn't respond. All around them, a cacophony of news\n\tbroadcasts is heard. From passing cars. From boom boxes. From\n\tportable TVs. Over and over, you hear what Sid 6.7 had said\n\twhile killing the woman in Dodger Stadium:\n\n\t\t\t\tSID 6.7 (V. 0.)\n\t\t\t(recorded)\n\t\tHey, Parker, this one's for you...\n\t\tHey, Parker, this one's for you...\n\n\tAs Parker raises his head slowly, you realize you are looking\n\tat the face of a wild animal. Eyes rabid. Jaw clenched. Pure\n\tanger. Violence about to erupt. Without fear. Without guilt.\n\tThe beast within has been unleashed.\n\n\t\t\t\tPARKER\n\t\t\t(in a whisper)\n\t\tThat's Grimes...\n\n\tMadison backs away in fear. Parker rises gradually.\n\n\t\t\t\tPARKER (CONT'D)\n\t\t(voice slowly rising) The man who\n\t\tkilled my wife...who killed my\n\t\tdaughter...who ruined my life used\n\t\tto taunt me with that line...\n\n\tParker advances toward Madison, who continues backing away.\n\n\t\t\t\tPARKER (CONT'D)\n\t\t\t(exploding)\n\t\tGrimes is back! He's back! He's\n\t\tcome back!!!\n\n\t\t\t\tMADISON\n\t\t(standing her ground) No! Grimes\n\t\tisn't back. He's only one part of\n\t\tSid. Sid 6.7 is a hell of a lot\n\t\tworse than Grimes ever was.\n\t\t\t(a beat)\n\t\tGet a hold of yourself!\n\n\tShe tries to grab him by the shoulders. Parker blocks her\n\tarms away.\n\n\t\t\t\tPARKER\n\t\t\t(going nose\u0097to\u0097nose)\n\t\tBut he's in there. And you knew it,\n\t\tdidn't you? Didn't you?!\n\n\tShe tries to back away, but backs herself against a light\n\tpole. Madison has nowhere to go. Parker grabs her by the\n\tcollar, and shoves her against the pole. Hard.\n\n\t\t\t\tPARKER (CONT'D)\n\t\t\t(hysterical)\n\t\tGod, you fucking know-it-all!\n\t\tYou've known all along and didn't\n\n\t\t\t\tPARKER (CONT'D)\n\t\ttell me! Why?! Were you afraid I'd\n\t\tlose it?! Go over the edge?! Huh?!\n\t\tIs that what you were afraid of?!\n\t\tWHY DIDN'T YOU TELL ME??!!!\n\n\tA prison transport and another police vehicle pull up to them\n\tfast. Two of the Prison Guards met earlier jump out of the\n\ttransport, advancing on Parker. Their weapons aimed at his\n\thead.\n\n\t\t\t\tGUARD\n\t\tHands up! Now!\n\n\tParker slowly raises his hands in the air. A Guard relieves\n\thim of his weapon.\n\n\t\t\t\tMADISON\n\t\t\t(recovering)\n\t\tWhat's going on?\n\n\t\t\t\tGUARD\n\t\tHe's going back where he belongs.\n\n\tDeane and Cox step out of the police vehicle.\n\n\t\t\t\tDEANE\n\t\t\t(to Madison)\n\t\tYou were right, Dr. Carter. Letting\n\t\ta lunatic like Barnes loose in the\n\t\treal world did pose an unacceptably\n\t\tdangerous risk to the public.\n\t\t\t(glancing at Cox)\n\t\tI should have never tried to solve\n\t\tone problem by allowing the\n\t\tcreation of another.\n\t\t\t(to Madison)\n\t\tChief Cox will give you a ride back\n\t\tto the station. You will provide\n\t\thim with any and all information\n\t\tyou have developed thus far.\n\t\t\t(to Parker)\n\t\tEnjoy the rest of your sentence,\n\t\tMr. Barnes.\n\n\tShe exits. Cox and Parker stand facing each other. Cox wishes\n\tthere was something he could do. Parker looks completely out\n\tof it. Cox extends his hand. After a moment, Parker takes it.\n\tBut his mind is way off elsewhere.\n\n\t\t\t\tGUARD\n\t\t\t(forcefully to Parker)\n\t\tLet's go.\n\n\tMadison looks on as Parker is herded roughly into the back of\n\tthe prison transport.\n\n\t\t\t\tMADISON\n\t\tParker...\n\n\tParker shuts her up with a look. There is nothing that can be\n\tsaid. The prison transport doors are SLAMMED shut. The\n\tvehicle takes off.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE COX'S POLICE VEHICLE\n\n\tCox and Madison head back toward L. A. P. D. Headquarters.\n\tThey are in mid\u0097conversation:\n\n\t\t\t\tMADISON\n\t\t\t(with regret)\n\t\tI should have told him.\n\n\t\t\t\tCOX\n\t\tDon't blame yourself. In your\n\t\tshoes, I don't think I would have\n\t\ttold Parker, either.\n\t\t\t(a beat)\n\t\tSo do you think Grimes has become\n\t\tthe dominant personality?\n\n\t\t\t\tMADISON\n\t\tI'm not sure. My guess is that's\n\t\twhat Sid wants us to think.\n\n\t\t\t\tCOX\n\t\t\t(a beat)\n\t\tYou think he's smart?\n\n\t\t\t\tMADISON\n\t\tCaptain, I'm afraid of how smart\n\t\tSid 6.7 is.\n\t\t\t(a beat)\n\t\tBut I'm even more afraid of what's\n\t\the's becoming.\n\n\t\t\t\t\tCUT TO:\n\n\tTHE PRISON TRANSPORT\n\n\tcomes to a stop at a traffic light.\n\n\tINSIDE THE PRISON TRANSPORT -- REAR\n\n\tParker sits alone in the darkness. Motionless. Until the\n\tsound of TWO GUNSHOTS piercing the transport's front\n\twindshield SHATTERS the silence.\n\n\t\t\t\tPARKER\n\t\tWhat the hell's going on?!\n\n\tHe scrambles to the front of the compartment, pressing his\n\tface against the steel mesh of the four\u0097inch portal.\n\n\tHIS POV -- LOOKING THROUGH PORTAL\n\n\tTwo bullet holes are visible in the windshield. The two\n\tPrison Guards lie dead in their seats. Sid 6.7's eyes appear,\n\tlooking directly at you. He's smiling.\n\n\t\t\t\tSID 6.7\n\t\t\t(neighborly)\n\t\tHey, old buddy, old pal, good to\n\t\tsee you again.\n\n\tINSIDE THE PRISON TRANSPORT\n\n\tParker goes absolutely berserk. Viciously punching the steel\n\tmesh which separates them until the synthetic skin on his\n\tknuckles is shredded.\n\n\t\t\t\tPARKER\n\t\tYou...mother...fucker! I'M GOING TO\n\t\tKILL YOU!!!\n\n\t\t\t\tSID 6.7\n\t\tNow, is that any way to talk to an\n\t\told buddy? I mean, just because I'm\n\t\tcarrying around the joy of killing\n\t\tyour family inside me doesn't mean\n\t\twe can't be friends.\n\n\t\t\t\tPARKER\n\t\tGRIMES, YOU'RE DEAD!\n\n\tHe savagely hurls himself against his confines. Bone vs.\n\tmetal. Don't try this at home.\n\n\t\t\t\tSID 6.7\n\t\tI'm sorry, the party you're trying\n\t\tto reach is not answering. Is there\n\t\tanyone else you would like to talk\n\t\tto?\n\n\t\t\t\tPARKER\n\t\tDEAD! YOU HEAR ME?\n\n\t\t\t\tSID 6.7\n\t\t\t(a beat)\n\t\tYou really are pathetic, you know\n\t\tthat? Mathew Grimes is only one\n\t\tletter in my alphabet. He is\n\t\tnothing compared to me.\n\n\tParker is completely spent. Mentally and physically. He\n\tslumps in a corner. Out of breath. Bleeding. Sore. All he can\n\tdo is stare out through the portal's mesh at Sid 6.7.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tYou could say thank\u0097you, you know?\n\t\tI'm giving you your freedom, short\u0097\n\t\tlived though it may be.\n\t\t\t(a beat)\n\t\tA little known fact about the\n\t\tlocater implants prison inmates now\n\t\treceive upon release is that they\n\t\tcontain a pinhead capsule of neural\n\t\ttoxin.\n\t\tThe satellite they use to track you\n\t\tcan also trigger release of the\n\t\ttoxin with microwaves. After\n\t\ttransmission, the implant's host\n\t\tdies within 30 seconds.\n\t\t\t(a beat)\n\t\tIt won't take long for them to get\n\t\tyour termination authorized once\n\t\tthey learn of your escape. Now who\n\t\twould you rather go after, killer,\n\t\tthem or me?\n\n\tHe releases the rear door lock.\n\n\tON THE STREET\n\n\tParker bursts out of the back of the Prison Transport,\n\tcharging after Sid 6.7. Who is nowhere to be seen. Parker\n\truns in one direction. Then the other. And changes his mind\n\tagain. He literally does not know which way to turn.\n\n\t\t\t\tPARKER\n\t\tShit!\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE A CONFERENCE ROOM IN L. A. P. D. HEADQUARTERS\n\n\tAn AIDE rushes through the door to Cox, who's briefing Deane\n\tand Wallace on what he has learned.\n\n\t\t\t\tAIDE\n\t\tParker Barnes just escaped from the\n\t\tprison transport. Both of the\n\t\tguards are dead.\n\n\tThe Aide exits.\n\n\t\t\t\tCOX\n\t\t\t(to Deane)\n\t\tBarnes wouldn't kill two innocent\n\t\tguards.\n\n\t\t\t\tDEANE\n\t\tHe would slaughter eight people\n\t\tsitting in a room, but not two\n\t\tprison guards?\n\n\t\t\t\tCOX\n\t\tDo I need to remind you what\n\t\thappened to his wife? To his\n\t\tdaughter?\n\t\t\t(with conviction)\n\t\tI will stake my reputation that\n\t\tBarnes didn't kill those guards.\n\n\t\t\t\tDEANE\n\t\tYou already have staked your\n\t\treputation.\n\t\t\t(a beat)\n\t\tMayor Bennett and I have been\n\t\tfriends a long time. Since Grimes\n\t\ttried to kill him, it doesn't take\n\t\ta rocket scientist to come to the\n\t\tconclusion that Sid 6.7 might go\n\t\tafter him, too.\n\t\t\t(a beat)\n\t\tBennett's Re-Election Rally is\n\t\ttomorrow night and we already have\n\t\tenough trouble on our hands with\n\t\tone psychotic on the loose.\n\t\t\t(to Wallace)\n\t\tThe fail-safe on\u0097line, yet?\n\n\t\t\t\tWALLACE\n\t\tOn\u0097line and at your disposal.\n\n\t\t\t\tCOX\n\t\t\t(to Deane)\n\t\tWhat fail\u0097safe?\n\n\t\t\t\tDEANE\n\t\t\t(approaching Wallace)\n\t\tThis had better work, Mr. Wallace.\n\n\tWallace exits the room. Cox has no idea what is going on. And\n\tDeane is not about to tell him.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE MADISON'S BEDROOM\n\n\tMadison enters wearily, late afternoon. Exhausted from the\n\tevents of the last two days, she starts to undress. Her\n\tclothing is filthy. So is her skin. She could use a good\n\tshower, and a better massage.\n\n\tMadison examines the various cuts and bruises she's received\n\talong the way. Not exactly war wounds, but to somebody used\n\tto sitting behind a desk, they are.\n\n\tShe absentmindedly turns on the television, then goes into\n\ther bathroom. Madison looks at her face in the mirror. She's\n\tlooked better. After splashing cold water on her face, she\n\tcomes to the same conclusion.\n\n\tMadison takes two aspirin. And then two more. Wishing they\n\twould take effect immediately. Finally hearing the news on\n\tthe TV, her entire demeanor changes instantly.\n\n\tMadison rushes in front of the television to see a report of\n\tParker's escape from the prison transport.\n\n\t\t\t\tMADISON\n\t\tOh, shit!\n\n\tGrabbing a handful of clothes, she bolts urgently out the\n\tdoor.\n\n\t\t\t\t\tCUT TO:\n\n\tMADISON\n\n\tspeeding recklessly through city streets in her car. She\n\tdoesn't stop for red lights. Not for grid-lock. Not for\n\tnothing.\n\n\tShe is also still finishing getting dressed.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE L. A. P. D. HEADQUARTERS\n\n\tIgnoring the warnings of several COPS walking toward their\n\tvehicles, Madison speeds toward the front entrance. She\n\tbarely stops in time. SCREEEECH!\n\n\tINSIDE L. A. P. D. HEADQUARTERS\n\n\tMadison races through the bustling facility. Looking for\n\tsomebody. She finally finds Cox coming out of his office.\n\n\t\t\t\tMADISON\n\t\t\t(urgently)\n\t\tThere is no way Parker killed those\n\t\tguards. No way.\n\n\t\t\t\tCOX\n\t\tI think we both know who did.\n\t\t\t(a beat)\n\t\tWhat's so urgent?\n\n\t\t\t\tMADISON\n\t\tI need your help--\n\n\tTaking him by the arm, she leads him into an elevator going\n\tdown just before its doors close.\n\n\tINSIDE THE ELEVATOR\n\n\tThe look on Cox's face tells you Madison has explained the\n\tsituation to him. He is furious.\n\n\t\t\t\tCOX\n\t\tWhy didn't anybody tell me?!\n\n\t\t\t\tMADISON\n\t\tI don't set policy.\n\t\t\t(a beat)\n\t\tYou have the key?\n\n\tHe takes a security key out of his pocket and uses it to gain\n\taccess to a subterranean floor.\n\n\t\t\t\tCOX\n\t\t\t(angrily)\n\t\tThis is a police department. I'll\n\t\tbe damned if this is going to go on\n\t\twithout my knowledge.\n\n\tThey exit quickly. Cox leads Madison\n\n\tINSIDE A POWER SUPPLY ROOM\n\n\tCox leads in Madison and takes her to the subterranean power\n\tsupply. He points to the floor's numerous circuit breakers.\n\n\t\t\t\tCOX\n\t\tGive me 30 seconds, then flip every\n\t\tswitch you can reach.\n\n\t\t\t\tMADISON\n\t\tGot it.\n\n\tINSIDE THE LOCATER TRANSMISSION ROOM\n\n\tThe room is still under construction. Wallace stands behind a\n\tTECHNICIAN sitting at a console in front of a massive\n\telectronic map tracking several convicts, including Parker.\n\tThe technician is typing in an elaborate termination code.\n\n\t\t\t\tTECHNICIAN\n\t\tWho are we going to fry?\n\n\t\t\t\tWALLACE\n\t\tJust an unrepentant criminal who is\n\t\tapparently going to die from a\n\t\tpreviously undiagnosed brain tumor.\n\n\tCox enters, concerning Wallace.\n\n\t\t\t\tWALLACE (CONT'D)\n\t\tWhat are you doing here, sir?\n\n\t\t\t\tCOX\n\t\tJust paying my last respects.\n\n\tHe surveys the electronic map, locating Parker. Just as the\n\tlights go BLACK. Wallace and the technician immediately\n\tpanic.\n\n\t\t\t\tWALLACE\n\t\tWhat happened?!\n\n\t\t\t\tTECHNICIAN\n\t\tI don't know. We've lost all power!\n\n\t\t\t\tCOX\n\t\tThe heat's been causing brown out's\n\t\tall over the city. Get above ground\n\t\tuntil it's restored.\n\n\tWallace and the technician rush out of the room, up the\n\temergency stairs. Cox sets to work ripping out the console's\n\tcircuitry. By the time he's finished, the equipment in here\n\twon't be able to toast a piece of bread.\n\n\t\t\t\t\tCUT TO:\n\n\tA TOMBSTONE\n\n\twhich reads: LINDA DAVIS BARNES (1961\u00971992) and CHRISTINE\n\tMARY BARNES (1987-1992). Parker kneels in front of it. Magic\n\thour.\n\n\tMadison, and Cox wind their way to him through obstacle\n\tcourse of tombstones. Parker stands as they arrive. He is\n\twiped out. There is no emotion left in him.\n\n\t\t\t\tMADISON\n\t\tWe know you didn't kill those\n\t\tguards.\n\n\t\t\t\tPARKER\n\t\tThey're going to fry me for it,\n\t\tanyway.\n\n\t\t\t\tCOX\n\t\tNobody's going to fry anybody...\n\n\tHe approaches, holding the Circuits he ripped out of the\n\tLocator Transmission Room.\n\n\t\t\t\tCOX\n\t\t\t(re: circuits)\n\t\tDon't worry, they have no idea\n\t\twhere you are.\n\n\t\t\t\tPARKER\n\t\tYou son\u0097of\u0097a\u0097bitch. How could you\n\t\tlet them put the implant in my\n\t\thead? How?\n\n\t\t\t\tMADISON\n\t\tHe didn't know about the neural\n\t\ttoxin.\n\t\t\t(a beat)\n\t\tI did.\n\n\t\t\t\tPARKER\n\t\t(matter-of-factly) You knew the\n\t\tentire time? Can you give me one\n\t\tgood reason why I shouldn't kill\n\t\tyou right now?\n\n\t\t\t\tCOX\n\t\tShe saved your life, Parker. She\n\t\tdidn't have to, but she did.\n\n\t\t\t\tPARKER\n\t\t\t(turning to Madison)\n\t\tThen I guess we're even.\n\n\t\t\t\tMADISON\n\t\t\t(a beat)\n\t\tHow did you find out about the\n\t\ttoxin?\n\n\t\t\t\tPARKER\n\t\tSid 6.7 told me after he killed the\n\t\ttwo guards. He suggested I kill you\n\t\trather than him.\n\n\t\t\t\tMADISON\n\t\tYou're not capable of it.\n\n\t\t\t\tPARKER\n\t\tI pose an unacceptable danger to\n\t\tthe public, remember?\n\n\t\t\t\tMADISON\n\t\tI was wrong.\n\t\t\t(a beat)\n\t\tAnd I was wrong not to tell you\n\t\tGrimes was part of Sid. I should\n\t\thave told you. I won't make the\n\t\tsame mistake again.\n\n\tShe means it. Parker turns away, looking at his wife's\n\theadstone.\n\n\t\t\t\tCOX\n\t\tThe son\u0097of\u0097a-bitch is still out\n\t\tthere, Parker.\n\n\tParker turns toward him slowly. Emotion beginning to return\n\tto his face.\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tWhen this is over, will you get\n\t\tthis goddam thing out of my head?\n\n\t\t\t\tCOX\n\t\tOn my life, I promise you I will.\n\n\t\t\t\tPARKER\n\t\tIf you're lying, I'll hunt you down\n\t\tand kill you myself.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE A CONSTRUCTION SIGHT\n\n\t6 PM. The human FOREMAN presses a remote control detonator.\n\n\tBOOM! An explosion occurs inside a building's foundation\n\n\t(STOCK FOOTAGE). The building is levelled instantly.\n\n\tSid 6.7, who's been watching the explosion, approaches the\n\tForeman.\n\n\t\t\t\tSID 6.7\n\t\t\t(applauding)\n\t\tBravo.\n\n\t\t\t\tFOREMAN\n\t\tWho the hell are you?\n\n\t\t\t\tSID 6.7\n\t\tSomeone who appreciates the\n\t\tartistic value of high\u0097explosives.\n\n\tHe shoots the Foreman in the chest. Sid 6.7 relieves him of\n\this keys and heads to an explosives storage shed.\n\n\t\t\t\t\tCUT TO:\n\n\tSID 6.7\n\n\tcarrying a crate of C-4 high-explosives out of the shed in\n\tthe construction sight minutes later. He adds it to the dozen\n\tcrates already loaded in a truck. And takes off.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE A LARGE SEWER PIPE\n\n\tSid 6.7 secures several crates of C\u00974 to an automated sewer\n\tcleaning vehicle. He schedules its start time \u0097\u0097 24 hours\n\tfrom now. It is now 7:45 PM. The bomb's TIMER is set to\n\tdetonate 15 minutes into the vehicle's journey -- at 8:00 PM\n\ttomorrow night.\n\n\t\t\t\tSID 6.7\n\t\t\t(admiring his work)\n\t\tYou think you know me, but you\n\t\tdon't have any idea who I really\n\t\tam...\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE THE BILTMORE HOTEL\n\n\tsight of Mayor Bennett's upcoming Re-Election Rally, Cox\n\tsupervises an army of L. A. P. D. officers who are securing\n\tthe area. Bomb\u0097sniffing dogs. Rooftop snipers. Helicopter\n\tsurveillance. Nothing is being left to chance.\n\n\tAnyone doing anything within 100 yards of the building is\n\tsearched, including the REPORTERS and their CAMERA CREWS\n\tcovering the convention's security.\n\n\tPARKER AND MADISON\n\n\tsurvey the scene with binoculars from amid a crowd of\n\tpedestrians two blocks away. Both are disguised in hats and\n\tdifferent clothing. You don't immediately recognize them.\n\n\t\t\t\tMADISON\n\t\tThe rally's a little obvious as a\n\t\ttarget, don't you think?\n\n\t\t\t\tPARKER\n\t\tI told you before, Grimes liked to\n\t\tbe obvious.\n\n\t\t\t\tMADISON\n\t\tSid 6.7 isn't Grimes.\n\n\t\t\t\tPARKER\n\t\tPart of him is.\n\n\tVarious faces in the crowd on the sidewalk. In the vehicles\n\tpassing on the street. On the bridge crossing the street down\n\tthe block further away from the hotel.\n\n\t\t\t\tMADISON (V. 0.)\n\t\tIf we find Sid, Lindenmeyer won't\n\t\tbe far behind.\n\n\t\t\t\tPARKER (V. 0.)\n\t\tThink he's keeping track of his\n\t\tcreation?\n\n\t\t\t\tMADISON (V. 0.)\n\t\tThat, or living through him...\n\n\tPARKER\n\n\tputs down his binoculars. Madison does not.\n\n\t\t\t\tPARKER\n\t\tSee something?\n\n\t\t\t\tMADISON\n\t\tI'm not sure...on the bridge...the\n\t\tguy at the payphone...\n\n\tShe points to what she's looking at. Looking through his\n\tbinoculars, he still can't see what she means. She helps him\n\taim his binoculars.\n\n\tPARKER'S POV -- THROUGH BINOCULARS\n\n\tHe scans the bridge. Finally settling on Sid 6.7, who is\n\ttalking on a payphone.\n\n\tON THE STREET\n\n\tParker looks up from his binoculars. Impressed.\n\n\t\t\t\tPARKER\n\t\tNice work.\n\n\t\t\t\tMADISON\n\t\t\t(a beat)\n\t\tThanks.\n\n\tThey move briskly down the block toward the bridge. Quickly\n\tclimbing a set of stairs.\n\n\tON A ROOFTOP\n\n\tParker and Madison's movement catches the attention of\n\tseveral snipers.\n\n\t\t\t\tSNIPER #1\n\t\tWell, look who we have here...\n\n\t\t\t\tSNIPER #2\n\t\t\t(into radio)\n\t\tParker Barnes is heading south\n\t\ttoward the bridge. If anybody can\n\t\tget a clean shot at him, take it.\n\n\tCOX\n\n\thears the order over his radio headset. He races toward the\n\tbridge. As do a dozen other cops.\n\n\tON THE BRIDGE\n\n\tSid 6.7 talks into the payphone.\n\n\t\t\t\tSID 6.7\n\t\tBe a reporter \u0097\u0097 figure it out for\n\t\tyourself. All I'm going to tell you\n\t\tis that at 8:00 tomorrow night, I\n\t\twill become legendary...\n\n\tPARKER AND MADISON\n\n\treach the top of the stairs. Sid 6.7 remains on the phone,\n\this back toward Parker and Madison. They split-up, winding\n\ttheir way through the crowd waiting for an arriving bus.\n\n\tAs the bus pulls to the stop, the awaiting passengers move\n\ttoward the opening doors. Obscuring Parker's view of the\n\tpayphone.\n\n\tParker shoves his way through the crowd, only to see Sid 6.7\n\tholding Madison in front of him, his gun to her head. Parker\n\ttrains his weapon at Sid 6.7. He doesn't have a clean shot.\n\n\t\t\t\tSID 6.7\n\t\t\t(to Parker)\n\t\tBrings back memories, doesn't it?\n\n\tTHROUGH A SNIPER'S RIFLE SCOPE\n\n\tParker's chest is put into the cross-hairs as the bus pulls\n\taway from the stop. He is focused on Parker, and Parker only.\n\n\tTHE SNIPER\n\n\tis some 300 yards away on a rooftop. His rifle is mounted on\n\ta tripod. His aim is perfectly steady.\n\n\t\t\t\tSNIPER\n\t\t\t(into his radio headset)\n\t\tSay good\u0097bye, Parker Barnes...\n\n\tParker stands frozen, staring at Sid 6.7 through his gun\n\tsight. Looking for just an inch of him to stick out from\n\tbehind Madison's terrified face.\n\n\t\t\t\tSID 6.7\n\t\t\t(to Parker)\n\t\tI wouldn't pull the trigger if I\n\t\twere you\u0097\u0097\n\n\t\t\t\tPARKER\n\t\tWhy's that?\n\n\tCox advances toward Sid 6.7 from the side of the bridge.\n\tCox's gun out and ready. His finger on the trigger.\n\n\t\t\t\tCOX\n\t\tHey, Sid, what were you planning on\n\t\tdoing with the C-4?\n\n\tSid 6.7 turns his head in surprise toward Cox as a rifle is\n\tFIRED in the distance. Cox steps directly in the sniper's\n\tline-of-fire and takes the bullet meant for Parker through\n\tthe chest. Cox drops to the bridge.\n\n\t\t\t\tPARKER\n\t\tNOOOOOO!\n\n\tHe rushes to Cox. Parker drops to his knees, cradling Cox's\n\thead. Cox isn't long for this earth. Looking up to Parker, he\n\ttries to talk. But nothing comes out.\n\n\t\t\t\tPARKER (CONT'D)\n\t\t\t(compassionately)\n\t\tDon't worry, I know. I know.\n\n\tCox's eyes roll back in his head. Parker then closes them and\n\tgently lays his head on the sidewalk.\n\n\tParker turns his head toward Sid 6.7, who's released Madison\n\tand is jumping over a railing to the street 20 feet below.\n\tParker rushes to the railing.\n\n\t\t\t\tHIS POV\n\t\tSid 6.7 lands on top of a garbage\n\t\ttruck passing beneath the bridge.\n\t\tThe garbage truck disappears\n\t\tbeneath the bridge.\n\n\tON THE BRIDGE\n\n\tA dozen cops advance toward Parker. Weapons drawn.\n\n\t\t\t\tCOP #4\n\t\tFreeze!\n\n\tParker ignores them. He bolts across the street, moving in\n\tthe same direction as the bus below. Through speeding\n\ttraffic.\n\n\tBullets fly. Parker keeps charging. Right in front of a\n\tmoving van barreling across the bridge. The cops lose sight\n\tof Parker.\n\n\t\t\t\tCOP #5\n\t\tThink he made it?\n\n\tON THE OTHER SIDE OF THE BRIDGE\n\n\tParker dives onto the sidewalk, avoiding the speeding van by\n\tinches. Getting to his feet, he launches himself up and over\n\tthe railing...\n\n\tON THE STREET\n\n\tThe garbage truck passes beneath Parker as he leaps from the\n\tbridge.\n\n\tON TOP OF THE GARBAGE TRUCK\n\n\tParker lands on the back of the truck. Right next the opening\n\tand-closing steel jaws of the truck's massive trash\n\tcompactor. His gun tumbles from his hand, falling to the\n\tstreet.\n\n\tSid 6.7 dives on top of Parker, putting him flat on his\n\tstomach. And his face against the steel teeth. Sid 6.7 chokes\n\tParker. Hard.\n\n\t\t\t\tSID 6.7\n\t\tI have to tell you, I do enjoy you,\n\t\tParker. I really don't want to have\n\t\tto kill you...\n\n\tThe sanitation worker at the wheel of the truck has no idea\n\twhatsoever what is happening on top of his truck.\n\n\t\t\t\t\tCUT TO:\n\n\tTHE DOZEN OF COPS\n\n\twho had been on the bridge, charging down the steps after the\n\tgarbage truck, which can no longer be seen.\n\n\tMadison walks calmly behind them. Scanning the crowd. Looking\n\tfor Lindenmeyer. Her every instinct telling her he's here. He\n\tmust be.\n\n\tShe spots him. Veering from the direction the cops headed in,\n\tMadison casually wades into the crowd. She takes out her\n\n\tweapon and stops behind Lindenmeyer. Even in disguise, he\n\tlooks familiar. Madison puts her gun against his back.\n\n\t\t\t\tMADISON\n\t\t\t(whispering into his ear)\n\t\tI figured you'd show up sooner or\n\t\tlater...\n\n\t\t\t\t\tCUT TO:\n\n\tON TOP OF THE GARBAGE TRUCK\n\n\tParker and Sid 6.7 continue battling next to the compactor's\n\tlethal jaws. The machine makes an awful, grinding sound. Not\n\tunlike the sounds Parker and Sid 6.7 are making. The fight is\n\tprimal. Savage. And moving at 30 miles-per-hour.\n\n\t\t\t\tPARKER\n\t\tWhat C-4...was Cox talking about?\n\n\t\t\t\tSID 6.7\n\t\tLet me put it to you this way...\n\t\twhether I'm here...or whether I'm\n\t\tnot...I'm leaving an indelible mark\n\t\ton the world tomorrow night.\n\n\t\t\t\tPARKER\n\t\tWhere did you plant the C-4?!\n\n\tHe should concentrate more on fighting, and less on asking\n\tquestions, because he's losing. Parker takes a wicked shot to\n\tthe face, and then the groin. Sid 6.7 holds Parker's head\n\tbetween the compactor's jaws. Which are closing.\n\n\tWith every last ounce of effort he has, Parker hurls his legs\n\tup into Sid 6.7. Which throws Sid 6.7 into the compactor.\n\n\tThe steel jaws immediately close in on Sid 6.7, who\n\tfrantically tries to climb out. He gets his hands out. Then\n\this head. But that's about it.\n\n\tWithout emphasizing graphic detail, Sid 6.7 is decapitated.\n\tHis lifeless body drops back into the compactor.\n\n\tHis head tumbles to the street. The force of the impact\n\tcauses the Sid 6.7 character module to separate from the\n\tneural net.\n\n\tThe character module scatters into the street. Parker\n\timmediately jumps off the truck after it.\n\n\tON THE STREET\n\n\tParker's landing isn't pretty. Finally getting to his feet,\n\the sees the Sid 6.7 character module is about to be run over.\n\n\tParker dives for it, nearly getting run over himself.\n\n\tThe approaching car SCREECHES to a halt next to him. It's\n\tdriven by Lindenmeyer. At gunpoint. Madison sits behind him,\n\ther gun to his head.\n\n\tWHAM! The car behind them obviously wasn't prepared to stop\n\tso quickly. The bumpers of the two cars are now intertwined.\n\tNeither vehicle will be going anywhere soon.\n\n\tMadison pulls Lindenmeyer roughly out of the car. She drags\n\thim to Parker, who is still on his knees, clutching the Sid\n\t6.7 character module. SIRENS approach in the distance.\n\n\t\t\t\tMADISON\n\t\t\t(to Parker)\n\t\tFind out anything?\n\n\t\t\t\tPARKER\n\t\tA bomb's going off tomorrow night,\n\t\tbut I have no idea where.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(a beat)\n\t\tThere is only one way to get any\n\t\tmore information out of Sid 6.7...\n\n\tThey scan the area for a new mode of transport. And find one\n\tstopped at a dumpster down the block: the garbage truck.\n\n\tOUTSIDE THE GARBAGE TRUCK\n\n\tParker quickly explains the situation to the sanitation\n\tworker while Madison motions Lindenmeyer into the cab with\n\ther gun. As Parker climbs up to her, Madison shuts the door\n\tto give them a moment of privacy.\n\n\t\t\t\tMADISON\n\t\tCan I ask you something?\n\n\t\t\t\tPARKER\n\t\t\t(with a smile)\n\t\tYou mean there's something you\n\t\thaven't asked me?\n\n\t\t\t\tMADISON\n\t\t\t(a beat)\n\t\tYou've already fulfilled the terms\n\t\tof your pardon. You stopped Sid 6.7\n\t\tand you've got his module. You're\n\t\tfree to go \u0097\u0097 right now.\n\t\t\t(a beat)\n\t\tWhy are you going to do this?\n\n\t\t\t\tPARKER\n\t\tYou don't know?\n\n\t\t\t\tMADISON\n\t\t\t(shaking her head)\n\t\tThat's why I'm asking.\n\n\t\t\t\tPARKER\n\t\tBecause this pain\u0097in\u0097the\u0097ass\n\t\tcriminal psychology expert has\n\t\thelped me understand what I'm\n\t\tcapable of. And what I'm not.\n\t\t\t(a beat)\n\t\tAnd better than anyone else, I am\n\t\tcapable of stopping Sid 6.7.\n\n\t\t\t\t\tCUT TO:\n\n\tON TOP OF THE GARBAGE TRUCK\n\n\tParker lands on the back of the truck. Right next the\n\topening\u0097and\u0097closing steel jaws of the truck's massive trash\n\tcompactor. His gun tumbles from his hand, falling to the\n\tstreet.\n\n\tThis sequence is IDENTICAL to the one you previously\n\twitnessed. It is as if we've jumped back in time.\n\n\tSid 6.7 dives on top of Parker, putting him flat on his\n\tstomach. And his face against the steel teeth. Sid 6.7 chokes\n\tParker. Hard.\n\n\t\t\t\tSID 6.7\n\t\tI have to tell you, I do enjoy you,\n\t\tParker. I really don't want to have\n\t\tto kill you...\n\n\tThe sanitation worker at the wheel of the truck has no idea\n\twhatsoever what is happening on top of his truck.\n\n\tParker and Sid 6.7 battle next to the compactor's lethal\n\tjaws. The machine makes an awful, grinding sound. Not unlike\n\tthe sounds Parker and Sid 6.7 are making. The fight is\n\tprimal. Savage. And moving at 30 miles-per\u0097hour.\n\n\t\t\t\tPARKER\n\t\tWhat C-4...was Cox talking about?\n\n\t\t\t\tSID 6.7\n\t\tLet me put it to you this way...\n\t\twhether I'm here... or whether I'm\n\t\tnot...I'm leaving an indelible mark\n\t\ton the world tomorrow night.\n\n\t\t\t\tPARKER\n\t\tWhere did you plant the C-4?!\n\n\tHe should concentrate more on fighting, and less on asking\n\tquestions, because he's losing. Parker takes a wicked shot to\n\tthe face, and but then blocks the anticipated shot to his\n\tgun.\n\n\tSid 6.7 still manages to put Parker's head between the\n\tcompactor's jaws. Which are closing.\n\n\tWith every last ounce of effort he has, Parker hurls his legs\n\tup into Sid 6.7. Which throws Sid 6.7 into the compactor.\n\n\tSid 6.7 frantically tries to climb out of the compactor as\n\tthe steel jaws close in on him. He gets his hands out. Then\n\this head...\n\n\tExcept Parker now does something different. Just before Sid\n\t6.7 is decapitated, Parker jams a metal rod between the\n\tcompactor's steel teeth. Then grabs Sid 6.7 by the throat.\n\n\t\t\t\tPARKER\n\t\t\t(fiercely)\n\t\tYou can't die until you tell me\n\t\twhere the C-4 is. Where is it?!\n\n\t\t\t\tSID 6.7\n\t\t\t(choking)\n\t\tMy...secret.\n\n\tHe SLAMS the back of his head into Parker's nose. Breaking\n\tit. Parker reels back in pain.\n\n\tSid 6.7 squeezes out from within the steel teeth. The jagged\n\tmetal cutting into him, striping him with blood. The blood\n\tthen begins to retract. Sid 6.7's wounds, once again, heal\n\tthemselves.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tToo bad you can't regenerate...\n\n\tAs the truck slows at an intersection, he jumps to the\n\tstreet. Parker goes after him. Still in excruciating pain. WE\n\tPULL BACK TO REVEAL what you are seeing is\n\n\tON A MONITOR\n\n\tThe scene continues seamlessly. As you may now be guessing,\n\tthe monitor is connected to the simulator\n\n\tINSIDE LINDENMEYER'S STATION IN LETAC\n\n\tParker lies unconscious on a bed. He is connected to the\n\tsimulator via the neural connectors in the polyurethane skull\n\tcap, just like he was before.\n\n\tThe Sid 6.7 character module is plugged into the system's\n\tmain console. Lindenmeyer sits at the controls. Madison next\n\tto him, her gun aimed at Lindenmeyer's head.\n\n\tThey are both watching Parker chase Sid 6.7 on the monitor in\n\tfront of them. Parker continues experiencing intolerable\n\tpain. A clock reads 4:00 AM. They are the only ones inside\n\tthe entire facility.\n\n\t\t\t\tLINDENMEYER\n\t\tI told you this would work.. By\n\t\tsetting back the clocks, he has\n\t\tabsolutely no idea he's in virtual\n\t\treality. He still thinks he's in\n\t\tthe real world.\n\n\t\t\t\tMADISON\n\t\t\t(a beat)\n\t\tWhat's wrong with Parker?\n\n\t\t\t\tLINDENMEYER\n\t\t\t(innocently)\n\t\tHow should I know?\n\n\t\t\t\tMADISON\n\t\t\t(getting an idea)\n\t\tShow me his physical sensory level.\n\n\tShe clicks back the hammer of her gun and presses the barrel\n\tagainst Lindenmeyer's ear. He does as told. On a panel by the\n\tconsole, you read: PARTICIPANT PHYSICAL SENSORY LEVEL: 670%.\n\n\t\t\t\tLINDENMEYER\n\t\tI wonder how that...\n\n\t\t\t\tMADISON (CONT'D)\n\t\tTurn it down!\n\n\tLindenmeyer adjusts the sensory level back down to 100%.\n\n\tON A MONITOR\n\n\tParker immediately returns back to normal. His pace picks up.\n\tHe starts closing the gap between him and Sid 6.7 as he races\n\tinto a shopping mall.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE SHOPPING MALL\n\n\tThe place is a seven\u0097story mecca of shopping. An atrium\n\tallows you to look from the ground floor up to the seventh.\n\tSid 6.7 rushes up the escalators. Going up to the second\n\tfloor. Then the third.\n\n\tParker follows suit climbing escalator after escalator.\n\n\tThrowing people out of his way.\n\n\tON THE SEVENTH FLOOR\n\n\twhich is also the highest, Sid 6.7 veers out of view. Parker\n\traces up the final steps to the seventh floor. Sid 6.7 is\n\tnowhere to be seen.\n\n\tParker searches methodically. Efficiently. He finally spots\n\tSid 6.7. Who has Parker's head lined-up perfectly in his gun\n\tsight. Parker is a sitting duck. BOOM!\n\n\tParker dives behind AFFLUENT SHOPPER 2.1, who takes a bullet\n\tin his ascot. Parker quickly grabs him, and uses his body as\n\ta shield against Sid 6.7's constant gunfire until Parker\n\tarrives behind a marble column.\n\n\t\t\t\tSID 6.7\n\t\t\t(surprised at Parker's\n\t\truthlessness)\n\t\tWe really aren't that different,\n\t\tare we?\n\n\tWhat he cannot see is that behind the column, Affluent\n\tShopper 2.1 is Auto Resetting. Parker puts his gun to the\n\tshopper's head.\n\n\t\t\t\tPARKER\n\t\t\t(whispering)\n\t\tDon't move, and don't make a sound.\n\t\tGot it?\n\n\tAffluent Shopper 2.1 nods his head repeatedly. Parker\n\tcollects himself behind the column, then pivots out from\n\tbehind it. Firing in Sid 6.7's direction. Each bullet finds\n\tits mark.\n\n\tAbsorbing the blows, Sid 6.7 backs up against the atrium\n\trailing. Taking one final shot, he falls backward. Over the\n\trailing.\n\n\tPARKER'S POV\n\n\tSid 6.7 tumbles through the atrium. Out of control.\n\n\tSpeeding toward the ground seven floors below.\n\n\tSID 6.7'S POV\n\n\tThe sense of momentum is exhilarating. And terrifying. If you\n\tget dizzy easily, close your eyes.\n\n\tFROM THE FIRST FLOOR\n\n\tSid 6.7 falls through the atrium like a rock directly at you.\n\tA 200 pound rock. WHAM!!!\n\n\tHe lands face down in the marble floor. The impact is bone\u0097\n\tcrushing. Sid 6.7 does not move.\n\n\tUntil he begins to regenerate. His fluids begin returning to\n\this body. His bones regaining proper form. Within seconds,\n\this body appears as good as new.\n\n\t(Technically, because this is VR1 the proper term would be\n\tAuto. Reset. But since Sid 6.7 thinks he's in the real world,\n\tregenerating is what he thinks he's doing.)\n\n\tSid 6.7 stands, dusting himself off.\n\n\t\t\t\tSID 6.7\n\t\tMan, what a rush.\n\t\t\t(yelling up to Parker)\n\t\tAdios, amigo!\n\n\tGrabbing his gun, he takes off out of the lobby.\n\n\tON THE SEVENTH FLOOR\n\n\tParker retrieves his gun, then bolts down the escalators.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE LETAC\n\n\tMadison and Lindenmeyer watch Parker on screen. Madison still\n\thas her gun trained on Lindenmeyer, who notices a WARNING\n\tLIGHT start to flash. He turns to Parker's unconscious body\n\tlying on the bed. Lindenmeyer looks concerned.\n\n\t\t\t\tMADISON\n\t\tWhat's wrong?\n\n\tLindenmeyer checks several readings on his console.\n\n\t\t\t\tLINDENMEYER\n\t\tHe's developing a hemisphere\n\t\timbalance.\n\n\t\t\t\tMADISON\n\t\tTalk so I can understand.\n\n\t\t\t\tLINDENMEYER\n\t\tIf I don't adjust the level of\n\t\tneural information each side of his\n\t\tbrain is receiving, he won't be\n\t\table to walk when I take him out of\n\t\tVR.\n\n\t\t\t\tMADISON\n\t\tThen fix it.\n\n\tAs Lindenmeyer moves to Parker, Madison stays right with him.\n\tHer gun aimed at Lindenmeyer's head. Lindenmeyer carefully\n\tremoves one of the neural connectors from Parker's skull cap.\n\tBefore removing another, he looks for a safe place to put the\n\tconnector.\n\n\t\t\t\tLINDENMEYER\n\t\tI need you to hold this. It can't\n\t\tget any dirt on it.\n\n\tMadison is reluctant, but doesn't know what else to do.\n\tLindenmeyer slowly gives the neural connector to her free\n\thand.\n\n\t\t\t\tLINDENMEYER (CONT ' D)\n\t\tAll you have to do is hold the\n\t\tneedle at the base. Just make sure\n\t\tnot to jab yourself with the\n\t\tpoint...\n\n\tShe clutches the needle in her left hand while aiming her gun\n\twith her right. Lindenmeyer removes a second neural connector\n\tfrom Parker's skull.\n\n\tHolding this second needle at the base, Lindenmeyer makes\n\tseveral adjustments on the neural management computer, then\n\tmoves slowly back to Madison.\n\n\t\t\t\tLINDENMEYER (CONT'D)\n\t\tHand me the connector nice and...\n\n\tHe suddenly jabs his neural connector into Madison's right\n\tforearm. Madison has no time to react. 10,000 volts of\n\telectricity instantly courses through her body.\n\n\tMadison drops to the floor, unconscious. The needle she had\n\tbeen holding falls from her grasp, breaking the circuit. She\n\tstops being electrocuted. Which saves her life.\n\n\t\t\t\tLINDENMEYER (CONT' D)\n\t\t\t(as Sid 6.7 had said)\n\t\tGod, some people are stupid.\n\n\tHe sits back down at the simulator's main console, and starts\n\tto type commands. On the monitor, Parker is visible exiting\n\tthe shopping mall.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE THE SHOPPING MALL\n\n\tParker races out the door. BOOM! That was left knee cap. He\n\ttumbles to the street. His gun flying from his hand.\n\n\tParker crawls desperately toward his weapon. But not fast\n\tenough. Sid 6.7 arrives at the weapon first.\n\n\t\t\t\tSID 6.7\n\t\tSo close, and yet, so far...\n\n\tHe kicks the weapon down the sidewalk, then points his gun at\n\tParker's head.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tIt's really too bad you have to\n\t\tmiss the Grand Finale.\n\n\t\t\t\tPARKER\n\t\tI thought you liked me being in the\n\t\taudience. Don't you want me to see\n\t\tit?\n\n\tSid 6.7 pauses to think about it.\n\n\t\t\t\tSID 6.7\n\t\t\t(considering the idea)\n\t\tYou know, I do want you to see it.\n\n\tHe shoots Parker in his other knee cap, rendering both of his\n\tlegs useless.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tI want you to have a bird's eye\n\t\tview...\n\n\tOUTSIDE THE NEWLY-CONSTRUCTED HOLLYWOOD TOWER\n\n\tA 67 story monument to engineering brilliance in this land of\n\tearthquakes. 6:30 PM.\n\n\tON THE ROOF OF THE HOLLYWOOD TOWER\n\n\tThe view is incredible. You can see from the Pacific to\n\tdowntown. From LAX to the Hollywood Bowl. Smog must be\n\tgetting better in the near future.\n\n\tSid 6.7 ties Parker to a chair at the roof's very edge. He is\n\tfacing downtown. Including the Biltmore Hotel, the location\n\tof Mayor Bennett's Re\u0097Election Rally.\n\n\t\t\t\tSID 6.7\n\t\tThere you go \u0097\u0097 best seat in the\n\t\thouse.\n\n\t\t\t\tPARKER\n\t\t\t(with some surprise)\n\t\tYou are going after Mayor Bennett.\n\n\t\t\t\tSID 6.7\n\t\tLet's just say I'm sending a very\n\t\tclear message to his Re\u0097Election\n\t\tRally...\n\n\tHe walks toward an open stairway door behind them.\n\n\t\t\t\tPARKER\n\t\tAren't you going to watch with me?\n\n\t\t\t\tSID 6.7\n\t\tI've got some final preparations to\n\t\ttake care of\u0097\u0097 Checking his watch,\n\t\the stops suddenly.\n\n\tON HIS WATCH\n\n\tTime is moving backwards. Literally.\n\n\tON THE ROOF OF THE HOLLYWOOD TOWER\n\n\tSid 6.7 pauses, then goes over to Parker and checks his\n\twatch. It is also moving backwards. A smile of realization\n\tspreads slowly across Sid 6.7's face as he admires the\n\tbeautiful sky above him.\n\n\t\t\t\tSID 6.7\n\t\t\t(as if to God)\n\t\tThank-you, Daryl.\n\t\t\t(turning to Parker)\n\t\tYou had me going for quite a while\n\t\tthere, sport.\n\n\t\t\t\tPARKER\n\t\tWhat are you talking about?\n\n\t\t\t\tSID 6.7\n\t\tI really did think I was still in\n\t\treality. At least, until now.\n\t\t\t(looking upward)\n\t\tBeam me up, Scotty!\n\n\tHis body DISINTEGRATES before your eyes. It's electronic\n\tparticles form into an amorphous cloud. Which disappears from\n\tview.\n\n\t\t\t\tPARKER\n\t\t\t(yelling)\n\t\tMadison, get me out of here!\n\t\tMADISON!\n\n\tLindenmeyer watches Parker scream on the monitor. Madison\n\tremains unconscious on the floor behind him.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(to the monitor)\n\t\tShe's taking a nap at the moment.\n\n\tHe types a set of instructions into the console and hits\n\tENTER.\n\n\t\t\t\tLINDENMEYER (CONT' D)\n\t\tBut don't worry. You won't be alone\n\t\tfor very long. Fairly soon, you'll\n\t\tbe dead.\n\n\tHe removes the Sid 6.7 character module from its slot and\n\texits the station.\n\n\tON THE ROOF OF THE HOLLYWOOD TOWER\n\n\tOne side of Parker's chair gradually starts to rise. Parker\n\tlooks down to see the roof surrealistically swelling beneath\n\this chair. This could only happen in virtual reality.\n\n\tIn a matter of minutes, he is going to be thrown over the\n\troof's edge. The next stop is 693 feet down.\n\n\tINSIDE LETAC\n\n\tParker's screams for help ECHO throughout the facility. But\n\tthere is no one there to hear him.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE LETAC\n\n\tThe garbage truck is parked in a loading dock. Lindenmeyer\n\tclimbs awkwardly onto the truck, then into the compactor.\n\n\tINSIDE THE GARBAGE TRUCK COMPACTOR\n\n\tLindenmeyer wades through trash until he comes upon Sid 6.7's\n\theadless body. The polymer neural net visible within its\n\tneck. Lindenmeyer inserts Sid 6.7's character module into its\n\tgelatinous base. But nothing happens.\n\n\t\t\t\tLINDENMEYER\n\t\tCome on, live. Live!\n\n\tThe synthetic nervous system begins to crackle with life.\n\tGrowing around the module. Forming the beginnings of a new\n\thead. Literally.\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\tsitting precariously on the increasingly-uneven roof of the\n\tHollywood Tower in virtual reality. Unable to break free of\n\this binds, he rocks the chair onto its side.\n\n\tHe and the chair fall to the roof, which will keep him from\n\tfalling to his death for another minute, if he's lucky.\n\n\t\t\t\tPARKER\n\t\tMADISON!!!\n\n\tINSIDE LINDENMEYER'S STATION\n\n\tMadison, still unconscious on the floor, finally stirs. Maybe\n\tParker's screaming is finally reaching her. Or at least,\n\tstarting to.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE GARBAGE TRUCK COMPACTOR\n\n\tLindenmeyer looks on with awe as Sid 6.7 grows a new head\n\tright before your eyes. You've never seen anything like it.\n\n\tSid 6.7's resulting head is slightly off center. His skin\n\ttone isn't perfect, nor is his color, but at least its\n\tfunctional. Sid 6.7 admires himself in a broken mirror.\n\n\t\t\t\tSID 6.7\n\t\tI am beautiful, aren't I?\n\n\t\t\t\tLINDENMEYER\n\t\tOf course you are.\n\n\tSid 6.7 wades through the trash toward Lindenmeyer.\n\n\t\t\t\tSID 6.7\n\t\tHow can I ever thank\u0097you for\n\t\tbringing me back to life a second\n\t\ttime, Daryl?\n\n\t\t\t\tLINDENMEYER\n\t\tHelp me get out of here.\n\n\t\t\t\tSID 6.7\n\t\tGlad to...\n\n\tHe reaches out to give Lindenmeyer a hand, then grabs him by\n\tthe throat. Choking him. Lindenmeyer can't believe what is\n\thappening.\n\n\t\t\t\tLINDENMEYER\n\t\t\t(gagging)\n\t\tWhat...are you doing?!\n\n\tSid 6.7 takes Lindenmeyer's face gently in his hands.\n\n\t\t\t\tSID 6.7\n\t\tYou made me a composite of 183 of\n\t\tthe most vicious people who ever\n\t\tlived.\n\t\t\t(a beat)\n\t\tWhat do you think I'm doing?\n\n\t\t\t\tLINDENMEYER\n\t\tI'm begging you...please don't kill\n\t\tme! Please!\n\n\t\t\t\tSID 6.7\n\t\t\t(reassuringly)\n\t\tDon't worry. Through me, you will\n\t\tlive forever...\n\n\tAs Lindenmeyer begins to scream, we\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\thanging on by his fingertips to the bulbous roof of the\n\tHollywood Tower. He's going to fall at any second.\n\n\t\t\t\t\tCUT TO:\n\n\tMADISON'S BLURRY POV\n\n\tof someone entering Lindenmeyer's station in LETAC. You can't\n\ttell who it is, at first. But you can see the person is male.\n\tAnd wearing Lindenmeyer's pants. You now see the person is\n\tSid 6.7.\n\n\tINSIDE LINDENMEYER'S STATION\n\n\tMadison forces herself into consciousness.- Or as close to it\n\tas she can get. Her expression is one of complete and utter\n\tterror.\n\n\t\t\t\tSID 6.7\n\t\tDr. Carter \u0097\u0097 I've been hoping we'd\n\t\tget a moment together...\n\n\tMustering her strength, she manages to crawl behind several\n\tof the computers which make up the simulator. Sid 6.7\n\tadvances calmly toward her.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\tYou know so much about me, I was\n\t\thoping to learn a little bit about\n\t\tyou. You see, I'm doing research,\n\t\ttoo...\n\n\tHe looks behind the computers where you last saw Madison.\n\n\tShe is no longer there. Sid 6.7 begins searching for her.\n\n\tHe passes a virtual reality monitor on which Parker can be\n\tseen clinging for life.\n\n\t\t\t\tSID 6.7 (CONT'D)\n\t\t\t(to the monitor)\n\t\tHang in there, Parker.\n\n\tOn the monitor, Parker looks all around him, trying to\n\tdetermine the voice's origin.\n\n\tMadison crawls out of Lindenmeyer's station. Sid 6.7 just\n\tcatches sight of her, and goes after her.\n\n\tINSIDE LETAC\n\n\tMadison crawls into a darkened engineer's station and hides.\n\tShe is still very dizzy. And trying to keep the sound of her\n\tbreathing to a minimum.\n\n\tSid 6.7 enters quietly. A hunter on the prowl. Moving very\n\tslowly. Then lunging very swiftly. He continues the hunt.\n\n\tIf Madison is discovered, she doesn't have a prayer. Her\n\theart pounds. Her forehead perspires. Sid 6.7 is getting\n\tcloser.\n\n\tSid 6.7 checks inside closets. Cabinets. Anywhere large\n\tenough for a human being to fit. He is practically standing\n\tover her. Looking. Listening.\n\n\t\t\t\tSID 6.7\n\t\tHow does it feel to know you're\n\t\tgoing to die? What are you thinking\n\t\tabout?\n\n\tLights in the building suddenly come on. Several engineers\n\tcan be heard entering. It's 8 AM \u0097\u0097 the start of a new day.\n\tThe facility is quickly becoming populated.\n\n\tAfter giving one last look around, Sid 6.7 reluctantly gives\n\tup the hunt, and exits. Madison does not move until she is\n\tcertain Sid 6.7 has left the building.\n\n\t\t\t\tPARKER (0.S.)\n\t\tSOMEBODY HELP!\n\n\tMadison scrambles out of her hiding place.\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER\n\n\tfinally losing his grip on the roof of the Hollywood Tower in\n\tvirtual reality. He plummets with accelerating speed.\n\n\tMadison bursts through the partition around Lindenmeyer's\n\tstation. Sacrificing her body. Without regard for pain.\n\n\tParker tumbles toward the sidewalk 67 stories below. The\n\tspeed is terrifying.\n\n\tMadison leaps over a table. Diving for the simulator's RETURN\n\tbutton.\n\n\tParker falls faster. And faster. The street just beneath him.\n\tThe instant before he slams into the street, his body DE\n\tMATERIALIZES.\n\n\tINSIDE LINDENMEYER'S STATION\n\n\tMadison keeps pressing the return button over and over,\n\tmaking sure it worked. Parker's eyes flutter as he returns to\n\tconsciousness. Madison rushes to him.\n\n\t\t\t\tMADISON\n\t\tYou okay?\n\n\t\t\t\tPARKER\n\t\t\t(shaking out the cobwebs)\n\t\t...I think so...You?\n\n\t\t\t\tMADISON\n\t\t\t(looking over her bruises)\n\t\tMore or less.\n\n\t\t\t\tPARKER\n\t\tLindenmeyer?\n\n\t\t\t\tMADISON\n\t\tMy guess is dead.\n\n\t\t\t\tPARKER\n\t\tSid?\n\n\t\t\t\tMADISON\n\t\tI don't know.\n\n\tSeveral engineers peek in curiously at them.\n\n\t\t\t\tMADISON (CONT'D)\n\t\tLet's get out of here.\n\n\tShe helps Parker to his feet.\n\n\t\t\t\t\tCUT TO:\n\n\tPARKER AND MADISON\n\n\tat a payphone outside a mini\u0097mall. Could be any one of the\n\t10,000 in Los Angeles. It's late morning.\n\n\t\t\t\tPARKER\n\t\t\t(on the phone)\n\t\tElizabeth Deane, please. Tell her\n\t\tit's Parker Barnes...\n\n\t\t\t\t\tINTERCUT WITH:\n\n\tINSIDE COX'S OFFICE\n\n\tElizabeth Deane picks up the phone.\n\n\t\t\t\tDEANE\n\t\tBarnes, where the hell have you\n\t\tbeen?!\n\n\t\t\t\tPARKER\n\t\tTrying to find out where the bomb\n\t\tis. Where the hell have you been?\n\n\t\t\t\tDEANE\n\t\tWhat did you find out?\n\n\t\t\t\tPARKER\n\t\tCall off the manhunt looking for\n\t\tme. I didn't kill the transport\n\t\tguards.\n\n\t\t\t\tDEANE\n\t\tIt's already been called off.\n\t\tWitnesses confirmed you weren't the\n\t\tshooter.\n\t\t\t(a beat)\n\t\tDid you find out where the bomb is?\n\n\t\t\t\tPARKER\n\t\tNo, but I've confirmed the\n\t\treelection rally is the target.\n\t\t\t(a beat)\n\t\tHow much C-4 is missing?\n\n\t\t\t\tDEANE\n\t\tEnough to level an entire city\n\t\tblock.\n\n\t\t\t\tPARKER\n\t\tIf I were you, I'd get every\n\t\tdemolition team in the city\n\t\tsearching in and around the\n\t\tBiltmore Hotel.\n\n\t\t\t\tDEANE\n\t\t(with frustration) Demolition teams\n\t\thave searched everywhere in and\n\t\taround the hotel. I don't know\n\t\twhere...\n\n\t\t\t\tPARKER\n\t\t\t(interrupting)\n\t\tSid is smart enough to know you'd\n\t\tcheck everywhere in the immediate\n\t\tarea. Whatever the device is, he's\n\t\tprobably got it timed to move into\n\t\tposition just before it detonates.\n\t\t\t(a beat)\n\t\tHave the demo teams check every\n\t\tsubway tunnel, water pipe, gas\n\t\tpipe, and sewer pipe that goes\n\t\tunder, over, or into the arena.\n\n\t\t\t\tDEANE\n\t\tYou know how much man power you're\n\t\ttalking about?\n\n\t\t\t\tPARKER\n\t\tYou're the highest law enforcement\n\t\tofficial in the country. Use the\n\t\tfucking army if you need to.\n\n\tHe hangs up the phone.\n\n\t\t\t\t\tCUT TO:\n\n\tDOZENS OF DEMOLITIONS TEAMS\n\n\tchecking every subway tunnel, water pipe, gas pipe, and sewer\n\tpipe that goes under, over, or into Dallas Arena. The effort\n\tis massive. Intensive. The clock is ticking. 6:00 and\n\tcounting.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE BILTMORE HOTEL, MAIN LOBBY\n\n\tThe area has been converted into a security checkpoint.\n\n\tEntrants are carefully scanned one\u0097by\u0097one. WE HEAR the rally\n\tOFF SCREEN.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE BILTMORE HOTEL\n\n\tSecurity is on extreme alert. Tension is very high. It's\n\t7:00. Parker, Madison, and Deane look on, anxiously. They\n\tlisten to a RADIO SCANNER monitoring the conversations\n\tbetween the demolitions teams.\n\n\t\t\t\tDEANE\n\t\t\t(to Parker)\n\t\tThis better not be a wild goose\n\t\tchase.\n\n\t\t\t\tPARKER\n\t\tOr what, you'll authorize my death\n\t\ta second time today?\n\n\t\t\t\tDEANE\n\t\t\t(sharply)\n\t\tDon't forget, convict, if this\n\t\tpsycho isn't stopped, you go right\n\t\tback to rotting in a prison cell.\n\n\t\t\t\tMADISON\n\t\tGive him a break, would you?\n\n\t\t\t\tMALE VOICE\n\t\t\t(from scanner)\n\t\tThis is demo team 27 leader. I\n\t\tthink we just found what we've been\n\t\tlooking for...\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE A LARGE SEWER PIPE\n\n\tA three\u0097man demolition team slowly, carefully disarms the\n\tbomb Sid 6.7 had secured to the automated sewer cleaning\n\tvehicle. Snip. One wire at a time. Snip.\n\n\tThe work is very delicate. Snip. One wrong move and it's all\n\tover. Snip.\n\n\t\t\t\tTEAM LEADER\n\t\tOne more and we're home free...\n\n\tSnip. The three members of the demo team look up proudly to\n\teach other. Breathing sighs of relief. It's 7:42.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE THE BILTMORE HOTEL\n\n\tParker, Madison, and Deane remain glued to their scanner.\n\n\t\t\t\tTEAM LEADER (V. 0.)\n\t\t\t(from scanner)\n\t\tHey folks, it's time to crack open\n\t\ta cold one.\n\n\tCheers are heard around the area from the other cops who'd\n\tbeen listening in.\n\n\t\t\t\tDEANE\n\t\tThank God.\n\n\t\t\t\tTEAM LEADER (V. 0.)\n\t\tThen again, maybe we ought to hold\n\t\toff for just a second...\n\n\t\t\t\tDEANE\n\t\t\t(with concern, into radio)\n\t\tWhat's the problem?\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE SEWER PIPE\n\n\tThe Team Leader carefully removes a piece of paper which had\n\tbeen taped to the timing mechanism. Written in handwriting,\n\tyou read: HEY, PARKER, THE FUN IS ONLY STARTING!\n\n\t\t\t\tTEAM LEADER\n\t\tThe good news is, we're finished\n\t\there. The bad news is...\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE THE BILTMORE HOTEL\n\n\tDeane stares at Parker with disbelief. Deane's Aide, holding\n\ta cellular phone, approaches Parker.\n\n\t\t\t\tAIDE\n\t\tYou've got a phone call.\n\n\tParker grabs the phone.\n\n\t\t\t\tPARKER\n\t\t\t(expecting it to be Sid)\n\t\tYou son-of\u0097a\u0097bitch, I'm going to\n\t\tkill you.\n\n\t\t\t\tALEXIEV (V. 0.)\n\t\t\t(through phone)\n\t\tMe? What did I do?\n\n\t\t\t\t\tINTERCUT WITH:\n\n\tINSIDE THE CAL TECH COMPUTER LAB\n\n\tAlexiev Borgen sits with a dismantled MAESTRO keyboard in\n\tfront of him.\n\n\t\t\t\tPARKER\n\t\t\t(a beat)\n\t\tI'm sorry, I thought you were\n\t\tsomebody else.\n\n\t\t\t\tALEXIEV\n\t\tI've discovered something about\n\t\tLindenmeyer'5 Maestro teaching tool\n\t\tI thought you should know... (a\n\t\tbeat) The harm done to the music\n\t\tstudents who used the device \u0097\u0097 it\n\t\twas not by accident. The machine\n\t\twas designed explicitly for that\n\t\tpurpose. Lindenmeyer intended to\n\t\thurt the kids using it.\n\n\t\t\t\tPARKER\n\t\tJesus Christ.\n\t\t\t(turning to Madison)\n\t\tI know who the dominant personality\n\t\tis.\n\t\t\t(a beat)\n\t\tLindenmeyer.\n\n\tMadison's reaction is one of panic. She bolts toward their\n\tsquad car with all the speed she has. Parker chases after\n\ther.\n\n\t\t\t\tPARKER (CONT'D)\n\t\tWhere the hell are you going?\n\n\t\t\t\tMADISON\n\t\tLindenmeyer never got over wanting\n\t\tto kill kids with more musical than\n\t\the had...\n\n\tShe gets into the driver's seat. Parker the passenger's.\n\tMadison punches the gas.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE HOLLYWOOD BOWL\n\n\tThe members of the L. A. Philharmonic tune-up for the\n\tevening's pay\u0097per\u0097view extravaganza. Several teenage\n\tmusicians sit with them.\n\n\tLights, cameras, and production trucks are all over the\n\tplace. This really is going to be one hell of a show.\n\n\t\t\t\tTV ANNOUNCER (V. 0.)\n\t\tJoining the Los Angeles\n\t\tPhilharmonic for this evening's\n\t\tfirst musical number will be\n\t\tseveral of the Los Angeles area's\n\t\tfinest, high school musicians...\n\n\tSID 6.7\n\n\twho is dressed in a tuxedo, knocking on the door to Guest\n\tConductor's Dressing Room.\n\n\t\t\t\tGUEST CONDUCTOR (0. 5.)\n\t\t\t(German accent)\n\t\tIt won't do any good to rush me. I\n\t\tneed my time to prepare myself.\n\n\tThe door is opened by the GUEST CONDUCTOR, who is dressed in\n\ta tuxedo, as well as large earrings. His hair is long and\n\tred. His complexion is pale, nearly white. And his eyes are\n\tpiercing green. You might describe this look as punk meets\n\tclassical.\n\n\t\t\t\tGUEST CONDUCTOR\n\t\t\t(annoyed beyond belief)\n\t\tAre you just going to stand there,\n\t\tor do you want something?\n\n\tShaking with concentration, Sid 6.7 turns his hair red.\n\t(Nano\u0097organisms can do this, as well as the following.) He\n\tthen grabs his hair and pulls it out, extending it to the\n\texact length of the guest conductor's. \n\n\tSid 6.7 then changes his complexion to match the conductor's.\n\tAs well as his eye color, and other facial features. The\n\tGuest Conductor can't believe his eyes.\n\n\tBy the time Sid 6.7 is finished modifying himself, he may not\n\tbe an exact duplicate of the guest conductor, but even his\n\tmother would have to look twice.\n\n\t\t\t\tSID 6.7\n\t\tIt's show time.\n\n\tHe shoves the Guest Conductor back into his Dressing Room.\n\tSid 6.7 follows him in, revealing a suppressed .38. He SLAMS\n\tthe door behind him.\n\n\t\t\t\t\tCUT TO:\n\n\tINSIDE THE SQUAD CAR\n\n\tMadison speeds recklessly through traffic toward the\n\tHollywood Bowl. Parker doesn't notice. He's totally focused\n\ton screaming into the police radio.\n\n\t\t\t\tPARKER\n\t\tListen to me, a bomb is planted\n\t\tsomewhere in the Hollywood Bowl!\n\t\tEvacuate everybody!\n\n\t\t\t\tFEMALE VOICE\n\t\tI'm sorry, sir, I don't have the\n\t\tauthorization to do that.\n\n\t\t\t\tPARKER\n\t\tThen put somebody on who does!\n\n\t\t\t\tMALE VOICE\n\t\tWhat's seems to be the problem?\n\n\t\t\t\tPARKER\n\t\tYou've got to stop the concert! A\n\t\tbomb is going to go off!\n\n\t\t\t\tMALE VOICE\n\t\tI'm sorry, sir, the concert has\n\t\talready started.\n\n\t\t\t\t\tCUT TO:\n\n\tTHE GUEST CONDUCTOR\n\n\twhose back is to the audience, leading the orchestra in a\n\ttruly magnificent performance of Tchaikovsky's Fifth Symphony\n\tinside the Hollywood Bowl.\n\n\tThe Guest Conductor waves his baton wildly. Passionately.\n\tBrilliantly. Getting the absolute best from the members of\n\tthe orchestra.\n\n\tThe musicians exhilarate in the challenge of being pushed to\n\ttheir musical limit.\n\n\tAs the Guest Conductor turns to the next page of his sheet\n\tmusic on the podium, you notice seven small, HIGH-FREQUENCY\n\tSENSORS above an upcoming musical measure.\n\n\tThe sensors are wired together. When the seven notes are\n\tplayed in sequence, an electrical pulse will be triggered\n\tdown the wires which run down the side of the podium, beneath\n\tthe stage.\n\n\tBENEATH THE STAGE\n\n\tThe wires connect to several crates of C\u00974 positioned beneath\n\tthe orchestra. These seven notes will be the last notes these\n\tmusicians ever play.\n\n\t\t\t\t\tCUT TO:\n\n\tOUTSIDE THE HOLLYWOOD BOWL\n\n\tMadison SCREECHES the vehicle to a halt. She comes within\n\tinches of mowing down several people. Madison and Parker bolt\n\tto the entrance, flashing their badges to the guards.\n\n\tINSIDE THE HOLLYWOOD BOWL\n\n\tThe Guest Conductor's movements grow even more intense. More\n\tdemanding. As he looks to the violin section, we now see the\n\tconductor's face. It is Sid 6.7.\n\n\t\t\t\tSID 6.7\n\t\t\t(silently)\n\t\tDon't hold back...Give it to me.\n\t\tGive it to me!\n\n\tThe orchestra plays with everything they've got. They hit\n\tevery note perfectly. Including a high C.\n\n\tON THE CONDUCTOR'S PODIUM\n\n\tThe first sensor is triggered. Then the second.\n\n\tPARKER AND MADISON\n\n\tappear at the back of the stage. Guns raised. Distracting the\n\tmusicians. As Parker and Madison charge through the horn\n\tsection toward Sid 6.7, the musicians stop playing.\n\n\tON THE CONDUCTOR'S PODIUM\n\n\tThe fifth sensor is triggered. Then the sixth...But not the\n\tseventh.\n\n\tSID 6.7\n\n\tcannot believe his eyes. Or his ears. The entire orchestra\n\thas stopped.\n\n\t\t\t\tSID 6.7\n\t\tCome on, play! PLAY!\n\n\tIn his rage, his face contorts \"past points\", which can only\n\tbe described bizarre, frightening, and not, something you\n\twould ever like to see when you look in the mirror.\n\n\tThe musicians stare at Sid 6.7, and then at Parker and\n\tMadison with concerned, confused silence. Which is broken by\n\tParker's gunfire.\n\n\tDucking behind the podium, Sid 6.7 desperately tries to\n\trewire the sensors to trigger manually. Without luck. He\n\ttakes his .38 out of his jacket and starts firing.\n\n\tPandemonium erupts throughout the Hollywood Bowl. Audience\n\tmembers run in every direction.\n\n\tThe members of the orchestra bolt for their very lives, but\n\tkeep their instruments with them. Even the oboist.\n\n\tPreventing Parker and Madison from taking any further shots\n\tat Sid 6.7.\n\n\tSid 6.7 bolts down into the crowd. Madison cannot get off a\n\tclean shot. Neither can Parker. He aims, but does NOT fire.\n\tHe and Madison struggle through the crowd after him.\n\n\tOUTSIDE THE HOLLYWOOD BOWL\n\n\tParker and Madison just catch a glimpse of Sid 6.7 as he\n\trushes up the entrance ramp to the Hollywood Freeway. Parker\n\tand Madison bolt after him.\n\n\tON THE HOLLYWOOD FREEWAY\n\n\tParker and Madison race past the cars waiting to merge into\n\twhat is effectively a parking lot. As is normal for this\n\tthoroughfare, traffic is at a standstill.\n\n\tSid 6.7 is nowhere to be seen. Parker and Madison split\u0097up,\n\twading through different lanes of traffic. Startling the\n\talready frustrated motorists. Who roll up their windows. Lock\n\ttheir doors. And some of whom reveal weapons of their own.\n\n\tMadison pauses, listening. She has no idea that Sid 6.7 steps\n\tbehind her. WHAM! He cold cocks her with the butt of his gun.\n\tMadison crumples to the street.\n\n\tWhich now leaves Parker a clean shot at Sid 6.7's head. BOOM!\n\tBOOM! Two hits. Two head wounds. Sid 6.7 falls behind a\n\ttruck, losing his weapon.\n\n\tBefore Sid 6.7's wounds have finished regenerating, Parker is\n\talready on top of him.\n\n\t\t\t\tPARKER\n\t\t\t(neighborly)\n\t\tHey, old buddy, old pal, good to\n\t\tsee you again.\n\n\tHe empties his clip into Sid 6.7, then discards the gun. As\n\tSid 6.7's wounds heal themselves, Parker pounds him\n\tmercilessly.\n\n\t\t\t\tSID 6.7\n\t\t\t(losing it)\n\t\tYou...ruined...I'M GOING TO KILL\n\t\tYOU!!!\n\n\tTrading blows, he manages to get to his feet.\n\n\t\t\t\tPARKER\n\t\tNow, is that any way to talk to an\n\t\told friend?\n\n\t\t\t\tSID 6.7\n\t\t\t(exploding)\n\t\tBARNES, YOU'RE DEAD!\n\n\tHe knocks Parker back with a good shot to the face, then\n\tdisappears around a van.\n\n\tParker continues the hunt. Quietly. Carefully. Tension grows\n\tin the silence that follows.\n\n\tHe carefully makes his way around a truck. Only to see Sid\n\t6.7 swinging a two-by-four directly at his head. WHAM!!!\n\n\tParker is knocked on his ass. Daze4. Blood streams down his\n\tcheek. He staggers to his feet, blocking another blow with\n\this arm. Which SNAPS the wood in two.\n\n\tParker grabs one of the boards. He battles with Sid 6.7.\n\n\tThe fight between Parker and Sid 6.7 is intense. Exhausting.\n\n\tParker gives it everything he has.\n\n\tMadison appears behind Parker, holding his gun. She wavers,\n\thaving trouble keeping her balance. She has even more trouble\n\taiming her weapon.\n\n\t\t\t\tMADISON\n\t\tHey, Parker...\n\n\tShe moves around, trying to get a clean shot at Sid 6.7.\n\tWhich she does not have.\n\n\t\t\t\tPARKER\n\t\tHow's your pulse?\n\n\t\t\t\tMADISON\n\t\t\t(totally focused)\n\t\tI couldn't tell you.\n\n\t\t\t\tPARKER\n\t\tThen shoot him already.\n\n\t\t\t\tMADISON\n\t\tDuck!\n\n\tWithout hesitation, Parker hits the deck. Leaving Sid 6.7\n\tcompletely exposed. Madison steadies her sight.\n\n\t\t\t\tSID 6.7\n\t\t\t(to Madison)\n\t\tYou couldn't hit the side of a...\n\n\tAs he raises his two\u0097by\u0097four high over Parker's head, Madison\n\tpulls the trigger smoothly.\n\n\tIN SLOW MOTION, you follow the bullet as it exits the barrel\n\tof her gun. And penetrates Sid 6.7's skull between the eyes\n\tand exits out the back of his head.\n\n\tSid 6.7 collapses on the ground next to Parker.\n\n\t\t\t\tMADISON\n\t\tWhat do we do now?\n\n\t\t\t\tPARKER\n\t\tYou won't want to watch. Turn\n\t\taround.\n\n\tShe does so. Parker reaches OUT OF FRAME to remove the Sid\n\t6.7 character module from within his skull. Then reveals the\n\tcharacter module in hand.\n\n\t\t\t\tMADISON\n\t\tWhat should we do with it?\n\n\tGlancing in the flatbed of a truck, Parker gets an idea, and\n\tknocks on the driver's window. As the DRIVER rolls down his\n\twindow, classic ROCK & ROLL MUSIC can be heard from inside.\n\n\t\t\t\tPARKER\n\t\tMind if I borrow a couple of your\n\t\ttools for a second?\n\n\t\t\t\tDRIVER\n\t\tBe my guest.\n\n\tParker removes two sledgehammers from the back of the truck.\n\tHe offers one to Madison.\n\n\t\t\t\tPARKER\n\t\tCare to join me?\n\n\tMadison gladly accepts takes the sledgehammer. Parker drops\n\tthe Sid 6.7 character module onto the pavement. And together,\n\tthey start pounding the shit out of it. WHAM! WHAM! In\n\tperfect time with the music. Which the driver cranks even\n\tlouder. As we ROLL CREDITS.\n\n\tTHE END\n\n\n\n\n\n\n\nVirtuosity\nWriters :   Eric Bernt\nGenres :   Action  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:01.459740"}