{"title": "Wag the Dog", "film_link": "/Movie Scripts/Wag the Dog Script.html", "script_link": "/scripts/Wag-the-Dog.html", "info_raw": "\n\nWag the Dog Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.50 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Mamet\nGenres  Comedy\nScript Date : October 1996\n\nRead \"Wag the Dog\" Script\n\n\n", "script": "\n\n\n\n   \"Wag the Dog\", production draft, by David Mamet\n\n\n\n    \n\n\n\n\n\n                                WAG THE DOG\n\n                                    by\n\n                                David Mamet\n\n\n\n\n\n\n10/14/96\n\n\n\n\n\n\n\n\n\n\nFADE IN:\n\nA CARD, WHITE ON THE BLACK SCREEN, READS:\n\n            Why does a dog wag its tail?\n\nBENEATH IT, THE NEXT LINE FADES IN:\n\n            Because a dog is smarter than its tail.\n\nCROSS-FADE TO THE NEXT CARD, WHICH READS:\n\n            If the tail were smarter, the tail would wag the dog.\n\nDISSOLVE\n\n\n\nFADE IN:\n\nEXT THE WHITE HOUSE NIGHT\n\nA VAN FULL OF PEOPLE STOPS AT A SIDE ENTRANCE.\n\nANGLE INT THE WHITE HOUSE\n\nAT THE SIDE, UTILITY ENTRANCE, WE SEE THE DISGORGING WORKING-CLASS MEN AND\nWOMEN, THEY PASS THROUGH SECURITY SCREENING IN THE B.G., THROUGH METAL\nDETECTORS, AND PAST SEVERAL GUARDS WHO CHECK THE PHOTO-I.D.'S AROUND THEIR\nNECKS.\n\nANGLE INT THE WHITE HOUSE\n\nWILFRED AMES, AND AMY CAIN, A BRIGHT YOUNG WOMAN IN HER TWENTIES, WALKING DOWN\nA CORRIDOR, LOOKING WORRIED.\n\nANGLE AMES AND CAIN\nAMES AND CAIN HAVE STOPPED AT THE END OF THE HALL.  BEYOND THEM WE SEE THE\nCLEANING PEOPLE COMING IN FROM THE VAN, AND BEING CLEARED THROUGH A METAL\nDETECTOR INTO A HOLDING AREA, AND HANDED CLEANING MATERIALS, MOPS, VACUUMS, ET\nCETERA, BY A TYPE HOLDING A CLIPBOARD.  PART OF THE GROUP, A MAN IN HIS\nFORTIES, IN A RATTY JACKET, OPEN COLLARED SHIRT, PASSES THROUGH THE GROUP,\nAND IS STOPPED BY A SECRET SERVICEMAN WHO APPEARS NEXT TO AMES.  IN THE B.G.\nWE SEE A TV IN AN ADJACENT ROOM, SHOWING A POLITICAL COMMERCIAL.\n\n                          AMES\n                    (TO SECRET SERVICEMAN)\n            ...That's him.\n\nAMES MOVES OUT OF THE SHOT.  LEAVING US ON THE POLITICAL COMMERCIAL.\n\nWE SEE TWO BUSINESS PEOPLE ON THE PLANE, A MAN AND A WOMAN.\n\n                          BUSINESSMAN\n            Well, all I know, you don't change horses in the middle\n            of the stream.\n\n                          BUSINESSWOMAN\n            \"Don't change Horses,\" well, there's a lot of truth in\n            that.\n\nTHE IMAGE SHIFTS TO A PRESIDENT, DOING PRESIDENTIAL THINGS.  AND THE VOICE-\nOVER.\n\n                          VOICE-OVER\n            For Peace, prosperity, for all of us:  Don't change\n            Horses in...\n\nANGLE\n\nA CORRIDOR OF THE WHITE HOUSE, AS AMES AND THE MAN IN THE RATTY JACKET (BREAN)\nWALK HURRIEDLY.  AMES FINISHES ONE CIGARETTE AND USES THE BUTT TO LIGHT A\nFRESH ONE.  THEY PASS BY A LARGE PHOTOGRAPH OF THE BACK OF A MAN, BENDING TO\nSHAKE HANDS WITH ONE OF A LINE OF GIRLSCOUTS.  AMES GLANCES UP AT THE\nPHOTOGRAPH AND SHAKES HIS HEAD DEJECTEDLY.\n\nINT WHITE  HOUSE \"SITUATION\" ROOM.   NIGHT.\n\nA WOMAN WITH A STENOPAD, ARRANGING PADS AND PENCILS AT A SMALL CONFERENCE\nTABLE.  A SECRET SERVICE TYPE PUTS HIS HEAD IN THE ROOM, AND BOWS OUT, AND\nNODS, BREAN AND AMES ENTER HURRIEDLY.\n\n                          AMES\n            We're going to...\n\nHE STOPS TALKING AS A WHITE HOUSE WAITER ENTERS WITH A TRAY WITH COFFEE THINGS\nON IT, FOLLOWED BY TWO YOUNG AIDES, SLEEPY AND DISHEVELLED, WHO ENTER QUICKLY,\nAND APOLOGIES UNUTTERED, SIT AND MAKE THEMSELVES SMALL.\n\nBREAN MAKES A LITTLE GESTURE AT THE WAITER, WHO IS SETTING OUT THE COFFEE,\nAND AT THE STENOGRAPHER, MEANING \"GET THEM OUT OF HERE.\"\n\n                          AMES\n            Thank you, that'll be all.\n\nTHE STENOGRAPHER AND THE WAITER LEAVE\n\n                          BREAN\n                    (OF THE TWO STAFFERS)\n            Who we got here...?\n\n                          AMES\n            John Levy, Staff, and Amy Cain, Press Off....\n\n                          BREAN\n            Alright.  Look here, any of you kids hear in this\n            room:  what you hear here, what you say here, what you\n            do here, f'it got out, you leaked it.\n                    (TO AMES)\n            Tell'em what they need to know.\n\n                          AMES\n            When it broke, he said one word:  get me Ronnie Brean.\n\n                          BREAN\n                    (NODS)\n            Well.  Alright.  What is it?  What's, he, uh...?  He\n            had an Illegal Immigrant, was his Gardener, some years\n            back...?\n                    (SMILES)\n            What's the thing?  You people get ahead, you sure get\n            nervous.\n\nAN AIDE ENTERS, WITH SEVERAL TYPED SHEETS, WHICH SHE HANDS TO CAIN. CAIN\nREADS TO HERSELF, PASSES THEM TO AMES.\n\n                          BREAN\n                    (CON'T)\n            ...he made a pass at some Secretary, back in...\n\nAMES TAKES THE SHEETS, AND READS.  GESTURES TO BREAN, \"ONE MOMENT, PLEASE.\"\n\nANGLE INS.  THE SHEET, WHICH AMES HOLDS.\n\nIT READS:\n             AS PRESIDENT OF THE UNITED STATES I REGRET THAT\n            PERSONAL INCAPACITY HAS RENDERED ME MOMENTARILY UNABLE\n            TO CONFRONT AND CORRECT....\n\nANGLE\nBREAN LOOKING ON, AS AMES READS, AND SHAKES HIS HEAD SADLY.  BREAN TAKES THE\nSHEETS.\n\nANGLE  INS.\nREADING OVER BREAN'S SHOULDERS:\n            1.)  Statutory Rape.\n            2.)  The President's long-documented mental problems\n            3.)  Brought about by reaction to Drugs to control\n            flu...?\n\nANGLE AMES READING OVER BREAN'S SHOULDER.\n\n                          AMES\n            ...did he have the flu...?\n\n                          CAIN\n            It can be documented that he displayed the...\n\nBREAN LAYS DOWN THE SHEET SOMBERLY, EVERYONE LOOKS AT HIM.\n\n                          BREAN\n            This ain't the illegal immigrant Nanny.\n\n                          CAIN\n            There was a group of Girlscouts here from Indiana last\n            month.  One of them expressed an interest in a\n            Frederick Remington bust.  The president took her into\n            the oval Office, for a period...\n\n                          AMES\n            Three minutes.  It couldn't have been over three\n            minutes, the Secret Service...\n\nBREAN GESTURES HIM TO BE QUIET.\n\n                          BREAN\n            Okay.  And she's alleging...?\n\nCAIN GESTURES BREAN TO KEEP READING THE SHEETS IN FRONT OF HIM.  HE DOES SO.\nPAUSE.  TO HIMSELF.\n\n                          BREAN\n                    (CON'T)\n            Jesus, Mary and Joseph.\n\n                          AMES\n            We are virtually certain it isn't...\n\n                          BREAN\n            Who's got the story?\n                    (PAUSE)\n\n                          AMES\n            Don't you want to know if it's true?\n\n                          BREAN\n            What difference does it make if it's true?\n                    (PAUSE)\n            It's a story, and, it breaks they're gonna have to run\n            with it -- How long've we got til it breaks?\n                    (PAUSE)\n\n                          AMES\n            Front page.  Washington Post.  Tomorrow.\n\n                          BREAN\n            Well, yeah.  Now.  That's not good.  Okay:\n                    (PAUSE)\n            Okay.  We'll set up the War Room Here...\n\nAN AIDE BRINGS HIM A CUP OF COFFEE.\n\n                          BREAN\n            Thank you.  Now:  where is he?\n\n                          LEVY\n            China.\n\n                          BREAN\n            When's he coming back...?\n\n                          LEVY\n            Touchdown, Andrews, fourteen hundred, today.\n\nBREAN TAKES A NOTEBOOK OUT OF HIS POCKET, AND LOOKS AT IT.\n\n                          BREAN\n                    (AS HE READS FROM HIS NOTEBOOK)\n            Alright, now, here:  he stays on the ground in China\n            til Tomorrow.\n\n                          CAIN\n            ...why?\n\n                          BREAN\n            ...you the Press Office?\n\n                          CAIN\n            ...Yes.\n\n                          BREAN\n                    (SHRUGS)\n            Earn your money.  ...He's ill, the Plane is sick...\n\n                          CAIN\n                    (MAKING NOTES)\n            ...Good...\n\n                          AMES\n            When do we bring'em back?\n\n                          BREAN\n            You gotta give me a day.  I need a day.\n                    (PAUSE)\n            He's sick, get it out now.  Get him on the phone'n tell\n            him how sick he is.  We got to get it out before the\n            story breaks, so we aren't quote, responding to it.\n            Issue is as a bulletin.  He's got some rare strain\n            of...\n\n                          AMES\n            It won't hold.\n\n                          BREAN\n            All I need is the one day.\n\n                          AMES\n            It won't even hold the one day, Ronnie --\n\n                          BREAN\n            Yes -- It will... Now:  why is the President in China?\n\n                          LEVY\n            Trade Re1ations.\n\n                          BREAN\n            You're goddamn right.  And it's got nothing to do with\n            the B-2 Bomber.\n                    (PAUSE)\n\n                          LEVY\n            There is no B-2 Bomber,\n\n                          BREAN\n            That's what I'm telling you.\n                    (PAUSE.  HE GLANCES AT HIS WATCH.)\n            The two things:  the two things:  Rare strain of flu,\n            No Cause to Be Alarmed.  And the B-2 Bomber...\n                    (TO AIDES)\n            Clear me a space.  Get me a copy, go rob one, get it\n            off the computer, Wash Post, N.Y. TIMES,\n\n                          AIDE\n            You want some research, flu?  Side-effects of medi....\n\n                          BREAN\n            Naw, we can't play this one catch-up.  That's how long\n            since you stopped beating the wife.  We have to...\n\n                          AMES\n            We're going to have to explain away the...\n\n                          BREAN\n            They caught him in the closet with a Girlscout.  Side-\n            effects of a pill ain't gone trump that.  You have to\n            keep'em guessing for\n                    (HE GLANCES AT THE CALENDAR)\n            Two weeks.  You  don't have to Cure Cancer, Pal, you\n            just have to give them something more interesting\n            than...\n\n                          CAIN\n            What's more interesting than boffing the girlscout?\n\n                          BREAN\n            Well, that's what we're doing here...\n\nBREAN IS SUNK IN THOUGHT.  AN AIDE STARTS TO SPEAK.  AMES SILENCES HIM, BREAN\nBECKONS AMES OVER.\n\n                          BREAN\n                    (SOTTO)\n            Gemme twenty thousand dollars....\n\nAMES NODS, AND WAVES AN AIDE OVER AND WHISPERS TO HER.\n\n                          BREAN\n                    (CONT.)\n            And gemme a car.\n\n                          AMES\n            Car and a driver, Mr. Brean, the Westgate, Now,\n            please...\n\n                          BREAN\n            Okay, look, who's takin' the press conference today?\n\n                          CAIN\n            Is there a press conference today?\n\n                          BREAN\n            What do you think?  What I need from you:  I need a\n            base of operations.  Some place in the District.  I\n            need some clean money ...\n\n                          LEVY\n            How much...?\n\nAMES GESTURES HIM TO BE QUIET.\n\n                          BREAN\n            And, to hold it together, I need two days.  There is no\n            B-2 Bomber:  here's what you do ahout that:  whoever is\n            leaking stuff to that geek at the Post, lets it slip,\n            \"Geez, I hope this doesn't screw up the B-2 Program...\"\n            \"What B-2 Program, and why should it screw it up?\"  \"If\n            the president moves to deploy the B-2 before it is\n            fully tested.\"  \"Deploy the B-2, Why?\"  \"In the\n            Crisis.\"\n\n                          AMES\n            What crisis?\n\n                          BREAN\n            I'm working on it.  Same time, you call Billy Scott at\n            Joint Chiefs, and pour him onna plane right now to\n            Seattle, y'got that...?  All flustered and worried. To\n            talk to the Boeing people.\n\n                          AMES\n                    (TO LEVY)\n            Do it...\n\nLEVY MOVES TO A TELEPHONE.\n\n                          BREAN\n                    (TO CAIN)\n            And you?\n\n                          CAIN\n            But there isn't a B-2 bomber.\n\n                          BREAN\n            Where'd you go to school, Kid.  Wellesly?\n\n                          CAIN\n            Dartmouth\n\n                          BREAN\n            Then show a little spunk.  There Is no B-2 Bomber,\n            General Scott, the best of your knowledge, is not in\n            Seattle to talk with Boeing...\n\n                          AMES\n            It won't hold.\n\n                          BREAN\n            One day, Two days?  Course it's gonna hhhh....\n\nCAMERA TAKES THEM DOWN THE HALL, WHERE WE SEE THE CLEANING PEOPLE, WITH FLOOR\nPOLISHERS, LOOKING UP AT THE PICTURE OF THE PRESIDENT AND THE GIRLSCOUTS, AND\nSNICKERING.\n\nANGLE\nON BREAN AND AMES LOOKING ON.\nTHE CLEANING PEOPLE NOTICE THEY ARE BEING WATCHED AND DISPERSE.\n\n                          AMES\n            It won't hold, Ronnie, it won't prove out.\n\n                          BREAN\n            We don't need it to prove out.  We need it to distract\n            them for two weeks til the election.\n\n                          AMES\n            What would do that...?\n\nHOLD, ON BREAN THINKING.\n\n                          AMES\n                    (CONT.)\n            What in the world would do that?\n\n                          BREAN\n            I'm working on it.\n\nHE TURNS AROUND AND STARES AT THE WALL.\n\nBREAN WALKS TO THE COUNTER WHERE THE COFFEE AND ROLLS ARE STEAMING.  ON THE\nWALL ARE HUNG TWO WIPE-OFF SLATES.  ONE READS \"DAYS TO ELECTION 12,\" THE OTHER\nREADS \"% IN FAVOR 63\" BREAN PICKS UP A ROLL, DOWNS A COFFEE, AND STARTS OUT OF\nTHE DOOR.\n\nANGLE\nCAMERA TAKES THEM OUT INTO THE HALL.\nBREAN LEANS CLOSE TO AMES.\n\n                          BREAN\n            Gimme twenty thousand dollars.\n\nHE STARTS INTO THE HALL, FOLLOWED BY THE ENTOURAGE, AND THE CAMERA.\n\n                          BREAN\n            I'll be back within the hour.  Now,\n\n                          AMES\n                    (WALKS ALONG, SHAKING HIS HEAD)\n            It's going to be fine.  It's going to be ... you\n            remember in 88, when...\n\nAN AIDE COMES UP TO THEM, HOLDING A VIDEOTAPE.\n\n                          AMES\n            What is it...\n\nAIDE WHISPERS TO AMES.  WHO NODS, TAKES THE TAPE, AND BREAN, AND THE AIDE,\nINTO A SIDE OFFICE.\n\nINT SIDE OFFICE NIGHT.\nAS THE AIDE PUTS THE TAPE INTO A V.C.R.\n\n                          BREAN\n            What is it?\n\n                          AMES\n            It's the rough-cut, the other side's new commercial.\n\nTHE PICTURE COMES ON, IT SHOWS THE PRESIDENT DOING SEVERAL PRESIDENTIAL\nTHINGS.  THE COMMERCIAL WE SAW EARLIER.\n\n                          BREAN\n            That's our commercial.\n                    (PAUSE)\n            I've seen it.  That's our commercial.\n\n                          AMES\n                    (TO AIDE)\n            Turn up the volume.\n\nTHE AIDE DOES SO, AND WE HEAR MAURICE CHAVALIER SINGING,\n            \"Thank heaven, for Little Girls....\"\n\nANOTHER AIDE ENTERS, SHEEPISHLY, HANDS A THICK PACKET TO AMES, WHO HOLDS IT\nOUT TO BREAN.\n\n                          BREAN\n            What is this?\n\n                          AMES\n            Twenty thousand dollars.\n\n                          BREAN\n                    (NODS, REMEMBERING  IT)\n            Yeah, I'm gonna have to go to L.A.\n\nINT BACKSEAT THE STATIONWAGON WE SAW AT THE WESTGATE.  GEORGETOWN.  NIGHT.\nAMES IN THE BACKSEAT.\n\n                          AMES\n            I'm coming with you.\n\n                          BREAN\n                    (SHRUGS)\n            Gemme a plane.  Business Aviation, National, one hour.\n            Fly to Chicago.  O'hare, LAX 6 A.M.\n\n                          AMES\n            I'll see you at National.\n\nBREAN NODS, AND EXITS.\n\nHOLD ON AMES.\nHE HEARS SOMETHING, AND TURNS.\n\nANGLE\nHIS POV.\nA YOUNG STAFFER, IN THE CORNER, SPEAKING SOFTLY ON THE PHONE.\n\n                          STAFFER\n                    (ON PHONE)\n            Tell him, well, tell him we, I know we just signed it,\n            but we're going to cancel it.\n                    (PAUSE)\n            Because, because we're not going to be staying here the\n            next four years.\n                    (PAUSE)\n            Well, I can't tell you on the phone...\n\nEXT GEORGETOWN STREET NIGHT.\n\nTHE DOORSTEP OF A HOUSE.  A MIDDLE AGED MAN IN A BATHROBE, HOLDS A VERY LARGE\nMANILA ENVELOPE, HE TURNS, SOMEONE BEHIND HIM OBVIOUSLY HAVING CALLED HIM.  HE\nTURNS AND SECRETS THE ENVELOPE IN HIS BATHROBE POCKET.\n\nANGLE\nIN THE FOREGROUND, BREAN, IN A TAXICAB, WHICH DRIVES AWAY, IN THE B.G., THE\nMAN IN THE BATHROBE, REENTERING HIS HOUSE.\n\nINT SMALL TWIN ENGINE PROP PLANE.  NIGHT.\n\nAMES AND BREAN IN THE BACK\nHOLD ON AMES\nWHO IS SHAKING HIS HEAD.  HE REACHES OVER AND NUDGES BREAN AWAKE.\n\n                          AMES\n            Tell, tell, tell me again.\n\n                          BREAN\n            ....we landing?\n\n                          AMES\n            Tell me again.\n\n                          BREAN\n                    (SIGHS)\n            Lookit, don't worry about it.  It's not a New Concept.\n            Wake me when we touch down, will...\n\nHE TRIES TO NESTLE HIMSELF BACK TO SLEEP.  AMES NUDGES HIM.\n\n                          AMES\n            We can't afford a war.\n\n                          BREAN\n            We aren't going to have a war.  We're going to have the\n            \"appearance\" of a war.\n\n                          AMES\n            I'm not sure we can afford to have the \"appearance\" of\n            a war.\n\n                          BREAN\n            What's it gonna cost?\n                   (HE SHRUGS AND STARTS TO ROLL OVER TO\n                   GO TO SLEEP.)\n\n                          AMES\n            But, but, but, \"they\" would find out.\n\n                          BREAN\n            Who would find out?\n\n                          AMES\n            ...the...\n                    (HE GESTURES OUT OF THE WINDOW)\n\n                          BREAN\n            The American \"people\"?\n\n                          AMES\n            Yes\n\n                          BREAN\n            Who's gonna tell'em.\n\n                          AMES\n            ...but...\n\n                          BREAN\n            What did they find out about the Gulf War?  One shot:\n            one bomb, falling though the roof, building coulda been\n            made of Legos.\n\nHE ROLLS OVER AGAIN.\n\n                          AMES\n                    (AS IF REHEARSING IT TO HIMSELF)\n            ...you want us to go to War...\n\nBREAN ROUSES HIMSELF, SHRUGS, TAKES OUT A NOTEBOOK, AND BEGINS TO WRITE.\n\n                          BREAN\n            ...that's the general idea.\n\n                          AMES\n            Why?\n\n                          BREAN\n            Why not, what've they ever done for us...?  Also:  they\n            sound... Ah, you see, this is why we have to mobilize\n            the B-2 Bomber...\n\n                          AMES\n            ...they sound what?\n\n                          BREAN\n            Shifty.  Who knows anything about em...\n\n                          AMES\n            Hold on, hold on, hold on:\n\n                          BREAN\n            Well, I'm gonna hold on, but you went to win this\n            election, you better change the subject.  You wanna\n            change this subject, you better have a War.  What do\n            you need?  It's gotta be quick, it's gotta be dramatic,\n            you got to have an enemy.  Okay?  What do you need in\n            an enemy?  Somebody you fear.  Who do you fear?\n            Som'b'y you don't know.\n\n                          AMES\n            Who?\n\n                          BREAN\n            Well, I'm working on it....\n\nHE ROLLS OVER.\n\nEXT, O'HARE AIRPORT.  BUSINESS TERMINAL.\n\nA BEAUTIFUL PRAIRIE DAWN.\n\nTHE SMALL PLANE FINISHES TAXIING, BREAN AND AMES EMERGE, A UNIFORMED\nOBSEQUIOUS AIRLINE ATTENDANT COMES UP, AND HANDS THEM TICKETS.\n\nANGLE, ON BREAN AND AMES, AS THEY WALK ACROSS THE TARMAC.\n\n                          AMES\n            Albania...\n\n                          BREAN\n            Yes.\n\n                          AMES\n            Why?\n\n                          BREAN\n            What do you know about them?\n\n                          AMES\n            ...nothing...\n\n                          BREAN\n            Precisely.\n\n                          AMES\n            What did Albania ever do to us?\n\n                          BREAN\n            What did they ever do for us...?\n                    (PAUSE)\n            You see, this is why we have to mobilize the B-2\n            Bomber.\n\n                          AMES\n                     (TO HIMSELF)\n            ...you want us to go to War with Albania.\n\n                          BREAN\n            Here's what you got to do:\n                    (HE GESTURES, \"GET ON THE PHONE\")\n            Get your Press Office, Right now.  To deny;  There is\n            no report of Albanian Activity.  They have to deny it.\n            Now, get the C.I.A.\n\nINT AIRLINE WAITING AREA.  DAY.\n\nEARLY MORNING BUSINESSMEN AND WOMEN, HOLDING COFFEE CUPS.\n\nONE WEARS A CAMPAIGN BUTTON SHOWING THE PHOTO OF THE PRESIDENT AND THE GIRL\nSCOUT.  HE BRUSHES PAST BREAN WHO IS SITTING BY A MINDLESS TELEVISION WEATHER\nPRESENTATION ON A HUGE TV.  HE LOOKS DOWN AT HIS WATCH.\n\n                          ANNOUNCER\n                    (VO)\n            American Airlines Announces the departure of flight\n            _____ for Los Angeles, will all Passengers holding...\n\nTHE BUSINESS TYPES BEGIN TO QUEUE UP IN A SLEEPY LINE.  BREAN LEANS CLOSER TO\nTHE TELEVISION, AS IT CHANGES TO A NEWS LOGO, AND A TALKING HEAD APPEARS.\n\n                          TALKING HEAD\n            Good morning:  With the election eleven days away the\n            world slept, expecting news from the President on Trade\n            and his visit to China, another sort of news, however,\n            has emerged from the Presidential Quarter.  Chris\n            Andrews, station KCRT, Santa Fe Reports:\n\nBREAN LEANS BACK FROM THE TELEVISION, AND PUTS HIS ATTENTION ON THE BUSINESS\nPEOPLE ABOUT TO FILE ONTO THE PLANE.  AS HE WATCHES THEY MOVE FIRST ONE AT A\nTIME, AND THEN, IN A GROUP, DRAWN TO THE TELEVISIONS.\n\nANGLE:\nBREAN, LOOKING AT THE BUSINESS PEOPLE, CLUSTERING UP.  BEYOND HIM, WE SEE THE\nTALKING HEAD FROM SANTA FE, THE SHOT OF THE PRESIDENT WITH THE GIRLSCOUTS,\nWHICH WE SAW PREVIOUSLY ON THE WHITE HOUSE WALL, AND ON THE CAMPAIGN BUTTONS.\n\nBREAN TAKES OUT A NOTEPAD AND STARTS MAKING NOTES.  AMES WANDERS INTO THE\nSHOT, WITH A CUP OF DUNKIN' DONUTS COFFEE, AND THE CELLPHONE INTO WHICH HE IS\nTALKING.\n\n                          AMES\n            Top people.  Albanian Desk.  Well, I don't know either,\n            but we probably have one.  Albanian Dusk, C.I.A.,\n            N.S.A. roust'em outta bed, sirens blaring....\n\nBREAN NODS, MEANING, \"GOOD STUDENT.\"\n\n                          AMES\n                    (CONT.)\n            I know they'll be in in an hour, get'em now...C.I.A.,\n            N.S.A., wake'em up.\n\nBREAN GESTURES, TELL THEM THE OTHER THING.     \n\n                          AMES\n                    (CONT.)\n            And you tell the staff, anyone leaks anything on this\n            situation, his or her job is going to be...\n\nTHE TWO ARE IN THE QUEUE THROUGH THE JETWAY.  THEY COME TO THE DOOR OF THE\nAIRLINER.\n\n                          AMES\n                    (CONT.)\n            ...General Scott in Seattle...?  No, I don't think his\n            trip has got anything to do with the B-2 Bomber.\n            Now...\n\nTHE STEWARDESS INTERVENES, AS THEY COME UP TO THE DOOR OF THE AIRLINER\n\n                          STEWARDESS\n            I'm sorry, Sir, I'll have to ask you to...\n\nSHE GESTURES AT THE CELLPHONE.\nAMES LAGS BEHIND IN THE JETWAY, AS BREAN WALKS INTO THE PLANE, CAMERA TRACKS\nWITH HIM.\n\nBREAN AND THE CAMERA NOTICE A SMALL MINI TV IN THE GALLEY AREA, WHERE THE\nSTEWARDESS IS SNEAKING A PEEK AT THE SCREEN, SHOWING THE PRESIDENT, GREETING\nTHE GIRLSCOUT.\n\n                          STEWARDESS\n                    (CONT.)\n                    (TO BREAN)\n            Did you hear?\n\n                          BREAN\n            Well, I don't know, a lot of these early reports are\n            inflated.\n\n                          STEWARDESS\n            ... could, could, could he have done it?\n\n                          BREAN\n            ...who understands Human Nature?\n\nANGLE\nBACK AT HIS SEAT, THE WOMAN IN THE SEAT ACROSS THE AISLE TO HIM IS TALKING IN\nAN AIRFONE.\n\n                          WOMAN\n                    (INTO PHONE)\n            What did she say that the President Actually did....\n            Well, who said it.  Her mother, or Her?\n                    (PAUSE)\n            He did...?\n                    (PAUSE)\n            ...and they said that on TV...?\n                    (PAUSE)\n            They used that word...?\n\nBREAN EASES INTO HIS SEAT, AND TAKES OUT HIS NOTEBOOK.\n\n                          WOMAN\n                    (INTO PHONE)\n            ...what time?  Two Eastern?  Alright, I'll.... Alright.\n\n                    (SHE HANGS UP THE AIRFONE.)\n\nBEAT.  SHE TURNS TO BREAN.  WE SEE SHE IS WEARING THE BUTTON WHICH SHOWS THE\nPRESIDENT AND THE GIRLSCOUTS.  SHE LOOKS DOWN AND FINGERS THE BUTTON.\n\n                          WOMAN\n                     (OF THE BUTTON)\n            ...what do you think...?\n\n                          BREAN\n            ...how can any of us know?\n\n                          WOMAN\n                    (OF THE BUTTON)\n            Makes you feel kind of foolish, doesn't it...?\n\n                          BREAN\n            I'm sure that's the worst of it.\n                    (BEAT)\n\n                          WOMAN\n                    (MEDITATIVELY, SHAKING HER HEAD, AS\n                    SHE LOOKS AT THE BUTTON)\n            ...a twelve year-old girl.\n                    (PAUSE)\n            ...and I was going to vote, for him.\n\n                          BREAN\n            Well, it ain't over til it's over...\n\nAMES SITS IN THE SEAT NEXT TO BREAN.\n\n                          BREAN\n            How's he doing?\n\nAMES SHUSHES BREAN, TAKES OUT THE AIRPHONE, AND STARTS DIALING.\n\nEXT POOLHOUSE BEVERLY HILLS HOTEL DAY.\n\nTWO WHITE-TOGGED POOL ATTENDANTS, WATCHING A SMALL TELEVISION AT THE CHECK-IN\nAREA.\n\nON TELEVISION, SENATOR FREDERICK NOLE, A MIDWESTERNER, HOLDING FORTH.\n\n                          NOLE\n            ...if it is true, he should, he must step down.  And if\n            it is not true, then he must ... we are informed he has\n            extended his visit to China, I say, on behalf of the\n            American...\n\n                          ANNOUNCER\n                    (VO)\n            Senator...Senator... we have to...\n\n                          NOLE\n            I say, on behalf of the American People, Come home,\n            face the music, whatever that may be.  Th'election's\n            in ten days, let the American...\n\n                          ANNOUNCER\n                    (VO)\n            Let the American People decide...\n\nSCREEN GOES TO THE TALKING HEAD OF THE ANNOUNCER.\n\n                          ANNOUNCER\n            Senator Frederick Nole.  With, excuse me, Senator,\n            that's eleven days, til the election, And the president\n            ahead in the polls by, Bob...?\n\n                          SECOND TALKING HEAD\n            Seventeen percent.\n\n                          ANNOUNCER\n            Accusations have surfaced, which...\n\n                          BOB\n            Bill, the White House has announced, that, in response\n            to media pressure there will be a press conference\n            in...\n\nTHE TWO POOL ATTENDANTS STRAIGHTEN, AND PUT ON THEIR BEST SMILES, AND LOOK AT AN\nARRIVING MAN.\n\n                          POOL ATTENDANT\n            Morning, Mr. Moss.\n\nSTANLEY MOSS, A SUCCESSFUL LOOKING FELLOW AROUND SIXTY, COMES THROUGH THE\nTURNSTILE, ONE OF THE ATTENDANTS BUSTLES AROUND, HANDING HIM TOWELS.  WE HOLD\nON THE SECOND ATTENDANT, WHO SCURRIES UP THE STEPS.\n\n                          SECOND ATTENDANT\n            ...I'll be right back with your juice...\n\nMOSS CALLS AFTER HIM\n\n                          MOSS\n            ...with a carrot in it...\n\nAS HE CLEARS THE FRAME, WE SEE, BELOW HIM, MOSS AND THE FIRST ATTENDANT, WHO\nIS GESTURING DOWN TOWARD THE POOL AREA, THEY TURN THEIR HEADS.\n\nANGLE\nDOWN AT THE DESERTED POOL AREA.  ONE NANNY TYPE, WITH A YOUNG KID IN\nWATERWINGS, FROLICKING IN THE WATER, AND BREAN, AND AMES, WHO ARE SITTING IN\nPOOL CHAIRS.  BREAN RISES, AND WALKS TO GREET MOSS, LEAVING AMES IN THE B.G.\nTALKING ON A CELL PHONE.\n\nANGLE\nON MOSS AND BREAN, AS MOSS APPROACHES A BIT TENTATIVELY.\n\n                          MOSS\n            Do I know you?\n\n                          BREAN\n            We have some mutual friends in Washington.\n\nINT POOL CABANA, BEV. HILLS HOTEL, DAY.  A CURTAIN IS SWEPT ASIDE, AS MOSS\nAND BREAN AND AMES ENTER, IN THE B.G. WE SEE THE NANNY AND THE LITTLE KID IN\nTHE POOL.  MOSS AND BREAN ARE TALKING AS THEY ENTER.\n\n                          MOSS\n            And is it true?\n\n                          AMES\n            Waal, Mr. Moss, I wouldn't....\n\nMOSS STARTS STRIPPING OFF HIS CLOTHES, AND CHANGING INTO A SWIMSUIT.\n\n                          MOSS\n            You wouldn't be here if it wasn't true.  It's true,\n            right?\n\nHE SWITCHES ON THE TELEVISION IN THE CABANA.  WE SEE A FEMALE TALKING HEAD.\n\n                          FEMALE TALKING HEAD\n            Sexual relations with a girl thirteen years old.\n\nTHE SCREEN GOES TO THE PHOTO OF THE PRESIDENT WITH THE GIRLSCOUTS.\n\nMOSS TURNS DOWN THE VOLUME.  AS HE AND BREAN TALK THE TV SHOWS IMAGES OF THE\nPRESIDENT WITH GIRLSCOUTS, AND WITH OTHER YOUTH GROUPS.\n\n                          MOSS\n            And you're here why...?\n\n                          BREAN\n            I'm here, Mr. Moss, because you've shown yourself a\n            great supporter of the Party.\n\n                          MOSS\n            Party's gonna need more than a couple bucks now.\n\nTHE POOL ATTENDANT ENTERS WITH A TRAY ON WHICH IS A GLASS WITH LIQUID AND A\nCARROT STICK IN IT, AND A GLASS FULL OF CELERY STICKS.\n\n                          MOSS\n            Back where I come from they call this Romeo in Joliet.\n                    (HE SHAKES HIS HEAD, REACHES ONTO A\n                    SMALL TABLE BEHIND HIM, AND PICKS UP A\n                    BOOK.)\n            I, I, and y'know, I like the guy... he signed his\n            book to me....\n\nHE HOLDS THE BOOK TO BREAN, THE CAMERA SEES THE PHOTO OF THE PRESIDENT ON THE\nBACK COVER, THE FRONT COVER READS.\n\n            \".... FOR TWO GENERATIONS TO AGREE.\"\n\nMOSS LOOKS DOWN AT THE BOOK, AND QUOTES\n\n                          MOSS\n            \"For Progress to occur, it is necessary for Two\n            Generations to Agree....\"\n\nHE LOOKS AT THE TELEVISION SCREEN, WHICH SHOWS THE PRESIDENT WITH A YOUNG GIBL\nON HIS LAP.\n\n                          MOSS\n            Oh, jeez, this guy is fucked.\n\n                          BREAN\n            What one has to do, Mr. Moss.  Is to fight a holding\n            action.\n\n                          MOSS\n            ...holding action.  THEY'RE GOING TO TEAR THIS GUY TO\n            Shreds.\n\n                          BREAN\n            If we can hold the break-in-the-dam for ten days, til\n            the election, we...\n\n                          MOSS\n            Yeah, hut you can't hold the dam.  How the hell,\n            n'nu'n', I don't get what you want me to ...\n\nTHE SCREEN CHANGES, WE SEE THE SEAL OF THE PRESIDENT, AND WE ARE IN THE\nNEWSROOM OF THE WHITE HOUSE.  A SHOT OF THE RESTIVE REPORTERS, IN THE B.G.\nOF THE CABANA WE SEE THE POOL ATTENDANT TAKING HIS LEAVE, HURRYING BACK TO\nTHE OTHER TELEVISION AT THE POOL DESK.\n\n                          ANNOUNCER\n                    (VO)\n            Allegations that the president had sexual... Ah...\n            here is the deputy ... assistant under secretary...\n\nWE SEE LEVY TAKE THE PODIUM, ARRANGE HIS NOTES, AND CLEAR HIS THROAT.\n\nBREAN LEANS FORWARD, ANXIOUS, IN HIS SEAT.\n\n                          MOSS\n            I don't ... they're gonna tear this guy to shreds...\n\n                          LEVY\n                    (ON TV)\n            ...the illness of the President, which we are assured,\n            is not serious.  I repeat, it is not serious, the\n            doctors suspect it's a stomach flu, but have advised\n            him not to fly.  He will remain, on the ground, in\n            China for, they estimate, one or two days, I stress\n            that, during this time he will, of...\n\n                          MOSS\n            ...he's gotta come back sometime, what the hell is two\n            days gonna buy him.\n\n                          LEVY\n                    (VO)\n            Any questions....Mr. Sklansky, Yes...\n\n                          MOSS\n                    (AS HE LEANS CLOSER TO THE TV)\n            ... twelve year old girl...  Breir Rabbit couldh t gut\n            outta this...\n\nANGLE, ON BREAN AS HE LOOKS AT MOSS, LEANING INTO THE TV.  HE THEN\nSWITCHES HIS GLANCE TOWARD THE POOL DESK, ANGLE HIS POV.  AT THE POOL DESK\nWE SEE THE TWO ATTENDANTS, THE NANNY, THE KID AND SEVERAL NEWLY ARRIVED\nBATHERS CLUSTERED, RAPT, AROUND THE TELEVISION.\n\n                          LEVY\n                    (C)  (VO)\n            Yes...?\n\n                          SKLANSKY\n                    (VO)\n            Mr. Levy...\n\n                          LEVY\n                    (VO)\n            Yes\n\n                          SKLANSKY\n            Would you comment on the rumors... on the rumors that\n            the President's trip, that the President's delay... is\n            due to the situation in Albania?\n\nANGLE\nON THE TELEVISION WE SEE SKLANSKY, AND SEE THAT HE IS THE CHAP IN THE\nBATHROBE WHOM BREAN GAVE THE ENVELOPE TO.\n\n                          LEVY\n            There, uh, I'm not aware of the situation to which you\n            refer.\n\n                          SKLANSKY\n            Sir:  the heads of the Albanian Desks at C.I.A., and at\n            the National Security agency have been recalled on\n            Special Alert, and there are rumors that the B-2\n            Bomber...\n\n                          LEVY\n            Mr. Sklansky, Mr. Sklansky, I am I am unaware of any,\n            um, \"situation...\"  The B-2 Bomber?\n                    (PAUSE)\n            The B-2 Bomber...?  There is no B-2 Bomber.  Mrs.\n            Rose...\n\nA WOMAN REPORTER STANDS.\n\n                          MRS. ROSE\n            Mr. Levy, early this morning Major General William\n            Scott flew to Seattle.  Is his trip connected with the\n            B-2 Bomber?\n\n                          LEVY\n            Uh...Mrs. Rose, there, to the best of my knowledge,\n            there is no...\n\n                          REPORTER\n            Mr. Levy:  is the situation in Albania in any way\n            connected with recent Muslim Fundamentalist, anti-\n            American...\n\nBEAT.  MOSS LOOKS AT BREAN.\n\n                          MOSS\n            How close are you to this thing?\n\nBREAN PICKS UP A CELLPHONE FROM THE TABLE, AND DIALS\n\n                          BREAN\n                    (TO MOSS)\n            What do you want the kid to say?\n\nMOSS LOOKS AT BREAN APPRAISINGLY.\n\n                          MOSS\n            Have him say, 'I know we're all concerned for the\n            President, there will he an update at 5:45.'\n\nAS MOSS SPEAKS BREAN NODS TO AMES, SPEAKS INTO THE TELEPHONE.\n\n                          AMES\n                    (INTO PHONE)\n            Have the kid say I know we're all concerned for the\n            President.  There will he an update on his\n            condition at 5:45.\n\nTHEY BOTH TURN TO WATCH THE SCREEN.\n\n                          LEVY\n                    (ON TV)\n            ...no information whatever on Fundamentalist...\n                    (HE HOLDS HIS HAND TO HIS EARPHONE)\n            I.  I just want to say I know we're all conceroed for\n            the President, there will be an update on his\n            condition at five forty-five...\n\nMOSS LEANS OVER AND TURNS DOWN THE VOLUME ON THE TV.\nBEAT.\n\n                          MOSS\n            Well.  You bought yourself one day.  Maybe two.\n\n                          BREAN\n            String a few together.  All I need's eleven,\n\n                          MOSS\n            How you going to stretch it?\n                    (HE GESTURES AT THE TV)\n            This won't hold for eleven days.  Guy fucked a twelve-\n            year-old...whadday're gonna do to hold that off?\n\n                          BREAN\n            What do you think would hold it off?\n\n                          MOSS\n            Uh, nothing, oh, nothing ... uh... a War, uh...\n                    (HE PAUSES, THEN LOOKS AT BREAN WITH\n                    COMPREHENSION.)\n            You're kidding.\n\nBREAN SHAKES HIS HEAD NO.\n\n                          MOSS\n            I'm a Jew in Show Business.  Why come to me?\n\n                          BREAN\n            I'm gonna tell you why...\n\nBREAN LEANS CONSPIRATORIALLY, OVER TOWARD MOSS.\n\n                          BREAN\n            Here's the Short Course:  Fifty-Four, Forty or Fight.\n            What does that mean?\n\n                          MOSS\n            Uh, it's a slogan.  From, uh...\n\n                          BREAN\n            Remember the Maine...\n\n                          MOSS\n            That's from the ... it's got to be from the...\n\n                          BREAN\n            Tippecanoe and Tyler, Too!\n\n                          MOSS\n            ...uh ... No, that's...\n\n                          BREAN\n            We remember the slogans, we can't even remember the\n            fucking wars.  Y'know why.  Cause it's show business.\n            That's why I'm here.  Naked girl, covered in Napalm.\n            Five marines Raising the Flag, Mount Suribachi.\n            Churchill, V for Victory, Y'remember the Picture, fifty\n            years from now, they'll have forgotten  the war.  Gulf\n            War?  Smart Bomb, falling through the roof.  2500\n            missions a day, 100 days, One Shot of One Bomb.  The\n            American people bought that war. M'I getting through\n            to you?  War in the Balkans, don't mean nothing, till\n            some G.I. flyer, went down, Eating Snakes for Ten days.\n            N'then It's show business, Mister Moss.  That's why\n            I'm here.\n\nANGLE\nAT THE POOL DESK. THE ATTENDANTS AND THE GUESTS ARE WATCHING THE TELEVISION.\nON WHICH WE SEE COMIONTATOR TALKING ABOUT A MAP OF ALBANIA.\n\nTHE SCENE SHIFTS TO THE SHOTS OF THE PRESIDENT BEING PRESIENTIAL, AND WE\nHEAR, \"THANK HEAVEN, FOR LITTLE GIRLS...\"\nAMES WINCES, WE SEE THE POOL ATTENDANTS LAUGH.\n\n                          BREAN\n            It's like being a producer, Mr. Moss.  The Things in\n            Trouble.  Somebody's got to wade in, save the thing.\n                    (PAUSE)\n            You get the Actors get up there, and strut and\n            Posture.  But somebody, knows what's what, got to jump\n            in and Save the Thing.\n                    (PAUSE)\n\nTHEY LISTEN TO THANK HEAVEN, FOR LITTLE GIRLS, AND THEY LOOK AT MOSS.\n\nPAUSE\n\n                          MOSS\n            Why Albania?\n\n                          BREAN\n            Why not?\n\nMOSS NODS DECISIVELY.  AS IF TO SAY, \"BY GOLLY, NOW YOU'RE TALKING...\"\n\n                          MOSS\n            Pat? Pat?\n\nONE OF THE ATTENDANTS RAISES HIS HEAD FROM THE TV AND SPRINTS OVER TO THE\nCABANA, WHERE WE SEE MOSS AND BREAN DEEP IN CONFAB.  MOSS GESTURES TO THE\nTRAY WITH THE JUICE AND THE CELERY.\n\n                          MOSS\n            ...throw this shit out.  Gemme a pot of coffee and a\n            packet of Camels.\n\nINT MOSS'S HOME, AFTERNOON.\n\nA GREENE AND GREENE BUNGALOW IN THE HOLLYWOOD HILLS, AMERICAN ART POTTERY\nALL AROUND.  MOSS IN BLUEJEANS AND A HAWAIIAN HAT, PACING BACK AND FORTH,\nSMOKING LIKE A CHIMNEY.\n\n                          MOSS\n            But at some point they gotta know.\n\n                          BREAN\n            Who?\n\n                          MOSS\n            The...\n                    (HE GESTURES OUT OF HIS WINDOW,\n                    MEANING, \"THE PUBLIC\")\n\n                          BREAN\n            \"They Got To Know?\"  Stan...?  Get with it.  Who Killed\n            Kennedy...?  I read the first draft of the Warren\n            Report, said he was killed by a Drunk Driver.  You\n            watched the Gulf War.  What did you see?  Day after\n            day, the one \"Smart Bomb\" falling into a building.\n            The truth, I was in the building when they shot that\n            shot, they shot it in a studio, Falls Church Virginia,\n            1/10th scale model of a building.\n\n                          MOSS\n            Is that true?\n\n                          BREAN\n            How the fuck do we know.  You take my point?\n\n                          MOSS\n                    (SHAKING HIS HEAD)\n            ...going to War...\n\n                          BREAN\n            It's not \"war.\"  It is a Pageant.  It's a Pageant...\n            Like the Oscars... why we came to you...\n\n                          MOSS\n            I never won an Oscar.\n\n                          BREAN\n            N'it's a crying shame.  But you staged the Oscars...\n\n                          MOSS\n            Yes.  Indeed I did.\n                    (PAUSE)\n\nHE LOOKS OVER AT HIS WALL FULL OF PLAQUES AND TROPHIES.\n\n                          MOSS\n                    (CONT.)\n            You know, you're a writer, that's your script.  You're\n            a director...\n                    (HE GESTURES, ET CETERA.)\n            But if you're the producer ... what did you do?\n                    (PAUSE)\n            What did you do?  All you've got is the credit...\n                    (PAUSE)\n            Some plaque on the wall...\n\nHE SHAKES HIS HEAD SADLY.\n\n                          BREAN\n            And if you never won an Oscar, How'd you like an\n            ambassadorship...\n                    (PAUSE)\n\n                          MOSS\n            Hell, I'd just do it for the hell of having done it,\n            for a story to tell...\n\n                          BREAN\n            Well, no, well, you couldn't tell any...\n\n                          MOSS\n            Hey, I know that, hey, I'm kidding...\n                    (PAUSE)\n            \"It's a pageant\"\n\n                          BREAN\n            ...that's what it is.\n\n                          MOSS\n                    (TO HIMSELF)\n            \"The Country Is At War.\"\n                    (PAUSE)\n\n                          BREAN\n            It's Miss America, N'you're Bert Parks.\n                    (PAUSE)\n\n                          MOSS\n            ...Yoha, Yoha... Yoha.\n                    (PAUSE)\n            Why Albania?\n\n                          BREAN\n            Because.\n\n                          MOSS\n            They got to have something that we want.\n\n                          BREAN\n            I'm sure they do.\n\n                          MOSS\n            What do we have that they want?\n\n                          BREAN\n            \"Freedom.\"\n\n                          MOSS\n            Why would they want that?\n\n                          HAKAN\n            They're Oppressed.\n\n                          MOSS\n            No, no, no.  Fuck Freedom.  No.  Fuck Freedom.\n            They.... They Want... They Want To Destroy the Godless\n            Satan of the United ... They want to destroy our Way of\n            Life.  Okay, okay, okay, could we ... okay:  the\n            President is in China.  He is dealing with a Dispatch\n            of the B-2 Bomber to Albania.  Why?\n                    (HE SHRUGS, HOLDS UP HIS HANDS, TO SAY,\n                    \"YOU TELL ME...\")\n\n                          AMES\n            Alright, well, alright:  geopolitically...\n\nMOSS GESTURES FOR SILENCE.\n\n                          MOSS\n            We've just found out They Have the Bomb.  We've Just\n            Found Out They Have The Bomb, aaaand... No, No wait a\n            second, no, no, wait a second, No.  The Bomb's not...\n            it's not there -- because they'd have to have a\n            rocket and that shit n'they're a buncha wogs-- it's ...\n            it's a suitcase Bomb.  Ooookay.  It's a suitcase bomb,\n            and it's .... in Canada!  Eh?  Albanian Terrorists have\n            placed a suitcase Bomb in Canada, in an attempt to\n            infiltrate the bomb into the USA.\n\n                          AMES\n            You know what?  This is good.  This is terrific, and\n            I'll tell you why:  it's cost effective.  This is....\n\n                          MOSS\n                    (SHRUGS)\n            It's producing.\n\n                          AMES\n            No, this is great.\n\n                          MOSS\n            I could tell you stories:  Cecil B. Demille:  Alright?\n            The Greatest Show on Earth:  He needs an elephant,\n\nGRACE COMES IN WITH A PHONE, TO AMES.\n\n                          GRACE\n            I have the White House on the Line.\n\n                          MOSS\n            ...one minute:  Demille needs an elephant for a\n            reshoot.\n\n                          AMES\n                    (TAKES THE PHONE)\n            Ames here.  Yessir...\n                    (HE LISTENS.)\n\n                          MOSS\n            Okay.  Okay.  The Suitcase Bomb...\n\n                          GRACE\n            ...good title for a movie....\n\nMOSS GESTURES \"WRITE IT DOWN\"\n\nAMES WANDERS AWAY, RELATING THE PROCEEDINGS INTO THE PHONE.\n\n                          AMES\n            ...\"Terrorism,\" and an attempt to infiltrate...\n\n                          MOSS\n            ...the Suitcase Bomb.  ACT ONE Albania denies it.\n            President comes on the air, \"Be Calm.\"  Okay, now:\n            Good.  Now, Alright.  Act TWO...\n                    (TO GRACE)\n            I need the following here.  Right now:  Johnnie Green,\n            Liz Butsky, and get me the Fad King.\n\n                          GRACE\n            Isn't Johnny Green in the...\n                    (SHE GESTURES, LOONEY BIN)\n\n                          MOSS\n            No, he's back in Nashville.\n\n                          BREAN\n            ...who is this guy...?\n\n                          MOSS\n                    (TO BREAN)\n            Act Two:  and then, Act Two...\n\n                          BREAN\n            We don't need an Act Two.\n\n                          MOSS\n                    (ON THE PHONE)\n            And get me the Fad King.  No.  Get him First...\n                    (TO BREAN)\n            We don't need an Act Two?\n\n                          BREAN\n            We've just got to hold their interest for ten more\n            days, till the Election.\n\n                          MOSS\n            ...it's a Teaser!\n\n                          BREAN\n            It's a teaser, absolutely right,\n\nAMES IS SEEN IN THE B.G. ON THE CELLPHONE.\n\n                          AMES\n                    (ON THE PHONE, SOTTO)\n            The thinking is, as of this moment, Terrorism...\n                    (HE COVERS THE PHONE)\n            ...they're getting a Good Reaction on the \"Albania\"\n            thing...\n\nBREAN SHRUGS, TO SAY, \"OF COURSE.\"\n\n                          MOSS\n                    (ON THE PHONE)\n            Hello, King.  How the heck are you...?\n                    (PAUSE)\n            Get out...\n                    (PAUSE)\n            Get out... Well, man, you fall in love like a\n            Hillbilly...\n                    (HE COVERS THE PHONE, EXPLAINING TO\n                    THOSE NEAR HIM)\n            Ditch the wife, toss the kids in the Pick-up,\n                    (HE GESTURES, MEANING, YOU KNOW...)\n                    (To THE FAD KING)\n            Listen, King:  Get your fat redneck ass out here,\n            willya...\n\n                          AMES\n                    (TO BREAN, STILL HOLDING THE PHONE TO\n                    HIS EAR)\n            ...but the President wonders about the Possible\n            Albanian Backlash...\n\n                          BREAN\n                    (SHRUGS)\n            You can't have a war without an enemy.\n\n                          MOSS\n                    (ON PHONE)\n            No, King, I need you here yesterday...\n                    (TO BREAN)\n            How long do I need him for?\n\n                          BREAN\n                    (CORRECTING HIMSELF)\n            Well, you could have one, but it'd be a very\n            ineffective war...\n                    (TO MOSS)\n            We're done in 10 days...\n\n                          MOSS\n            Ten Days.\n                    (COVERS THE PHONE)\n            There going to be any Back End in this thing?\n\n                          BREAN\n            W...what?\n\n                          MOSS\n            ...there gonna be any money in this thing?\n\n                          BREAN\n            \"Back End\" ... count on it.\n\n                          MOSS\n                    (TO PHONE)\n            Lots n lotsa cash.  Stay on for Gracie, she'll get you\n            a ticket\n                    (HE HANGS UP)\n\n                          AMES\n                    (TO BREAN)\n            ...where is the Back End coming from?\n\n                          BREAN\n            It's like that thing with the Yellow Ribbon...\n\n                          AMES\n            The thing with the Yellow Ribbon...\n\n                          BREAN\n            The Hostages...?\n\n                          AMES\n            The hostages, but that was a naturally-occuring...\n                    (BREAN GIVES HIM A LOOK TO SAY, \"OH,\n                    GROW UP\")\n            It was a put-up job?\n                    (BREAN GIVES HIM THE LOOK AGAIN)\n            But where was the, where was the money in that?\n\n                          BREAN\n            In the yellow ribbon.\n\n                          AMES\n            ...the Yellow Ribbon, but who, who'd profit from\n            that...\n\n                          BREAN\n                    (LONG SUFFERING)\n            The Ribbon Manufacturers.\n\n                          MOSS\n                    (INTO THE PHONE)\n            King, King, I got a thing here, a product placement,\n            gonna have a bigger back-end than Hattie McDaniel.\n            Now:\n\nAMES, CELLPHONE TO HIS EAR, APPROACHES BREAN -- BREAN WAVES HIM OFF.\n\n                          BREAN\n            I gotta protect the Canadian Horder,\n\nBREAN PICKS UP ANOTHER PHONE, AND STARTS\n\n                          BREAN\n                    (INTO THE PHONE)\n            Here's what we want to do:  The Park Police, the\n            Border Patrol, and the US Marshall's Service.  The D.E.\n            the A.T.F, all of em, Stand by for instant\n            mobilization, 'long the Canadian Border.\n                    (PAUSE)\n            And tell 'em there's nothing to be alarmed about.\n\nINT MOSS'S DINING ROOM NIGHT.\n\nMOSS, BREAN, AND THREE MORE PEOPLE, PADS AND NOTES TACKED ONTO THE WALL.\n\nCAMERA PANS OVER THE TABLE.  ONE NEWSPAPER, THE EDITORIAL CARTOON SHOWS\nTHE PRESIDENT.  A GIRLSCOUT IS HANDING HIM A BOX OF COOKIES, AND HE IS SAYING,\n\"I KNOW I REALLY SHOULDN'T\"... ON ANOTHER THE EDITORIAL CARTOON SHOWS THE\nGREAT SEAL OF THE PRESIDENT, THE MOTTO, WRITTEN AROUND THE CIRCUMFERENCE\nREADS, \"SIT ON MY LAP.\"\n\n                          JAY LENO\n                    (VO)\n            ...went into a Convenience store...\n\nANGLE\nTHE GROUP, MOSS, BREAN AND THREE MORE, WATCHING THE TV\n\n                          JAY LENO\n            ...asked if they had any girlscout cookies.  Five cops\n            jumped on me, took me off in chains...\n\nMOSS SWITCHES THE STATION.  WE SEE RICKY JAY, DOING A VANISH OF COINS.\nAPPLAUSE... CONAN O'BRIAN BECKONS RICKY OVER TO THE PANEL.\n\n                          CONAN\n            Ricky Jay, Ladies and Gentleman, Ricky, I guess we'd\n            have to say that you're the most famous manipulator of\n            small oblects in the World.\n\n                          RICKY JAY\n            No, I'd have to say, that'd be the President.\n\nLAUGHTER ON THE TV.\nMOSS SWITCHES THE CHANAEL AGAIN.  WE SEE SENATOR NOLE.\n\n                          SENATOR NOLE\n                    (ON TV)\n            ...taking refuge behind the fact of distance, taking\n            refuge behind the mention of Albania, of his stomach\n            flu, taking refuge, with the election those scant days\n            away, behind everything except avowal of his guilt.\n            Mr. President, if you have any shame, I ask you, the\n            public asks you, the electorate asks you to return,\n            to face these terrible charges, to...\n\nTHE SCREEN GOES TO THE GREAT SEAL OF THE PRESIDENT\n\n                          ANNOUNCER\n            ...from Airforce One.  In China.  The President of the\n            United States.\n\n                          PRESIDENT\n            My fellow Americans.  I apologize for the need for\n            secrecy.  I assure you that had it not been\n            necessary to ensure the safety of our men and women\n            in the Combat Arms.  The Republic of Albania, long\n            a staging ground for terrorists around the World, is\n            in the procesa of mounting ... actions directed against\n            the people of the United States.  In consultation with\n            my advisors, I have elected to take the following\n            precautionary measures:\n\nEXT POOLSIDE, MOSS'S HOME, L.A. NIGHT.\n\nTHE FAD KING, A SLOPPILY FAT FELLOW IN A DIRTY T-SHIRT, IS WALKING THE POOL,\nHOLDING FORTH TO MOSS, AND JOHNNY GREEN, A NASHVILLE TYPE, AND LIZ BUTSKY, A\nCOSTUME DESIGNER, WHO IS SKETCHING ON A PAD.\n\n                          FAD KING\n            It's a, it's a...\n                    (LIZ STARTS TO TALK)\n            It can't be a ribbon...\n\n                          LIZ\n            Why can't it be a ribbon?\n\n                          FAD KING\n            It can't be a ribbon cause AIDS had a ribbon, cause\n            the Yellow Ribbon thing had a ribbon, cause...\n\n                          MOSS\n            Look, look, look, look, Canada, okay...?  Our neighbor\n            to the North, alla sudden, transformed, into That\n            Place, where, like the North Wind, Terror comes...\n\n                          FAD KING\n            Keep Talking....\n\n                          MOSS\n            What guards Us Against Canada...?\n\n                          AMES\n                    (PHONE TO HIS EAR)\n            ...we've got a crash poll, says...\n                    (HE LISTENS)\n            Sixty seven percent of the\n                    (BEAMS)\n            American People, on hearing the President's Speech...\n\nJOHNNIE GREEN WALKS AWAY, HUMMING TO HIMSELF, \"I GUARD THE NORTHERN\nBORDERS...\"\n\nFAD KING AND LIZ WAVE AMES OFF, MEANING, \"WE HAVE ADULT WORK TO DO HERE.\"\n\n                          LIZ\n            Uh...uh... Mounties.  The Mounties Guard The Border.\n            uh... those Mountie Hats.\n\n                          FAD KING\n            They look stupid.\n\n                          LIZ\n            We had Davy Crockett hats... They made a fortune.\n\n                          FAD KING\n            We had Davy Crockett hats, but you could crush'em ...\n            you could crush'em, see, when you felt stupid.\n            Crush'em, put em in your Pocket.  You can't put a\n            Mountie hat in your...\n\nMOSS WALKS THROUGH THE SHOT, WITH BREAN.\n\n                          MOSS\n                    (EXPANSIVELY)\n            Y'see, this is what Producing is:  you put me in a\n            Room...\n\n                          AMES\n                    (LISTENING TO THE PHONE)\n            ...and he's got a negative rating of...\n                    (HE SMILES)\n\n                          MOSS\n                    (TO FAD KING, PROMPTING)\n            King, we've got to be on the streets in...\n\n                          FAD KING\n            ...what am I doing?  Do you see me working...?\n                    (TO LIZ)\n            Here's what you want to do, you want to come out of the\n            box, an item, someone 'ready has, but then you sell\n            it to'em.  Torn jeans, uh ... faded Levi Jackets, uh...\n            uh...\n\n                          MOSS\n            Where are we on the Image?  Grace?  Grace...\n\nANGLE\nOVER A SLEEPING BREAN, STRETCHED OUT ON A POOLCHAIR, GRACE, THE SECRETARY,\nCOMES OUT ON TO THE POOL AREA, HOLDING THE SHOT OF A SMALL, FOREIGN LOOKING\nCHILD, IN FRONT OF A PILE OF RUBBLE.\nSHE SHOWS IT TO MOSS.\n\n                          MOSS\n            ...we own it?\n\n                          GRACE\n            Public Domain.\n\n                          MOSS\n            And what?  What?  She was Driven From Her Home, by\n            Albanian Terrorists.  It is her we are mobilizing to\n            defend... it is \"she\"?\n\n                          GRACE\n            We-are-mobilizing-to-defend-her.\n\n                          MOSS\n            Can we give'er a kitten?\n\n                          GRACE\n            No problem.  Here's the...\n\nSHE GOES BACK INTO THE HOUSE.\n\n                          FAD KING\n            I gotta get something, I gotta get ...shoes?  Ties?\n            Hats...?\n                    (TAKES A SHEAF OF HEADSHOTS FROM\n                    GRACE)\n            Good.  Good.\n                    (HE PASSES THEM AROUND, WE SEE THEY\n                    ARE ALL GIRLS AROUND FOURTEEN WITH LONG\n                    BLONDE HAIR.)\n\n                          BREAN\n            ...what is this?\n\n                          MOSS\n            Headshots.  Girls to play the girl in our footage.\n                    (OF A PHOTO)\n            I like the sorrowful one.  Anybody Else....?\n                    (HE PASSES THE PHOTOS AROUND.)\n\n                          FAD KING\n            ...what is this?\n\n                          BREAN\n\n            Young-Albanian-girl-driven-from-her-home.\n\n                          FAD KING\n            I go with this here...\n                    (HE WALKS OFF SHAKING HIS HEAD.)\n\n                          MOSS\n            Too Texan.  Go with the stick.  Thanks.\n                    (TO THE FAD KING.)\n            What...? ...does it have to be Albania...We're locked\n            into Albania...why?\n\n                          JOHNNY GREEN\n            It's tough to rhyme.\n\n                          MOSS\n            I believe in you....\n\n                          JOHNNY GREEN\n            Albania, Albania, Albania, James bond Villains.\n\n                          MOSS\n            John Belushi... Jim Belushi...\n\n                          JOHNNY GREEN\n            Jim Belushi...?\n\n                          MOSS\n            Surest thing you know.\n\n                          FAD KING\n            Shoes, Hats....\n\n                          LIZ\n            The special hats of the Special Anti-terrorist\n            detachment of the Border Patrol.\n\n                          MOSS\n                    (MULLING IT OVER)\n            The Special Anti-Terrorist Detachment of the Border\n            Patrol... what do they do...?\n\n                          LIZ\n                    (SHRUGS)\n            ...they... you know...\n\n                          JOHNNY GREEN\n            They guard our, you know ... \"borders,\" night and\n            day...\n\n                          MOSS\n            Yeah, good good good good good.  And They're So\n            Secret...\n\n                          LIZ\n            Oh huh...\n\n                          MOSS\n            ...they have the capacity to Meld into the Woods,\n            and...\n\nALL NOD\n\n                          MOSS\n                    (CONT.)\n            And one of them is in love with the sister of...\n\n                          LIZ\n            I'm just talking about the Hats.\n\n                          MOSS\n            The hats.\n\n                          LIZ\n            A beret.\n\n                          MOSS\n            Why a beret?\n\n                          LIZ\n            Cause you can crush it and put it in your pocket.\n\n                          MOSS\n            \"...the special detachment...\"\n            Good!  What is it?\n\nBREAN WAKES FOR A MOMENT, AT THE SHOUTING, LOOKS AT HIS WATCH.\n\n                          BREAN\n            Three-o-three...\n\n                          MOSS\n            The men and women of Detachment Three-O-Three, with\n            their...\n\n                          FAD KING\n            Black...\n\n                          LIZ\n            Leopard Skin...\n\n                          MOSS\n            With their berets...\n\n                          LIZ\n            ...their Leopard Skin Berets....\n\n                          FAD KING\n            Well, that ain't very butch, is it?\n\n                          LIZ\n            It's a beret...\n\nCAMERA TAKES MOSS TO THE TV WHERE BREAN IS WATCHING A \"CHANGE HORSES IN\nMIDSTREAM\" AD, SHOWING TWO RETIRED LADIES, SITTING OUT ON A PORCH IN THE\nSOUTH, ON A ROCKER.\n\n                          LIZ\n                    (CONT.)\n            ...you said you wanted something they could stuff in\n            their pocket...\n\n                          FAD KING\n            ...I meant the Leopard Skin...\n\n                          LIZ\n            British Regiments drape their drums in Leopard Skins.\n\n                          FAD KING\n            Thank God this is America.\n\n                          MOSS\n                    (DISTRACTED)\n            How about half-black, half leopard skin...\n\n                          TV OLD LADY\n            ...why change Horses in Mid Stresm, that's what I ...\n\n                          MOSS\n                    (SHAKING HEAD SADLY)\n            Why are they sticking with this age old horseshit?\n\n                          BREAN\n                    (SHRUGS)\n            \"If One Twinkie is Funny, Two Twinkies are Funnier...\"\n\nAMES WALKS IN WITH HIS ARMS FULL OF FAXES.  HE READS FROM THEM.\n\nAS HE PERUSES THEM WE SEE THE FAD KING, HE GOES, DREAMILY, TO A PHONE, AND\nDIALS.\n\n                          FAD KING\n                    (INTO PHONE)\n            Bunny:  I had an idea:  a Slinky, that falls Up...\n                    (PAUSE)\n            Naa, we can figure that out.  What I'm wondering:  what\n            do we call it...\n                    (PAUSE)\n            You got my number...\n                    (HE HANGS UP.)\n\n                          MOSS\n                    (TO AMES)\n            Why are they ...\n\n                          AMES\n                    (OF FAXES)\n            NY Times, Washington Post, War, War, War.  Times got\n            the girlscout page twelve, Post in Section Two....\n            Horses in Mid-Stream...?\n\n                          MOSS\n            I don't think you're gonna need it.\n\n                          AMES\n            Well, we paid for it, we got the guys on a retainer.\n\n                          MOSS\n            They got the guys on a retainer, it's cheaper, pay'em,\n            but don't lettem touch it... Let'em leave us alone.\n\n                          AMES\n            What can it hurt.\n\n                          MOSS\n            What can it hurt is they offend me.\n\nIN THE B.G. WE SEE BREAN, WALKING AROUND WITH A CELLPHONE.\n\n                          LIZ\n            I need a ruling on the Hats.  I say a Leopard-skin,\n            and...\n\n                          MOSS\n            Hey, you're getting the big bucks....\n                    (TO BREAN)\n            I think we're up-and-running...\n\nJOHNNY GREEN COMES OVER, \"JUST LISTEN TO THIS.\"\n\n                          JOHNNY GREEN\n                    (SINGS)\n            Canada your Peaceful slumbers\n            Guard our Border To The North...\n            The Rightful Order\n            Of Our Border...\n\nHE SHAKES HIS READ, AND RETIRES.  GRACE COMES OUT WITH A TRAY OF COFFEE, FROM\nWHICH THEY TAKE A CUP.\n\n                          FAD KING\n            Kid comes to School.  Teacher:  You're late for\n            Geography Class.  Kid:  I din' get my breakfast.\n            Teacher:  siddown, where's the Canadian Border.  Kid:\n            In bed wit My Mom.  That's why I missed my breakfast...\n\nGRACE REACHES IN HER BACK POCKET, HANDS MOSS SEVERAL SHEETS\n\n                          GRACE\n            We got the Albanian Girl, with a cat, with a kitten,\n            with a dog...\n\n                          MOSS\n            I didn't ask for a dog.\n\n                          GRACE\n                    (SHRUGS)\n            ...the pet wrangler suggested it..he's also got a...\n\n                          AMES\n            I think I should check with the President -- to see\n            what kind of animal he...\n\n                          GRACE\n            The Pet wrangler has also got a...\n\n                          MOSS\n            Do it later...\n                    (OF THE PHOTO)\n            Okay,  now, \"The Little Girl,\" who is she, what is she\n            doing?  She is....she's ...Okay, okay, it's an Albanian\n            village... She is the victim of, she has been\n            relocated, to, to, for the terrorists, the Government\n            Labs...the, the... a staging area for their Atomic\n            workshop.\n                    (PAUSE)\n            They're torturing her family, because they have\n            connections in Canada, which would permit the\n            terrorists access to the American Border.\n\n                          GRACE\n            Better.\n\n                          MOSS\n            You like it?\n\n                          GRACE\n            Yes.\n\n                          MOSS\n            Fine.  Good.\n\nGRACE EXITS.\n\n                          BREAN\n                    (HANGS UP THE CELL PHONE)\n            Would somebody wake me in five minutes?\n\n                          FAD KING\n            Does it have to be Albania?  Because, lookit:\n                    (HE HOLDS UP A SKETCH OF A BOOT)\n            I can get my hands on a lot of walking-around-cash, I\n            think, if it's Italy...Look at the tie-in here:  The\n            Boot, \"Givvem the Boot,\"... If we were to go Wide\n            with a shoe as the fad.  A \"Shoe-fad\"...  Here's what\n            it offers us...\n\n                          BREAN\n            We're locked into Albania.\n\n                          FAD KING\n            Well, let's not be too sure, why is that?\n\n                          BREAN\n                    (CHECKS HIS WATCH.)\n            The President is going to declare War against Albania\n            in a half an hour.\n\nBREAN ROUSES HIMSELF, WALKS TO THE POOL, AND BEGINS TO WASH HIS FACE IN IT.\n\nEXT STUDIO PARKING LOT L.A. DAWN.\n\nMERCEDES CONVERTIBLE PULLS UP, MOSS DRIVING.  HE AND BREAN GET OUT.\n\nINT STUDIO, DAWN.\n\nA TELEVISION, SHOWING THE PRESIDENT, SPEAKING.\n\n                          PRESIDENT\n            That a state of war has existed, between the United\n            States, and...\n\nBREAN AND MOSS BREEZE PAST THE SET, INTO A MOVIE MAKING SCENE.  TWENTY PEOPLE\nCLUSTERED AROUND A YOUNG GIRL IN TRADITIONAL ALBANIAN DRESS WHOSE HEADSHOT\nWE SAW EARLIER, BEING FUSSED-UP AND TWEAKED BY HAIR AND MAKE-UP.\n\n                          MOSS\n            Good morning, My name's Stanley Moss, I'll be your\n            director this morning, what I'd like you to do, Miss,\n            what is your name...\n\n                          ALBANIAN TYPE\n            Trudy Larouche.\n\n                          MOSS\n            ...\"Trudy,\" is, to start at that wall...\n                    (HE GESTURES AT THE SWEEP)\n            and, on my signal, \"action\" to run toward me,\n            screaming ...they taking care of you...?  Good.  You\n            wanna cuppa tea?  Okay.  Can we just try one, just for\n            the...\n\n                          TRUDY\n            I understand this is going to be National?  Is that the\n            case?  Because my agent didn't get a chance to...\n\nTHEY ARE WALKED OVER TO AN AREA IN WHICH WE FIND THE PET WRANGLER, SURROUNDED\nBY SEVERAL ANIMAL CASES WITH DOGS IN THEM.\nMOSS, AS HE SPEAKS, IS SURVEYING THE DOGS.\n\n                          MOSS\n            Well, it's a little bit of a...\n\n                          A.D.\n            ...we're going for a direct buy-out.\n\n                          MOSS\n            ...you have your agent check with the...\n\n                          TRUDY\n            No, I know it's going to be fine.  I'm so excited, and\n            I'm looking forward to putting it on my resume.  When\n            you called last...\n\nBREAN TAKES TRUDY ASIDE.\n\n                          BREAN\n            Eh, Trudy, could I talk to you for a moment...?  You\n            know, this project is a... \"Funny\" kind of...\n\nHE WALKS HER ASIDE.  MOSS SELECTS A DOG, AND AMES COMES OVER TO HIM, HOLDING\nA CELLPHONE.\n\n                          AMES\n                    (DESCRIBING THE SCENE, INTO THE PHONE)\n            A schnauzer.  What appears to be a...\n\n                          PET WRANGLER\n            Lhasa Apso.\n\n                          AMES\n                    (INTO PHONE)\n            Lhasa Apso, and a...\n         \nHE LOOKS AT THE THIRD DOG.\n\n                          PET WRANGLER\n            What you have here is a cross-breed, between a dog\n            which was substantially a...\n\nAMES GESTURES HIM FOR SILENCE, AS HE LISTENS TO THE PHONE.\n\n                          AMES\n                    (INTO THE PHONE)\n            Abso... absolutely, sir... Absolutely.\n                    (TO MOSS)\n            He wants a kitten.\n                    (PAUSE)\n\n                          MOSS\n                    (TAKING CHARGE)\n            Okay.  Here's what we're gonna do.\n\nHE GESTURES TO HIS ASSISTANT, WHO COMES OVER FOR A CONFERENCE.\n\n                          MOSS\n                    (CONT.)\n            I need a little bit of help...?\n\nANGLE ON BREAN WALKING TRUDY.  HE GESTURES TO AMES.\n\n                          AMES\n            Miss, we are going to ask you to sign this little sheet\n            of paper...\n\n                          TRUDY\n            Well, my agent would be ril ril miffed with me, if I\n            signed anything, uh, to...\n\n                          AMES\n            This does not have to do with your Deal.  This is for\n            your Security Clearance.\n                    (PAUSE)\n\nHE TAKES OUT A SHEET OF PAPER FROM HIS POCKET.\nTHEIR WALK HAS BROUGHT THEM AND THE CAMERA BACK TO MOSS AND THE ASSISTANT, AND\nTHE DIRECTOR.\n\n                          DIRECTOR\n                    (TO MOSS)\n            ...fix it in the mix.\n\n                          ASSISTANT\n            We're going to do it digitally...\n\n                          MOSS\n            ...can we shoot one?\n\n                          DIRECTOR\n            Alright, now we're gonna...\n\nTHE PET WRANGLER HANDS A DOG TO TRUDY.  THE ASSISTANT WAVES HIM OFF, AND\nLOOKS AROUND, AND HANDS HER A BAG OF POTATO CHIPS.\n\n                          ASSISTANT\n            ...run with this...\n\n                          TRUDY\n            ...these'r potato chips...\n\n                          DIRECTOR\n            Just, uh, just hold the bag when you run.\n\n                          MOSS\n                    (TO BREAN)\n            We need it for the Arm Position, on the screen it'll be\n            a kitten.\n\n                          TRUDY\n            Someone's bringing in a kitten...?\n\n                          MOSS\n            No, no, no.... we'll punch in a kitten.  Um... Later.\n\n                          TRUDY\n            ...you're gonna Punch in a Kitten Later.\n\n                          MOSS\n            Yes.\n                    (PAUSE)\n\n                          TRUDY\n            Why...?\n\n                          A.D.\n            Okay, settle, people.  Settle... we're gonna try\n            one...\n\n                          MOSS\n            It gives us a wider option.\n\n                          TRUDY\n            A wider option of what?\n\n                          MOSS\n                    (DISTRACTED)\n            ...of kittens...\n\nTWO HAIR AND MAKE-UP WOMEN JUMP IN, AND START TWEAKING TRUDY, AS MOSS'S\nATTENTION IS DIVERTED ELSEWHERE.\nTRUDY ADDRESSES HERSELF TO BREAN.\n\n                          TRUDY\n            ...but, you know, all kidding aside.  When this goes\n            National.... I get to put it on my resume.\n\n                          BREAN\n                    (WHO IS DIALING A PHONE)\n            Actually, no.\n\n                          TRUDY\n            Because, like, what is it, a Guild thing?  I mean,\n            what, what, what could they do to me...\n\n                          BREAN\n            ...someone would come to your house and kill you.\n                    (TO PHONE)\n            Hello... we're about to start shooting...\n\n                          A.D.\n                    (TO HAIR AND MAKE-UP)\n            Hey, hey, hey, she's ... will you?  She's just been\n            raped by Terrorists, jump out, will you...\n\nTHE A.D. SHOOS HAIR AND MAKE-UP AWAY.\nCAMERA GOES WITH BREAN, PAST AMES, WHO IS ADDRESSING HIMSELF TO THE A.D.\n\n                          AMES\n            And...she's not an Illegal Immigrant?  Is she?  Can I\n            see her \"chart?\"  Because...\n\n                          MOSS\n            Gonna be fine.  Gonna be fine, people?  Are we getting\n            there...?\n\nBREAN WANDERS BACK TO THE CONTROL BOOTH WHERE WE SEE THE SCENE ON SEVERAL\nMONITORS AND THE YOUNG GIRL, STANDING AGAINST THE BARE SWEEP ON THE BACK WALL.\nWE HEAR \"ACTION\" AND THE YOUNG GIRL RUNS FORWARD.  WE HEAR THE TECHNICIANS\nMUTTERING, AND THEY PUNCH UP A PLAYBACK, AND WE SEE THE SAME RUN-FORWARD,\nREPLAYED AGAINST AN \"ALBANIAN VILLAGE\" SCENE.\n\n                          TECHNICIAN\n            ...gimme some flames...\n\nAS HE SPEAKS, FLAMES ARE ADDED TO THE SCENE...\n\n                          TECHNICIAN\n            ...some sound of Screaming...?\n                    (SCREAMING IS ADDED)\n            ...whoo-aahh sirens?  Anne Frank?...\n\nTHE SIRENS ARE ADDED.\nMOSS COMES INTO THE CONTROL BOOTH, AND TALKS TO THE ACTOR.\n\nANGLE\nON AMES AND BREAN, IN THE CONTROL ROOM.\n\n                          AMES\n            ...can we see the Kitten...?\n\nTHE PHONE RINGS, AMES PICKS UP HIS CELLPHONE.\n\n                          AMES\n                    (CONT.)\n            Hello... Yes.  We'll be back...?\n\n                          BREAN\n            We'll be back tonight.\n\n                          AMES\n                    (TO PHONE)\n            Tonight.\n                    (HE HANGS UP)\n            Well, you've started a Tempest in a Teapot.\n\n                          BREAN\n            Waal, that's where you want em...\n\n                          AMES\n            ...I just hope...\n\n                          MOSS\n                    (TO TRUDY)\n            Do it again, love, will you...?  We'll tell you before\n            we're going to shoot...\n\nWE SEE ON THE MONITOR THE YOUNG GIRL RUNNING WITH THE BAG OF POTATO CHIPS,\nVARIOUS BURNING BUILDINGS IN THE B.G.\n\n                          MOSS\n            ...could she be running across a bridge?  She's running\n            across a Burning Bridge.\n\nONE OF THE TECHNICIANS' FACES LIGHTS UP.\n\n                          TECHNICIAN\n                    (TO HIMSELF)\n            ....beautiful.\n\nWE PLAYBACK THE LAST RUNTHROUGH, AND THE GIRL IS NOW RUNNING ACROSS A BRIDGE.\n\n                          MOSS\n                    (LEANS IN TO TALK WITH THE TECH PEOPLE)\n            Of course, we're gonna need some water, uh...\n\n                          TECHNICIAN\n            Is it a stream, or is it a...\n\n                          MOSS\n            No, I think..\n\n                          TECHNICIAN\n            a \"pond,\" or\n\n                          MOSS\n            No, I think it's ... can we see the calico kitten...?\n\nAS HE SPEAKS THE BAG OF CHIPS IS TRANSFORMED INTO A CALICO KITTEN.\n\n                          AMES\n                    (ON HIS PHONE)\n            A small, \"calico\" kitten, sir.\n                    (PAUSE)\n            \"Calico.\"\n                    (PAUSE)\n\n                          AMES\n                    (TO MOSS)\n            ...can we have a white one...?\n\n                          MOSS\n                    (TO DIRECTOR)\n            Can we have a white one, please...\n\nAS THEY SPEAK THE BROWN KITTEN IS TRANSFORMED INTO A WHITE ONE.\n\n                          MOSS\n                    (CONT)\n            You know, if we're gonna run with the kitten, maybe it\n            turns out, the Kitten has a Name, and...\n\n                          DIRECTOR\n            We ready out there...?\n\nBREAN LOOKS DOWN AT HIS WATCH, AND TAPS AMES ON THE SHOULDER, AS HE EASES HIS\nWAY PAST THE CONTROL CONSOLE.\n\n                          AMES\n                    (ENGROSSED)\n            ...one moment...\n\nINT L.A.X. DAY.\n\nA POSTER FILLS THE SCREEN.  IT IS A NORMAL ROCKWELL SORT OF THING SHOWING\nHAPPY AND PROUD AMERICANS OUTSIDE OF A VOTING BOOTH.  AND IT READS:  \"DON'T\nFORGET TO VOTE.  NOVEMBER 2ND.  IT'S YOUR DUTY -- IT'S YOUR RIGHT.\"\n\n\n                          PRESIDENT'S VOICE\n                    (VO)\n            ...a state of War.\n                    (PAUSE)\n            That a State of War...\n\nPAN OFF THE POSTER TO SHOW THE GATE AREA, MANY PEOPLE WAITING, WATCHING A\nTELEVISION SET, ON WHICH WE SEE THE PRESIDENT.\n\n                          PRESIDENT\n                    (CONT.)\n            ...exists...\n\nA TELEVISION SET, THE PRESIDENT ON THE TELEVISION.\n\n                          PRESIDENT\n            ...between the United States and Republic of Albania,\n\n            and that the Congress Authorize any and all measures\n            consonant with a swift and painless, and victorious\n            conclusion of that War.\n\nANGLE\nBUSINESS PEOPLE QUEUING UP, AT THE TV, BEYOND THEM, THE DEPARTURE GATE,\nSHOWING A SIGN, AMERICAN AIRLINES FLIGHT _____ TO WASHINGTON D.C.\nIN THE FOREGROUND, BREAN, ON A CELLPHONE, PAYS NO ATTENTION TO THE SCREEN, AS\nHE STANDS IN LINE.\n\n                          BREAN\n                    (ON THE PHONE)\n            Go with a two-tone hat, I don't care, you work it out.\n            You, well, I'm sure you've had similar problems in the\n            past.  Good.  Good.  Keep me ppp... Fine, I'll call you\n            from the plane.\n\nTHE TICKET TAKER, TAKING HIS TICKET, IS SHAKING HIS HEAD AT THE TELEVISION, ON\nWHICH WE SEE AN ANNOUNCER/COMMENTATOR, DOING, \"YOU HAVE JUST HEARD,\" ET.\nCETERA.\n\n                          TICKET TAKER\n            Hell of a thing.  Hell of a thing.\n\n                          BREAN\n            Innit?\n\n                          TICKET TAKER\n            Albanian Terrorists on the Canadian Border.\n\n                          BREAN\n                    (ABOUT TO GET ONTO THE PLANE)\n            ...makes you think.\n\nIN THE B.G, WE SEE THE TELEVISION HAS GONE TO A COMMERCIAL, TWO BUSINESSMEN\nTYPES, EACH PARKING HIS STATION WAGON IN HIS DRIVEWAY.\n\n                           TYPE ONE\n            Ed, what do you think?\n\n                           TYPE TWO\n            Bob, my mind wasn't one hundred percent made up,  but\n            now  it is:  I say:  don't go changing Horses in\n            Midstream...\n\nBREAN, HEARING THIS, WALKS BACK TO THE NOW DESERTED TELEVISION.\n\nANGLE\nFROM THE JETWAY THE DOOR ABOUT TO CLOSE, BREAN IN THE B.G. WATCHING THE\nINFOMERCIAL.  THE TICKET TAKER CALLS TO HIM, \"...SIR...?\"  BREAN TURNS AND\nRUSHES TO THE CLOSING DOOR.  ON THE TV, IN THE BG, WE SEE THE LOGO:  \"RE-ELECT\nTHE PRESIDENT.  THIS MESSAGE PAID FOR BY...\" ET CETERA.\n\n                          BREAN\n                    (INTO THE PHONE)\n            It's workmanlike, what can I tell you.... no, it ain't\n            going to help, but it won't hurt, cool down, see you in\n            Nashville.\n\nHE FOLDS UP HIS PHONE AND WALKS ONTO THE PLANE, IN THE B.G. WE SEE SENATOR\nNOLE, SPEAKING ON THE TELEVISION, THE REMAINING VIEWERS ARE DRIFTING AWAY.\n\n                          SENATOR NOLE\n            The issue of War, is, finally, an issue of Moral Fibre,\n            Moral Fibre.  In my Platoon, in World War Two\n\n                          BREAN\n                    (ON THE PHONE)\n            You have the number in D.C.?  Good.  What time\n            tonight... What...?\n                    (BREAN TURNS TO THE TELEVISION)\n\nBREAN COMES OVER TO AMES WHO IS ON THE PHONE, AND TALKING WITH LIZ BUTSKY, WHO\nIS SHOWING HIM SOME SKETCHES.\n\n                          LIZ\n            ...wanted to go with Roman Numerals... but there isn't\n            a Roman Numeral for Zero, so, you can't really do THREE\n            OH THREE, in Roman...\n\n                          BREAN\n                    (TURNING TO AMES, OF NOLE)\n            Why is this putz on the air...\n\n                          AMES\n            ... they're checking the ratings...uh...\n\n                          LIZ\n            ...and I wanted to ask you if you thought it made sense\n            that the uniforms of the Freedom fighters were\n            starched.\n                    (PAUSE)\n            I know that, traditionally,\n                    (SHE FLIPS A CARD AND WE SEE THE\n                    STARCHED UNIFORMED FREEDOM FIGHTER\n                    DRAWN BY HER)\n            ...they're torn, and so forth:  days-in-the-mountains,\n            so on, but I thought...\n\n                          BREAN\n                    (INTO THE PHONE)\n            Why am I seeing this guy on the News...?\n                    (PAUSE)\n            What am I missing...?  What are we forgetting?\n\n                          AMES\n            Well, at least we're not seeing the Girlscouts...\n\nHE TURNS AROUND\nANGLE, HIS POV.\nA YOUNG DISHEVELLED COLLEGE STUDENT TYPE.  HE WEARS A BUTTON ON HIS JACKET.\n\nANGLE INS\nTHE BUTTON READS, \"FUCK ALBANIA\"\n\nANGLE\nAMES AND BREAN.\n\n                          AMES\n                    (OF THE BUTTON)\n            ...is that \"us\"...?\n\nBREAN AND LIZ BUTSKY SHAKE THEIR HEADS.\nAMES JUMPS UP IN THE AIR AND YELLS \"YAY.\"\n\n                          SENATOR NOLE\n            Especially in a time of war.  Now:\n            We said that Moral fibre, not guns, not supplies, not\n            strategy, Moral...\n\n                          COMMENTATOR\n                    (INTERRUPTING)\n            ...Senator...?\n\n                          SENATOR NOLE\n            And this man, our President, in what I hope will be his\n            last days in that office, has proved himself empty and\n            devoid of...\n\nA SMALL CHILD COMES OVER TO THE TELEVISION AND CHANGES THE CHANNEL.\n\nINT DULLES AIRPORT ARRIVALS AREA, DUSK.\n\nBREAN AND AMES COMING OFF OF THE PLANE, BREAN STOPS AT THE FREE PERIODICALS\nDISPLAY.  SAMPLE HEADLINES READ:\n\nDEFENSE OF THE REALM:  TERRORISM ALONG THE BORDER:  THE PRESIDENT:  ALL SPUNK:\nCALL TO THE COLORS:  DEFEND THE NORTH, ETC.\n\nHE PICKS UP SEVERAL, AND CAMERA FOLLOWS HIM DOWN A HALL, PAST A HUGE POSTER\nSHOWING OPPRESSED COMMUNIST HORDES, AND THE MOTTO \"THEY DIDN'T HAVE THE\nCHOICE, YOU DO.  VOTE!  IT'S YOUR RIGHT!\"\n\nANGLE\nTIGHT ON BREAN AND AMES, AND A FELLOW PASSENGER, AS ALL SCAN THEIR NEWSPAPERS.\nTHE PASSENGER IS WAITING IN LINE TO USE A PAY PHONE.\n\n                          BREAN\n                    (AS HE NUDGES AMES)\n            Can't find anything in here about the President and\n            that girlscout.\n\n                          PASSENGER\n            ...what are you talking about...  What does that mean\n            now, are you nuts...?\n\nTHE PASSENGER MOVES UP IN TURN TO TAKE THE PHONE, HE DIALS.\n\n                          PASSENGER\n                    (INTO PHONE)\n            Hello, Honey.... NO.  I'm safe.  In about an hour.\n            Have you got Grandma and the kids in...?  Well, where\n            am I talking to you?  Well, who has the Shotgun?  Go\n            Down in the Basement.  Well, get the long cord, and...\n            isn't there a jack down there...  Well, move, the\n            canned goods, and...\n\nTHE LINE BREAN AND AMES ARE IN MOVES FORWARD, PAST THE MAN ON THE TELEPHONE.\n\nTIGHT ON AMES AND BREAN, AS THEY MOVE FORWARD, THEY SPEAK UNDER THEIR BREATH.\n\n                          AMES\n                    (SHAKING HIS HEAD)\n            ...hell of a price for the country to pay.\n\n                          BREAN\n            ...take a long view.\n\n                          AMES\n            ...what's the Long View?\n\n                          BREAN\n            Your guy gets four more years in Washington...  ...it's\n            only Nine More Days.\n\n                          AMES\n            Yes.  That's true.  But...\n\n                          BREAN\n                    (SMILES)\n            Wilfred.  We've got work to do...\n\nTHE LINE THEY ARE IN STOPS.  BREAN LOOKS UP.\n\nANGLE, HIS P.O.V.\nA LINE OF SERVICEMEN, ARMED WITH SUBMACHINE GUNS, STANDS BARRING THE ARRIVING\nPASSENGERS AN EXIT.  THE PASSENGERS ARE HERDED INTO LINES, TO GO THROUGH\nMAKESHIFT BARRICADES, AND METAL DETECTORS.\n\nANGLE\nBREAN, AND ANOTHER PASSENGER.\n\n                          BREAN\n            ...what the hell's this all about, d'you think?\n\n                          PASSENGER\n            ...small price to pay, pal...\n\nHE APES THE PRESIDENT, WHO'S SAID THAT EARLIER.\n\nBREAN LOOKS UP, AS AMES, ACCOMPANIED BY AN ARMY MAJOR, PASSES THROUGH\nLINE AND APPROACHES BREAN, BECKONING.\n\nINT SUBURBAN MALL NIGHT.\n\nBREAN, AND AMES, AND TWO SECRET SERVICE TYPES, WALKING THROUGH THE MALL.\nBREAN GLANCES AT A FOODSTORE, WHERE WE SEE A LONG LINE OF PEOPLE WAITING TO BE\nADMITTED, AND A VAST LINE INSIDE, AT THE CHECK OUT COUNTER, THEIR CARTS PILED\nHIGH, THE SHELVES BEHIND THEM DENUDED.\n\nTHEY PASS BY A SHOESTORE, CLOSED, A PLYWOOD SCREEN IN FRONT, COVERED BY A\nSIGN:  SOON TO REOPEN UNDER NEW MANAGEMENT.  BREAN FOLLOWS AMES, INTO THE\nSTORE.\n\nINT SHOESTORE NIGHT.  MANY YOUNG STAFFERS.  A VAST SIGN READS:  DAYS TIL\nELECTION 8. % IN FAVOR?\n\nTHE STAFFERS STAND IMMOBILE, AS BREAN, AMES, AND THE SECRET SERVICE TYPES\nENTER.  ON A TELEVISION, UNWATCHED BEHIND THEM.  A FOREST SCENE, A SQUAD OF\nSERVICEMEN IN WOODLAND CAMO, LOOKING DOWN AT A RIVER, THEIR LEADER SPEAKING\nSOFTLY INTO A MICROPHONE.\n\n                          LEADER\n            ...scared.  Sure we're scared.  But th'fella said the\n            trick is not minding that it hurts.  N'Ill tell you one\n            thing:  They might get into the U.S.A., but they'll\n            have to get in over Mrs. Kelly's son...\n                    (HE TAPS HIMSELF ON THE CEEST)\n\nTHE SCREEN GOES TO A SCENE OF SUPERMARKET LOOTING IN AN INNER CITY.  A STAND-\nUP COMMENTATOR SPEAKS.\n\n                          COMMENTATOR\n            ...dead and fifteen wounded in these first hours of the\n            War.  They are not, they are not The Enemy, they are\n            people, like You and Me, a different kind of Victim of\n            Albanian Aggression, but Victims Nonetheless...\n\n\nANGLE\nBREAN, GIVEN THE TOUR BY AMES.\n\n                          AMES\n            Telexes to the major...\n\nHE IS SHUSSHED BY A YOUNG AIDE, STANDING, HIS EAR TO A PHONE.  ON THE TV WE\nSEE THE DECK OF AN AIRCRAFT CARRIER, AND A REPORTER SPEAKING, AS PLANES TAKE\nOFF.\n\n                          REPORTER\n            Missions into Albanian Airspace.  Missions to Kill or\n            Die.  American Men, and, yes, and women, in the prime\n            of their lives, but never closer to death, while...\n\nANGLE, ON BREAN, AS HE TURNS TO LOOK AT ANOTHER SCREEN.  ON THAT TV SCREEN WE\nSEE A SOB-SISTER TYPE\n\n                          SOB SISTER REPORTER TYPE\n            ...fighting, yes, but fighting for what?\n\nTHE SCREEN IS FILLED WITH THE PHOTO OF THE YOUNG ALBANIAN WOMAN, WHO IS NOW\nHOLDING TWO CATS.\n\n                          SOB SISTER REPORTER TYPE\n            For this.  For this.  For Freedom, for safety -- yes,\n            theirs and ours.\n\nBREAN HEARS A WHOOSH, AND TURNS TO LOOK BACK AT THE SCREEN OF THE JETS TAKING\nOFF.\n\nTV SCREEN, WITH JETS.\n\n                          ANNOUNCER\n                    (VO)\n            The sound of Freedom?  Yes, Perhaps the sound of\n            Death... but....\n\nBREAN LOOKING AT THE SCREEN, BEHIND HIM HE HEARS A VAST CHEER, HE TURNS.\nTHE AIDE WITH THE PHONE TO HIS EAR HAS PICKED UP A PIECE OF CHALK, AND IS\nWRITING, ON THE % IN FAVOR SLATE THE FIGURE 71%.\nTHE AIDES ARE CHEERING, AND SLAPPING EACH OTHER ON THE BACK.\n\nINT, IMPROVISED OFFICE, IN THE SHOE STOCKROOM.  NIGHT.\n\nA STOCKROOM LINED WTTH SHOEBOXES, IN IT A DESK, TWO CHAIRS, A TELEVISION.\nAMES ENTERS, OPENS THE DESK AND TAKES OUT A BOTTLE.  HE HANDS IT TO BREAN,\nWHO ENTERS AFTER HIM.  ON THE WALL IS ANOTHER SET OF SIGNS, READING DAYS TILL\nELECTION 8, AND % IN FAVOR WHICH AMES NOW FILLS IN 71.  AMES PICKS UP A SHEAF\nOF PAPERS FROM THE DESK.\n\n                          AMES\n            New York Times, Wash Post, Detroit Register, San Diego\n            BEE, all in emission.  No mention of the Girlscout.\n            None.\n\n                          BREAN\n            Eight Days To Go\n                    (HE GESTURES AT THE CALENDER)\n\n                          AMES\n            I live for midnight, when I can tear another of those\n            suckers off.  Watcha got for me?\n\n                          BREAN\n            Big Bird touches down when?\n\n                          AMES\n            We're bring'n im in tomorrow, five AM.\n\n                          BREAN\n            Anything at the Airport?\n\n                          AMES\n            Press thought \"no,\" whaddaya think...?\n\n                          BREAN\n                    (NODS)\n            I think, here's what I think:  S'it gonna rain...?\n                    (HE CHECKS A NOTEBOOK)\n\n                          AMES\n                    (YELLING)\n            Gimme the weather for tomorrow morning, five A.M.\n            Andrews...\n\n                          BREAN\n                    (CHECKING HIS NOTEBOOK)\n            An Albanian, a young Albanian Girl.\n\nAN AIDE APPEARS WITH A TEARSHEET.  AMES READS IT.\n\n                          AMES\n            No rain.\n\n                          BREAN\n                    (SHRUGS, NONETHELESS)\n            A young Albanian Girl, dressed in their...\n\nHE GESTURES, MEANING, \"WHATEVER THEY WEAR, YOU FIGURE IT OUT...\" AMES NODS TO\nTHE AIDE, WHO BEGINS SCRIBBLING IN A PAD.\n\n                          BREAN\n            And carrying.\n                    (HE GESTURES, MEANING, LOOK IT UP)\n            The National Flower of Albania, something..... Now Is\n            it some Festival?  Some Harvest Festival, something...\n\n                          AMES\n                    (TO THE AIDE)\n            Get on this, right now...\n\n                          BREAN\n            ...got to be something.  She gives him the sacred...\n                    (HE GESTURES, WHAT-HAVE-YOU)\n            And tells him:  this is the Traditional Harvest\n            Offering, given to the Man who Ties the First Sheaf,\n            the last sheaf, whatever the fuck it is...\n\n                          AMES\n            ...this's good...\n\n                          BREAN\n            Stanley Moss, Ladeesngennlmen... And she says...\n\n                          AMES\n            Is she saying this in Albanian...?\n\n                          BREAN\n                    (OF NOTES)\n            Yes:  she is saying this in Albanian, but she's doing\n            it not to be uh...\n                    (AMES GESTURES, MEANING, \"I GET IT\")\n            But because, she explains, that is the only way it can\n            be understood by her Aged and Sainted Mother, who is\n            standing there with her, dressed in her Traditional...\n\nAMES GESTURES TO THE AIDE, MEANING, \"GET TO IT,\"  THE AIDE NODS HER\nUNDERSTANDING, AND DISAPPEARS.\n\n                          BREAN\n                    (TO DISAPPEARING AIDE)\n            C'n I get something to eat...?  Now the Old Broad\n            starts to speak:  you are bringing peace.  Not only to\n            This Land...\n\n                          AMES\n            Our adopted land...\n\n                          BREAN\n            ...but to the Old World; you are stilling the forces of\n            hatred and of War which have, since I was a child...\n\n                          AMES\n            ...uh huh...\n\n                          BREAN\n            Now, the Old Lady starts to Weep, Big Bird shrugs off\n            his secret Service, goes to her, and covers her with\n            his own coat.\n\n                          AMES\n                    (CALLING OUT)\n            Find out is there any chance we can get some rain\n            tomorrow, will you...?\n\n                          BREAN\n                    (OF PAD)\n            So forth...\n\nAMES STOPS TO LOOK AT ANOTHER COMMERCIAL ON TV.  THEY TURN TO SEE TWO \"YOUNG\nMOTHER\" TYPES, SHOPPING...\n\n                          YOUNG MOTHER ONE\n            ...to vote for.\n\n                          YOUNG MOTHER TWO\n            Well, I think it's like when we thought of Changing\n            Tommy's Pediatrician.  Bill said, \"Not While he's sick\n            --  cause you Don't Change Horses in the mid...\"\n\nBREAN TURNS OFF THE VOLUME, AND CONTINUES.\n\n                          BREAN\n            How is Big Bird holding up, by the way?\n\n                          AMES\n            Catching up on his reading.  Asked about you, sends his\n            thanks.\n\n                          BREAN\n            Knock on wood.\n\n                          AMES\n            Speaking of thanks... we puttem back in, what does\n            your fellow Moss want?\n\n                          BREAN\n            I dunno.... Ambassador to Togo, somethin', I dunno...\n            he...\n\n                          AMES\n            Maybe he's just a patriot.\n\n                          BREAN\n            Yeah...what was I talking about...?\n\nAN AIDE APPEARS WITH A SANDWICH, AND BREAN STARTS TO EAT.\n\n                          AMES\n            How long you been up, you need a nap.\n\n                          BREAN\n                    (SHAKING HIS HEAD)\n            Due in Nashville.\n\n                          AMES\n            Nashville...?\n\n                          BREAN\n            We're gonna do the Team Song.\n\n                          AMES\n            You're tired, Ronnie.\n\n                          BREAN\n            Y'wanna follow the Cattle Drive?  Sleep in the Winter.\n            What does Moss want...?  Matchmaker comes to the\n            Levinsky Family.  Mr. Levinsky, Mrs. Levinsky, would\n            you entertain an offer of marriage for your son Saul,\n            from Princess Margaret of Great Britain.  Well, they\n            think, she isn't Jewish, but she's well to-do, a nice\n            old family.  Alright, yes, they say.  We would\n            consider such an offer.  Wonderful, matchmaker says,\n            My Job is Half Done.\n                    (HE YAWNS)\n            Now, Look:  I got the file, from the L.A. contingent, I\n            got the day-by-day, of how...\n\nHE LOOKS AT AMES, WHO IS LOOKING INTENTLY AT THE TV.\n\n                          ANNOUNCER\n                    (AS AMES TURNS UP THE SOUND)\n            ...denial from the Albanian Government continues, but\n            this tape, just in...\n\nTHE SCREEN SWITCHES TO SHOTS OF TRUDY LAROUCHE, IN ALBANIAN GARB, RUNNING\nTOWARD THE CAMERA, OVER A BRIDGE ACROSS A SMALL STREAM, IN THE B.G. HER\nBURNING HOUSE, SIRENS, AND THE SOUNDS OF SHOTS, AT WHICH TRUDY COLLAPSES,\nCONVULSED WITH SOBS.\n\n                          ANNOUNCER\n            ...just having heard her family shot.  For the crime of\n            non-cooperation with Albanian Authorities.  Apparently,\n            they had a family connection in Canada, along the US\n            border and refused to exploit it to aid the Terrorists\n            to infiltrate this country.\n                    (BEAT)\n            They paid with their lives.\n\n                          AMES\n            ...this is magnificent.\n\n                          BREAN\n            ...Stanley Moss...\n\n                          AMES\n            8 days and we bring it back home....\n\nBREAN RISES, STRETCHES.\n\nSOMEBODY SWITCHES THE CHANNEL, AND WE SEE A NEWSMAN DOING A STANDUP IN FRONT\nOF A STREETVENDOR, WHO HAS A BOARD FULL OF BUTTONS.  THE CAMERA PANS OVER THE\nBUTTONS, WE SEE THE \"FUCK ALBANIA,\" AND WE SEE ONE READING \"RUN FROM ALBANIA?\nTELL ME ANOTHER ONE...\"  AND T-SHIRTS SHOWING SIMILAR LOGOS.\n\nANGLE\nON BREAN AND AMES SITTING AROUND.\nAMES LOOKS AT HIM INQUISITIVELY.\n\n                          BREAN\n            None of these are ours.  None of em are ours....\n                    (HE SMILES AT AMES)\n            ....that's real politik, Buddy.\n\n                          AMES\n            Waal, I gotta tell you.  I've been inside the Beltway\n            fourteen years, and I feel like I Just Got My Feet Wet.\n\nTHEY KICK BACK, AND WATCH THE TELEVISION, SHOWING IMAGES OF THE TANKS ALONG\nTHE CANADIAN BORDER.\n\n                          AMES\n            And if you think about it:  if you think about it, what\n            Is war...?  What is war?  I mean, aside from the\n            killing, and, all... that isn't so pleasant, ... you in\n            the Service...?\n                    (PAUSE)\n\nBREAN, UNSEEN BY AMES, GETS UP AND GOES TO THE DOOR TO LISTEN.\n\n                          AMES\n                    (CONT.)\n            ...and I'll tell you another thing.  President said to\n            me:  When this thing... \"happened.\"  \"It looks like the\n            Building's falling.  But, these are the times...\" and I\n            wish what he said, we could have used it on TV, and, as\n            a matter of fact, we can, if we...\n                    (HE LOOKS AROUND, SEES BREAN STANDING\n                    BY THE DOOR.)\n            Look here, here's an idea... Here's an idea...\n                    (HE WALKS OVER TO THE DOOR.)\n            Turn it on it's head.  If we're ahead in the polls,\n            well, hell, this is the time to capitalize on it.  What\n            do you think?  Get ahead of them, use the percentage\n            points to push forward some of the long-term goals:\n            housing, health-care ref...\n\nBREAN GESTURES FOR SILENCE.  HE AND AMES LISTEN INTENTLY, THE HUBBUB IN THE\nADJOINING ROOM (THE SHOESTORE) HAS PASSED.  IT IS SILENT.  AMES AND BREAN PEEK\nAROUND THE WALL OF SHOEBOXES.\n\nANGLE THEIR POV\n\nTHE AIDES, IMMOBILE.  FIVE VERY FIT YOUNG MEN IN SUITS STAND NEAR THE\nENTRANCE.  ONE YALIE-LOOKING FELLOW IN HIS THIRTIES WALKS THROUGH THEIR MIDST,\nFROM THE ENTRANCE.  HE STOPS FOR A MOMENT AT A TELEVISION, WHICH IS GLARING A\nCOMMERCIAL FOR LAUNDRY SOAP, AND FLICKS IT OFF, ONE OF HIS FIT YOUNG MEN\nINCLINES HIS HEAD TOWARD THE REAR OF THE STORE, AND MR. YOUNG WALKS TOWARD THE\nREAR.\n\nTHE YALIE COMES INTO A FITTING AREA.  SEVERAL OF THE SMALL BENCHES USED FOR\nTRYING ON SHOES... TO AMES AND BREAN.\n\n                          YALIE\n            Who might be the Boss Hog in this operation?\n                    (PAUSE)\n\n                          BREAN\n            Feel free to talk to me.\n\nYALIE NODS\n\n                          YALIE\n            Cheezit-the-Cops.\n\n                          AMES\n                    (TO HIMSELF)\n            Ohmigod...\n\nINT OFFICE SUITE, NIGHT.\n\nBREAN AND AMES SITTING ON A COUCH.  THE YALIE SITTING BEHIND A LARGE DESK,\nWATCHING A SMALL TELEVISION ON WHICH WE SEE A REPORTER, STANDING NEXT TO\nSEVERAL VERY GRIM LOOKING MEN IN PARK POLICE SMOKEY HATS.  IN A FOREST, BELOW\nTHEM, A LINE OF TANKS FADING ALONG A RIVER.\n\n                          REPORTER\n            ...awaiting the arrival of The President back on\n            American Soil.  To still the fears, to answer the\n            questions of this troubled land.  Here, along a border\n            once considered more Imaginary than real, I'm Mike\n            Stears, at latitude 45, along the Canadian Border.\n\nANGLE\nBREAN LOOKS DOWN AT HIS WATCH.\n\n                          BREAN\n            ...I just missed my plane.\n\n                          AMES\n            You missed your plane?  My life is over.\n                    (PAUSE)\n            My life is over.  What have you done to me?  What have\n            I done?\n                    (PAUSE)\n            Fourteen years of Public Service...\n\n                          BREAN\n            Well, keep your wits about you, and let's see if we\n            can't...\n\n                          AMES\n            ...fourteen years...\n\n                          BREAN\n            ...brazen-it-through...\n\n                          AMES\n            Brazen it through?  Brazen it through?  They're going\n            to hang us out to dry like the laundry --- do you know\n            what we've ddd...\n\nTHE BODYGUARD IN THE B.G. RAISES HIS FINGER TO HIS LIPS AND SHAKES HIS HEAD.\n\n                          AMES\n            Do you know what we've done, for Godsake?  Do you know\n            what you've....\n\nA BODYGUARD IN THE B.G. SPEAKS UP.\n\n                          BODYGUARD\n            No talking, please.\n\nTHROUGH IT ALL AMES SITS, WITH HIS HEAD IN HIS HANDS.\n\nA NEW REPORTER TAKES OVER ON TV, BEHIND HER A CHART, A GRAPH OF AN UPWARDLY\nMOVING LINE.\n\n                          REPORTER\n            With seven days to go before the election, the Fortunes\n            of President...\n\nTHE DOOR OPENS, THE YALIE COMES TO ATTENTION, MR. YOUNG, A TWENTY-YEAR OLDER\nVERSION OF THE YALIE, ENTERS, CARRYING A CUP OF COFFEE, NO TIE, HAIR\nDISHEVELLED.\n\n                          MR. YOUNG\n                    (TO YALIE)\n            ...took you long enough.\n\n                          YALIE\n            Found'em as quick as we could, sir.\n\n                          MR. YOUNG\n            When I'm done with'em, we want to dump'em in the\n            District, or stick'em out in the country, have the\n            F.B.I. trip over'em?\n\nTHE YALIE CONSULTS HIS NOTES.\n\n                          YALIE\n            Legal department says You Pick Em.  Depends on how big\n            of a splash you want to make, how long you want them to\n            Go Away for.\n\n                          AMES\n                    (SOTTO)\n            Oh, MiGod.\n\nBEAT, MR. YOUNG SHAKES HIS HEAD SADLY.\n\n                          MR. YOUNG\n            Guess who I am.\n\n                          AMES\n            I'd like to mention a few names, who...\n\n                          MR. YOUNG\n                    (LOOKING AT NOTES HE IS HANDED BY\n                    YALIE)\n            I know who you are, Mr. Ames.\n\n                          AMES\n            I was acting as a Private Citizen.  Nothing that I've\n            done should be construed as reflecting on the orders or\n            intentions of anyone with whom you may have reason to\n            believe I am connected with.\n                    (PAUSE)\n            Or in whose employ...\n\n                          MR. YOUNG\n            Quite touching.\n\n                          AMES\n            And I take this opportunity to suggest that, equally,\n            I admit to nothing, and that I would like my lawyer\n            present.\n\nMR. YOUNG NODS.\n\n                          MR. YOUNG\n            Guess what?  We show, and N.S.A. confirms, there are no\n            nuclear devices on the Canadian border.\n                    (PAUSE)\n            There are no nuclear devices in Albania.  Z'at put us\n            in something of a pickle?\n                    (PAUSE)\n            Albania has no nuclear capacity.  Our spy satellites\n            show \"no secret terrorist camps\" in The Albanian\n            Hinterland.  The F.B.I. and the Border Patrol, And the\n            R.C.M.P. report no repeat no untoward activity along\n            our picturesque Canadian Border.  The Albanian\n            Government is screaming its innocence, the world is\n            listening.\n                    (PAUSE)\n            There is no War.\n\n                          BREAN\n                    (GESTURES AT THE TV, WHERE WE SEE TRUDY\n                    LAROUCHE RUNNING ACROSS THE BURNING\n                    BRIDGE)\n            Course there's a war.  I'm watching it on Television.\n\n                          MR. YOUNG\n            N'who might you be, when all's said and done?\n\n                          BREAN\n            My name is Ronald Brean.\n\n                          MR. YOUNG\n            Who're you working for?\n\n                          BREAN\n            Nobody whose name you want me to say, Mr. Young, I\n            promise you.\n\n                          MR. YOUNG\n            S'all very well, but when the Fit hits the Shan,\n            somebody's going to have to Stay After School, and who\n            do you 'spose that might be.\n\n                          BREAN\n            S'only got to hold for another few days.\n\n                          MR. YOUNG\n            Well, I'm not interested in how long its \"got to hold\n            for.\"\n\n                          BREAN\n            What are you interested in?\n                    (PAUSE)\n\n                          MR. YOUNG\n            I'm interested in the Security of My Country, Mr.\n            Brean.\n\n                          AMES\n            As are we all, and I'd like to take this opportunity to\n            suggest that the Security of the country would be ill-\n            served by any, any...any...\n\nPAUSE.  THEY LOOK AT HIM.\n\n                          AMES\n                    (CONT.)\n            Any untoward \"revelation\" regarding, uh...\n\n                          MR. YOUNG\n            And I think that the Security of the Country would be\n            best-served by its citizens obeying its laws.\n                    (OVER HIS SHOULDER, TO AN AIDE)\n            Gemme a Federal Judge, gemme search-warrants, all\n            premises controlled by our friends, and bench-warrants\n            for the two of...\n\n                          BREAN\n                    (SIMULTANEOUSLY, WITH THE ABOVE SPEECH)\n            Well, I'm sure that speaks very well of you and for\n            your parents.  But if forced to choose between the\n            security of the country and the security of your Job,\n            which would you pick.  And, while you hesitate, permit\n            me to suggest that they are one and the same.  Your\n            country and your job.\n\n                          MR. YOUNG\n            I'm doing my job, Mr. Brean.  That's what you see me\n            doing here.  What is it you thought you were doing?\n\n                          AMES\n            And I'd like to point out that I've been on\n            prescription medication, the side-effects of which...\n\n                          BREAN\n            I'm doing my job, Too.\n                    (OF THE AIDE)\n            Would you give me a... do you think you could call off\n            your Dogs for a minute.\n\nPAUSE.  MR. YOUNG LOOKS AT THE AIDE, WHO IS EXITING, AND NODS.  THE AIDE STAYS\nBEHIND.\n\n                          BREAN\n                    (CONT.)\n            Thank you.\n\n                          MR. YOUNG\n            What's on your mind?\n\n                          BREAN\n            I have a question for you.\n\n                          MR. YOUNG\n            Ask it.\n\n                          BREAN\n            Why do people go to war?\n\n                          MR. YOUNG\n            Why do people go to war?\n\n                          MR. YOUNG\n            I'll play your silly game.\n\n                          BREAN\n            Why do they go to War?\n\n                          MR. YOUNG\n            To preserve their Way of Life.\n\n                          BREAN\n            Would you go to War to do that?\n                    (PAUSE)\n\n                          MR. YOUNG\n            I have.\n\n                          BREAN\n            Well, I have, too.  Would you do it again...?  In't\n            that why you're here?  I guess so.  N'if you go to war\n            again, who is it going to be against?  Your \"ability to\n            fight a Two-ocean War\" against who?  Sweden and Togo?\n            Who you sitting here to Go To War Against?  That time\n            has passed.  It's passed.  It's over.  The War of the\n            Future is Nuclear Terrorism.  It is and it will be\n            against a Small Group of Dissidents who, unbeknownst,\n            perhaps, to their own governments, have blah blah blah.\n            And to go to that war, you've got to be prepared.  You\n            have to be alert, and the public has to be alert.\n            Cause that is the war of the future, and if you're not\n            gearing up, to fight that war, eventually the axe will\n            fall.  N'you're gonna be out in the street.\n                    (PAUSE)\n            And you can call this a \"drill,\" or you can call it\n            \"job security,\" or you can call it anything you like.\n            But I got one for you:  you said, \"Go to War to protect\n            your Way of Life,\"  well, Chuck, this\n                    (HE GESTURES AROUND THE ROOM)\n            is your way of life.  Innit?  And if there ain't no\n            war, you can punch out, go home, and take up Oil\n            Painting.  And there ain't no war but ours.\n                    (PAUSE)\n\nHOLD ON THE GROUP.\n\n                          BREAN\n                    (CONT.)\n            It's just for eight more days.....\n\nINT CORRIDORS C.I.A. COMPLEX\n\nAMES, AND BREAN ACCOMPANIED BY SEVERAL BODYGUARD TYPES AND THE YALIE.\n\n                          BREAN\n                    (TO THE YALIE)\n            One more thing, what is that river she's running\n            across?\n\n                          YALIE\n            What?\n\n                          BREAN\n            ...the young girl in the video, the Albanian Girl....\n\nYOUNG NODS, AND MAKES A NOTE IN A BOOK.  BREAN TURNS TO AMES.\n\n                          BREAN\n            ...she's running, it's some sacred... some ancestral\n            land, cloven by the Brook named.... give it to Moss,\n\n                          YOUNG\n            No, we're on top of it.\n\n                          BREAN\n            Thank you.\n\n                          YOUNG\n            No, thank you...\n\n                          BREAN\n                    (HE CHECKS HIS WATCH)\n            I should be in Nashville, tell him I'm coming in.\n\n                          BREAN\n                    (TO AMES)\n                    (GESTURING TO THE YALIE, AND\n                    BODYGUARDS.)\n            Nice enogh people... they just hadn't thought it\n            through...\n\nAMES, AS HE WALKS, TAKES OUT HIS CELLPHONE, AND DIALS.\n\n                          AMES\n                    (INTO THE PHONE)\n            No.  I was busy.\n                    (PAUSE)\n            Yes, I need the new poll fig.... how long?  I'll call\n            in from Nashville.  And patch me through to the Big\n            Bird, will...?\n                    (TO BREAN)\n            I've got to hand it to you.  They sure let us out of\n            there easy....\n\n                          BREAN\n                    (TO HIMSELF)\n            ...they just hadn't thought it through...\n\nTHE YALIE SHAKES BREAN'S HAND, AND GESTURES FOR A DOOR TO BE OPENED.  BEYOND\nTHE DOOR WE SEE A HELIPAD, AND THE ROTORS OF A HELICOPTER JUST BEGINNING TO\nTURN, BREAN WAVES, AND TROTS OUT TO THE HELICOPTER.\n\nINT HELICOPTER NIGHT.\n\nAN AIRCREWMAN, LISTENING TO A SMALL RADIO.\n\n                          RADIO\n                    (VO)\n            Midst repeated denial from the Albanian Government.\n            While, at the White House, a sense of Stillness\n            pervades, awaiting the return of...\n\nTHE AIRCREWMAN SNAPS TO ATTENTION AS BREAN COMES INTO THE AIRCRAFT, BUCKLES\nHIMSELF INTO A WEBSEAT, AND FALLS ASLEEP.  HE ROUSES HIMSELF, TAKES OUT HIS\nNOTEBOOK, AND STARTS TO WRITE IN IT.\n\nEXT PARKING LOT, NASHVILLE DAWN.\n\nA SUPERMARKET PARKING LOT, A HUGE COWBOY HAT ADORNS A STORE CALLED \"KELLEY'S\nWESTERN WEAR.\"  AT THE SUPERMARKET, SHOPPERS, PUSHING CARTS PILED HIGH -- THE\nWIFE PUSHING, THE HUSBAND GUARDING THE CART WITH A RIFLE.  A FISTFIGHT BREAKS\nOUT.  NO ONE NOTICES THE HELICOPTER.\nBREAN IS GETTING INTO A JEEP, ITS TOP OFF, DRIVEN BY A FELLOW IN WESTERN\nGETUP, ON THE SIDE IS PAINTED A GUITAR.  IN THE B.G. WE SEE THE HELICOPTER\nLIFTING OFF.  IN THE JEEP ARE THE FAD KING AND MOSS.\n\nANGLE\nTHE JEEP, AS BREAN SETTLES HIMSELF IN HE TURNS TO LOOK AT THE CHAOS IN THE\nPARKING LOT.\n\n                          COWBOY\n            It ain't hoarding.  It's stockpiling.\n\n                          BREAN\n            Uh huh.\n\n                          COWBOY\n            Only common sense.\n\n                          MOSS\n                    (OF THE BOOK)\n            We got the guy, we got the guy, we got the Guy!\n\n                          FAD KING\n            The Canada Thing was a shuck.  A shuck -- wasted a day.\n            What can you do with Canada?  Bears, mapleleafs, \"sugar\n            -on-Snow.\"  Lays there on the plate like a lox.\n\nANGLE\nAMES ON THE PHONE IN THE JEEP.\n\n                          AMES\n            Yes... Hello...?\n                    (PAUSE)\n            What...?  What...?  We're breaking up, I'll call you\n            from the studio.\n\nINT RECORDING STUDIO NASHVILLE, DAY.\n\nTHE COWBOY, MOSS, FAD KING, AMES, AND BREAN WALKING THROUGH THE LOBBY AND\nCORRIDOR OF A NASHVILLE STUDIO, MANY GOLD AND PLATINUM RECORDS ON THE WALL.\nTHEY PASS AN ELDERLY AFRICAN AMERICAN MAN SWEEPING THE HALL, AND NOD AT HIM.\n\n                          BREAN\n                    (REACHES INTO HIS JACKET POCKET)\n            Oh, oh, oh, oh, oh, get this typed, get somebody to\n            send it to the White House...\n\nHE HANDS IT TO MOSS.\n\n                          MOSS\n            What is it?\n\n                          BREAN\n            President's speech.\n\n                          MOSS\n            At the Airport?  Cause we decided at the Airport he\n            hugs the fat, wet Albanian Broad, we...\n\n                          BREAN\n            No, no, no, no, no after the airport.\n\nTHEY TURN AROUND, LOOKING FOR AMES, WHO IS HANGING BACK, LOOKING AT A TV.  THEY\nRETRACE THEIR STEPS.  CAMERA TAKES THEM TO AMES, WHO IS WATCHING SENATOR NOLE\nON TV.\n\n                          AMES\n                    (SOFTLY)\n            Oh, shit...\n\n                          NOLE\n            ...gotten word that the situation in Albania is\n            resolved.  That it is resolved.  My military sources\n            confirm that our troops, along the Canadian Border, And\n            overseas are standing down, and I must take this\n            opportunity to call upon our President to stand and\n            face the charges, the heinous charges brought against\n            him.  You know, folks, there is nothing in life as\n            precious as the Innocence of a Child.\n                    (PAUSE)\n            Nothing.  Now, I do not say these charges are true, I do\n            not see how they could be.  Accusations of, of sexual\n            misconduct in anyone, must be investigated.  In the\n            case of a Sitting President, of one whose term, and I\n            do not hesitate to mention it, ends, in, effectively,\n            in a matter of days... I call upon the President...\n\n                          AMES\n            What does he mean The Situation has Been Resolved?\n\n                          BREAN\n            He just got Hip to us.\n                    (PAUSE)\n            He just ended the War.\n\nCAMERA TAKES THEM INTO THE RECORDING STUDIO.\n\n                          AMES\n            What are we gonna do about it...?\n\nWE SEE SEVERAL PEOPLE AT A CONSOLE, AND, IN THE STUDIO, A BRIGHT SASSY LOOKING\nGROUP, SINGING.\n\n                          GROUP\n            We guard the Northern Borders.\n            We live the Northern Liiiiifffe...\n            We come to restore Order...\n            For our Children and our Wiiiiiiiffee...\n\n                          BREAN\n                    (TO ENGINEER)\n            Tell'em to knock it off.\n\nTHE ENGINEER TELLS THE GROUP TO STAND DOWN.\nPAUSE\n\n                          AMES\n            What are we going to do?\n\n                          BREAN\n                    (TO MOSS)\n            The War is Over.\n\n                          MOSS\n            What?\n\n                          BREAN\n            The War is Over.  Senator Nole just ended the War.\n\n                          AMES\n            Oh, God...\n\n                          BREAN\n            Yep.  Well, we started it, he Ended it...\n\nANGLE ON THE TV.\n\n                          TELEVISION REPORTER\n            ...and the C.I.A. Confirms the cessation of\n            Hostilities, with...\n\n                          BREAN\n            The C.I.A.\n\n                          AMES\n            Oh, Lord....\n\n                          BREAN\n            ...those limp-dick ... turncoat... I thought they let\n            us out of there too easy.....\n\nHE REACHES OVER AND FLICKS OFF THE TV.\n\n                          BREAN\n                    (TO MOSS.  CONT.)\n            War's over, Pal.\n                    (PAUSE)\n\nIN THE B.G. AMES PICKS UP THE PHONE AND DIALS.\n\n                          AMES\n                    (ON PHONE)\n            Gloria -- sell the House.\n                    (HE HANGS UP)\n                    (PAUSE)\n\n                          MOSS\n            The War ain't over.\n                    (PAUSE)\n\n                          BREAN\n            I saw it on TV.\n\n                          MOSS\n            The war ain't over til I say it's over.  This is my\n            picture.  You think you're in a spot?  You think this\n            is a tight spot?  Try making the Hunchback of Notre\n            Dame when your three lead actors die, two weeks from\n            the end of Principal Photography.  This is... this\n            is... this is just...\n                    (PAUSE)\n            Act One:  THE WAR.\n            Act Two ... the... uh...\n\n                          FAD KING\n            It's like those Japanese in the Caves on Okinawa...\n            didn't believe the War was Over.\n\n                          MOSS\n            You got a guy, doesn't believe the War is... NO NO NO.\n            An American Serviceman... A brave American Serviceman,\n            is Left Behind ...\n                    (HE LOOKS AT THE FAD KING, WHO IS\n                    MASSAGING HIS FOOT, HAVING TAKEN OFF\n                    HIS SHOE)\n            He is Left Behind.  He is discarded like an Old Shoe...\n                    (TO BREAN)\n            Gemme the Pentagon.  List of people in all Military\n            Special Programs.... Left behind.  Like the Old Shoe...\n            Johnny: \"Good Old Shoe\"...\n                    (JOHNNY NODS)\n\nBREAN PICKS UP THE PHONE AND DIALS.\n\n                          BREAN\n            Hello...?\n\nFAD KING PICKS UP THE PHONE.\n\n                          FAD KING\n            Yeah, I need a list, people in Military Special\n            Pro...\n\n                          MOSS\n            ...what do you got?\n\n                          FAD KING\n                    (INTO PHONE)\n            Military Special Programs... Programs... No, I am not\n            Shouting at you, I'm... I'm sorry.  Anyone named Shoe\n            Schumann?  Schuster... uh\n\nJOHNNY GREEN, ANGLE ON HIM, HIS EYES LIGHT UP.\n\n                          JOHNNY GREEN\n            I got it!\n\nHE TAKES OUT HIS GUITAR, AND STARTS TO STRUM.  HE PICKS UP A PENCIL.  IN THE\nB.G. WE SEE THE OLD AFRICAN AMERICAN MAN COME INTO THE STUDIO, AND START\nCLEANING UP.\n\n                          SINGER\n            \"I guard the Northern Borders...\"\n            Okay, y'want to roll on another one...?\n\n                          JOHNNY GREEN\n            Naaa.  Fuck that.  Fuck that...\n\n                          ENGINEER\n            ...go get a Coke.  Y'want something to eat...?\n\n                          SINGER\n            We gonna be long, cause I told my wife...\n\nDISSOLVE\n\nINT STUDIO.  NIGHT.  VAST AMOUNTS OF TAKE-OUT FOOD WRAPPING.  AMES, BREAN,\nJOHNNY GREEN, MOSS, THE ENGINEER, SITTING AT THE CONSOLE.  IN THE STUDIO, AN\nOLD, BLACK SINGER, ARRANGING MUSIC ON THE STAND IN FRONT OF HIM.  HE HOLDS A\nVERY BATTERED OLD GUITAR.\n\nJOHNNY GREEN, STILL SCRIBBLING ON MUSIC PAPER, GOES INTO THE STUDIO, AND HANDS\nA SHEET TO THE SINGER, AND LEAVES.\n\nTHE SINGER IS THE OLD MAN WE SAW SWEEPING UP.\n\n                          SINGER\n                    (SINGS)\n            Good Old Shoe\n            Good Old Shoe...never left you hangin, Just a Good Old\n            Shoe...\n                    (HE STOPS, TALKS TO THE CONTROL ROOM)\n            I'm sorry, Barry, the action on this... where the hell\n            did you get this old thing?\n\n                          ENGINEER\n                    (TALKING THROUGH THE P.A.)\n            ...found it in a pawnshop.  Three bucks.\n\nTHE SINGER SMILES, SHAKES HIS HEAD, STARTS TO TUNE A STRING.\n\n                          MOSS\n            Don't tune it too good.\n\n                          ENGINEER\n            Leave it flat, will you, Ben?\n\nTHE SINGER NODS.\n\n                          ENGINEER\n            Do another?\n\n                          SINGER\n            Let's do it.\n\n                          ENGINEER\n                    (CUING THE TAPE)\n            Good Old Shoe...\n\n                          MOSS\n                    (SHOWS THE PHOTO OF SCHUMANN TO BREAN)\n            William Schuman.  Old Shoe.  U.S. Army.  Serial number,\n            21-31-2841-262.\n\n                          ENGINEER\n            Take ten.\n\n                          SINGER\n            He's the Runt of the Litter\n            Waal that's true\n            N'I found him jest hiding in an Old Work Shoe\n            N'he got into mischief, as a Pup will do.\n            But I never had a better than my Good Old Shoe.\n            Waal, we's out jest a-huntin, on a Cold Fall Day, and\n            it seems like that Possum 'bout to Get Away...\n\n                          MOSS\n            It's too clean.\n\n                          ENGINEER\n            Hold it a minute, Benny, willya?\n\n                          MOSS\n            It's too clean.\n\n                          ENGINEER\n            Let's take the bridge from nine, and the intro from\n            one, and...\n\n                          MOSS\n            It's got to sound like an acetate recording, 1930.\n\n                          ENGINEER\n            Hold it a minute, Benny, we're going to tweak it a bit.\n                    (TO THE GROUP)\n            This may take a while.\n\n                          BREAN\n                    (TO JOHNNY, AND MOSS)\n            This is fantastic.\n\n                          JOHNNY GREEN\n            Y'like it?  Wait'll you get to the bridge...\n\n                          BREAN\n            This's Fantastic...\n\n                          JOHNNY GREEN\n                    (TO ENGINEER)\n            Don't go with the bridge from nine, go with the bridge\n            from eight.\n\n                          ENGINEER\n            Why eight?\n\n                          JOHNNY GREEN\n            Just try it.\n\nIN THE B.G. WE SEE AMES TALKING INTO THE CELLPHONE.\n\n                          AMES\n            A new take on the...  Well, sir, we're coming back,\n            we'd like you to try it out, this evening...\n\n                          MOSS\n            Listen to what I've ... listen to... does anybody know\n            Morse Code?\n\n                          BREAN\n            What're you gonna do with Morse Code?\n\n                          MOSS\n                    (NODS, POINTS TO THE GLOSSY PHOTO)\n            ...we put your Guy in a sweater...\n\n                          BREAN\n            Yeah...?\n\n                          MOSS\n            \"Good Old Shoe -- \"  We put him in a sweater.\n\nWE HEAR A WHISTLE.  HEADS TURN.  THE COWBOY TYPE IS WHISTLING.  HE IS OVER\nAT A COFFEE AREA, LOOKING AT A SMALL TELEVISION, THE GROUP MOVES TO THE TV.\nON THE TELEVISION WE SEE A TALKING HEAD, ANNOUNCING THE ARRIVAL OF THE PRESS.\nIN THE B.G. AIRFORCE ONE IS ROLLING TO A STOP.  WE SEE THE RAMP COME DOWN AND\nTHE PRESIDENT COME OUT IN THE RAIN AND HURRY TOWARD A WAITING HELICOPTER.\n\nHE SEES SOMETHING OFF TO THE SIDE AND STOPS, HIS AIDES TRY TO DISSUADE HIM,\nBUT HE PULLS AWAY.  THE NEWS CAMERA HUNTS AND FINDS A SMALL ALBANIAN GIRL,\nCARRYING A SHEAF OF WHEAT IN HER HANDS, AN OLD WOMAN BEHIND HER, BOTH STANDING\nIN THE RAIN.  THE PRESIDENT ADVANCES, AND MOVES TO LET HIS AIDES LET THE CHILD\nCOME FORWARD.  WE SEE THE PRESIDENT, MOVED AT THE SIGHT OF THE LITTLE GIRL,\nOFFERING HIM THE SHEAF OF WHEAT, WE HEAR A REPORTER, V.O.\n\n                          REPORTER\n                    (VO)\n            ...trying too... it seems that she is speaking in... is\n            is Albanian ... Is it Albanian?  Can we get someone\n            on...\n\nA WOMAN'S VOICE COMES ON, A TRANSLATOR.\n\n                          TRANSLATOR\n                    (VO)\n            ...salvation of our Country.  To...to \"intercede\" where\n            violent men would work to destroy ... to destroy\n            Harmony.  Now is the Harvest Season in my Land, and I\n            bring you...\n                    (SHE HANDS HIM THE WHEAT)\n            I bring you this traditional Albanian, forgive me not\n            to speak English, but my Grandmother...\n\nTHE CAMERA MOVES ONTO THE GRANDMOTHER, STANDING, NODDING, BEHIND THE LITTLE\nGIRL, AND THE PRESIDENT, REALIZING FOR THE FIRST TIME THAT THE OLD WOMAN IS\nSTANDING IN THE RAIN, MOVES TO HER, REMOVES HIS SUITCOAT, AND PLACES IT OVER\nHER HEAD.  SHE CLASPS HIM TO HER BOSOM.  SHE SPEAKS TO HIM IN ALBANIAN.\n\n                          TRANSLATOR\n            God bless you, God bless you, you are my Son... you are\n            a Bringer of Peace...\n\nWE HEAR A PHONE RING.\n\nANGLE\nWIDER, ON THE GROUP AT THE TV, ALL SHAKING THEIR HEADS SADLY.  AN AIDE HANDS\nTHE PHONE TO MOSS, WHO GIVES IT TO BREAN.\n\n                          BREAN\n            Hello?\n\nEXT ANDREWS AIRFORCE BASE DAY.  CAIN, FROM THE PRESS CORPS, ON A CELL PHONE,\nBEHIND HER THE SPECTACLE OF THE PRESIDENT AND THE GIRL AND THE OLD WOMAN, WE\nSEE THE RAIN IS BEING SUPPLIED BY RAINBIRD MACHINES, THE DAY IS CLEAR.\n\n                          CAIN\n            ...getting the speech for the White House...?\n                    (PAUSE)\n            Good.  Good.  Because he's....\n\nANGLE, INT THE STUDIO, ON BREAN, ON THE PHONE.\n\n                          BREAN\n            He can't respond to the Allegations.\n                    (PAUSE)\n            I don't care how many girlscouts are picketing the ...\n            look, look, look, we're coming home with Gold.  Eh?\n            Tell him to hold firm for two hours... coming home with\n            Gold.\n\n                          MOSS\n                    (TO FAD KING)\n            Did we ever use those costumes for the Border Patrol?\n            Those guys in the Leopard-Skin Hats?  Here's my\n            idea....\n\nINT LIMO DAY.\n\nTHE BACKSEAT OF A LIMO\nAMES AND BREAN WITH A PHONE TO HIS EAR.  THE TELEVISION ON, SHOWING THE GIRL\nRUNNING ACROSS THE FLAMING BRIDGE, MOSS, FIDDLING WITH THE VOLUME ON THE TAPE\nPLAYER, WHICH IS PLAYING \"GOOD OLD SHOE.\"\n\n                          BREAN\n                    (INTO PHONE)\n            I'll hold.\n\nWE HEAR THE SCRATCHY RENDITION OF \"GOOD OLD SHOE\" ON THE TAPE PLAYER.\n\n                          AMES\n            ...this is a snappy song....\n\n                          MOSS\n            What'd ya think?\n\n                          BREAN\n            I think it's fine?\n\n                          MOSS\n            It's not too clean...\n\n                          BREAN\n            No, it's...\n                    (ON PHONE)\n            I'll, yes, I'm holding, but...\n                    (TO MOSS)\n            No, it's ...\n\nHE STOPS AND GESTURES MOSS TO TURN OFF THE VOLUME ON THE TAPE.  THEY BOTH TURN\nTOWARD THE TV, WHERE WE SEE A FREEZE FRAME OF THE GIRL ON THE BRIDGE, AND AN\nINSERT OF A MAP OF ALBANIA.\n\n                          ANNOUNCER\n            Have identified the bridge, and the river from that\n            tape.  It is a bridge over the river __________, ...\n            what is it, Mayra, a \"rhyme...?\"\n\nANOTHER WOMAN IS SHOWN ON THE SCREEN, AS THE ANGLE WIDENS.\n\n                          MAYRA\n            Actually, Bess, it's an ode, an ancient Albanian ode,\n            praising the river, this particular river, the\n            ________, as a source of peace.  It is ironic that....\n\n                          BREAN\n                    (ON PHONE)\n            Hello --\n\n                          BREAN\n                    (ON PHONE)\n            Look: I'm bringing in a tape, I need it copied AT ONCE\n            onto an old acetate, and stuck in the Library of\n            Congress.  Gotta Happen Today.\n\n                          MOSS\n            In the Folk Music Section.\n\n                          BREAN\n            In the Folk Music Section.  We'll be in in...\n\nON THE TV SCREEN, NOW, IS SENATOR NOLE.  BREAN HANGS UP THE PHONE.\n\n                          MAYRA\n            Ironic Bess, that while Peace is At Hand, the spectre\n            of disgrace, unrest haunts the President, who, scant\n            days from the Election...\n\nINT. MALL -- DAY\n\nBREAN MOSS AND AMES.\nWALKING -- AN AIDE GIVES BREAN A PHOTO.\n\n                          BREAN\n            ...this the Guy.\n\n                          MOSS\n            Oh, he's gonna be Aces.\n\n                          BREAN\n            Where is he now?\n\n                          MOSS\n                    (SHRUGS)\n            Some, military... Special Program, Oklahoma\n            somewhere...\n\n                          BREAN\n            ...we get our hands on him?\n\n                          MOSS\n            They got him standing by.\n\n                          BREAN\n            What's the thing with Morse Code...\n\n                          MOSS\n            Oh, you're gonna love this:\n\nINT MALL H.Q., SHOESTORE DAY.\n\nWE SEE THE ASSEMBLED THRONG LISTENING TO THE END OF THE SONG, \"GOOD OLD SHOE,\"\nRAPT.  BREAN RISES, AND FLIPS OFF THE TAPE.\n\n                          BREAN\n            Who said, \"I care not who writes a country's laws, so\n            long as I can write its songs...\"?  Stanley Moss,\n            folks...\n\nTHE GROUP STARTS APPLAUDING.\n\n                          MOSS\n            Hey, hey, I'm just the Producer, I'm just the\n            Stationmaster, Johnny Green wrote that song, and...\n\n                          AMES\n            All we have to do now is sell it to the President.\n\n                          BREAN\n            No, I'm telling you, this guy, this guy is aces, this\n            guy is the Kitty's Sleepwear, this guy, they should of\n            given him every Oscar.  Every Oscar.  This is the...\n\nAN AIDE ENTERS, HOLDING A BOX GINGERLY, SHE BRINGS IT TO BREAN, WHO OPENS IT,\nHOLDS IT TO THE CAMERA, IT CONTAINS A RATTY OLD 78 RECORD \"FOLKLORE OF THE\nRURAL SOUTH, VOLUME THREE, 'GOOD OLD SHOE' WRITTEN AND SUNG BY NATHANIEL\nHORN, 1934, ATHENS, GA.\"\n\n                          BREAN\n                    (HOLDING IT UP)\n            Well, this is genius.  Who did this?\n\n                          MOSS\n            My prop guy, had a guy out here.\n\n                          BREAN\n                    (TO THE AIDE)\n            Get it in the stacks at the Library of Congress, Now.\n                    (TO THE ASSEMBLE)\n            Who's seeing the guy at C.B.S.?\n\nA YOUNG WOMAN RAISES HER HAND.\n\n                          BREAN\n            Tonight, you remember some song, from your folksong\n            days, something about a Good Old Shoe...\n\n                          AIDE\n            ...tonight...\n\n                          BREAN\n            You're with him tonight, watching the President's\n            Speech, when the President...\n\n                          AIDE\n            What if he's busy tonight?\n\n                          BREAN\n            Lure him.\n                    (PAUSE)\n\n                          AIDE\n            What are you saying...\n\n                          BREAN\n            Well, darlin' I ain't your confessor.  Tell him you've\n            got some info on the President's sex scandal, it's on\n            your conscience, believe me, he'll drop what he's\n            doing.  Okay;  Now:  Folks, folks, folks, this is a\n            shitty business, and it needs no Ghost Come From the\n            Grave to tell us that.  But in Six Days, Lord willing\n            n'Jesus Tarries, I am going to take you beauties into\n            the second term. .....wait til you hear the speech\n            tonight.  The 3-0-3 Speech... where's the Fad King, by\n            the way...\n\n                          AIDE\n                    (ON THE TELEPHONE, LOOKING WORRIED)\n            ...on the way in.\n\n                          BREAN\n            When you...\n                    (TO AIDE)\n            What?  I'm busy.\n\n                          AIDE\n            It's the White House.\n\nHE HANDS THE PHONE TO BREAN.\n\n                          BREAN\n            Hello.\n                    (PAUSE)\n            What?\n\n                          MOSS\n            What?\n\n                          BREAN\n            What do you mean he won't do it?\n                    (PAUSE)\n            He won't do what?\n                    (TO MOSS)\n            He won't do the sp...\n                    (TO PHONE)\n            It's what?  It's corny?  Corny?  Is that the word?  Of\n            course it's corny.  We wouldn't have him say the\n            flippin' thing it wasn't corny.  Put... listen, it's\n            not a question, we're locked in to this speech.  NO\n            We're, Are You Listening?  LOCKED IN.  We're, we're\n            playing way past it, we're past it -- it's the set-up\n            for...he has got to say the speech.\n                    (PAUSE)\n            Tell Ames to meet me at the West Gate in...\n                    (HE CHECKS HIS WATCH AND HANGS UP THE\n                    PHONE)\n\nANGLE\nAT THE TV, MOSS IS WATCHING THE TELEVISION WHICH IS SHOWING THE \"CHANGE\nHORSES CAMPAIGN.\"  WE SEE TWO KIDS WITH SOAPBOX RACERS.\n\n                          KID ONE\n                    (OF HIS MACHINE)\n            ...change it, but I said to my dad, \"You Don't Change\n            Horses in the Mid...\"\n\n                          MOSS\n                    (OF TV)\n            Can you believe this shit?\n\nBREAN GRABS MOSS, AND THEY EXIT HURRIEDLY.  THE TV GOES TO A CARD READING\n\"COMMITTEE TO RE-ELECT THE PRESIDENT,\" AND THEN TO A TALK-SHOW FORMAT, THE\nWOMAN SPEAKING TO A HIGHLY DECORATED GENERAL.\n\n                          GENERAL\n            Yes.  Thank God, I say.  Thank God for the B-2 Bomber.\n            Thank God for it, for it is not an engine of War, but\n            an engine of Deterrence, as we've seen, and were it not\n            for that deterrence, who is to say, but that American\n            blood, would, even now...\n\nEXT WHITEHOUSE.  PENNSYLVANIA AVE.  DAY.\n\nMANY PLACARDS, ON THE GROUND, SHOWING MAPS OF ALBANIA, IN A RED CIRCLE WITH\nTHE RED LINE THROUGH IT, HELD ALOFT, PLACARDS READING, \"DON'T CHANGE HORSES,\"\nPHOTOPLACARDS SHOWING THE PRESIDENT WITH THE GIRLSCOUT AND THE MOTTO:  \"THANK\nHEAVEN FOR LITTLE GIRLS.\"\n\nA REPORTER IS INTERVIEWING A POLICEMAN.\n\n                          POLICEMAN\n                    (TALKING INTO A MICROPHONE)\n            I was in the Vietnam Conflict, and I want to tell you\n            that a man who could do what the President did -- I\n            respect him.  But, on this issue....\n\nEXT WHITEHOUSE WESTGATE.  DAY.\n\nA VAN MARKED \"JIFFY LOCKSMITHS\" IS WAVED THROUGH THE GATE.\n\nANGLE\nAT THE DRIVETHROUGH PORTICO, AMES WAITING, WE SEE THE VAN, ON WHICH SOMEONE\nHAS SPRAYPAINTED \"FUCK ALBANIA.\"\n\nINT WHITEHOUSE.\n\nAMES, CAIN AND LEVY STANDING THERE, WAITING, AS BREAN AND MOSS, DRESSED IN\nLOCKSMITHS COVERALLS, ENTER THE WHITEHOUSE/\nCAMERA TRAVELS WITH THEM AS THEY STRIDE DOWN THE HALL.\n\n                          MOSS\n                    (TO AN AIDE)\n            Gemme all your secretaries, puttem in an office now,\n            Would  you?  Would you do that?\n                    (PAUSE)\n            Gimme thirty secretaries...\n\nAMSE NODS AT LEVY, WHO TAKES OFF ON HIS MASTER'S BUSINESS.\n\n                          MOSS\n            I need the President.  Five minutes of his time. Eh?\n            Five... \"the speech is corny\"...??\n                    (TO BREAN)\n            You know, this is what they used to say when I went out\n            to Hollywood.  \"It's too theatrical\"... I came from the\n            Theatre, and, anything, over their heads, \"It's too\n            Theatric...\"\n\n                          AMES\n            He thinks it's too...\n\n                          BREAN\n            First of all, we're locked in to it, secondly:\n\n                          MOSS\n            Don't tell me that the speech is too corny.  Your guy got\n            caught with his hand in the cookie Jar.  I came to Save\n            him.  I don't need this gig, I don't need the money, I\n            don't need the tsuris ... I don't need it.  He needs\n            the gig.  Y'r gonna go to the goddamn Doctor an exam,\n            What've I got?  He tells you you've got Cancer, you\n            tell him, \"That's Old Hat, gimme something else\"...?\n\nHE IS STEERED INTO AN OFFICE, HE OPENS THE DOOR, AND WE SEE THE LAST OF TWENTY\nSECRETARIES, WANDERING, TAKING SEATS IN A SMALL WAITING ROOM.  HE TURNS.  AND\nWE SEE THE BACK OF THE PRESIDENT, ENTERING.\n\n                          AMES\n            Mr. President, this is St...\n\n                          MOSS\n            Hi, How are ya?  Listen to this, willya...\n\nMOSS TAKES A SHEAF OF PAPERS FROM HIS POCKET AND GOES THROUGH THE DOOR FROM\nTHE SMALL OFFICE INTO THE WAITING ROOM.  LEAVING THE DOOR HALF-OPEN, THE\nPRESIDENT WAITS BEHIND, LOOKING ON THROUGH THE HALF OPEN DOOR.\n\n                          MOSS\n                    (TO THE SECRETARIES)\n            ...Ladies, thank you for coming.  I have in my hand a\n            .  It is a photograph of a man.  His name is\n            William A. Schumann.  He is the part of the team, of\n            unit 303, who dropped behind Albanian Lines.  We've\n            just received this photograph, of Schumann in\n            captivity.  Held by a dissident, a renegade group of\n            Albanian Terrorists.\n                    (HE HOLDS THE PHOTOGRAPH UP)\n            I'm going to call your attention to something...I don't\n            know how many of you know Morse Code...\n\nANGLE\nBREAN, AND AMES, IN THE CORRIDOR.  PACING.  PAUSE.\n\n                          AMES\n            You need this Schumann fellow?\n\n                          BREAN\n            Ronnie says we don't need'em for another four days.\n                    (PAUSE)\n            ...s'there a problem?\n\n                          AMES\n            No.  No...Pentagon says, Army's got'em, they got'm in\n            ...\"Custody\"...\n                    (PAUSE)\n\n                          BREAN\n            How's your wife?\n\n                          AMES\n            Fine.\n                    (PAUSE)\n\nTHE DOOR BEHIND THEM OPENS.  BEAT.  THEN A WEEPING SECRETARY COMES OUT.\nBREAN, MOVES INTO THE ROOM, FOLLOWED BY AMES, WE SEE A ROOM FULL OF\nSECRETARIES, QUIETLY WEEPING.\nBREAN LOOKS AROUND FOR MOSS.  HE SPOTS HIM THROUGH THE OPEN DOOR.\n\nANGLE.  HIS POV, IN THE OVAL OFFICE, MOSS, HANDING THE SPEECH BACK TO THE\nPRESIDENT.\n\n                          MOSS\n            \"The Speech Won't Work...\"\n\nMOSS STARTS OUT OF THE OFFICE, BACK TOWARD THE CAMERA, AND THEN TURNS BACK TO\nTHE PRESIDENT.\n\n                          MOSS\n            ...and see if you can keep your dick in your pants two\n            more weeks, willya...?\n                    (HE CLOSES THE DOOR)\n                    (TO HIMSELF, DEROGATORILY)\n            \"...speech won't work...\"\n\nAS HE STARTS TO LEAVE THE ROOM, ONE OF THE WEEPING SECRETARIES TAKES HIS HAND\nAND KISSES IT...\n\nHE PICKS UP HIS LOCKSMITH KIT, AND STARTS DOWN THE HALL, MOTIONING TO HIM TWO\nSECRET SERVICE ESCORTS, \"LET'S GO...\"\nHOLD ON THE WAITING ROOM, ONE OR TWO RESIDUAL WEEPING SECRETARIES DABBING AT\nTHEIR EYES.  AND A SIGN ON THE BOARD, READING 6 DAYS TO ELECTION, AND %-IN-\nFAVOR -- 37%.  AN AIDE GOES OVER TO THE BOARD, A PHONE TO HIS EAR, AND WIPES\nOUT 37% AND INSERTS 27%.\n\nINT STUDIO APARTMENT NIGHT.\n\nA YOUNG FELLOW, IN BLUEJEANS AND T-SHIRT, EATING POPCORN OUT OF A BOWL AND\nWATCHING TELEVISION.\nON THE TELEVISION, THE PRESIDENT, IN THE OVAL OFFICE.\n\n                          TV (VOICE OVER)\n            Ladies and Gentlemen, the President of the United\n            States.\n\nWE SEE THE FORM OF THE PRESIDENT COME TO THE PODIUM, AND CAIN MOVES TO THE\nBACK OF THE READYROOM, WHERE SHE WATCHES, THROUGH A TWO-WAY MIRROR, THE BACK\nOF THE PRESIDENT, AS THE PRESIDENT PREPARES TO GIVE THE SPEECH.  WE SEE,\nBEYOND THE PRESIDENT THE PODIUM, AND THE GLASS WITH THE TELEPROMPTER TEXT\nPRINTED ON IT, AS IT SCROLLS UP, AND WE SEE CAIN FOLLOW ALONG, ON THE TEXT AT\nHER HAND.\n\n                          PRESIDENT\n            Thank you, would you be seated, please.\n                    (PAUSE)\n            Ladies and Gentlemen... I thank.  A merciful God.  And\n            I am sure each and every one of us will thank that\n            Supreme Power, whatever we conceive that power to be --\n            that peace is at hand.\n\nMURMUR AMONG THE PRESSCORPS.  THE PRESIDENT CLEARS HIS THROAT, AND TAKES A SIP\nOF WATER.\nCAIN LOOKS UP, AND WE SEE ON A VIDEOMONITOR, WHICH SHOWS A REARVIEW OF THE\nPRESIDENT, THE SAME TELEPROMPTER IMAGE HE SEES, WHICH READS:\n            ...That peace is at hand...\n                    (CLEAR THROAT AND TAKE A DRINK)\n\nANGLE\nTHE PRESIDENT, CONTINUIN TO SPEAK.\n\n                          PRESIDENT\n            The threat of Nuc1ear Terrorism has been quelled.  We\n            are in contaot with the Albanian Premier, who assures\n            me, and this government credits his assurances, that\n            his country does not wish us ill, and has not.  That\n            the threat which we perceived was not of his wish, or\n            of his making.\n\nANGLE\nCAIN, MOUTHING ALONG, WITH THE SPEECH, SHE LOOKS DOWN, AND WE SEE WRITTEN, ON\nHER COPY.\n            of his making\n                    (BITE LIP)\n\nANGLE\nAS WE LOOK UP, WE SEE THE PRESIDENT BITING HIS LIP, AND CONTINUING WITH THE\nSPEECH.\n\n                          PRESIDENT\n            From whence did it come?  Our information states it\n            came from a small group of armed, dissidents.  Of Armed\n            and Violent Dissidents...\n\nANGLE\nON CAIN, AS SHE LOOKS AROUND.\n\nANGLE, HER POV.\nTHE GROUP, LISTENING SPELLBOUND.\n\nANGLE\nCAIN, AS SHE SMILES TO HERSELF.\n\nANGLE\nON THE PRESIDENT.  AS HE CONTINUES.\n\n                          PRESIDENT (C)\n             But that group has been, in the main, subdued.  Now:\n             How did we come by this information?  And.  Who subdued\n             that group?\n                     (THE PRESIDENT COUGHS)\n\nANGLE\nCAIN LOOKS DOWN AT HER SCRIPT.  SHRUGS, AND LOOKS UP.\n\nANGLE\nON THE PRESSCORP, THE REPORTERS, LISTENING WIDEMOUTHED, TO THE PRESIDENT'S\nSPEECH.\n\n                          PRESIDENT\n            It falls to me to reveal to you a secret.\n                    (PAUSE)\n            To reveal the existence of a secret group of warriors.\n            Men, yes, and women, trained and pledged their\n            strength, their skills, and, if called upon, their\n            lives, in the service of their fellow Americans.\n            A group so secret, its very existence has been known to\n            just a few, and known not by a Name, but by a\n            Designation Number, Three-Oh-Three...\n\nINT HEADQUARTERS IN THE SHOESTORE IN THE MALL, NIGHT.\n\nLIZ, THE COSTUME DESIGNER, WORKING ON A DRAWING OF A SHOULDER PATCH, ON A\nBERET.  ON ONE SKETCH WE SEE IT IS ON A BLACK BERET, ON THE ONE BELOW IT IS ON\nA LEOPARDSKIN BERET.\nONE VERSION HAS A COUGAR WITH AN OLILTE BRANCH, WE PAN ONTO VERSION TWO WHICH\nSHOWS A DOVE HOLDING A SWORD.  THE NUMERALS 303 FIGURE PROMINENTLY ON EACH.\nTHE BANNER FOR THE MOTTO IS BLANK.\n\n                          LIZ\n            ...anybcdy know Latin.\n\n                          PRESIDENT\n                    (VO)\n            ...member of the group, was left behind what were,\n            then, Enemy Lines.\n                    (PAUSE)\n\nANGLE\nON LIZ, AS SHE WALKS THROUGH THE H.Q., ON A BOARD WE SEE \"DAYS TILL ELECTION\n6\" AND % IN FAVOR 82%.  A HUGE TV SHOWS THE PRESIDENT.\n\n                          PRESIDENT\n            And I can only say, to those family members, of group\n            303, which members are, I know, as I speak, gathering\n            to comfort you, the parents of the missing man, I can\n            only say,\n\n                          LIZ\n            I need a Latin Motto, anybody know n'y Latin...?\n\n                          PRESIDENT\n            ....and the Albanian Government joins with me, that no,\n            I repeat, No effort will be apared, to find...\n\nANGLE INT LIMO, BREAN AND MOSS WATCHING THE TV\n\n                          PRESIDENT\n                    (ON TV)\n            ...this brave man and to bring him home.\n\nBEAT.  BREAN REACHES OVER AND TURNS DOWN THE SOUND.\nTHEY LOOK AT EACH OTHER AND SMILE.\n\n                          MOSS\n            Trump that, Senator Nole, you Howdy Doody vontz.\n\n                          BREAN\n            Not bad for government work.\n                    (PAUSE)\n            Having a good time.\n\n                          MOSS\n            Haven't had so much fun since Live TV.\n\nBREAN SIGHS, TAKES A PHOTO OF SCHUMANN FROM HIS POCKET, CAMERA SEES IT\nCAPTIONED WITH THE NAME WILLIAM SCHUMANN, ETC.\n\n                          PRESIDENT\n                    (HOLDS UP A PHOTOGRAPH)\n            Here's a photograph.  It is a photograph of a man.\n            His name is William Schumann.  He is a Master Sergeant\n            in the United States Army.  A member of the Squad\n            303....dropped behind Albanian Lines.  We've just\n            received this photograph, of Schumann in Captivity.\n            Held by a dissident group of Albanian\n            Terrorists...Now, I don't know how many of you are\n            familiar with the Morse Code...but...could you bring\n            the camera closer in here, please...?\n\nTHE CAMERA PUSHES IN, TO A SECTION OF SCHUMANN'S SWEATER.\n\n                          PRESIDENT (VO)\n            You will see his sweater is worn...it has been\n            unraveled in places, and those places form dashes and\n            dots.\n\nANGLE\nTHE PRESIDENT, HOLDING THE PHOTOGRAPH\n\n                          PRESIDENT\n            Dashes and Dots.  And those dots spell out a message in\n            the Morse Code.\n            And that message is, \"Courage, Mom...\"\n                    (PAUSE.  PRESIDENT PAUSES, AS IF ALL\n                    CHOKED UP)\n            And he got the message through. \"Courage.  Mom...\"\n                    (PAUSE.  HE COMPOSES HIMSELF)\n            Well, to the Family of William A. Schumann, to the Men\n            and Women of Unit 303, to my fellow citizens I say\n            \"courage.\"  I have informed the Albanian government,\n            and I inform you, that we will not rest until the safe\n            return of Sergeant Schwn&nn.\n                    (PAUSE)\n            I'm told his unit mates gave him the nickname, \"Old\n            Shoe.\"  Ladies and Gentleman, we will not treat him\n            like an Old Shoe, we...\n\nANGLE INT, 5HOESTORE HQ.  NIGHT.\nAMES, MOSS AND BREAN, LOOKING AT THE TV.\n\n                          MOSS\n            Trump that, Senator Nole, you Howdy-Doody-looking\n            Vontz.\n\nANGLE\nYOUNG PERSON'S APARTMENT, NIGHT.\n\n                          PRESIDENT\n                   (VO.  ON TELEVISION)\n            ...we will not be swayed, will, will not be swayed\n            from Every effort to find our Old Shoe, our...\n\nWE HEAR A YOUNG WOMAN'S VOICE\n\n                          YOUNG WOMAN\n                   (VO)\n            Hey...?\n\nANGLE\nON THE YOUNG MAN, AS HE TURNS.  WE SEE, BEHIND HIM, AN UNMADE BED, AND A YOUNG\nWOMAN, THE AIDE FROM THE SHOESTORE H.Q., WRAPPED IN A SHEET.\n\n                          AIDE\n            ...wasn't there a folksong called \"Old Shoe?\"  Wasn't\n            there an old, uh ...\"folksong\"...\n\nWHITEHOUSE SITUATION ROOM, WE SEE THE BOARD, READING, DAYS TO ELECTION, ET\nCETERA, AND THE AIDE, STANDING BY THE PERCENTAGE IN FAVOR SIGN WHICH NOW\nREADS 37%, THE AIDE CROSSES OUT 37 AND WRITES IN 41, THEN LISTENS, AND WIPES\nOUT THE ONE AND MAKES IT 47.\n\nEXT.  POOR NEIGHBORHOOD.  NIGHT.\n\nA BLACK LIMO GLIDES SLOWLY THROUGH THE STIEET.\n\nANGLE, INT THE LIMO.\nBREAN AND MOSS IN THE BACKSEAT.\n\n                          MOSS\n            It's all, you know ... thinking ahead.  Thinking\n            Ahead.  That's what producing is.\n                    (PAUSE)\n            It's like being a piumber.\n\n                          BREAN\n            Mmm...\n\n                          MOSS\n            You do your job right, nobody should notice.\n\n                          BREAN\n            Mmm.         \n\n                          MOSS\n            S'only when you fuck up, everything gets full of shit.\n                    (PAUSE)\n            Do you think we could line him up for the Peace Prize?\n\n                          BREAN\n            Hey, our job ends at the Finish Line.\n\n                          MOSS\n            Yes, but I, well, you know...\n\n                          BREAN\n            Just for the Symmetry of the thing...?\n\n                          MOSS\n            ...that's right.\n\n                          BREAN\n            If they can give Kissenger the Peace Prize, I wouldn't\n            be surprised to wake up and find I'd won the Preakness.\n\n                          MOSS\n            Well, yes, but the guy did bring Peace.\n\n                          BREAN\n            Yes, but there wasn't a War.\n\n                          MOSS\n            All the greater accomplishment.\n\nTHEY LOOK AT THE TELEVISION, PLAYING SILENTLY.\n\nANGLE INS. THE TV SHOWING THE SHOULDER PATCH OF GROUP 303, THE NUMERALS AND A\nDOVE HOLDING A SWORD, AND A WOLF HOLDING AN OLIVE BRANCH.  AND THE WORD\n\"VOLO.\"  BREAN INCREASES THE VOLUME A BIT.\n\n                          ANNOUNCER\n            \"Volo,\" meaning, \"I will.\"  As the President bends all\n            his will, to find, and to restore to his country, to\n            his family, and to what are his mounting legion of\n            friends, William Schumann, the Commando Ranger of\n            detacment 3.0.3. -- Sgt. William Schumann...the Old\n            Shoe.\n\n                          BREAN\n                    (SIGHS)\n            Hell of a thing...\n                    (HE LOOKS OUT OF WINDOW.  TO THE\n                    DRIVER)\n            Stop there..\n\nTHE LIMO STOPS.  BREAN AND MOSS EXIT THE LIMO, TAKING A LARGE CARDBOARD BOX\nWITH THEM.\n\nANGLE, EXT, THE LIMO\n\nBREAN AND MOSS, BENT OVER A BOX OF WHAT ARE REVEALED TO BE OLD SHOES.\n\n                          BREAN\n            Ya got to hand it to the Fad King.\n\n                          MOSS\n            No, he's my Hero.\n\nTHEY PICK UP SEVERAL OLD SHOES, TIE THEM TOGETHER, AND BEGIN HEAVING THEM UP\nONTO A LAMPPOST ON THE DESOLATE STREET.  A SMALL AFRICAN-AMERICAN BOY COMS\nUP, AND LOOKS THROUGH THE BOX.\n\n                          KID\n            ...these Shoes are ratty...\n\n                          BREAN\n            Yeah, well, that's why we're flinging them away...\n\nTHE KID SHRUGS, TAKES SEVERAL SHOES OUT OF THE BOX.  BREAN AND MOSS GET INTO\nTHE LIMO, WHICH BEGINS TO DRIVE AWAY.  THE KID BEGINS TYING SHOES TOGETHER\nAND WALKS DOWN THE STREET AND HEAVES ANOTHER PAIR UP TO ANOTHER LAMPPOST.\n\nANGLE\nRICH NEIGHBORHOOD.  SUBURBS NIGHT.\nWEALTHY LOOKING WHITE GUY OUT WAKING HIS DOG.  LIMO COMES UP BEHIND HIM.\nBREAN GETS OUT OF HIS CAR AND TAKES A CARDBOARD BOX OUT, AFTER HIM.  HE\nRUMMAGES THROUGH THE BOX.  FINDS A PAIR OF RATTY \"SPERRY TOPSIDER,\" AND FLINGS\nTHEM UP INTO THE TREE.\n\nINT RICH WHITE FELLOW'S HOUSE. NIGHT.\n\nTHE MAN ENTERS THE BACK-DOOR, WITH THE DOG.\n\nINT LIVING-ROOM.  HIS WIFE, KNITTING, LISTENING TO THE RADIO.\n\n                          MAN\n            ...there was a fellow in a limousine, outside,\n            throwing...\n\nSHE SHUSHES HIM.  WE HEAR, ON THE RADIO:\n\n                          RADIO\n                    (SINGING, AS PER THE RECORDING WE HEARD\n                    PREVIOUSLY)\n            ...\"Dog Was Loyal, and the Dog was True...n'there's\n            never been a better than my Good Old Shoe...Good Old\n            Shoe...Good Old Shoe...Never have ta call'im when\n            there's Work to do...If I get to Heaven when the Day is\n            Through.  I'll know I'll see him waitin', Jest a Good\n            Old Shoe...\"\n\nANGLE, ON THE MAN, AS HE NODS ALONG IN TIME, TO THE WISDOM OF THE SONG.\n\n                          F.M. ANNOUNCER (VO)\n            ...was just discovered.  A l93O's recording, part of\n            the folksong collection of the Library of Congress, and\n            a fitting...\n\nTHE MAN, MOVED, GOES INTO THE KITCHEN, WHERE HE POURS HIMSELF A DRINK,\nSWITCHING ON THE TV, WHERE WE SEE JIM BELUSHI, DOING \"PANE:\" ON SOME TALK\nSHOW.\n\n                          JIM BELUSHI\n            ...and there's just one thing I'd like to say, and I am\n            speaking to those in Albania who have the man in\n            custody, and from the bottom of my heart:\n\nHE TURNS TOWARD THE CAMERA, AND BEGINS SPEAKING IN ALBANIAN.\n\nDISSOLVE\n\nINT FACTORY LUNCHROOM.  DAY.\n\nA BUNCH OF WORKERS EATING, SOUNDS OF HEAVY MACHINERY IN THE B.G., AS OTHER\nWORKERS ENTER.  SEVERAL PEOPLE WATCHING A SOAP OPERA.\n\nANGLE\nONE WORKER, WITH A T-SHIRT READING, \"COURAGE, MOM,\" AND A PHOTO OF SCHUMANN,\nCHECKS HER WATCH, AND SWITCHES THE CHANNEL TO A NEWSCAST.\n\n                          NEWSCASTER (ON TV)\n            ...the City Council, Denying the charges of...and this\n            just in...the search for William Schumann continues.\n            NATO, US, and Albanian Forces continue to scour the\n            countryside, as...\n\nANGLE\nANOTHER SMALL GROUP OF WORKERS, SEVERAL WEARING, \"FUCK ALBANIA\" T-5HIRTS.  ONE\n\nINT SHOESTORE H.Q.\n\nTHE BLANK \"% IN FAVOR\" CHART. IS FILLED IN BY THE HAND OF AN AIDE.  IT READS\n\"87.\"  CAMERA PULLS BACK TO SHOW \"3\" DAYS TIL ELECTION.\n\nBREAN AND MOSS AND THE FAD KING, LEAVING THE OFFICE, AN AIDE COMES AFTER THEM.\n\n                          AIDE\n            ...White House wants to know about the Congressional\n            Medal of Honor.\n\n                          BREAN\n            What about it?\n\n                          AIDE\n            For Schumann.\n\n                          BREAN\n            Well, well, well, well, wait a minute, we got 86\n            percent.  We bring'em back tomorrow, the charts go up,\n            they don't go down...\n\nTHEY WALY THROUGH THE MALL, PAST A NEWSSTAND SHOWING TIME AND NEWSWEEK BOTH\nOF WHICH BREAN PICKS UP, ONE SHOWS THE PHOTO OF SCHUMANN AND THE LEGEND,\n\"COURAGE, MOM,\" THE OTHER A PHOTO OF SCHUMANN, AND THE LEGEND, \"GIVE HIM\nBACK.\"  THE VENDOR IS WEARING A \"303\" T-SHIRT.\n\n                          BREAN\n            I don't wanna tell them their business, but why not\n            wait to give it to him after the election.  When he's\n            gonna need some help....\n\nTHE AIDE NODS AND RETIRES.\nBREAN GESTURES AT THE KID WITH THE 303 T-SHIRT.\n\n                          BREAN\n            King...\n\n                          FAD KING\n            All part of the Service we Render.\n\n                          MOSS\n                    (OF BREAN, TO FAD KING)\n            He ain't seen nothin' yet.\n\n                          FAD KING\n            When do you bring'em back?  Schumann.\n\n                          BREAN\n                    (LOOKS AROUND)\n            Schumann. We're gonna go pick him up tonight.\n\n                          FAD KING\n            Where is he?\n\n                          BREAN\n            Out in Oklahoma.\n\n                          MOSS\n            Going to make a little stop back home, pick up my\n            shirts, show him a little treat.\n\n                          FAD KING\n            See y'at the Finish Line.\n\nAS THEY WALK AWAY, MOSS CALLS BACK.\n\n                          MOSS\n            Tell'em to fly the Inaugural Speech past me.\n\n                          BREAN\n            Inaugural Speech, press corp's gonna be jealous of\n            giving up that one...\n\n                          MOSS\n            Hey, lemme close out the thing in style.\n\n                          MOSS\n            I've come to feel It's my thing.\n                    (PAUSE)\n            You know, you take a job... You take a job, and, many\n            times, it's just a job.  And then...\n\n                          BREAN\n            Hell of a Ride, Stanley...\n\n                          MOSS\n            ...isn't it?\n                    (PAUSE)\n            Hey, what-the-hey ... it's all part of the\n            bittersweet...\n\nHE GESTURES WITH HIS HANDS, LOOKING FOR THE WORD.\n\nINT L.A. LAKERS, STADIUM, NIGHT.\n\nBREAN AND MOSS.  LOOKING ON, A SILENT AUDITORIUM, MOSS TALKING ON THE PHONE.\nBREAN SHUSHES HIM.  MOSS LOOKS UP.\n\nANGLE HIS P.O.V.\n\nTHE LAKERS, AND THE OPPOSING TEAM, SILENTLY, IN TWO RANKS, LOOKING ON AS A\nCHOIR OF YOUNGSTERS OF ALL RACES FILES ONTO THE COURT, AND, DIRECTED BY THEIR\nCHOIRHASTER, BEGINS TO SING, IN MANY PART HARMONY, \"GOOD OLD SHOE.\"\n\nAS THEY CONCLUDE, THE BASKETHALL PLAYERS TAKE OFF THEIR SHOES, AND FLING THEM\nINTO THE STANDS, WHICH CHEER.\n\nANGLE\nBREAN, MOSS, AND AMES, IN A SKYHOX, WATCHING THE SPECTACLE.\nBREAN SHAKES HIS HEAD IN SATISFACTION.\n\n                          MOSS\n            No business like it.\n\nTHEY WALK OUT OF THE BOX.\n\nINT LIMO, LEAVING THE STADIUM.  POURING RAIN.  THE GUARD MOTIONS FOR THE LIMO\nTO STOP, CHECKS THEIR I.D., AND SAYS, \"COURAGE, MOM...\"  THE GUARDS WEAR A\nLAPEL PIN OF AN OLD SHOE.\n\nANGLE\nMOSS AND BREAN LOOKING OUT OF THE WINDOW.\n\nANGLE, THEIR POV.\nEVERY TREE AND LAMPPOST HAS A PAIR OF OLD SHOES HANGING IN IT.\n\nANGLE INT THE LIMO.\nBREAN, MOSS, AND AMES, BREAN NODDING, DEEP IN THOUGHT.\nTHE RADIO IN THE LIMO IS PLAYING AN AUDIO VERSION OF THE \"DON'T SWITCH\nHORSES,\" COMMERCIAL.\n\n                          COWHOY\n                    (VO)\n            Rode the fifteen miles from the Bottomland, n'I was a-\n            gonna switch him for a fresher one to do the Ropin'...\n\n                          COWBOY #2\n                    (VO)\n            Waal, but, you know, my Paw always said, Ya Don't\n            Switch Horses...\n\n                          ANNOUNCER\n            Don't switch Horses.  Vote.  And vote for the man who\n            brought peace to...\n\nMOSS REACHES OVER AND TURNS OFF THE RADIO, SIGHS.\n\n                          MOSS\n            Fucking amateurs.  Pity of it is, two more days, we\n            bring it all back home...\n\n                          BRKAN\n            ...knock wood...\n\n                          MOSS\n            And who's gonna know?\n                    (PAUSE)\n            Who's gonna know what we did.\n                    (PAUSE)\n            Who's gonna know...?\n\n                          BREAN\n                    (SHRUGS)\n            Pride of a job-well-done...\n\n                          AMES\n            It's the Pride of a Job Well Done, Stanley, yes, but\n            it's more than that.\n\n                          MOSS\n                    (DISTRACTED)\n            ...mmm?\n\n                          AMES\n            It's the gratitude of your party, and of your\n            President...\n\n                          MOSS\n            Izzat the thing...\n\n                          AMES\n            Indeed it is.\n\nMOSS LOOKS OUT OF THE WINDOW.\n\nANGLE, OUT OF HIS WINDOW.  AN L.A. VIADUCT, IN THE POURING RAIN, SPRAY\nPAINTED, WITH A HUGE MURAL OF SCHUMANN, AND THE WORDS, \"COURAGE, MOM...\"\n\n                          BREAN\n                    (ON HIS PHONE)\n            Dean City, Oklahoma...\n                    (SHRUGS)\n            Army Special Programs -- tell'em to bring Schumann to\n            the plane, n we'll bring him back, stash him the\n            Hospital...Call the plane....tell me where to pick'm\n            up.\n\nMOSS LOOKS OUT OF THE WINDOW, AT THE MURAL.  LOOKS OVER IN ADMIRATION AT\nBREAN.\n\n                          MOSS\n            I'll bet you're good at Chess.\n\n                          BREAN\n            I would be, I could remember how all the pieces move...\n\nINT CORPORATE JET NIGHT.\n\nTHE AIRBORNE JET, NIGHT, BREAN AND MOSS RELAXING.\nA CO-PILOT COMES BACK INTO THE CABIN, AND CAMERA HINGES HIM TO A BAR -- HE\nTAKES OUT A BOTTLE AND TOPS UP DRINKS FOR THE TWO MEN --\n\nHE PROGRESSES DOWN THE AISLE, WHERE WE SEE AMES ON THE PHONE.\n\n                          AMES\n                    (ON PHONE)\n            ...aspect of the inaugural which.... No.  No, the\n            thinking is, to Wait on the Congressional... hello?\n                    (TO THE CO-PILOT)\n            We getting some.... hello?  Some interference...?\n\n                          CO-PILOT\n            Little rough weather.\n\n                          AMES\n                    (AS THE PHONE COMES BACK ON)\n            To wait on the Congressional Medal for Schumann.  Moss\n            and Brean think, and I agree, why spend it til you need\n            it.\n                    (PAUSE)\n            No.  Go ahead and pre... go ahead and prepare it.\n            Sure.\n                    (PAUSE)\n            Well, you... hello?  You can find the info on him in\n            the Army Special... Hello?  The Army Special Programs.\n\nCAMERA TRAVELS UP THE CABIN AGAIN, WITH THE CO-PILOT.\n\n                          CO-PILOT\n            We're seeing some difficult weather out of Oklahoma --\n            but the captain thinks that we'll be fine.\n\n                          BREAN\n                    (TALKING ON THE TELEPHONE)\n            Against...who could be aggressor....Help me out\n            here...Units of 303, the Defense Department confirms,\n            early this morning, Albanian Time, stormed a mountain\n            hideaway, near the city of -- help me out here -- and\n            freed a tired, but happy William Schumann, Suffering\n            no casualties.  His condition is reported as Guarded,\n            and his route to the US has not been disclosed, but a\n            high White House source confirms he is expected in\n            Washington tomorrow morning...no, that's for the wire\n            service.  Moss's working on Big Bird's Inaugural.\n                    (PAUSE)\n            Nine A.M...?\n                    (TO MOSS)\n            Nine?  Miss the commuters, but...\n\n                         MOSS\n            ...we'll gettim in their cars.\n\n                          BREAN\n                    (INTO PHONE)\n            Yeah, we'll gettem in their cars.\n                    (TO SELF)\n            I'm slowing down...\n                    (TO PHONE)\n            No, no.  Look, lookit:  I think it's a mistake, well,\n            I'll tell you why:  you got'em by the balls, Squeeze.\n                    (PAUSE)\n            Because Schumann's the Shark.  He's ...Jaws.  You have\n            to tease'em... You don't puttem in the first reel of\n            the movie...\n                    (MOSS NODS)\n            Bring'em back slow, the President...  No, no, put him\n            on.  Put him on.\n                    (PAUSE.  HE COVERS PHONE)\n            President wants to reveal Scbumann before the election.\n\n                          MOSS\n            Big mistake.\n\n                          BREAN\n                    (INTO PHONE)\n            Hell, yes, we're, we're on our way to get him now.  No.\n            Lookit:  it's like a girl with her virginity,\n            y'understand...\n\nMOSS NODS ALONG.\n\n                          BREAN\n                    (CONT)\n            Guy says he'll respect her tomorrow, he might, but why\n            take a chance?  Hold out til after you're married.\n            That's... that's.... looky, we're offering'em Schumann,\n            make em vote for hhhh.... psychologically, they will\n            understand that that's the bargain.  Make them pay for\n            him.  Make... that's right, the price is their vote.\n            Now, we bring him home, the President announces he is\n            flying home, he's here, he's there... f'there the\n            election, TA DA, here he is.\n                    (PAUSE)\n            Have him say it like I wrote it, It'll be fine.\n            Thanks.\n                    (HE HANGS UP.)\n            Labor, five bucks an hour.  If you watch, ten bucks an\n            hour.  If you help ... if you help, a hundred bucks an\n            hour.\n\n                          MOSS\n            Hey, lcokit:  any business...\n\n                          BREAN\n            Ain't that the truth.\n                    (PAUSE)\n\n                          MOSS\n            Whattaya gonna do when this is all over?\n\n                          BREAN\n            What am I gonna do?  I'm gonna \"Fade Away.\"\n                    (SMILES)\n            What are you gonna do?\n\n                          MOSS\n                    (LAUGHS)\n            Well, I'll be damned if I know ... you know... doing\n            this thing ...\n                    (PAUSE)\n            You know what the worst word is, in the English\n            Language?  It's ïretirement.\"  What the hell was I\n            thinking of?  Hell, I used to...\n\nBREAN NUDGES HIM, TO LOOK AT THE TV.\n\nTHEY SETTLE BACK, LOOK AT THE TV.\n\nANGLE, ON A TV, A COUNTRY MUSIC SPECTACULAR.  WILLIE NELSON IS CALLED TO THE\nSTAGE, SITS ON HIS STOOL, PLAYS A FEW BARS FOR NOTHING, AND THEN\nA RENDITION OF \"COURAGE, MOM.\"\n\nANGLE, IN THE AUDIENCE, PAN OVER THE FACES, ONE TEENAGE GIRL IN A 858\nSWEATSHIRT, BEARING THE LOGO, AND THE WORD, \"VOLO,\" IS SILENTLY, TEARFULLY,\nMOUTHING THE WORDS ALONG WITH WILLIE.\n\n                          WILLIE NELSON\n            \"What have you got at the end of the day?  How do you\n            keep those fears at bay?  What do you say, when there's\n            nothin' to say?  Courage, Mom...\"\n                    (ET CETERA)\n\nANGLE\nMOSS AND BREAN.\n\n                          BREAN\n            We pick up Schumann.  Sneak him back inside the Beltway.\n            And we plan his homecoming.  Zt's gone be Neil\n            Armstrong, Dr. Livingston, and Lindy...They're gonna\n            forget, they're gonna forget, they're gonna forget that\n            there is an election...The Pres's gonna have to say,\n            one of his speeches, \"Don't forget to Vote...\"\n\n                          MOSS\n            I got it in the inaugural.  \"Thank you for voting for\n            me, but, as importantly:  Thank you for voting...\n                    (HE GESTUR£S AT A SHEAF OF PAPERS)\n\n                          BREAN\n                    (GRINS)\n            Getting off on the inaugural?\n                    (MOSS NODS)\n            Gonna go...\n\n                          MOSS\n            Might, if I was asked...\n                    (HE SMILES)\n\nANGLE THE OKLAHOMA AIRPORT.  NIGHT.\n\nIN THE POURING RAIN, THE PLANE, BEING WAVED TO A PARKING SPACE.  IN THE B.G.\nAN ARMY TRUCK, SURROUNDED BY CHASE CARS, PULLS UP, WE READ, \"UNITED STATES\nARMY.  SPECIAL P...\"  AND THE REST OF THE WORD OBSCURED.\n\nANGLE\nINT THE PLANE.  AS THE TWO UNBUCKLE, AND STRETCH.\n\n                          MOSS\n            But, you know, this is the meeting, Ron?  You think\n            about it.  This is the meeting.  This, here.  Schumann\n            and us.  King Kong and the Trainers...this's it... What\n            are you working on?\n\nANGLE\nON BREAN, WHO IS DOODLING.\n\n                          BREAN\n            Medal.  Medal and Ribbon.\n\n                          MOSS\n            Of what?\n\n                          BREAN\n            The Albanian Campaign.\n\n                          MOSS\n                    (TO HIMSELF)\n            ...the Albanian Campaign.  This... this is history...\n\nAMES COMES UP FROM THE BACK OF THE PLANE.\n\n                          AMES\n            ...The Albanian Campaign...\n\n                          MOSS\n            ...like the sound of it, eh...\n\n                          AMES\n            We've got to put that, into the Inaugural.  \"I have\n            here, a ribbon.  You haven't seen it before, and you\n            will not see it too often now.  For it is the Proud\n            Possession of a few, a very few Men and Women... it is\n            the Ribbon of the Albanian Campaign....\"\n\nTHE OTHER TWO LOOK AT HIM ADMIRINGLY.\n\n                          MOSS\n            Wilfred, that's not bad.\n\n                          BREAN\n            That's not bad at all.\n\n                          AMES\n            Well, you know, \"The Whole Thing's Theatre...\"\n\nTHE OTHER TWO MEN LAUGH WITH HIM.\n\n                          BREAN\n            Napoleon said, fellow won't sell you his life, but he\n            will trade it to you for a little piece of ribbon.\n\n                          MOSS\n            ...the Albanian Campaign.\n                    (PAUSE)\n            And we won't even be a footnote...\n\n                          BREAN\n            We were the Albanian campaign, John -- We Were There.\n\nHE CLEARS HIS THROAT.  HE LOOKS OUT THROUGH THE WINDOW.  WE SEE A MILITARY\nCONVOY APPROACHING.  THE DOOR TO THE COCKPIT OPENS, THE PILOT GOES OUT.\n\n                          PILOT\n            Gentlemen, little problematical weather.\n\n                          BREAN\n            Well, c'n we get him back home?\n\n                          PILOT\n            Could if we had to.  Rather not.  Rough weather.\n\nBREAN AND MOSS GET UP, MOVE TOWARD THE FRONT OF THE PLANE, MOSS LOOKING OUT\nOF THE WINDOW.\n\n                          MOSS\n            Well, they're protecting him well enough.\n\n                          BREAN\n            They should be.  Most valuable animal since Sea\n            Biscuit.  Isn't he...\n\n                          MOSS\n            Bigger than that.  For want of a nail a Kingdom was\n            lost...\n\n                          BREAN\n            You've got something, there...\n\n                          AMES\n                    (WRITING)\n            Napoleon said -- A man will not sell you his\n            life...\n\nTHEY LOOK OUT THE WINDOW, START STRAIGHTENING UP THEIR CLOTHING, ET CETERA, IN\nPREPARATION FOR MEETING SCHUMANN.\nBREAN LOOKS HACK OVER HIS SHOULDER AT THE TELEVISION.\n\nANGLE HIS POV.\nON THE TV A PICTURE HEADED \"ANDREWS AIRFORCE BASE,\" AND SIGNS OF SCAFFOLDING\nBEING CONSTRUCTED, AND BUNTING PUT UP.  CUTS TO A TALKING HEAD, IN FRONT OF A\nPHOTO OF SCHUMANN.\n\nANGLE\nMOSS AND BREAN.\n\n                          BREAN\n            ...a masterpiece...\n\n                          MOSS\n                    (SHRUGS)\n            ...givem what they want...But...\n\nTHEY MOVE TOWARD THE FRONT OF THE PLANE.\nTHEY RUN INTO THE PILOT.\n\n                          PILOT\n            Weather's worsening, sir...might be advisable, wait it\n            out, on the ground, till..\n\n                          BREAN\n                    (NODS)\n            We're due at Andrews.\n                    (LOOKS AT HIS WATCH)\n\n                          PILOT\n            Well, I wouldn't go up in it, lest I had to...\n\n                          MOSS\n                    (TO AMES)\n            Here he comes...\n\nTHEY HEAR THE PLANE DOOR OPENING.\nTHEY ALL STRAIGHTEN UP AND SMILE, AS SCHUMANN, A RAINCOAT OVER HIS SHOULDERS,\nIS LED ONTO THE PLANE, FLANKED BY 4 M.P.'S, AND AN OFFICER, WITH A CLIPBOARD.\n\n                          MOSS\n            Sergeant Schumann?  If I may?  Welcome to History...\n\n                          AMES\n            Sergeant Schumann?  My name is Ames.  Welcome.\n\n                          OFFICER\n            S'mby named Brean?  Sign here...\n\n                          BREAN\n                    (TO THE PILOT)\n            Captain...  You wanna Take'er up...?\n\n                          PILOT\n            Heavy weather East of here.\n\n                          BREAN\n            Whaddaya think?\n\n                          PILOT\n            Six to five and pick'em...you wanna chance it...\n\nTHEY ARE QUIET, AS SOUNDS OF THE TV FILTER IN.  AN EXCITED NEWSCASTER.\n\n                          NEWSCASTER\n                    (ON TV)\n            Word that William Schumann, the Old Shoe, is\n            expected back, today, and that a glimpse of him...\n\n                          MOSS\n            Let's fly, if it'll fly... People waiting for us...\n\nTHE PHONE RINGS.  BREAN ANSWERS IT.\n\n                          BREAN\n                    (ON PHONE.  HE HAS NOT YET REGISTERED\n                    SCHUMANN)\n            ...child at the airport...\n                    (TO MOSS)\n            breaks through the ranks, runs to \"old shoe\" --\n            should we have flower or a bear...?\n\n                          AMES\n            Uh...Didn't we do this?\n\n                          BREAN\n            Never quit a winner.\n\n                          MOSS\n            I thought they weren't meeting him at the airport...\n\n                          BREAN\n            They insist they wanna go with meeting him at the\n            airport.  I told'em they're wrong, I can't convince'em.\n            They're concerned that the last kid had the Wheat.\n            Variations include, the kid is a boy, the kid is twins,\n            it's a little dog ... they rub meat on Schumann's cuff,\n            the dog runs to him...\n\n                          MOSS\n                    (OF SCHUMANN)\n            Uh...\n\nIN THE B.G. BREAN FINISHES SIGNING THE CLIPBOARD, THE OFFICER NODS TO THE\nM.P.'S, AND THEY SALUTE AND DEPART, THE OFFICER HANDS A KEY TO BREAN.\n\n                          AMES\n                    (OF KEY)\n            What's this...?\n\nTHE OFFICER TAKES THE RAINCOAT FROM SCHUMANN'S SHOULDERS, REVEALING HE IS IN A\nPRISON UNIFORM, AND HEAVILY MANACLED.  THE MAN, IS SCHUMANN, AN UNMISTAKABLE\nDERANGED, DROOLING, PSYCHO-NUTTER.  HOLD.\n\n                          OFFICER\n                    (TAKES A KEY ON A CHAIN FROM AROUND HIS\n                    NECK -- HANDS IT TO BREAN)\n            Key to the manacles...\n\nTHE OFFICER SALUTES, STARTS OUT OF THE PLANE.\n\nANGLE.  AMES LOOKS BACK, AT THE MANACLED SCHUMANN, AND BREAN GLARING, OPEN\nMOUTHED AT HIM.\n\nANGLE\nEXT THE PLANE, THE OFFICER RETREATING, IN THE RAIN, TO THE TRUCK, AMES,\nRUNNING AFTER HIM.\n\n                          AMES\n            Wait wait wait wait wait wait wait wait wait...\n                    (HE CATCHES UP WITH THE OFFICER)\n            What did he...what...what's the trouble?\n\n                          OFFICER\n            No trouble at all.\n\n                          AMES\n            What did he do...?\n\nTHE OFFICER CONSULTS HIS CLIPBOARD.\nCAMERA PANS TO SHOW THE VAN READS \"MILITARY SPECIAL PRISONS.\"\n\nANGLE\nINT, THE PLANE, BREAN, LOOKING AT SCHUMANN.  HOLD.  MOSS ENTERS THE PLANE.\n\nANGLE\nON MOSS, AS HE MOVES TO HIS BRIEFCASE, AND EXTRACTS THE TELEPHONE-LIKE BOOK,\nHE TURNS TO THE FRONT PAGE, AND WE SEE THE TITLE IS \"MILITARY SPECIAL\nPRISONS.\"\n\nANGLE\nMOSS AND BREAN.  MOSS HANDS BREAN THE BOOK.  BREAN LOOKS.  TURNS TO MOSS.  AND\nTHEN TO SCHUMANN.\n\n                          BREAN\n            ...how ya doing?\n\nMOSS TAKES THE CLIPBOARD, AND READS, WHILE AMES SITS STUNNED.\n\n                          SCHUMANN\n            Fine.\n\nMOSS HOLDS UP THE MILITARY DIRECTORY.\n\n                          MOSS\n            I think we asked for \"special programs\" and they gave\n            us \"special prisons.\"\n\n                          BREAN\n            Yeah, well -- it's only one word difference.\n\nAMES DRAWS MOSS ASIDE.\n\n                          AMES\n                    (SOTTO)\n            He, uh, has he been in the \"jail\" long?\n\n                          MOSS\n            ...twelve years.\n\nBREAN NODS.\n\n                         AMES\n            Much more...uh, he have much more time to \"serve?\"\n\nMDSS SHAKES HIS HEAD, SPREADS HIS HANDS APART TO ARM'S LENGTH.\nPAUSE\n                          AMES\n                    (BRAVING IT)\n            What'd he do?\n\n                          MOSS\n            He raped a nun.\n                    (PAUSE)\n\n                          AMES\n            Yeeaahhh...  Ohmigod ... ohmigod... ohmigod...\n\n                          MOSS\n                    (READING FROM THE CLIPBOARD)\n            ...and...\n\n                          AMES\n            And?  NO.  I don't wanna know.\n                    (PAUSE)\n            What do you mean \"and...\"?\n\n                          MOSS\n                    (READING)\n            Look, look, look....\n                    (HE HOLDS UP A SMALL VIAL, READS.)\n            He's fine, as long as he has his medication.\n\n                          AMES\n            What happens if he doesn't have his medication?\n\n                          MOSS\n            He's not fine.\n\nBREAN GOES TO THE FRONT OF THE PLANE.\n\n                          BREAN\n            Yeah, Captain, uh, yeah, Captain, uh, y'better get us\n            back to Washington.\n\nBREAN POURS HIMSELF A DRINK.  PAUSE.  TO SCHUMANN.\n\n                          BREAN\n            How are'ya...\n\nDISSOLVE\n\nINT THE PLANE  NIGHT.\n\nINSERT.\nTHE VIAL OF PILLS, LABELLED, \"MILITARY SPECIAL PRISONS,\" SCHUMANN, WILLIAM.\nA.  TWO PILLS EVERY FOUR HOURS.  SHOULD THE PATIENT BECOME VIOLENT THE DOSAGE\nCAN BE INCREASED TO...\nTHE PILLS SPILL OUT OF THE FRAME.\n\nANGLE\nTHE PLANE, IN A VIOLENT RAINSTORM, BUCKING WILDLY.  AMES, ON HIS KNEES,\nGATHERING UP THE PILLS, REPLACES THEM IN THE VIAL, SHAKES OUT TWO, AND GIVES\nTHEM TO SCHUMANN.  WHO TAKES THEM.  MOSS THEN STRAPS HIMSELF BACK IN AND BREAN\nCONTINUES TALKING ON THE TELEPHONE.\n\nTHE THREE STRAPPED IN, THE PLANE TOSSING WILDLY.  BREAN ON THE PHONE.\n\n                          SCHUMANN\n            You gonna git me back tomorrow?\n                    (PAUSE)\n            Cause they havin beans tomorrow...\n\n                          BREAN\n                    (ON THE PHONE)\n                    (HE PICKS UP A BOTTLE OF SCOTCH AND\n                    STARTS DRINKING FROM IT.)\n            A slight, a slight, well, no, we're gonna deal with it,\n            we just, I need a little readjustment...we need to\n            rethink...\n\n                          MOSS\n            Yes, William, Uh, we have this thing we're doing...\n\n                          SCHUMANN\n            Long's you git me back for the beans...\n\n                          MOSS\n            ...for the beans, yes...\n\n                          BREAN\n                    (ON THE PHONE)\n            We're gonna, just, may have to call off the...\n\nHE GESTURES AT THE SILENT TELEVISION, WHERE WE SEE THE SIGNS OF THE\nSCAFFOLDING, SIGNS READING, \"WELCOME HOME OLD SHOE,\" ET CETERA...\n            Well, maybe, you know, ah, ah, he's sicker than we\n            thought, and rush him under wraps to Walter Reed to do\n            a complete...\n\n                          SCHUMANN\n                    (TO AMES)\n            R'if y'r gonna keep me out, I'd kinda like the chance,\n            t'go to church...\n                    (HE LEANS TOWARD AMES AND WINKS\n                    LASCIVIOUSLY, AND NUDGES HIM IN THE\n                    RIBS)\n\n                          AMES\n            Oh Lord.  What have you done to me?  What have you done\n            to me...?\n\n                          BREAN\n            Wilfred.\n\n                          AMES\n            ...what have you done to me...\n\n                          BREAN\n            All Combat takes place at night, in the Rain, and at\n            the Junction of four Map Segments...\n\n                          AMES\n            ...what are we going to do...?\n\n                          MOSS\n            He's fine, as long as he gets his medication.\n\n                          BREAN\n            Speaking of that...\n                    (HE LOOKS AT THE VIAL)\n            We're gonna need a whole lot more of this....\n\n                          AMES\n            Well, get on the phone, and get it...\n\n                          MOSS\n            You know, I think you people are looking at this All\n            Wrong.  If you look at the backstory -- the guy's\n            coming back from Combat and Torture.  Of course he is\n            gonna be ... uh ... uh ... \"fucked up\".  Of Course he's\n            gonna \"need a little help\"...\n                    (GESTURES PUTTING A HYPODERMIC IN HIS\n                    ARM)\n\n                          AMES\n                    (TO HIMSELF)\n            Oh, Lord....\n\nANGLE, ON THE TV, WHERE WE SEE THE PRESIDENT, WEARING AN OLD SHOE BUTTON.\n\n                          PRESIDENT\n            ...a proclamation of a Day of National Rejoining...\n\nTHE TELEVISICN GOES ALL FUZZY, THEN CONKS OUT.\n            ...a day of Humility, a day of Pride...in the Return\n            of...\n\n                          SCHUMANN\n            N'ybody gotta Beer...?\n\nTHE LIGHTS IN THE PLANE FLICKER, AND THEN COME ON, WE SEE THE LIGHTENING\nFLASHING OUT OF THE WINDOW, THE CO-PILOT COMES BACK INTO THE CABIN...\n\n                          BREAN\n                    (ON THE PHONE)\n            Just....do what I ...look:  get me a ...hello...?\n            Hel...?  I'm going to need an ambulance, we take him,\n            the last moment, right from the Pl...no, we land, we\n            puttem in the ambulance.  Air force jet lands, we take\n            somebody else off that jet...what the fuck do I care?\n            Somebody in a Hospital gown.  And we need a\n            ......hello?  Hello...?\n\nTHE LINE GOES DEAD.\n\n                          BREAN\n            Cause I don't think this dog is gonna hunt....\n\n                          MOSS\n            He's going to be fine, aren't you boy...?\n\n                          BREAN\n            Yeah, well, perhaps...\n                    (TO PHONE)\n            Speaking of which:  I have a prescription here, I'm\n            going to give you the number, I need you standing by\n            with a crate of the stuff.... it's ... what is it?\n\n                          MOSS\n            An anti-psychotic...\n\n                          BREAN\n                    (TO TELEPHONE)\n            It's an anti-psychotic, the num...  the\n            number...hello...hello...\n\nBEAT.  THE BUFFETING STOPS.  THE CO-PILOT ENTERS.\n\n                          CO-PILOT\n            We have been experiencing some buffeting, but I think\n            from here on out, it's going to be fine.\n\nHE RETURNS TO THE COCKPIT.  BREAN TRIES TO REDIAL THE TELEPHONE.\n\n                          SCHUMANN\n            Long's I git back for my Beans.\n\n                          MOSS\n            This is nothing,  Wait'll you've worked with a movie\n            star, one time, this is nothing, we keep him shot-up\n            and happy -- the Old Days, I used to think I was a\n            pharmacist, the kind of stuff I had to do.  One time...\n\n                          SCHUMANN\n            Cause the beans, y'know, y'can tell if they're puttin\n            stuff in it.\n\n                          BREAN\n            Uh huh...\n\n                          SCHUMANN\n            So you don't have to fear it.\n\n                          BREAN\n            Uh huh...\n\n                          MOSS\n            Mmm.\n\n                          BREAN\n            What kind of stuff?\n                    (TO PHONE)\n            Hello...?\n\n                          SCHUMANN\n                    (PAUSE.  SCHUMANN LOOKS AT THEM WARILY)\n            What do you mean, \"What kind of stuff?\"\n\n                          AMES\n            No, no, he didn't mean anything at all...\n\n                          BREAN\n                    (TO MOSS)\n            Give'em another pill...\n\n                          AMES\n            No.  No.  He didn't mean anything by it at all...\n\n                          BREAN\n                    (TO PHONE)\n            Hello?   No, operator...\n\nMOSS ADMINISTERS A PILL TO SCHUMANN.\n\n                          SCHUMANN\n            What the fuck did you mean, \"What kind of stuff?\"?\n\n                          MOSS\n                    (TO BREAN)\n            ...this is nothing.  This is nothing. D'you ever shoot\n            in Italy?  Try three Italian starlets on Benzedrine,\n            this is a walk in the park...\n\n                          SCHUMANN\n                    (AS IF COMING TO)\n            ...who are you?\n                    (PAUSE)\n            Who are you sonofabitches...\n                    (HE LOOKS AROUND WILDLY)\n\n                          AMES\n            We're just, actually, we're friends of... can we get\n            another pill into him...\n\n                          SCHUMANN\n            Where are you taking me...?\n\n                          BREAN\n                    (TO PHONE)\n            Hello...?\n\nA HUGE FLASH OF LIGHTENING, THE PLANE IS PLUNGED INTO DARKNESS, THE ENGINES\nSTOP:\n\nINT THE DARK CABIN.  THE WIND WHISTLING.\n\n                          AMES\n                    (SOFTLY)\n            Oh, Heck.\n\nDISSOLVE\n\nEXT A FIELD IN MONTANA.  THE WRECKED CORPORATE JET.\n\nANGLE\nA BEATEN-UP BREAN STRUGGLES FROM THE PLANE, FINISHING A BOTTLE OF SCOTCH, HE\nFLINGS IT FROM HIM, REACHES IN HIS BACK POCKET, OPENS ANOTHER, AND, AS HE DOES\nSO, HE SINGS DRUNKENLY.\n\n                          BREAN\n            \"Hush little baby, don't say a Word...Pappa's gonna buy\n            you a Mockingbird, if that Mocking bird don't sing,\n            Poppa's gonna buy you a diamond ring...\"\n\nAMES, SIMILARLY BRUISED, STUMBLES FROM THE PLANE BEHIND HIM.\n\n                          BREAN\n            ...kid complains, kid cries, gets more junk, junk don't\n            work, kid cries, gets more junk.  End of the song,\n            house full of worthless junk, the kid's still crying.\n            Story of America...\n                    (HE SITS ON THE GROUND AND OPENS THE\n                    NEW BOTTLE OF SCOTCH.)\n            ...Z'at ever bother you...?\n                    (HE REACHES BACK INTO THE PLANE, AND\n                    BRINGS OUT A SMALL TELEVISION SET)\n\nANGLE, AS HE LEANS INTO THE PLANE. WE SEE MOSS, LYING IN A HEAP, MOSS COMES\nTO.\n\n                          MOSS\n            ...what happened...?\n\n                          BREAN\n            I think we were experiencing a Little Technical\n            Difficulty.\n\n                          MOSS\n            How's our friend?\n\nBREAN SETS UP THE TELEVISION.  TURNS IT ON.\nHE SITS, AND TAKES THE BOTTLE FROM BREAN, AND DRINKS.\n\n                          MOSS\n            ...\"Courage.  Mom\"...\n\nBREAN HAS KICKED THE TELEVISION INTO LIFE, WE SEE A MAN AND WOMAN ANCHOR,\nSPEAKING LUGUBRIOUSLY, INTO THE CAMERA.\n\n                          BREAN\n            News.  Like a Wedding Cake.  Tons and tons of sticky\n            sugar, Barbie and Ken on top...\n                    (HE HITS THE TV)\n            Can't ya Talk, you sonofabitches...?\n\n                          MOSS\n            What the hell do we care?\n\n                          BREAN\n            Eh?  I'm like the Rest of America.  I don't care -- I'm\n            just addicted to it...\n\nA PHOTO OF SCHUMANN COMES ON THE TELEVISION.  BREAN STUMBLES BACK INTO THE\nPLANE, AND HAULS THE DAZED SCHUMANN OUT, AND PROPS HIM AGAINST THE PLANE.\n\n                          BREAN\n                    (TO SCHUMANN)\n            N'just when everything was going so well...\n\nHE SIGHS.  HE LOOKS AT THE TELEVISION SCREEN.\n\nANGLE\nTHE CROWDS AT ANDREW'S AIRKORCE BASE, THE \"OLD SHOE\" BANNERS, THE \"COURAGE,\nMOM,\" BANNERS.  THE STILL BAND.  A SHOT OF THE BANDMASTER, SURREPTITIOUSLY,\nGLANCING AT HIS WATCH.\n\n                          MOSS\n            How's our friend?  What is he, \"dead?\"\n\n                          BREAN\n            Wake up.\n\n                          MOSS\n            Is he dead?\n\n                          AMES\n            Is he dead?\n                    (PAUSE)\n            Is he dead?  ARE YOU DEAD?  WAKE UP.  You stupid, nun-\n            raping sonofoabitch.... wake up...  WAKE UP.  Do you\n            want to spend the rest of your life in JAIL?  WAKE UP!\n            Do You Know Who I AM???  I'm talking to you...\n\nSCHUMANN BEGINS TO ROUSE BIMSELF.\n\n                          SCHUMANN\n            Z'it time for Exercise?\n                    (PAUSE)\n            Cause it's my Day on the Yard.\n\n                          BREAN\n            Courage, Mom.\n\n                          AMES\n            Oh.  Hell.  And what do we do now?  What do we do now?\n            Boy Producer?\n                    (PAUSE)\n            Mister Win-an-Emmy, Social Conscience, Whaleshit, save-\n            the-rainforest, Liberal hire-a-convict shithead?\n            Mister Affirmative-Action Peacnik.  Commie...\n            shithead....?\n\n                          MOSS\n                    (PAUSE)\n            This is nothing. ...piece of cake.  Y'know, producing\n            is being a Samurai Warrior.  They pay you, day in, day\n            out, for Years, so that, ONE DAY, when called upon,\n            you can respond, your training At Its Peak, and save\n            the day.\n\nANGLE\nBREAN, SHAKING HIS HEAD.  IN THE B.G., MOSS, DRINKING.\nTHE TV COMES TO LIFE.\n\n                          COMMENTATOR\n            ...long overdue, its absence unexplained.\n\nTHE NEXT SHOT IS SENATOR BUD NOLE, SPEAKING EARNESTLY AT THE CAMERA.\n\n                          NOLE\n            ...this...regrettable absence... this ...tardy absence\n            of the flight.  Must give us pause.  And, in that pause\n            we should take time to examine ourselves, our plans,\n            and our future.  There has been an ...interregnum -- if\n            you will, of reason, while we've watched unfold this\n            drama..... on the world scale...\n\n                          AMES\n                    (TO HIMSELF)\n            ...I hate this cocksucker...\n\n                          NOLE\n            And, now, end how it will, this drama is done...\n\nANGLE MOSS, AS HE WANDERS BACK TO STARE AT THE SCREEN.  THE VAST FIELDS\nSTRETCHING AWAY IN THE DISTANCE\n\n                          NOLE (C)\n            The drama is done, and we must pause to consider.\n                    (HE HOLDS UP A PHOTO OF THE PRESIDENT)\n            And we must consider this man.  This man...who, you\n            will remember, was discovered, scant days ago, in a\n            situation which must debar him from Public Office...\n                    (HE HOLDS UP A SHOT OF THE PRESIDENT\n                    AND THE GIRLSCOUTS)\n            And I say, when we take time to reflect, there're going\n            to be a lot of apartments for rent in Washington,\n            Election Day.  Two days from now, Folks...Don't forget\n            to vote.\n\n                          MOSS\n            No, I didn't think so.\n\nAMES KICKS IN THE THLEVISION.  HE MOVES TO SCHUMANN AND LIFTS HIM TO HIS FEET.\n\n                          BREAN\n                    (DRUNKENLY)\n            Leav't alone.  Wha'd television ever do to you?  Ate\n            your life, ruin'd your Culture, but...\n\nAMES FINISHES DESTROYING THE TV.\n\n                          AMES\n            IT DESTROYED THE ELECTORAL PROCESS.        \n\nHE FINISHES RAGING AT THE TELEVISION SET.  PAUSE.\n\n                          MOSS\n            Come on.\n\n                          AMES\n            ...where?\n\n                          MOSS\n            Come on.\n\nMOSS MOVES SCHUMANN INTO A STANDING POSITION.\n\n                          BREAN\n            Y'know what else bothers me?  \"Shh lil baby, don' saya\n            word, papa's gon buy you a mocking bird...\"\n                    (PAUSE)\n            The baby don'say a word, WHAT THE FUCK IS THE\n            MOTHERFUCKING MOCKING BIRD GONE SAY?\n                    (PAUSE)\n            You follow me...?\n\n                          MOSS\n            Get on your feet, boy.\n\n                          BREAN\n            Uh huh...why?\n\n                          MOSS\n            We're going home.  We're going home together...\n\n                          BREAN\n            We have no home.  We're vagrants.  N'each man's hand's\n            against us.  We killed Old Shoe...\n                    (HE BEGINS TO WEEP)\n            We killed the Schuster...spend our life in a\n            packingcrate...Where are you going...?\n\nMOSS STARTS CODDLING SCHUMANN.\n\n                          MOSS\n            Come on, Pal, come on Willie, come on, Old Shoe...\n\n                          SCHUMANN\n            Just want to take a nap.\n\n                          MOSS\n            He's not dead, Ronnie.  He's just a little\n            understandab1y, fatigued.\n                    (PAUSE)\n            Let's get him to some help...\n\n                          SCHUMANN\n            ...gimme some help...\n\n                          MOSS\n            That's right, we'll take a nap.  We'll get you to\n            Washington, we'll get you Back to your Buddies, and...\n\n                          SCHUMANN\n            ...just want to Get Back to the Beans...\n\nMOSS WALKS TO BREAN, AND STARTS KICKING HIM.\n\n                          MOSS\n            Come on, you fucking sissy, you think this is tough?\n            Try show-business.  1970-1990, n'ybody I worked with,\n            y'could of bottled their piss n'sold it in the\n            ghettos...\n                    (TO SCHUMANN)\n            Come on, Pal...\n\n                          BREAN\n            I'm tired.\n\n                          MOSS\n            Finish Strong!  Are you nuts?\n                    (HE STARTS SHEPHERDING THE TWO ACROSS\n                    THE VAST WHEATFIELD)\n            Are you nuts?  This's Pennies from Heaven... on his\n            triumphal return home, Old Shoe, his Plane Forced\n            Down...AND YET...\n\n                          BREAN\n            He's supposed to be flying in from Europe.\n\n                          MOSS\n            We'll deal with that when we come to it.  This is\n            producing.  This is what they pay off on...come on,\n            Pal, Boots and Saddles...\n\n                          AMES\n            ...his Triumphal Plane.  Shot Down.\n\n                          MOSS\n            Shot down, Forced down...\n                    (HE GESTURES, MEANING, THIS IS A MINOR\n                    POINT)\n            You guys are missing it... You're missing the\n            opportunity\n\nTHE GROUP TRUDGES OFF.\n\n                          SCHUMANN\n            Isn't it time for my Pill...?\n\nDISSOLVE\n\nINT VAST COMBINE HARVESTER DAY.  STOPPED IN A WHEATFIELD.\n\nOUTSIDE, AN ENDLESS WHEATFIELD.\nINSIDE, BREAN, MOSS, AMES AND SCHUMANN, CRAMMED INTO THE PASSENGER SPACE OF\nTHE HUGE MACHINE.  THE DRIVER WATCHING A SMALL TELEVISION, AS HE DRIVES, THE\nEARPIECE IN HIS EAR.\n\nANGLE, THE TELEVISION, SHOWS THE DESERTED RUNWAY AT THE AIRFORCE BASE.  THE\nCROWD BREAKING UP.\n\nANGLE.  THE THREE IN THE PASSENGER SPACE OF THE COMBINE.\n\n                          MOSS\n            This is producing.  This is, this is, this is the\n            Beauty Part.  You've got your fortune right here, and\n            you were ready to throw it away.  Because he's got a\n            Problem?  F'it was easy, anyone would do it.\n                    (PAUSE)\n            Otto Preminger.  Had to film a scene, in EXODUS.  The\n            proclamation of the State of Israel.  Needed twenty\n            thousand extras, n'Jerusalem Park.  Not enough money to\n            pay'em.  What did he do?  What did he do?  Printed up\n            signs:  Be in a movie, fifteen skekels.  He Charged'em\n            -- had to turn'em away.  That's producing.  That's\n            producing... n'you know, someday, people're gonna tell\n            this story...\n\n                          BREAN\n            You can't tell this story.\n\n                          MOSS\n            Why not?\n\n                          BREAN\n            Some'b'y'll have you killed.\n\n                          MOSS\n            Ha ha.  No, no, not now, not now, of course, But\n            Someday... when they tell this story...\n\n                          AMES\n            You can't tell this story.  He's not kidding you.\n                    (PAUSE)\n            You can't tell this story.  You knew that.\n                    (PAUSE)\n            The pay off was, you get to be Ambassador, or...\n\n                          MOSS\n            No, no, no...\n\n                          SCHUMANN\n            ...isn't it time for my Pill...?\n\n                          BREAN\n            And what the fuck story are you gonna tell?  The guy is\n            a nutcase.\n\n                          MOSS\n            You would be, two, if you'd gone through what he went\n            through.\n\n                          BREAN\n            He raped a Nun...\n\n                          MOSS\n            What he went through in Albania...\n\n                          BREAN\n            He's doped to the Gills ...\n\n                          SCHUMANN\n            ...where's my l'il pill?\n\n                          MOSS\n                    (TO BREAN)\n            Show some compassion.\n\n                          BREAN\n            ... and he spent the last twelve years in a Milit&ry\n            Prison...\n                    (PAUSE)\n\n                          AMES\n            How do we explain that?\n\n                          MOSS\n            ...how do we Explain That?  Hey?  Am I worried...?\n\n                          AMES\n            ...how do we explain that?  With the World Watching.\n\n                          MOSS\n            Fuck the world.  Try a ten A.M. pitch meeting, no\n            sleep, coked-to-the-gills, and you haven't even read\n            the material.\n\n                          AMES\n            But how do we explain the fact he was in prison?\n\n                          MOSS\n            How do we explain that?  Ah, well, you see, Wilfred,\n            this is where you've never been at a pitch.  You see?\n            His records say he was in prison ... as they must, as\n            all the records of Group 303 have the men and the\n            women, carried on their roster, as belonging somewhere\n            else, the secrecy required of....\n\nANGLE\nMOSS STILL TALKING, THE HARVESTER CONTINUING DOWN THE ENDLESS ROWS OF WHEAT,\nMOVING AWAY FROM THE CAMERA.\n         \nDISSOLVE\n\nEXT TINY OLD FASHIONED OKLAHOMA GAS STATION DAY.\n\nTHE OWNER, BOOTS PROPPED ON THE COUNTER, WATCHING AN OLD BLACK AND WHITE\nTELEVISION.  IT IS SENATOR NOLE.\n\n                          NOLE\n            Get out and vote, get out and vote, but remember the\n            difference, between a Promise, and a deed -- a promise-\n            and-a-deed...\n\nHE HALF TURNS HIS HEAD, ACROSS THE HIGHWAY WE SEE THE HARVESTER, WITH MOSS AND\nBREAN AND SCHUMAN AND AMES.  AMES STAYS BEHIND, TO TALK WITH THE DRIVER OF\nTHE HUGE HARVESTER COMBINE.\n\nANGLE\nON BREAN AND MOSS, WHO WALK SCHUMANN ACROSS THE HIGHWAY.\nIN THE B.G. WE SEE AMES TALKING TO THE DRIVER OF THE HARVESTER, WHO IS A\nSMALL, HISPANIC MAN.\n\nANGLE ON THE THREE, AS THEY APPROACH A PAYPHONE OUT BY THE GAS STATION.\n\n                          MOSS\n                    (TO BREAN)\n            ...\"down safely,\" crew perished in the Crash....\n\n                          BREAN\n                    (SHAKING HIS HEAD TO CLEAR IT.)\n            No, I'm On Top of it...\n\n                          MOSS\n            \"...unsure whether or not Enemy Action...\"\n\n                          BREAN\n            No, I'm fine... I got it together....\n\n                          MOSS\n            ...but...\n\nTHEY STOP BY A TELEPHONE.\n\n                          BREAN\n            You got a dime....?\n\nMOSS HANDS HIM A DIME.\nBREAN DIALS.\n\n                          BREAN\n                    (TO PHONE)\n            Hello.\n                    (PAUSE)\n            Hello.  I'm fine.  We're fine.  We're... stand by to\n            copy this, will... just get a pencil.... He is Down\n            Safely, though...\n\nANGLE\nON MOSS, AS HE WALKS THE GROGGY SCHUMANN TOWARD THE GAS STATION.\n\n                          MOSS\n            ...how ya feeling, boy?\n\n                          SCHUMANN\n            ...mmm.\n\n                          MOSS\n            ...'bout ready to Mix it Up...?\n\n                          SCHUMANN\n            Is today Laundry Day...?\n\nCAMERA TAKES THEM INTO THE SMALL GAS STATION OFFICE, WHERE WE SEE A WIZENED\nOLD WESTERNER, LOOKING AT THE TELEVISION WHERE WE SEE SENATOR NOLE.\n\n                          MOSS\n            Hiya.\n\n                          OWNER\n            Yup.\n\n                          MOSS\n            How 'bout a Cold Drink...?\n\nANGLE ON THE TELEVISION, SENATOR NOLE.\n\n                          NOLE\n            ...produce this Schumann.\n                    (PAUSE)\n            Produce him.  I say;  or, and I do not hesitate to say\n            it, rank him as Just One More...\n\nTHE OWNER GESTURES AT A COLD DRINK COOLER.\n\n                          NOLE\n                    (CONT.)\n            Just One More of a series of Broken Promises.  Of ...\n            Fantasies, yes, Fantasies, which...\n\nMOSS AND SCHUMANN WALK OVER TO THE COOLER.  THEY LOOK OUT THE WINDOW AT\nBREAN, WHO IS WALKING IN FROM THE PHONE.  HE HANGS UP AND COMES IN.\nMOSS LOOKS AT HIM, MEANING, \"WHAT'S UP?\"  BREAN GESTURES AT THE TELEVISION.\n\nANGLE, HIS POV.\nTHE TELEVISION, NOW SWITCHED TO THE SCENE OF THE DESERTED TARMAC.\n\n                          COMMENTATOR (VO)\n            Senator Nole, commentating on the unexplained\n            absence of...wait a moment...wait a....\n\nTHE SCREEN DISSOLVES, TO A SHOT OF THE GREAT SEAL OF THE PRESIDENT OF THE\nUNITED STATES.\n\n                          ANNOUNCER (VO)\n            Live, from the White House, we bring you...\n\nANGLE\nON BREAN AND MOSS, AS THEY CLUSTER UP TO THE TELEVISION.  IN THE B.G.,\nSCHUMANN, SITTING ON A STOOL AT THE COUNTER.\n\n                          PRESS PERSON (VO)\n            Ladies and Gentlemen, the President of the United\n            States...\n\nANGLE\nON THE THREE, AS THEY WATCH THE TELEVISION.\n\n                          MOSS\n            Okay ... it's time for the Cavalry.\n                    (PAUSE)\n            Nick of Time.... sonofabitches.... Fuck with me...?\n\n                          PRESIDENT (VO)\n            My fellow Americans.\n                    (PAUSE)\n\nANGLE\nTIGHT ON SCHUMANN WHO SEES SOMETHING OUT OF THE CORNER OF HIS EYE.\n\nANGLE, HIS POV\nUP A NARROW STAIRCASE, THE FIGURE OF A YOUNG GIRL IN A FLIMSY DRESS, CLIMBING.\n\nANGLE\nSCHUMANN, AS HE LOOKS AWAY, AND MUTTERS TO HIMSELF.\n\n                          SCHUMANN\n            \"...where's my pill...\"\n\nANGLE\nTHE GROUP WATCHING TELEVISION.\n\n                          PRESIDENT\n            ...he is down safely, though the flight crew perished\n            in the crash.  He will be transhipped, we are informed\n            he has sustained minor injuries, which will require his\n            being medicated for some time, but, I am assured...\n\nAMES WANDERS IN.\n\n                          MOSS\n                    (OF THE T.V.)\n            You see, this is what I'm talking about.  Stand It On\n            Its Head.  How does it Work for your benefit...\n\n                          AMES\n            I'm concerned about the driver of the rig.\n\n                          MOSS\n            What rig?\n\n                          AMES\n            ...the Harvester...\n                    (HE GESTURES OUT AT THE VAST FARM\n                    MACHINE, WHICH CAN JUST BE SEEN\n                    STANDING BY THE HIGHWAY.  ITS OWNER\n                    BESIDE IT.  WAITING.)\n\n                          BREAN\n            What about him?\n\n                          AMES\n            Well, he doesn't have his Green Card.\n                    (PAUSE)\n            He Doesn't have his Greencard.\n\nANGLE\nON SCHUMANN, WHO HAS CONE TO THE BACK OF THE COUNTER, AND IS EMPTYING THE\nCANNISTERS.\n\n                          SCHUMANN\n                    (TO HIMSELF)\n            Where's my pill...?\n\nHIS WANDERINGS BRING HIM TO THE END OF THE COUNTER.  WHERE WE SEE, OVER HIS\nSHOULDER, A YOUNG GIRL, PUTTERING ABOUT IN THE KITCHEN OFF THE GAS STATION\nOFFICE.\n\nANGLE\nCU.  ON SCHUMANN, LEERING.\n\nANGLE ON AMES, ETC.\n\n                          AMES\n            ... you want Schumann saved by an Illegal Alien...?\n\n                          BREAN\n            Well, what do you want to do about it?\n                    (PAUSE)\n            What do you...\n\n                          MOSS\n            Pals:\n                    (TO BREAN)\n            Get on the phone... r'they flying it?\n\n                          BREAN\n            They'll be here in ten minutes.\n\n                          MOSS\n            Get on the phone, have'em fly in a ...whaddaya need to\n            be a citizen?  A Judge?  Whaddaya need?  A Judge...?\n            Call in a Judge, call in a Federal Judge, and...\n                    (TO AMES, AS IF TO A CHILD)\n            If you're concerned about him, being an ...\"immigrant.\"\n            Make him a citizen... Eh?  Guys ... what's all this\n            mopery, we...\n\nSCHUMANN LOOKS TO THE SIDE.\nTHE YOUNG GIRL HAS DROPPED A SPOON OFF OF THE WORKTABLE AND BENDS OVER TO PICK\nIT UP, REVEALING HER LEGS AND LITTLE GIRL UNDIES.\n\nANGLE\nON SCHUMANN, LEERING.\n\n                          SCHUMANN\n                    (MUTTERING)\n            ...where is my pill?\n\nANGLE\nON THE MEN, IN THE ROOM, ARGUING ABOUT THE ILLEGAL ALIEN, SCHUMANN IN THE B.G.\n\n                          SCHUMANN\n            WHERE'S MY FUCKING PIIIILLLLLLL...?\n\nSCHUMANN RUNS INTO THE KITCHEN, AND WE HEAR THE SOUNDS OF LITTLE GIRL SCREAMS.\n\nALL THE MEN IN THE ROOM LOOK AROUND.\nTHE OWNER STANDS, AND LOOKS AROUND.\n\n                          OWNER\n            Susie...?\n                    (PAUSE)\n            Susie...\n\nHE IS ANSWERED BY WHIMPERING.\n\n                          MOSS\n            Oh, hell...\n\nTHE GAS STATION OWNER GOES TO THE DOOR TO THE KITCHEN, AND FINDS IT LOCKED.\n\n                          OWNER\n            Susie?  Susie.  Are you alright...?  Susie...\n\nMOSS STRIDES UP TO THE DOOR.\n\n                          MOSS\n            Lemme talk to him.  Will?  Shoe?\n\n                          OWNER\n            SUSIE...?  Are you alright...?\n\n                          MOSS\n                    (PUSHES HIM ASIDE)\n            Lemme talk to him.  Shoe?  Shoe...?  You in there...?\n\nWE ARE ANSWERED BY THE SOUNDS OF WHIMPERING.\n\nANGLE\nON THE GAS STATION OWNER, WHO HAS RETREATED TO HIS COUNTER AND PRODUCES A\nSHOTGUN, AND STARTS TO LOAD IT.\n\n                          MOSS\n                    (AT THE DOOR)\n            Shoe, boy...?  You know, you were telling me you\n            wanted Beans?  Remember, you were concerned about the\n            Beans...?\n\nTHE MAN WITH THE SHOTGUN COMES UP TO THE DOOR.\n\n                          MOSS\n                    (TO THE STATION OWNER)\n             No, 1emme talk to him... 1emme talk to him, we have a\n             relationship...\n\nTHE GAS STATION OWNER EXITS THE BUILDING, AND WE SEE HIM, OUTSIDE, KICK IN\nTHE SIDE DOOR TO THE KITCHEN.\n\n                          MOSS\n                    (THROUGH THE DOOR, TO SCHUMANN)\n             'Member, we were talking about how much you liked the\n             \"beans\" and all...?\n\nWE HEAR THE SOUND OF WHIMPERING, AND THEN TWO SHOTGUN BLASTS.\n\nWE HEAR MORE LITTLE GIRL SCREAMS, THEN A BLAST, AND THEN ANOTHER SHOTGUN\nBLAST.\nBEAT.\nBREAN AND MOSS ROUSE TBEMSELVES, AND GO TO STAND IN THE DOORWAY, LOOKING INTO\nTHE KITCHEN.  AMES PEEKS OVER THEIR SHOULDERS.\n\n                          BREAN\n                    (AFFECTLESS)\n             ...now look what's happened...\n\nBREAN WALKS TO THE DRINK COOLER, OPENS A CAN OF DR. PEPPER, AND COMES BACK TO\nSTAND IN THE DOORWAY.\n\nBEAT.  THE OWNER COMES OUT, HOLDING THE SHOTGUN AND COMFORTING THE DISTRAUGHT\nLITTLE GIRL.\n\nIN THE B.G. WE HEAR A JET ROAR, AND WE SEE A CARRIER JET MAKING AN APPROACH\nONTO THE HIGHWAY.\n\n                          AMES\n            So-close-and-yet-so-far.\n\n                          MOSS\n            Naa, fuck this, this is nothing.  Oh, Lord -- this\n            just got Big.  I see it -- Big -- Big for you and big\n            for me.\n\n                          AMES\n            What are you talking about?\n\n                          MOSS\n            You're not thinking right, Pal...\n\n                          AMES\n            He's dead.\n                    (PAUSE)\n            He's dead.\n                    (PAUSE)\n            The Fella Killed Old Shoe.\n                    (PAUSE)\n\n                          MOSS\n            And what is bigger than a triumphal Homecoming...?\n\nINT HANGAR, ANDREWS AIRFORCE BASE, DAY.\n\nA VAST HANGAR, A SINGLE JET TRANSPORT.\n\nANGLE\nBREAN AND MOSS, DISHEVELLED, UNSHAVEN, LOOKING ON.\n\nANGLE, THEIR POV\nTHE RAMP, AT THE BACK OF THE PLANE, A FLAG DRAPED CASKET APPEARS AND CRAWLS\nDOWN THE RAMP.\nSIX MILITARY PEOPLE IN FATIGUES ADVANCE TO THE CASKET.\n\nANGLE\nBREAN AND MOSS, THEY SWIVEL THEIR HEADS, AND WE SEE, BEYOND THE DOORS OF THE\nHANGAR, A VAST CROWD, FLASHBULBS BEGIN POPPING.\n\nANGLE ON MOSS, AS HE GLANCES AROUND, AND THEN AT AN AIDE, AS IF TO SAY,\nWELL...\n\nTHE AIDE LOOKS AROUND, AND THEN, WITH RELIEF, AT THE CROWD, AS A SMALL DOG\nBREAKS AWAY, AND RUNS TOWARD THE CASKET.\n\nSEVERAL PHOTOGRAPHERS BREAK THROUGH THE CORDON, AND BEGIN SNAPPING PHOTOS OF\nTHE SMALL DOG, AS IT SITS, ITS HEAD COCKED, NEAR THE CASKET.\n\nBREAN AND MOSS WALK AWAY, CAMERA FOLLOWS THEM TOWARD A SMALL READYROOM OFF THE\nHANGAR.\n\nINT, THE READYROOM.  BREAN AND MOSS SINK DOWN INTO AN OLD RATTY LEATHER COUCH,\nBREAN GETS UP, WALKS TO THE TABLE, ON WHICH IS A PACK OF CIGARETTES.  HE TAKES\nONE, LIGHTS IT, PASSES ONE TO BREAN WHO LIGHTS IT.  WALKS TO A MR. COFFEE\nMACHINE.\n\n                          BREAN\n            ...coffee...?\n\n                          MOSS\n            Yes, please.\n\nBEYOND THE COFFEE MACHINE WE SEE AMES, AND THE HISPANIC MAN WHO DROVE THE\nHARVESTER, STILL WEARING A STRAW COWBOY HAT, ET CETERA, THEY BOTH STAND, AS A\nMAN IN HIS SIXTIES ENTERS, AND BEGINS EXTRACTING A BLACK ROBE FROM HIS\nBRIEFCASE, HE PUTS ON THE ROBE.\n\nBREAN SIGHS.  NODS, AND WALKS HACK TO THE TABLE, WBERE MOSS IS SLUMPED.\n\nBREAN SNAPS ON A SMALL TELEVISION, ON THE COUNTER, AND WE SEE, IN ITS SCREEN,\nTHE PALLBEARERS PROCEEDING TO A MILITARY TRUCK, AND THE SMALL DOG FOLLOWING,\nWE SEE A PORTRAIT OF THE DOG, AS IT COCKS ITS HEAD, WE CUT TO A SHOT OF THE\nPRESIDENT, IN THE HANGAR, DABBING AT HIS EYES WITH A HANDKERCHIEF.\n\n                          MOSS\n                    (WATCHING THE SCREEN)\n            Good.  Good.  Good.  Looking Good, bring-it-all-back-\n            home.  Lassie Barks Twice n'it's time to take out the\n            garbage.\n\n                          BREAN\n            Hell of a show.  Hell of a job, Stan.\n\n                          MOSS\n                    (KNOCKS ON WOOD)\n            ...one more day.\n\n                          BREAN\n            Naw, naw, we own the airways...\n                    (HE FLIPS THE CHANNEL)\n\nWE SEE A COUPLE OF MEDIA NERDS, BEING INTERVIEWED AROUND A CONFERENCE TABLE.\n\n                          MODERATOR\n            ...thrust of the Albanian Episode, to put him over the\n            top...\n\n                          FIRST MEDIA GUY\n            Yes, you could say that, Joyce, but it wouldn't be\n            true.\n\n                          JOYCE\n            What would be true, then.\n\n                          SECOND MEDIA GUY\n            Well, you  said it yourself, earlier, and if I may\n            rephrase, that the success of the President, in the\n            Polls...\n\n                          JOYCE\n            ...as of today, 89% favorable.\n\n                          SECOND MEDIA GUY\n            Eighty-nine percent favorable, is based not on\n            events...\n         \n                          BREAN\n            ...events.\n\n                          SECOND MEDIA GUY\n            Which, of course, we cannoy control....\n\n                          FIRST MEDIA GUY\n            ...no...\n\n                          SECOND MEDIA GUY\n            But on the spin given to those events.\n\n                          FIRST MEDIA GUY\n            ...yes.\n\n                          SECOND MEDIA GUY\n            On the meaning found in those events, and given to the\n            public...\n\n                          JOYCE\n            ...by you?\n\n                          SECOND MEDIA GUY\n            By the  media, by, yes, by, in this case, our\n            organization.\n\n                          JOYCE\n            Well, there's a lot to be said for that.  And I'm\n            going to show a clip.\n                    (TO THE AUDIENCE)\n            You've seen it before, you've seen it many times...\n                    (ALL SMILE)\n            But I'm going to ask you to look at it once more.  With\n            the election one day off, and the President's standing\n            in the polls...\n\n                          FIRST MEDIA GUY\n            ...89 percent\n\n                          JOYCE\n            ...a record, a record high for sitting president, I'd\n            like you to watch the campaign that put him there when\n            we come back.\n\nTHE SCREEN CHANGES TO A COMMERCIAL.\n\n                          MOSS\n            You see?  What's the lesson here?  Never give up.\n            Never give up.\n\n                          BREAN\n            No.  You're right.\n\n                          MOSS\n            Show Must Go On.\n\n                          BREAN\n            A proud tradition.\n\n                          MOSS\n            Prouder of this, than anything I ever did in my life.\n            I want to thank you, Ron.\n                    (PAUSE)\n            Want to thank you.\n\nTHE SCREEN COMES BACK TO THE TALKING HEADS.  WKERE WE SEE THE COMMENTATORS\nINTERVIEWING THE SUBJECTS.\n\n                          JOYCE\n            And as we said.  The President, a sure-fire winner, and\n            the campaign, many said, that put him there...\n\nTHE SCREEN CHANGES TO TWO HORSES IN A PADDOCK.  A COUPLE OF JOCKEYS WALK UP TO\nTHEM.\n\n                          JOCKEY ONE\n            Which horse you going to ride tomorrow, Jim?\n\n                          JOCKEY TWO\n            Well, Chuck, my Daddy used to say, and I've lived by\n            it:  never change Horses in...\n\n                          MOSS\n                    (TO HIMSELF)\n            ...oh no...\n\nTHE SCREEN REVERTS TO THE MODERATOR AND THE TWO TYPES.\n\n                          JOYCE\n            And now, we're going to be taking your calls.  The\n            number is...\n\nMOSS RISES.\nMOSS BEGINS PACING AROUND THE READYROOM.\n\n                          BREAN\n            What're you doing?\n\n                          MOSS\n            I'm looking for a phone...\n\n                          BREAN\n            No, I don't think you can do that.\n\n                          MOSS\n            Watch me.\n\n                          BREAN\n            No, I don't think you can do that, Stanley...\n\n                          MOSS\n            Watch me.\n\n                          BREAN\n            Stanley.  Stanley... you knew the... Stanley.\n                    (HE RESTRAINS HIM)\n            You knew the deal when you signed on.\n\n                          MOSS\n            Deal's changed.\n\n                          BREAN\n            No, the deal isn't changed.  The Deal isn't changed.\n            You can't ... what is it?  Money?  Money?  You want\n            Money?\n\n                          MOSS\n            Money?  You think I did this for money...?  I did this\n            for Credit.  Credit, paalll...\n\n                          BREAN\n            But you always knew you couldn't take the credit....\n\n                          MOSS\n            That's one thing, but I'm not gonna let two dickheads\n            from Filmschool take it... are you Nuts?  Are you Nuts?\n\nHE TRIES TO GET OUT OF THE READYROOM.  BREAN RESTRAINS HIM.\n\nANGLE\nTIGHT ON THE TWO.\n\n                          BREAN\n            Stanley, no fooling... no fooling... you're playing\n            with your life here...\n\n                          MOSS\n            Fuck my life... Fuck my life.... Z WANT THE CREDIT...\n            The Credit.  Do you know what the New York Times said\n            about my last picture?  They pissed on me.  They pissed\n            on me.  Do you know what that picture Grossed?  And now\n            some limp-dick film school pansy...\n\n                          JOYCE\n                    (ON TV)\n            That number to call....\n\nMOSS TAKES OUT A PAD AND PENCIL, AND BEGINS TO WRITE IT DOWN.\n\n                          BREAN\n            Stanley, you can't do this....\n\nAMES CALLS FROM THE FAR ROOM.\n\n                          AMES\n            Could we have you in here, please...7\n\nBREAN, DISTRACTED FOR A MOMENT, LETS MOSS GO, MOSS PULLS AWAY, AND RUNS OUT OF\nTHE ROOM.\n\nANGLE\nON BREAN, AS HE PROCEEDS TO THE BACK ROOM, WHERE WE SEE AMES, STANDING WITH\nTHE MAN, WHO NOW HAS ON HIS BLACK ROBE, AND HOLDS A BIBLE OUT TO THE HISPANIC\nFELLOW IN THE STRAW COWBOY HAT.\n\n                          AMES\n                    (SOTTO, TO BREAN)\n            ...we need a witness.\n\n                          MAN IN THE BLACK ROBE\n                    (TO THE HISPANIC HARVESTER DRIVER)\n            Do you swear to Uphold the duties and responsibilities\n            of a citizen of the United States?  To defend her, (ET\n            CETERA)\n\nANGLE\nON THIS ROOM, WITH THE HUGE HANGAR, AND THE CASKET IN THE FAR ROOM.\nANGLE, ON BREAN AS HE SHAKES HIS HEAD SADLY.\n\nDISSOLVE\n\nEXT PENNSYLVANIA AVENUE.  NOVEMBER DAY.\n\nVAST CROWDS, LINING THE STREET.  THE SOUND OF SLOW FIFE AND DRUMS.\n\nANGLE\nON VARIOUS SPECTATORS, WEEPING, MANY OF THEM WITH OLD SHOES HUNG AROUND THEIR\nNECKS.  303 SWEATSHIRTS.  ET CETERA...  THE SPECTATORS CRANE THEIR NECKS.\n\nANGLE, THEIR P0V.\nA CAISSON, A RIDERLESS HORSE, COMING DOWN THE STREET.\nPAN ONTO A NEWSCASTER.\n\n                          NEWSCASTER\n            ...coming, yes, yes, I can just...yes, the caisson,\n            bearing his remains, the Riderless Horse, led by three\n            members of his unit, 303, identified by their\n            distinctive Caps...\n\nANGLE, ON THE 303 TROOPERS, TWO MEN AND A WOMAN IN BERETS WHICH ARE HALF\nBLACK, HALF LEOPARD SKIN.\n\nINT SHOESTORE, H.Q.\n\nTHE TELEVISION, SHOWING THE SAME SCENE.  PAN ONTO AIDE, SWEEPING UP.\n\n                          TV VOICE OVER\n                    (WE HEAR A SERIES OF GUNSHOTS)\n            ...and that's the, yes, you hear it, a salute, in Code,\n            5pelling out, \"Courage, Mom\" ...and there, yes, there\n            is the Staff Car, bearing the Pres...\n\nINT MOSS'S KITCHEN, BEVERLY HILLS, DAY\n\nA SMALL COUNTERTOP TELEVISION.  A HISPANIC MAID WATCHING THE TV.\n\n                          ANNOUNCER\n                    (ON TV)\n            ...sident Elect -- the President-Elect of the United\n            States...\n\nSHE PICKS UP A TRAY OF CRUDITES, AND PROCEEDS, CAMERA FOLLOWS HER INTO THE\nLIVING ROOM, GIVING ONTO THE POOL, WHERE WE SEE A FLOCK OF MOURNERS, THE MEN\nIN YALMULKAS.\n\nANGLE EXT, MOSS'S HOUSE.\nA LINE OF LIMOS, ONE OF THE CHAUFFEURS LISTENING TO THE RADIO.\n\n                          RADIO\n                    (VO)\n            ...the end of the incredible saga of One Man, his\n            country, and a War He did Not Wish, but unto which\n            he...\n\nA LIMO ARRIVES, BEARING BREAN, WHO IS GIVEN A YALMUKA, AS HE ENTERS MOSS'S\nHOUSE.\n\nINT. H.Q. SHOESTORE, DAY.\n\nTHE AIDE HAS JUST FINISHED CLEANING UP.  THE SCENE ON THE TV IS ARLINGTON\nNATIONAL CEMETERY.  THE PALLBEARERS, MILITARY MEN AND WOMEN, ARE DOING A SLOW\nMARCH TO THE TUNE OF \"GOOD OLD SHOE.\"  THERE IS A SHOT OF THE PRESIDENT, AS AN\nAIDE APPROACHES HIM, AND HANDS HIM A BOX, WHICH HE OPENS, WE SEE AS THE CAMERA\nRACKS FOCUS TO IT, THAT IT IS THE CONGRESSIONAL MEDAL OF HONOR.  THE PRESIDENT\nPROCEEDS TOWARD THE CASKET, BEARING THE BOX.\n\nTHE TV GOES BLANK, AS THE AIDE FLIPS IT OFF.  HE TAKES THE LAST REMAINING\nTRASHBIN, AND STARTS TO PULL IT OUTSIDE.\n\nWE SEE TWO MOVING MEN, TAKING DOWN THE TELEVISION, AND PUTTING IT ON A DOLLY.\n\nANGLE, INT, THE MALL\n\nTHE BOARDED UP STOREFRONT.  THE OLD \"SHOE WORLD\" SIGN, THE AIDE PUTTING OUT\nTHE LAST TRASHBIN.  HE IS OVERTAKEN BY, AND CAMERA DOLLIES WITH, THE TWO MEN\nMOVING OUT THE TELEVISICN.  THEY PASS A NEW SIGN, WHICH HAS BEEN APPLIED OVER\nTHE PLYWOOD, READS:  \"COMING SOON, GOOD OLD SHOE,\" FOLLOWED BY A STYLIZED\nRENDITION OF A PAIR OF OLD BASKETBALL SHOES, THE TRADEMARK REGISTRATION SIGN,\nAND THE NIKE SWOOSH, CAMERA CONTINUES TO DOLLY, PAST GRAFFITI, READING,\nCOURAGE, MOM.\n\n           -----------------\n\n\nEND\n\nWAG THE DOG\n\nA SCREENPLAY BY\n\nDAVID  MAMET\n\n\n                                               SECOND DRAFT.  OCTOBER, 1996\n   \n\n\n\n\n\n\nWag the Dog\nWriters :   David Mamet\nGenres :   Comedy\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:03.148167"}