{"title": "Warm Springs", "film_link": "/Movie Scripts/Warm Springs Script.html", "script_link": "/scripts/Warm-Springs.html", "info_raw": "\n\nWarm Springs Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating  None available\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Margaret Nagle\nGenres  Biography  Drama\nScript Date : September 2004\nMovie Release Date : April 2005\n\nRead \"Warm Springs\" Script\n\n\n", "script": "\n\n\n                    WARM SPRINGS\n\n                     Written by\n\n                   Margaret Nagle\n\n\n\n\n                                          Shooting Draft: 9.14.2004\n\n    FADE IN:\n\n    EXT. A BODY OF WATER - LATE AFTERNOON\n1                                                                 1\n    A glimpse of sunlight desperately tries to force its way\n    through a gray sky before being obliterated.\n4\n    A MAN, sunburned and bearded, lets himself fall from the edge\n    of a boat and into the ocean.\n                                                  D\n    UNDERWATER, through shafts of light, white limbs are\n    FLAILING. The MAN struggles, alone. Bubbles stream upward.\n\n    He breaks the surface and gasps for air.\n\n    He begins to swim. His massive arms and shoulders grab at the\n    tide in large, hard strokes. His legs and feet are buried\n    beneath the dark ocean water.\n\n    EXT. HOUSEBOAT - CONTINUOUS\n2                                                                 2\n\n    A floating tenement.\n    A crane LOWERS a fishing net into the water. The MAN swims\n    into it. The net is RAISED as he lays, motionless, within its\n    grip.\n\n    EXT. BOAT DECK - CONTINUOUS                                   3\n3\n    The crane swings around with the MAN in the net.\n\n    He is EMPTIED out onto the deck like a fish.\n\n    AHIVERING on the rotting wooden planks he FLIPS himself over\n    on his stomach. Slowly, using the palms of his hands, he\n    DRAGS his trunk and withered limbs across the deck in a\n    labored lobster-walk.\n\n    He uses his chest muscles to swing his legs around the edge\n    of the boat. They dangle like pieces of rope, his feet white\n    and flaccid.\n\n    A towel, a bottle and a glass are wordlessly placed next to\n    him by a CREW PERSON. He pours himself a generous amount of\n    scotch and begins drinking.\n\n                                                   ISSOLVE TO:\n\n    INT. HOTEL SUITE - NIGHT                                      4\n\n    The same MAN is illuminated by the light of a single candle.\n\n    He is dancing, holding on tightly to a WOMAN.\n\n                                                                2.\n\n    Though the light is dim it is clear that he is clean shaven,\n    with his hair neatly trimmed.\n\n    Their connection is powerful and alive. They stop dancing,\n    overwhelmed with mutual desire.\n\n    He holds the WOMAN's face in his hands and KISSES it all\n    over, moving into a realm of feeling that is foreign to him.\n\n    He kisses her passionately on the mouth.\n\n                        MAN\n              Oh, my dear...\n\n    His fingers run softly over the outside of her breasts. She\n    begins to undo the back of her dress and slips it down around\n    her ankles. Wearing only her tight corset she brings his\n    hands to the laces and together they undo it.\n\n                        WOMAN\n                  (whispering softly)\n              It's all right, darling. It's all\n              right.\n\n    INT. HALLWAY - MORNING\n5                                                                    5\n    OSCAR, a manservant, is carrying both a silver tray and a\n    pair of pants over his extended arm.\n\n                        A VOICE (O.S.)\n              Oscar! Where the devil are you?\n\n    Deftly, Oscar opens the door to a spacious bedroom.\n\n                        OSCAR\n              My apologies, Mr. Roosevelt.\n\n    INT. BEDROOM - CONTINUOUS\n6                                                                    6\n    There with his bare legs, muscular and lean, sporting black\n    socks held up with garters is FRANKLIN DELANO ROOSEVELT, 39.\n\n    He projects a natural elegance and the confidence of a man\n    who can have anything he wants.\n\n    Right now... he wants his pants.\n\n                        FRANKLIN\n              I've been standing here for five minutes.\n\n    Oscar offers the tray to Franklin which bear cuff links and a\n    Tiffany watch which Franklin grabs.\n\n                                                               3.\n\n                        OSCAR\n              Did you sleep well, sir?\n\n                        FRANKLIN\n              Don't remember. That's good, isn't it?\n\n                          OSCAR\n              Yes, sir.\n\n    Franklin takes his pants from Oscar and steps into them,\n    pulling the suspenders up and over his shoulders.\n\n7                                                                   7\n    INT. DINING ROOM - MORNING\n\n    Striding into the dining room, Franklin lifts a silver lid\n    off a breakfast plate. He dismisses it and instead pours\n    himself a cup of coffee from a silver pot on the sideboard.\n\n    He overhears a voice from the nearby sitting room.\n\n                        WOMAN (O.S.)\n              I could not be more delighted to have\n              received your most charming letter.\n              It has been far too long since we last\n              corresponded. However, it is with\n              great reluctance I must decline your\n              kind speaking invitation...\n8\n\n                                                                    8\n    INT. SITTING ROOM - CONTINUOUS\n\n    ELEANOR ROOSEVELT, 34, is dictating a letter. Her enormous\n    eyes, liquid and blue, reveal a woman of extraordinary\n    intelligence and depth.\n\n                        ELEANOR\n              Unfortunately, I would be of little\n              assistance to the Junior Assistance\n              League. Particularly if my purpose\n              were to appear as an alumna who is\n              gifted at public speaking.\n\n    She is dictating to LUCY MERCER, 27, deeply feminine with a\n    head of soft dark hair and an accommodating nature. She is\n    Eleanor's social secretary and closest friend.\n\n    She is also the WOMAN dancing with Franklin the night before.\n\n                        LUCY\n              And what do you really want me to say?\n\n                        ELEANOR\n              Thank you and if you ask again I\n              shall scream?\n\n                                                          4.\n\nThey share a laugh -- which is not shared by the homely\nrumpled mess of a man draped over a sofa in the corner.\n\n                    LOUIS\n          Why don't you ask your husband for\n          some pointers? He's a pretty gifted\n          public speaker, don't you think?\n\nLOUIS HOWE, 48, is a wizened man of limited stature and\nunlimited soul. Franklin's political advisor extraordinaire --\npart consiglieri and part priest. He is the mastermind behind\nwhat he believes will be the greatest political career of the\ntwentieth century.\n\nHe gets up and leans in closely to Eleanor. A cigarette dangles\noff his lip and the smoke rises up and curls in her face.\n\n                    LOUIS\n          You should get out once in a while.\n          Accepting that invitation would be\n          good for Franklin's career.\n\n                    ELEANOR\n          Mr. Howe, wouldn't you be more\n          comfortable waiting for my husband\n          outside?\n\n                    LOUIS\n          In the street, Mrs. Roosevelt?\n\n                    ELEANOR\n          If you like.\n\nEleanor smiles oh-so politely at Louis, as Franklin enters\nfrom the dining room.\n\n                    FRANKLIN\n          I see it's not even eight a.m.\n          and already the gloves are off.\n              (kissing Eleanor on the\n               cheek)\n          Good morning, Babs. Hello, Miss\n          Mercer.   L\n                     UCY\n          Good morning, sir.\n\nQuickly, she lowers her eyes to her work.\n\n                    LOUIS\n              (annoyed)\n          You're late. Honestly, why do you\n          enjoy keeping people waiting?\n\n                                                                5.\n\n                        FRANKLIN\n              Because they always seem more\n              grateful to see me when I arrive.\n\n    He leans in and kisses Eleanor on the cheek.\n\n                        FRANKLIN\n              Have a lovely day, Babs.\n\n                        ELEANOR\n              Should I expect you for dinner?\n\n                        FRANKLIN\n              I have the Navy reception this\n              evening. I'll be home quite late.\n              Unless you've changed your mind\n              about coming?\n\n    Louis looks up from his paper at Lucy who is writing\n    furiously.\n\n                        ELEANOR\n              Do you wish me to come?\n\n                        FRANKLIN\n              Well... whatever you'd like.\n\n                        ELEANOR\n                  (a beat)\n              Thank you, no.\n\n                        FRANKLIN\n              Very well then.\n                  (tipping his hat)\n              Good day, Miss Mercer.\n\n    Lucy nods and Franklin exits. Then Louis tips his hat to the\n    ladies and follows him out.\n\n    EXT. WASHINGTON, D.C. SIDEWALK - DAY\n9                                                                    9\n    A car pulls over and Franklin is first out, followed by\n    Louis, walking at a brisk pace as they cross the opposite\n    side of the street. Louis struggles to keep up while\n    consulting a small appointment book.\n\n                        LOUIS\n              At ten you've got a meeting with\n              representatives from Pittsburgh\n              Steel. Their bid on the ship\n              building contract has already been\n              turned in and is on your desk for\n              approval.\n\n                                                         6.\n\n                    FRANKLIN\n          What did I think of it?\n\nAn AFRICAN-AMERICAN man steps off the curb, letting Franklin\nand Louis pass.\n\n                    LOUIS\n          You had some problems with it.\n\n                    FRANKLIN\n          I better read it. Steel workers\n          tend to vote democratic. Next.\n\n                    LOUIS\n          Lunch with Secretary Daniels.\n\n                    FRANKLIN\n          Must I?\n\n                    LOUIS\n          He's your boss.\n\n                    FRANKLIN\n          Anything else?\n\n                    LOUIS\n              (a beat)\n          What if she'd said yes?\n\n                    FRANKLIN\n          Who?\n\nLouis shoots him a look that says \"you know who.\"\n\n                    LOUIS\n          People know. It's time to stop.\n\n                    FRANKLIN\n          I can handle my own affairs, Louis.\n\n                    LOUIS\n          Not this one. This is Washington,\n          D.C., not the Harvard Club.\n              (off-put by Franklin's\n               arrogance)\n          How can you be so cavalier?\n\n                    FRANKLIN\n          You say that like it's a bad thing.\n\nLouis takes a quick last drag on his cigarette and follows\nhim inside a building.\n\n                                                                 7.\n\n     INT. FRONT HALL - NIGHT\n10                                                                10\n     A large grandfather clock reads 3:00.\n\n     The sound of a key in the front door turns and Franklin\n     quietly enters. His hair is a mess and his clothing is\n     slightly askew.\n\n     As he comes through the hall two eyes shine in the darkness.\n     They belong to Eleanor sitting rigidly on a settee, listening\n     to the sound of Franklin's footsteps going up the stairs.\n\n11                                                                11\n     INT. UPPER LANDING - CONTINUING\n\n     Franklin goes into his bedroom. Eleanor quietly comes up the\n     stairs and stops for a brief moment by Franklin's door, then\n     goes off to her bedroom closing the door behind her.\n\n     INT. FRANKLIN'S BEDROOM - EARLY MORNING\n12                                                                12\n     Franklin lays sleeping in his bed as Eleanor enters quietly\n     so as not to wake him.\n\n     Carefully she picks up a set of keys on the dresser then\n     turns and notices a packet of letters sitting on top of an\n     open duffle bag.\n\n     Tentatively she reaches for them. She brings the packet, tied\n     with a piece of ribbon, up to her nose. She is shocked by\n     their familiar scent.\n\n     With trembling hands she unties the ribbon. Tears flood down\n     her cheeks as she reads.\n\n     Franklin opens his eyes.\n\n                                                       CUT TO:\n\n     EXT. HYDE PARK - DAY\n13                                                                13\n     Springwood is the three-story Roosevelt mansion. It is\n     surrounded by a thousand acres of forests, fields, bridal\n     paths and a glorious view of the Hudson River.\n\n     THE FIVE ROOSEVELT CHILDREN are screaming on the front lawn\n     playing a boisterous game of croquet.\n\n     INT. SPRINGWOOD - DINING ROOM - DAY\n14                                                                14\n     SARA ROOSEVELT, 65, sits at the head of the table. She is one\n     for whom the expression \"Grande Dame\" was coined.\n\n                                                                 8.\n\n     Franklin is at the opposite end of the table, looking pale.\n     Louis, as always, is by his side.\n\n     Eleanor, like a prisoner who has accepted her fate, sits\n     across from them, calm and composed.\n\n                         ELEANOR\n               I have offered Franklin his freedom.\n\n                         FRANKLIN\n               And I have accepted.\n\n                         SARA\n                   (to Eleanor)\n               His freedom is not yours to offer!\n\n                         FRANKLIN\n               I am in love with Miss Mercer, Mama.\n\n                         LOUIS\n               Lord save us from fools in love.\n\n                         SARA\n               Falling in love is out of the\n               question. Why do you think men have\n               mistresses? Duty. Duty to their\n               families and their careers.\n\n     Eleanor rises from the table.\n\n                         SARA\n               Where do you think you're going?\n\n                         ELEANOR\n               It's obvious that my input in this\n               matter is of little importance.\n\n     She begins to exit the room, but Franklin is up like a shot.\n\n                         FRANKLIN\n               Babs!\n\n                         SARA\n               Come back here! Both of you!\n\n     INT. ENTRY HALL - CONTINUOUS\n15                                                                15\n     Franklin chases Eleanor. Midway up the stairs, she turns.\n                          E\n                          LEANOR\n               I don't know whether to hate you\n               or thank you.\n\n                                                              9.\n\n                           FRANKLIN\n               For what?\n\n                         ELEANOR\n               For forcing me to face my life\n               honestly for the first time.\n\n                         FRANKLIN\n               I didn't mean to hurt you, Babs.\n\n                         ELEANOR\n               You never do. You live your life\n               skimming the surface... never aware\n               of the attachments beneath.\n                   (finding her anger)\n               It must be a luxury.\n\n     She goes up the stairs without looking back.\n\n16                                                                16\n     INT. DINING ROOM - CONTINUOUS\n\n     Franklin slowly walks back into the room.\n\n                         SARA\n               Divorce will finish your career in\n               politics. How do you intend to\n               support yourself?\n\n                         FRANKLIN\n               My trust fund.\n\n                         SARA\n               Divorce Eleanor and there is no\n               trust fund.\n\n     Franklin turns away. He looks out the large picture window\n     and attempts to light a cigarette, but his hands shake.\n\n                         LOUIS\n               We've come so far, boss. State\n               Assembly, Assistant Secretary of\n               the Navy -- all pages right out of\n               Cousin Teddy's play book. We're on\n               the road to the White House. Don't\n               do this.\n\n     Franklin sees his son, ELLIOT, 10, playing separately from\n     the rest of his siblings. Elliot looks up at his father as\n     Franklin bares his best politician's smile at him.\n\n     A ROAR begins to fill his ears. It becomes clearer that it is\n     the sound of a CROWD CHEERING.\n\n                                                                 10.\n\n                         CROWD NOISE (O.S.)\n               Rose-velt! Rose-velt! Rose-velt!\n\n     INT. DEMOCRATIC CONVENTION HALL - SAN FRANCISCO - NIGHT\n17                                                                    17\n     CONVENTIONEERS shout out Franklin's name holding up PLACARDS\n     emblazoned with:\n\n                       \"COX/ROOSEVELT IN '20!\"\n     Franklin BOLTS, running vigorously down the center aisle of\n     the hall lit by the circle of a spotlight. The CROWD goes\n     wild over this unconventional entrance.\n     W\n      hen he reaches the edge of the stage he LEAPS onto it. This\n     final act of daring pushes the crowd into frenzy.\n\n     CLOSE UP - FRANKLIN\n18                                                                    18\n     Smiling for no one. For everyone.\n\n                         FRANKLIN\n                   (breathless)\n               I humbly accept your nomination for\n               Vice-President!\n\n     The CROWD roars back in reaction to his less-than-humble stance.\n\n                          FRANKLIN\n               They say the best way to get   rid of\n               a man is to have him run for   Vice-\n               President.\n                   (he holds for the laugh)\n               You might well have asked my   cousin\n               Teddy if that's how they got   rid\n               of him!\n\n     Franklin stands on the stage, the music rising, the crowd\n     cheering. Slowly, the sound of the convention fades to\n     something far more delicate...\n\n                                                       DISSOLVE TO:\n\n     INT. TEA ROOM - WASHINGTON, D.C. - AFTERNOON\n19                                                                    19\n     A harp playing in an elegant tea room. The hushed tones of\n     polite conversation wafts through the air.\n\n     Franklin sits with his cousin, ALICE ROOSEVELT, 36, daughter\n     of Teddy. Brilliant and acerbic, she would have had a career\n     in politics had she been born a man.\n\n                                                   11.\n\n                    ALICE\n          Of course you lost. A Roosevelt on\n          the democratic ticket? Our ancestors\n          are turning in their graves.\n\n                    FRANKLIN\n          Cousin Alice, if Teddy were alive\n          he'd be a democrat -- and you know it.\n\n                    ALICE\n          Rubbish. But I do know one thing:\n          You're exactly like him. My father\n          was born wanting only one thing: to\n          be President.\n\n                    FRANKLIN\n          And what's wrong with that?\n\nThey both share a laugh.\n\n                     ALICE\n          Do you know what they're saying\n          about you?\n\nFranklin's smile fades.\n\n                    FRANKLIN\n          No, but I'm sure you'll tell me.\n\n                    ALICE\n          They say F.D.R. stands for\n          \"featherduster.\" That you're a\n          lightweight. A dilettante with no\n          substance; no point of view.\n\n                    FRANKLIN\n          Is that what you think?\n\n                    ALICE\n          You lead with your vanity. You\n          talk when you should listen.\n          Unless these are the qualities of\n          a democrat?\n                    F\n                     RANKLIN\n          The democratic party is the party\n          of the people. I am a man of the\n          people.\n\n                    ALICE\n          Darling, you're a Roosevelt. What\n          do you know about people?\n\n                                                             12.\n\n     She leans in conspiratorially.\n\n                         ALICE\n               Of course, I can think of one person\n               you did manage to find the time to\n               invest in. A Miss Mercer, I believe?\n\n                         FRANKLIN\n               Alice, stop.\n\n                         ALICE\n               Don't misunderstand me, Franklin.\n               Being married to Eleanor I think\n               you deserved some fun. But you made\n               the right decision. Especially\n               since Miss Mercer has gone on with\n               her life.\n\n                         FRANKLIN\n               What are you talking about?\n\n                         ALICE\n               Edward Rutherford is a wonderful\n               catch for a girl like her.\n\n                         FRANKLIN\n                   (stunned)\n               She's married?\n\n                         ALICE\n               Last week. A small event, of course.\n\n                         FRANKLIN\n               When I last heard she was governess\n               to his children.\n\n                         ALICE\n                   (with a smile)\n               And then love bloomed. As a \"man of\n               the people,\" I wouldn't be too hard\n               on her, Franklin. We can't all have\n               trust funds you know.\n\n     EXT. STATEN ISLAND BOY SCOUT CAMP - DAY\n20                                                             20\n     Franklin, Louis and a PHOTOGRAPHER disembark from a touring car.\n\n                         LOUIS\n               We're not taking this defeat lying\n               down, boss. We'll run you for\n               Governor --\n\n                                                        13.\n\n                    FRANKLIN\n              (kidding)\n          Really? Of which state?\n\nLouis shoots him a look.\n\n                    LOUIS\n          Very funny. No, this buys you time.\n          It buys you experience.\n\n                    FRANKLIN\n          What about Al Smith?\n\n                    LOUIS\n          He's vulnerable. You're still a\n          fresh face, boss. We'll use that to\n          our advantage.\n\nThey walk down a hill towards some waiting Boy Scouts as the\nPHOTOGRAPHER follows them.\n\n                    FRANKLIN\n          Boy Scouts, Louis? Hardly my\n          political base.\n\n                    LOUIS\n          They've got parents. Besides\n          they're photogenic.\n\nFranklin begins glad-handing the assembled group of mostly\nunderprivileged children.\n\n                    FRANKLIN\n          Franklin Roosevelt, happy to\n          meet you.\n\nFranklin masks his thinly veiled discomfort with an\nartificial good cheer. Meanwhile, Louis, in full political\nmode, makes sure the L\n                     Photographer gets everything.\n\n                        OUIS\n          Over here!\n\nFranklin poses with two Scouts. The picture is taken.\n\n                    SCOUTMASTER\n          Okay, boys, lunch. Line up to wash!\n              (to Franklin)\n          Will you be joining us?\n\n                       FRANKLIN\n          Of course!\n\n                                                                14.\n\n     Franklin steps into a line before a large communal water\n     barrel and glances sideways at GUISEPPE, 9, an immigrant\n     child of the city streets. He wears his uniform proudly and\n     smiles at Franklin.\n\n                         FRANKLIN\n               What's your name, son?\n\n                           GUISEPPE\n               Guiseppe.\n\n     Franklin puts his arm around Guiseppe, forcing the moment\n     between them. He waits patiently as the cameras click away.\n\n                         FRANKLIN\n               Guiseppe! Come sta, ragazzo?\n\n                         GUISEPPE\n                   (puzzled)\n               Okay, I guess.\n\n     The SCOUTS begin washing their hands together in the water\n     barrel and Franklin joins in as Louis looks on admiringly.\n\n     As Guiseppe splashes some of the water on his face, Franklin,\n     not to be outdone, does so as well. It's all for the cameras.\n\n     ESTABLISHING SHOT - CAMPOBELLO ISLAND\n\n     EXT. ROOSEVELT SUMMER HOME - DAY\n21                                                                21\n     A large but unpretentious house with a sweeping lawn that\n     looks out over the icy waters of the Bay of Fundy.\n\n22                                                                22\n     EXT. PORCH - LATE AFTERNOON\n\n     Eleanor sits quietly on the front porch knitting -- in a\n     world of her own.\n\n     A few feet away -- also in a world of his own -- sits Louis,\n     overdressed for summer in a three piece suit. An overflowing\n     ashtray is by his side and piles of newspaper lie at his\n     feet.\n\n     He holds up a paper to Eleanor with the photo of Franklin and\n     the Boy Scouts.\n\n                         LOUIS\n               He's a natural.\n\n     Eleanor gives it a cursory glance then looks out to where\n     Franklin and the children come bounding up the lawn.\n\n                                                         15.\n\nFranklin and Elliot break out from the rest and begin racing\nup the lawn. Franklin, no match for his son's speed, loses.\nHe doubles over, trying to catch his breath.\n\n                    ELLIOT\n          Vae victis! (\"Woe to the\n          conquered!\")\nC\n aught up in his victory, Elliot doesn't see Franklin sneak\nup behind him and tackle him to the ground.\n\n                    FRANKLIN\n          Festina lente! (\"Not so fast!\")\n\nOne by one the other children all pile on top of Franklin and\nElliot.\n\n                    ELEANOR\n          Dinner is in one half-hour! Come in\n          and change, children!\n\n                    FRANKLIN\n          Up! Up, chicks! You heard your\n          mother!\n\nEveryone runs up the porch stairs and into the house except\nFranklin.\n\n                    ELEANOR\n          Go wash up.\n\nUtterly spent, Franklin lays on the grass, not moving.\n\n                    LOUIS\n          Hey, boss! Are you all right?\n\nSlowly, Franklin gets up and walks with great effort up the\nporch stairs.\n\n                    FRANKLIN\n          I'm fine.\n              (re: her knitting)\n          Oh, that's pretty, Babs.\n\nHe puts his hand on Eleanor's shoulder and leans in to buss\nher cheek but Eleanor quickly stands.\n\n                    ELEANOR\n          I must check on dinner.\n\nThere is a cursory formality to her words and little warmth.\n\n                                                              16.\n\n                            FRANKLIN\n               Very well.\n\n     She goes into the house. Louis then hands Franklin letters.\n\n                            LOUIS\n               Tired?\n\n                         FRANKLIN\n               Of you? Never.\n\n     Wearily, he sorts through the envelopes.\n\n                         LOUIS\n               Why don't you nap before dinner?\n\n                            FRANKLIN\n               Yes, dear.\n\n     Franklin heads into the house leaning heavily against the\n     screen door struggling for control.\n\n                                                    DISSOLVE TO:\n\n     INT. SUN ROOM - DAY\n23                                                                 23\n     Franklin lays on a chaise being examined by a DOCTOR, who\n     leans over him holding out his hand.\n\n                         DOCTOR\n               Can you take my hand?\n\n     Franklin tries, but can't. Almost his entire body is\n     paralyzed. He can only breathe and blink.\n\n     The Doctor glances at Eleanor, Louis and Sara indicating they\n     should follow him out.\n\n     EXT. SCREENED PORCH - DAY\n24                                                                 24\n     As the door from the sun room opens onto the porch, Elliot is\n     there waiting. Seeing them coming, he dashes off into the\n     yard so as not to be seen as Eleanor, Louis, Sara and the\n     Doctor enter.\n\n                         DOCTOR\n               He has Infantile Paralysis. Polio.\n\n     Sara sinks into a chair.\n\n                         SARA\n               I knew it. I knew it.\n\n                      D\n\n\n\n\n                (\n\n\n\n\n                      D\n\n\n\n\n                                                         17.\n\n                      ELEANOR\n          I\n              thought it only struck children.\n\n                     OCTOR\n          Not necessarily.\n\n                    LOUIS\n          How did he get it?\n\n                    DOCTOR\n          Some experts believe it is linked\n          to contaminated water. But that\n          theory is speculative at best.\n\n                    LOUIS\n          It was the visit to that god damned\n          Boy Scout Camp!\n\n                    DOCTOR\n          In all honesty you need to be\n          looking forward, not back.\n\n                    ELEANOR\n          What is the prognosis?\n\n                    DR. LOVETT\n          The damage to his leg muscles is\n          extensive. I suspect he will be\n          paralyzed from the waist down.\n\n                     ELEANOR\n          Dear God.\n               beat)\n          And the children?\n\n                    DR. LOVETT\n          If they don't have any symptoms by\n          now then they have been spared.\n\nSara stands -- her bearing once again erect and proud.\n\n                    SARA\n          Then we must count our blessings.\n\n                     R. LOVETT\n          You will need to prepare yourselves.\n          There is a deep depression that\n          follows an illness of this magnitude.\n          I'm afraid life as he knew it is over.\n\nTheir discussion is suddenly interrupted by the sound of a\nchild crying. Eleanor rushes off the porch to the bushes.\n\n                            L\n\n\n\n\n                                                               18.\n\n     EXT. BUSHES - CONTINUING\n25                                                                25\n     Eleanor finds Elliot, having heard everything, curled up in a\n     ball, weeping. She leans down and wraps her arms around him.\n\n     INT. BEDROOM - WEEKS LATER\n26                                                                26\n     CLOSE-UP - WALLPAPER\n\n     A pink background covered in small white flowers with red\n     centers and green leaves. There is a seam in the paper. A\n     tiny white spot where glue has soaked through.\n\n     PULL BACK TO REVEAL - Franklin in bed.\n\n     This is all he stares at -- hour after hour after hour.\n\n     His lips are dry.\n\n     A glass of water sits tantalizingly on the night stand. He\n     reaches for it but it's a few inches out of his reach.\n\n     Slowly, he begins to rock his torso back and forth.\n\n     INT. HYDE PARK - PARLOR - CONTINUOUS\n27                                                                27\n     Sara, Eleanor and Louis are in heated conversation.\n\n                         SARA\n               Now that politics are out of the\n               question he can stay here at home\n               with me.\n\n                         ELEANOR\n               But what kind of life is that?\n\n                           OUIS\n               I've rented him an office downtown.\n               He can still practice law.\n                         S\n                          ARA\n               Why would you want to do that?\n\n                         LOUIS\n               Because he needs it.\n\n                         ELEANOR\n               He can pursue a career, Mama.\n\n                         SARA\n               A man as proud and vital as\n               Franklin... you're inviting him to\n               be hurt.\n                         (MORE)\n\n                                                              19.\n               And you, Mr. RA(cont'd)\n                         SA Howe, engaged in the\n               fantasy of a political future for\n               my son... is there nothing you\n               won't do to keep your job?\n\n     Sara leaves as Eleanor goes after her.\n\n                         ELEANOR\n               Mama! That's not fair!\n\n     INT. BEDROOM - CONTINUOUS\n28                                                               28\n     Franklin, still rocking his torso, has now gained some\n     momentum, managing to have moved just a few inches.\n\n     INT. SUN ROOM - CONTINUOUS\n29                                                               29\n     Sara busies herself arranging flowers.\n\n                         SARA\n               What kind of life is it to be\n               pitied and stared at?\n\n                         ELEANOR\n               What kind of life is it to be\n               hidden away? I know you believe\n               that what you are suggesting for\n               Franklin is best. But I think you\n               are making it harder for him.\n\n                         SARA\n               I think I know what's best for\n               Franklin. I am his mother!\n\n                         ELEANOR\n               And I am his wife.\n\n     Sara stares at Eleanor in disbelief. Eleanor stares back --\n     unflinching.\n\n     INT. BEDROOM - CONTINUOUS\n30                                                               30\n     Franklin reaches his arm towards the glass only to fall from\n     the bed to the floor with a thud. Frustrated beyond words,\n     Franklin lunges at his wheelchair and shoves it across the\n     floor letting out an anguished cry.\n\n     In agony, from both the pain and the humiliation, he stares\n     up and fixes his gaze on the ornate ceiling overhead.\n\n     Then, closing his eyes, a POUNDING in his head starts to get\n     louder and louder --\n\n                                                       CUT TO:\n\n                                                               20.\n\n     INT. BOAT - DAY - BACK TO PRESENT\n31                                                                31\n     Franklin, on his back, his face and body drenched with sweat,\n     is asleep in his bunk in the boat. He awakens to the sound of\n     the POUNDING. Voices are calling him accompanied by FISTS\n     smashing at the door. He opens his eyes and is disoriented.\n     He tries to sit up -- momentarily forgetting that he can't.\n     H\n      e lifts the sheet and visibly WINCES in disgust at the sight\n     of his crippled legs. BONES covered by FLESH with barely an\n     ounce of muscle.\n\n     Finally the door BURSTS open.   Two young crewman, EUGENE and\n     STANLEY enter.\n\n                         EUGENE\n               Mr. Roosevelt, we got a storm\n               comin'!\n\n     He lifts Franklin over his shoulder. Stanley grabs clothes and\n     pulls a set of long iron leg braces from a hook off the wall.\n\n     Eugene grabs a bucket and holds Franklin up to urinate.\n\n                         FRANKLIN\n                   (while peeing)\n               Leave me here. Let the ocean\n               swallow me up. Burial at sea.\n               Perfect for a navy man.\n\n     Stripped to his underwear Franklin is laid across the bunk.\n     Eugene kneels and puts on Franklin's socks and shoes. Then he\n     and Stanley slide on his braces and pants.\n\n     Their hands zipper, clasp, buckle and tie. Each hand works in\n     synchronicity with the other.\n\n     Clumsily they lift Franklin up, struggling under his weight.\n\n     EXT. BOAT - DAY\n32                                                                32\n     Eugene and Stanley carry Franklin off in the driving rain.\n\n     INT. DINER OFF THE FLORIDA COAST - DAY\n33                                                                33\n     Kerosene lamps light the diner which is filled with people,\n     mostly fishermen, seeking refuge from the coming storm.\n     Franklin, soaked-to-the-skin and wrapped in a blanket, is\n     being pushed through the door by Eugene in a wheelchair.\n\n     The restaurant collectively pauses to take them.\n\n                                                        21.\n\nFranklin is slowly wheeled across the restaurant. He shrinks\nfrom the stares of the patrons.\n\nA LITTLE GIRL eating with her parents gets excited when she\nsees Franklin's braces and points. Franklin gives her a hard\nlook and she is hurt.\n\nWhat he can't see is that under the table she wears a set of\nbraces like his.\n\nFranklin is wheeled up to his table and EUGENE and STANLEY sit\ndown with him.\n\nLouis enters resembling a drowned rat. He rips off his hat\nand raincoat and puts down his suitcase.\n\n                    FRANKLIN\n              (genuinely surprised)\n          Louis?\n\n                    LOUIS\n          I never miss Florida in the rainy\n          season.\n\n                    FRANKLIN\n          No letter? No wire?\n\n                    LOUIS\n          Why? Would you have answered it?\n\n                    FRANKLIN\n          What the hell are you doing here?\n\n                    LOUIS\n          Good to see you too. Nice whiskers.\n          You look like Chester Arthur.\n\n                     FRANKLIN\n          Stanley, this is Mr. Howe. He gets\n          sea-sick at the mere sight of a\n          boat so he's probably happy that\n          it's being Ldestroyed right now.\n\n                     OUIS\n          Boys, I need to talk to Mr. Roosevelt\n          alone. Find your own breakfast. Here's\n          a five spot. Make it a feast.\n\nThey look at the money and take their leave.\n\n                    FRANKLIN\n          You're always so generous with my\n          money.\n\n                                                          22.\n\n                    LOUIS\n          You mean your mother's, don't you?\n\nThe Waitress puts down two cups of coffee. Franklin pulls out\na flask and pours some into his cup. He then lights a\ncigarette and begins smoking, but doesn't offer one to Louis.\nWithout asking, Louis helps himself.\n\n                     FRANKLIN\n          So Mama financed this fool's\n          errand, has she? Well, it's a waste\n          of a trip.\n\n                    LOUIS\n          It was Eleanor's idea.\n\nFranklin's face is immobile.\n\n                    WAITRESS\n          What can I get you?\n\n                    LOUIS\n          I'd like some ham and eggs, sunny\n          side up, please?\n              (to Franklin)\n          What's your fancy, boss?\n\n                    FRANKLIN\n          Nothing. I fancy nothing.\n\n                    LOUIS\n          He'll have the same.\n\nThe Waitress grabs their menus and scurries away. Louis opens\nhis briefcase and hands Franklin a stack of mail. Franklin\nglances it, but doesn't open any.\n\n                    LOUIS\n          There are a few from your children.\n\n                    FRANKLIN\n          I can still read.\n\nFranklin flips through the mail and finds a letter that\ninterests him, opening it.\n\n                    LOUIS\n          Your wife wants you to come home.\n              (choosing his words)\n          She's concerned. I'm concerned.\n          This life on a boat... where is it\n          getting you?\n\n              (\n\n\n\n\n                    F\n\n\n\n\n                                                 23.\n\n                    FRANKLIN\n          Getting me? For one thing, no one\n          gets to see me and I don't get to\n          see them.\n\n                    LOUIS\n          Don't say that. Everyone's waiting\n          for you to come home. The kids...\n          they're aching to see you.\n\n                     RANKLIN\n              (reading)\n          Really?\n\nLouis looks sadly at his friend.\n\n                    LOUIS\n          What's that?\n\n                    FRANKLIN\n               skimming the letter)\n          From George Foster Peabody. He owns\n          a resort in rural Georgia for\n          investment purposes. Hot springs or\n          something. He claims that only\n          recently a crippled boy swam in the\n          waters and can walk again.\n\n                    LOUIS\n          Oh, for Chrissake...\n\n                    FRANKLIN\n              (reading)\n          \"\n           The high magnesium content of\n          these natural springs will hold\n          anyone up. Although it is not a\n          resort for infirm types I am\n          extending you my personal\n          invitation to come visit in the off-\n          season.\"\n              (putting the letter aside)\n          I'm only welcome in the \"off-\n          season.\"\n\nEugene and Stanley approach the table.\n\n                    EUGENE\n          Mr. Roosevelt, we got bad news.\n\n                    FRANKLIN\n          What?\n\nF\n\n\n\n\n                     F\n\n\n\n\n                                                24.\n\n                    STANLEY\n          It's the boat... it got banged up\n          real bad tied to the dock.\n\n                      RANKLIN\n          How bad?\n\n                    STANLEY\n          I don't think you can stay there\n          anymore.\n\n ranklin absorbs this.\n\n                    EUGENE\n          Maybe it's a blessing in disguise,\n          Mr. Roosevelt. I don't know about\n          you, but I'm homesick.\n\n                    FRANKLIN\n          And I'm sick of home.\n              (to Louis)\n          Where's the letter from Peabody?\n\n                    LOUIS\n          You can't be serious?\n\nHe hands Franklin the letter who rereads it.\n\n                    FRANKLIN\n          Why not miracle waters? I've drunk\n          the oil of monkey glands, been\n          zapped with electricity and hung\n          upside down in harnesses. After all\n          that, this sounds downright\n          peaceful.\n\n                    LOUIS\n          I can't quite picture you in the\n          back woods of Georgia.\n\n                    FRANKLIN\n          Where do you picture me, Louis?\n\n                    LOUIS\n          1600 Pennsylvania Avenue.\n\n                    FRANKLIN\n          President, Louis? I can't visit the\n          bathroom without a team of\n          associates to help pull my pants\n          down.\n\n                         E\n\n\n\n\n                         F\n\n\n\n\n                                                             25.\n\n                         LOUIS\n               Give it a little time.\n\n                          RANKLIN\n               There's a reason they say a man\n               runs for office.\n                   (a beat)\n               I'm going to Georgia.\n\n                                                       CUT TO:\n\n     INT. A TRAIN CAR - DAY\n34                                                               34\n     Franklin and Eleanor sit next to one another. Franklin is now\n     shaved and cleaned up considerably.\n\n     However, the tension between them is palpable. Eleanor knits\n     furiously while talking. Franklin looks out the window at\n     African-American FIELD HANDS hard at work in the red clay\n     hills of Georgia.\n\n                         ELEANOR\n               James has been doing so much better\n               now that Elliot has joined him at\n               Groton. They've put their\n               differences behind them and have\n               become a real team.\n\n     Franklin observes two YOUNG BOYS, African-American, running\n     alongside the slow-moving train.\n\n                          ELEANOR\n               Two peas in a pod. Last week they\n               were both in the infirmary with the\n     F         same cold.\n\n      ranklin eyes a wagon pulled by a mule. The driver, a FARMER,\n     takes off his hat and wipes his brow in the hot sun.\n\n                          LEANOR\n               Meanwhile, any suggestion I make to\n               Anna for her future -- she\n               dismisses me. I am going to have to\n               enlist your support in this,\n               Franklin. She listens to you.\n\n     She looks over at Franklin and sees that he is staring out the\n     window, deep in thought -- not having heard a word she's said.\n\n                                                              26.\n\n     EXT. BULLOCHVILLE TRAIN STATION - GEORGIA - DAY\n35                                                              35\n     TOM LOYLESS, 39, stands waiting by a car dressed in a white\n     suit. Laconic, with a dry sense of humor, Tom is a man of few\n     words whose poker face hides a true desperation. He holds a\n     telegram from Franklin in his hand.\n\n     As the train pulls in Tom looks for Franklin among the\n     passengers making their exit.\n\n     There are two different exits on the platform clearly marked\n     WHITE and COLORED. Whites exit from the front of the train\n     and Blacks from the rear.\n\n     LIONEL PURDY, tiny, and dressed in a mailman's uniform,\n     approaches Tom. Of indeterminate age and dubious intellect,\n     his mail bag is almost as big as he is.\n\n                         LIONEL\n               Someone important?\n\n                         TOM\n               You might say so, Lionel.\n\n                         LIONEL\n               Who?\n\n                         TOM\n               A Mr. Roosevelt.\n\n                         LIONEL\n               Teddy?\n\n                         TOM\n                   (patiently)\n               No, he's dead.\n\n                         LIONEL\n               Oh.\n\n     The STATIONMASTER approaches.\n\n                         STATIONMASTER\n               Tom, your guest needs some\n               assistance. We're gonna need some\n               able-bodied men to move him.\n\n                         TOM\n                   (to Lionel)\n               Go over to the livery stable...\n\n                         LIONEL\n               ... and get the Collier boys.\n\n                                                               27.\n\n     EXT. A TRAIN CAR - DAY\n36                                                                36\n     Franklin exits the train slung in a fireman's carry over the\n     shoulder of ROY COLLIER, African-American, 29. His brother\n     PETE, 27, is close behind, carrying luggage -- both hover at\n     around 6' 4\".\n\n     Tom approaches. Franklin attempts to hide his embarrassment\n     with good cheer.\n\n                         FRANKLIN\n               Hello! Hello! Mr. Loyless?\n\n                         TOM\n               Tom, Mr. Roosevelt.\n\n                         FRANKLIN\n               Then you'd better call me Franklin.\n\n     Still in the fireman's carry, Franklin extends his hand for\n     Tom to shake.\n\n                           TOM\n               Franklin.\n\n                         FRANKLIN\n               And this is the Misses.\n\n                         ELEANOR\n               Call me Eleanor.\n\n                         TOM\n               Pleased to make your acquaintance.\n\n     Roy then carries him over to Tom's car and gingerly places\n     him inside. Pete follows.\n\n                         ROY\n                   (to Tom)\n               There's a trunk and a chair with\n               the wheels, too.\n\n                         TOM\n               I'll send a wagon right over.\n\n                         PETE\n               We got a wagon, sir.\n\n     EXT. A COUNTRY ROAD - DAY\n37                                                                37\n     Tom drives Franklin in front, Eleanor sits in the back.\n\n                                                             28.\n\n     Pine trees tower over the sides of the dirt road. In\n     occasional clearings, Franklin spies barefoot children\n     playing out in front of broken-down shacks. They stop their\n     play to look at the car.\n\n                         FRANKLIN\n                   (covering his discomfort)\n               Beautiful country.\n\n                         ELEANOR\n               How long have you been manager of\n               the Inn?\n\n                           TOM\n               Not long.\n\n     They BANG over a large pothole. They all fly up and land hard.\n\n                         FRANKLIN\n               Got any paved roads?\n\n                         TOM\n               No we don't.\n\n     EXT. THE MERIWETHER INN - DAY\n38                                                               38\n     Tom's car turns into a driveway. Franklin has a brochure for\n     \"The Meriwether Inn\" opened in his lap. He tries to spy the\n     building through the trees but cannot.\n\n     He looks back at the brochure. The picture is of a lavish\n     Victorian Hotel and the words, \"Our renowned mineral hot\n     springs can cure whatever ails you!\"\n\n     Franklin looks up and sees a three-story hideous green and\n     yellow monstrosity leaning slightly to one side. Paint is\n     peeling everywhere. What once were flower beds are overgrown\n     with weeds.\n\n     The car pulls to a stop.\n\n                         TOM\n               You'll have a great deal of\n               privacy. There are only a few\n               guests right now as it's the off-\n               season... I'm hoping to make some\n               improvements by next Spring --\n\n     Franklin puts out his arm preventing Tom from getting out of\n     the car.\n\n                           F\n\n\n\n\n                                                                29.\n\n                         FRANKLIN\n                   (panicked)\n               I... I can't stay here. This place\n               is a wreck.\n                         E\n                            LEANOR\n               Franklin!\n\n                         TOM\n               Look on the bright side. Most of\n               your time will be spent in the\n               water.\n                   (a beat)\n               It's true, we've fallen on some\n               hard times...\n\n                          RANKLIN\n               Hard times? This is a disaster! It\n               should be condemned!\n\n     Tom's southern manners are being put to the test, but he\n     stays remarkably calm.\n\n                         TOM\n               Yes, we've seen better days.\n                   (a beat)\n               But then I imagine so have you.\n\n     Franklin blinks incomprehensibly at Tom and what he has just\n     said.\n\n                         TOM\n               I'm happy to drive you back to the\n               train station right now, if that's\n               what you want.\n\n     They lock eyes. Franklin wonders if Tom's bluffing, but he\n     can't tell.\n\n                         FRANKLIN\n                   (in a low voice)\n               Fire. I'm frightened of fire. I\n               can't get out if I'm upstairs.\n\n                         TOM\n               We've got options.\n\n     EXT. MERIWETHER INN GROUNDS - DAY\n39                                                                39\n     Tom's car is now parked in front of a group of small\n     cottages. Roy and Pete's horse drawn wagon is behind it.\n\n                                                               30.\n\n     EXT. COTTAGE - DAY\n40                                                               40\n     Tom and Pete open a set of shutters over the windows of a\n     tiny cottage.\n\n     Franklin and Eleanor sit in the car, watching.\n\n     INT. COTTAGE - DAY\n41                                                               41\n     Sheets cover the furniture, cobwebs span the beams and dust\n     particles fill the air.\n\n     As Tom maneuvers the wheelchair through the front door,\n     Franklin notices a broken window.\n\n                         FRANKLIN\n                   (caustic)\n               Well ventilated, at least.\n\n     Roy enters with a suitcase.\n\n                          ROY\n               Where do you want this, Mr.\n               Roosevelt?\n\n                         FRANKLIN\n               The bedroom, Roy, thank you.\n\n     He looks after Roy as he exits.\n\n                         FRANKLIN\n               Tom, this young man appears quite\n               competent. Would you ask him if\n               he'd like to stay on as my valet?\n\n                         TOM\n                   (politely)\n               Why don't you ask him yourself?\n\n     He tips his hat and goes outside.\n\n     EXT. DRIVEWAY - DAY\n42                                                               42\n     Pete, alone, drives the wagon past the Inn and out onto the\n     road.\n\n     INT. COTTAGE - DAY\n43                                                               43\n     Eleanor stands in the middle of the tiny living room stunned\n     by the squalor. She speaks to Franklin who is changing in the\n     other room.\n\n                           T\n\n\n\n\n                                                             31.\n\n                         ELEANOR\n               This is madness.\n\n                           FRANKLIN (O.S.)\n               No doubt.\n\n                         ELEANOR\n               Tell me again, Franklin, why are we\n               here?\n\n     Franklin is wheeled out by Roy, now changed into a bathing\n     suit.\n\n                         FRANKLIN\n               For the waters. Are you coming?\n\n     EXT. A DIRT PATH - DAY\n44                                                                44\n     Roy wheels Franklin while Tom walks in front of them leading\n     the way.\n\n                          OM\n               Mrs. Roosevelt want to swim?\n\n                         FRANKLIN\n               Mrs. Roosevelt doesn't know how.\n\n     Franklin takes in the surroundings. Deserted horse stables in\n     total ruin and tennis courts covered with underbrush mar the\n     landscape.\n\n45                                                                45\n     EXT. POOL - DAY\n\n     An immense, T-shaped pool rimmed in concrete. The bluish\n     water is clear and sparkling and a delicate steam rises out\n     of the warmth.\n     A\n       MOTHER, eyeing Franklin approaching in his wheelchair,\n     comes to the edge of the pool and coaxes her CHILDREN out of\n     the water.\n\n     AUNT SALLY, an ancient, gaunt, African American woman, stands\n     guard by the edge of the water.\n\n                         TOM\n               Mr. Roosevelt, I'd like you to meet\n               Aunt Sally.\n\n                         FRANKLIN\n               Aunt Sally.\n\n                         AUNT SALLY\n               Good day, sir. I have towels for you.\n\n                                                                32.\n\n     Roy wheels Franklin as close to the rim of the pool as\n     possible. Tom lends his assistance and both he and Roy HOIST\n     Franklin out of the chair and place him at the edge, letting\n     his feet dangle in the warm water.\n\n     Twisting on his massive arms, Franklin lowers himself cautiously.\n\n                         TOM\n               Now give it a minute. You'll see\n               that the mineralization makes the\n               water more buoyant. The crippled\n               boy who swam here was actually able\n               to walk in the water.\n\n     Franklin's legs flop as his useless feet touch the shallow\n     bottom. Crushed, all hope drains from his face.\n\n                         FRANKLIN\n               I can't even stand.\n\n                         AUNT SALLY\n               Well, not yet.\n\n     EXT. CABIN - NIGHT\n46                                                                46\n     Roy sleeps on a couch on the front porch. Crickets hum.\n\n     INT. CABIN - CONTINUING\n47                                                                47\n     Eleanor tosses and turns on a roll away bed.\n\n48                                                                48\n     INT. CABIN BEDROOM - CONTINUING\n\n     Franklin lies in bed staring up at the ceiling.\n\n     INT. MERIWETHER INN - DINING ROOM - DAY\n49                                                                49\n     A handful of guests are spread out in a huge dining room.\n     Franklin and Eleanor sit together. He is eating heartily, but\n     Eleanor merely moves her food around.\n\n                         ELEANOR\n               This is simply revolting.\n\n                         FRANKLIN\n               It's not very good, but it is\n               mysterious.\n                   (holding out his plate)\n               What in the world do you think\n               they've poured over this chicken?\n               Or is it possum?\n\n     Eleanor sizes Franklin up. She knows this is a preamble.\n\nH\n\n\n\n\n                                                33.\n\n                    ELEANOR\n          You want to stay.\n\n                       FRANKLIN\n          Yes.\n\n                    ELEANOR\n          New York has the best doctors and\n          hospitals in the country.\n                    F\n                     RANKLIN\n          I need something new.\n\n                    ELEANOR\n          This isn't about getting better is\n          it? You don't want to come home.\n          You don't want to live with us.\n\n                    FRANKLIN\n          I refuse to be a burden to anyone.\n\n                    ELEANOR\n          You're not a burden, you're my\n          husband.\n\n e reaches out and takes her hand in his.\n\n                    FRANKLIN\n          I want to offer you the freedom you\n          once so generously offered me.\n              (she pulls it away)\n          All you've ever known is duty. To\n          me and to a political career that\n          unless I can walk no longer exists.\n          You've been exemplary. Now I'm\n          telling you you're free to go.\n\n                       ELEANOR\n                 (her voice rising)\n          No.\n              (a beat)\n          I don't want freedom. I want a\n          marriage. I want a life with you.\n\nFranklin won't let himself believe it.\n\n                    FRANKLIN\n          I can't imagine what you think that\n          life is going to be.\n\nThis takes the wind out of Eleanor.\n\n                                                             34.\n\n                            ELEANOR\n                  Oh Franklin... it's not up to me to\n                  imagine, it's up to you.\n\n     Eleanor folds her napkin and gets up from the table.\n\n     EXT. COTTAGE DRIVEWAY - DAY\n50                                                               50\n     Pete helps Eleanor into his livery wagon.\n\n     Franklin watches from the porch as Eleanor rides away. Her\n     suitcase slides across the open wagon bed, as the wagon makes\n     the tight turn from the driveway onto the main road.\n\n     ON ELEANOR\n\n     Looking out -- straight ahead.\n\n     ON FRANKLIN\n\n     Alone and scared as he watches the wagon fade from sight.\n\n51                                                               51\n     INT. HYDE PARK - DAY\n\n     Eleanor is pouring tea for Louis, who is seated.\n\n                            ELEANOR\n                  Thank you for stopping by, Mr. Howe.\n\n                            LOUIS\n                  I thought you might want to see a\n                  friendly face.\n                     (off the silence)\n                  So how's our boy doing?\n\n                            ELEANOR\n                  Well, he's enjoying the waters very\n                  much. He...\n                      (suddenly overwhelmed)\n                  I think we've lost him.\n\n     Her pent-up tears burst in a free-flow. Louis leads her to a\n     nearby settee and hands her his handkerchief.\n                          E\n                             LEANOR\n                  Please excuse me, Mr. Howe.\n\n                            LOUIS\n                  Don't you think it's time you\n                  called me Louis?\n\n                            ELEANOR\n                  Louis.\n\n                          E\n\n\n\n\n                                                             35.\n\n                         LOUIS\n               Maybe we've been going about this\n               all wrong. He's down there to be\n               alone so let's give him what he\n               wants. We change our focus.\n\n                           LEANOR\n               To what?\n\n     Louis smiles, knowingly.\n\n                          LOUIS\n               To you.\n\n     EXT. COTTAGES - SUNSET\n52                                                             52\n     The row of abandoned cottages look strangely pretty, aglow in\n     the setting sun.\n\n53                                                             53\n     EXT. COTTAGE - CONTINUOUS\n\n     Franklin is seated on the ramshackle porch in his chair. His\n     cigarette hangs from his lip as he mixes martinis in a glass\n     milk bottle. He pours one for Tom, then himself.\n\n                         FRANKLIN\n               To your mineral pool, or whatever\n               you call it.\n\n                         TOM\n               Warm Springs.\n\n     They clink their glasses. Tom takes a polite sip, then chokes\n     back the bad taste.\n\n                         FRANKLIN\n               Too strong?\n\n                         TOM\n               Haven't been in a drinking mood lately.\n\n                          FRANKLIN\n               I have.\n\n                         TOM\n               Actually, its the most god-awful\n               martini I've ever tasted.\n\n                         FRANKLIN\n               Are you always this direct, Tom?\n\n                                                              36.\n\n                         TOM\n               Well, I never tasted a martini this\n               bad before.\n\n     Franklin takes another sip, checking. It tastes fine to him.\n\n                          FRANKLIN\n                   (hurt)\n               Everyone likes my martinis...\n\n                         TOM\n               So they say.\n\n     INT. COTTAGE - MORNING\n54                                                              54\n     Franklin's bed is already empty.\n\n     EXT. POOL - MORNING\n55                                                              55\n     Aunt Sally is seated, talking with Roy while Franklin lies on\n     his back in the water, swimming. All his movement comes from\n     his shoulders and arms. The morning sun streams down on him.\n\n     Tom sits off to one side reading the newspaper.\n\n                         FRANKLIN\n               Tell me more about what that boy\n               did, Aunt Sally.\n\n                         AUNT SALLY\n               Well, first he'd always swim over\n               to the side of the pool and hold\n               himself there -- make sure he\n               righted himself. Then... before he\n               knew it... he'd be standing.\n\n                         FRANKLIN\n               If it was only that easy.\n\n                         AUNT SALLY\n               Well, you make it hard. Get over to\n               the side of that pool and grab it.\n\n                         FRANKLIN\n                   (\n                    humoring her)\n               Yes, ma'am.\n\n                         AUNT SALLY\n               Now you got to remember how you did\n               it.\n\n     Franklin holds the edge of the pool, closing his eyes.\n\n                         F\n\n\n\n\n                                                             37.\n\n     For a long moment there is silence. Almost without realizing\n     it, Franklin lets go of the edge of the pool.\n\n     When he opens his eyes -- he is standing -- all by himself in\n     the water.\n\n                         FRANKLIN\n                   (a nervous laugh)\n               I'm standing.\n\n     His laughter gets stronger. Tom, Aunt Sally and Roy look on.\n\n                         FRANKLIN\n               I'm standing.\n\n     The release is powerful as Franklin dissolves into tears.\n\n     EXT. COTTAGE PORCH - EVENING\n56                                                               56\n     Tom, who's been mixing cocktails, hands Franklin a drink and\n     lifts his glass.\n\n                         TOM\n               To standing on your own two feet!\n\n     They clink and drink.\n\n                          RANKLIN\n               This water could be the cure -- the\n               cure! In six months I could be up\n               and walking!\n\n     Lionel, the mailman, comes down the path carrying a\n     flashlight, reading an open letter.\n\n                         LIONEL\n               Evening folks.\n\n                         FRANKLIN\n               Cocktail, Lionel?\n\n                         LIONEL\n               I can't. I'm working for the\n               federal government.\n\n                         FRANKLIN\n               All the more reason.\n                   (shoving a drink at him)\n               Sort of late for the mail, isn't it?\n\n                    F\n\n\n\n\n                    L\n\n\n\n\n                                                 38.\n\n                    LIONEL\n          Not for me it isn't. Got a whole\n          packet of clippings for you, Mr.\n          Roosevelt. From a Mr. Howe. New\n          York Times, Journal-American...\n          don't know what else.\n\nHe hands an already opened letter to Franklin.\n\n                    LIONEL\n          Your mother wants to know when\n          you're coming home. She says they\n          got swimming pools in Hyde Park.\n          She's mad as all hell.\n\n                    FRANKLIN\n          Reading other people's mail is not\n          only impolite, it's illegal.\n\n                    LIONEL\n          Sheriff don't mind. He likes I read\n          his mail. Saves him the time. Plus\n          a lot of folks around here can't\n          read, so it's more a public\n          service, really.\n\n                    FRANKLIN\n          Astonishing. Thank you, Lionel.\n\nHe hands Lionel a letter.\n\n                      IONEL\n              (reading)\n          \"Miss Missy LeHand.\" Who's she?\n                    F\n                     RANKLIN\n          If you must know, she's my social\n          secretary.\n              (to Tom)\n          I'm having her come down.\n\nLionel reaches into his bag.\n\n                    LIONEL\n          Almost forgot... your wife wrote\n          the nicest letter. She's gonna make\n          a speech at the League of Women\n          Voters.\n\n                     RANKLIN\n          Give me that.\n\n                   (\n\n\n\n\n                                                                39.\n\n     He hands the letter to Franklin who immediately begins\n     reading.\n\n                         LIONEL\n                   (to Tom)\n               Says she's gonna keep the Roosevelt\n               name alive. Least till he starts\n               walkin' and all.\n\n     Lionel takes the letter Franklin just handed him, opens it,\n     flicks his flashlight back on and continues on his way.\n\n                         FRANKLIN\n                   (studying the letter)\n               This is so unlike Eleanor. She's\n               terrified of crowds.\n\n                                                         CUT TO:\n\n57                                                                 57\n     INT. HALLWAY - DAY\n\n     Louis and Eleanor approach a set of double doors.\n\n                         ELEANOR\n               We are facing imminent disaster.\n\n                         LOUIS\n               I take full responsibility if you\n               hyperventilate or faint.\n\n     They enter the room.\n\n     INT. MEETING ROOM - CONTINUOUS\n58                                                                 58\n     At a lectern, behind which a banner reads \"LEAGUE OF WOMEN\n     VOTERS,\" the CHAIRWOMAN sees them and waves them forward.\n\n                         CHAIRWOMAN\n               Ah, here she is now. Ladies, Mrs.\n               Franklin Roosevelt.\n\n     A small crowd of about two dozen women offer up polite, but\n     scant applause for Eleanor.\n\n                         ELEANOR\n               Good afternoon. I am so pleased to\n               be invited here today.\n                    looking down at her\n                    cards)\n               Too often....\n\n     A PHOTOGRAPHER snaps a picture which throws Eleanor off.\n\n                                                           40.\n\n\n\n                    ELEANOR\n          Too often...\n\nShe stops. The pause is deadly. Louis looks ready to jump out\na window. Eleanor continues, her voice still pitched too high.\n\n                    ELEANOR\n          Too often the great decisions are\n          originated and given form in bodies\n          made up wholly of men...\n\nSlowly, she begins to find her voice.\n\n                     ELEANOR\n          So that whatever political value\n          women have to offer is shunted\n          aside... without expression.\n          T\n            his is a mistake.\n\nShe looks up from her cards and stares at the audience...\nand for the first time speaks spontaneously.\n\n                    ELEANOR\n          I think this might be the reason I\n          am having such a difficult time\n          giving voice to my own thoughts\n          here today.\n\nThe immediacy of her self-effacing comment charms the room.\n\n                    ELEANOR\n          I'm reminded of what someone once\n          said about looking at an elephant.\n          That it is impossible to ever see\n          an entire elephant from one place --\n          you must walk around it. If our\n          elected leaders are to be truly\n          effective then they must be willing\n          to go out of their way to look\n          beyond what is right in front of\n          them. To see the entire elephant.\n          And for that... they need our help.\n\nThe ladies applaud her, much to her relief. Louis beams.\n\nLATER\n\nAt a reception following the speech, Eleanor and the\nChairwoman are drinking tea.\n\n                            F\n\n\n\n\n                                                             41.\n\n                         CHAIRWOMAN\n               That was so moving, Mrs. Roosevelt.\n               The Child Welfare Amendment could\n               use someone with your passion. You\n               must consider being our\n               spokesperson.\n\n     Eleanor looks to Louis who nods.\n\n                         ELEANOR\n               Oh. It would be an honor.\n\n                            CHAIRWOMAN\n               Wonderful.\n\n59                                                             59\n     EXT. POOL - DAY\n\n     Franklin is attempting to walk in the water, working\n     diligently. Tom watches him from a few paces back.\n\n                            TOM\n               Morning.\n\n                         FRANKLIN\n               I walked five steps today!\n\n                         TOM\n               Congratulations. Listen, Franklin,\n               I got word a local reporter wants\n               to do a story on you.\n\n                          RANKLIN\n               I'm hardly newsworthy these days.\n                   (a beat)\n               How did he find out I'm here?\n\n                         TOM\n               Small town -- word gets out. It\n               probably won't amount to more than\n               a provincial puff piece but it\n               might give us some free publicity\n               for the Inn.\n\n     Franklin looks at Tom knowing full well he's arranged this.\n\n                         TOM\n               All right, I know the gentleman.\n               I'm doing him a favor. You know, I\n               used to be a journalist.\n\n                         FRANKLIN\n               Do you mean all this time I've been\n               talking to a newspaper man?\n\n                                                             42.\n\n                         TOM\n               Not anymore. I got in a bit of\n               trouble in Atlanta. Seems some of\n               the editorial pieces I wrote\n               offended the sensibilities of a\n               local civic group. So I needed to\n               lay low for a while.\n\n                         FRANKLIN\n                   (a beat)\n               You mean the Klan? Good God, Tom...\n                         T\n                          OM\n               Thankfully, Mr. George Foster\n               Peabody gave me this job...\n\n                         FRANKLIN\n               Well, that explains a few things.\n               For the life of me, I couldn't\n               figure out why someone like you was\n               running this --\n\n                           TOM\n               Rat-trap?\n\n                         FRANKLIN\n                   (laughing, swimming off)\n               I was going to say dump, but rat-\n               trap fits nicely.\n\n     EXT. FRANKLIN'S COTTAGE - FRONT PORCH - DAY\n60                                                               60\n     Franklin is seated -- but not in his wheelchair. He wears\n     long pants even though it's blisteringly hot.\n\n     CLEBURNE GREGORY, 28, sits across from Franklin -- a second\n     string reporter in a three-piece suit.\n\n                         GREGORY\n               Now in 1920 when you were running\n               for Vice-President...\n\n                         FRANKLIN\n               I can't imagine your readers are\n               interested in ancient history. Cox\n               and I lost the election by a wide\n               margin.\n\n                         GREGORY\n               It was only a few years ago, Mr.\n               Roosevelt...\n\n     H\n\n\n\n\n                                                             43.\n\n                         FRANKLIN\n               Now it's the waters extra minerals\n               plus its warmth that makes all the\n               difference. At 90 degrees I can\n               work my muscles for hours and not\n               get cold.\n\n                         GREGORY\n               As Assistant Secretary of the Navy\n               during the Great War did you\n               condone the use of...\n\n                         FRANKLIN\n               I forgot one more thing you will\n               need to write down. Poor\n               circulation is a chronic problem\n               for people in my condition.\n\n     Gregory looks at Franklin. It's clear he's not going to get\n     the interview he came for.\n\n                         GREGORY\n               So... you think it could be a cure?\n\n                         FRANKLIN\n               I don't know.\n\n                         GREGORY\n               But you're hopeful?\n\n                            FRANKLIN\n               Yes. I am.\n\n     INT. COTTAGE - NIGHT\n61                                                                61\n     Franklin is laid out on the bed as Roy slides the braces off\n     his legs. Roy unlaces his shoes and slips them off his feet.\n\n      e is about to put them under the bed when Franklin motions\n     for Roy to hand them to him.\n\n     Still flat on his back, Franklin luxuriates in the rich\n     leather cobbled by hand. He examines their smooth, immaculate\n     soles... worn but never walked in.\n\n     INT. COTTAGE - MORNING\n62                                                                62\n     A newspaper clipping of Eleanor in her speech to the League\n     is taped to the wall.\n\n     We hear the sound of an Underwood typewriter clacking away\n     and Franklin's voice, dictating.\n\n                                                        44.\n\n                    FRANKLIN\n          Therefore, a formal questionnaire\n          should be composed in order so we\n          may hear from all recent delegates\n          as to how we can do better in '28 to\n          present a more united front. Signed,\n          Franklin Roosevelt, etc., etc.\n\nMISSY LE HAND, 30, is sitting at a card table, typing.\nBrunette with some early gray, she is sturdy in build with a\nplain but friendly face.\n\n                    MISSY\n          Very good. Do you want this out\n          today?    F\n                     RANKLIN\n          Tomorrow will be fine.\n\n                     MISSY\n          Alright.\n\n                    FRANKLIN\n          Thank you, Missy, and c.c. that to\n          Louis.\n\nMissy rises with a stack of envelopes and heads out.\n\nRoy enters with a plate of pancakes in front of Franklin.\n\n                    ROY\n          Hungry, Mr. Roosevelt?\n\n                    FRANKLIN\n          Not really.\n\n                    ROY\n          Who do you write to every morning?\n\n                    FRANKLIN\n          Different people I knew in\n          politics. Just in case they ever\n          want me back.\n\n                    ROY\n          So you'll be ready when you get\n          your legs workin' again?\n\n                     FRANKLIN\n          Exactly.\n\n                                                        45.\n\nThere is a knock at the screen door. An earnest young man,\nBENJAMIN PRENDERGAST, 18, is peering in. He has a newspaper.\n\n                    PRENDERGAST\n          Excuse me, are you Mr. Roosevelt?\n\n                    FRANKLIN\n          Yes. Who are you?\n\nRoy opens the door to Prendergast, who enters.\n\n                    PRENDERGAST\n          My name is Benjamin Prendergast.\n          I've come to see if you could speak\n          at this year's graduation ceremony\n          at the schoolhouse. You being so\n          famous and all.\n\nPrendergast unfolds the newspaper. There is a picture of\nFranklin under the heading \"FRANKLIN ROOSEVELT SWIMS HIS WAY\nTO HEALTH!\"\n\n                    FRANKLIN\n          I'll be damned.\n\n                    PRENDERGAST\n          Would you be available?\n\n                    FRANKLIN\n              (looking up)\n          When? Next spring?\n\n                    PRENDERGAST\n          Next week. We only have a four\n          month school year.\n\n                    FRANKLIN\n          How is that possible?\n\n                    PRENDERGAST\n          Tax dollars only cover that much.\n\n                    FRANKLIN\n          Are you graduating?\n\n                    PRENDERGAST\n          No, sir. I'm the principal.\n\n                    FRANKLIN\n          I see.\n\nBut Franklin doesn't see.\n\n                                                                46.\n\n     EXT. SCHOOLHOUSE - DAY\n63                                                                63\n     A small breeze or a decent rain would knock it to the ground.\n\n     INT. SCHOOLROOM - CONTINUOUS\n64                                                                64\n     A bookshelf with four books.\n\n     A few FARMERS and their WIVES sit with large groups of filthy\n     children. They look at Franklin askance.\n\n     Prendergast stands proudly beside three GRADUATES-TO-BE.\n\n     Tom stands in the back observing.\n\n     Franklin, in his wheelchair, sits uncomfortably before the\n     gathering. He notices a FATHER staring at his legs.\n\n                          PRENDERGAST\n               Now that we're all here let me\n               introduce to you to our guest\n               speaker today, Mr. Franklin\n               Roosevelt.\n\n                         FRANKLIN\n               Good afternoon.\n\n     A fly begins buzzing around his head. He laughs derisively,\n     almost to himself.\n\n                         FRANKLIN\n               At Groton, where I graduated from\n               high school, our beloved Headmaster\n               encouraged his students to enter\n               public life...\n\n     He looks up and catches the glazed eyes of an undernourished\n     child which unsettles him.\n\n                         FRANKLIN\n               I chose to attend Harvard for my\n               undergraduate work and then\n               Columbia for my law degree.\n     H\n      e takes in their uncomprehending expressions.\n\n                         FRANKLIN\n               I followed my Headmaster's advice\n               and sought a career in public life.\n               But circumstances beyond my control\n               have made that... very difficult...\n\n                         R\n\n\n\n\n6\n\n\n\n\n                                                             47.\n\n     He stares at his tiny audience, all of whom know something\n     about circumstances beyond their control.\n\n                         FRANKLIN\n               I've given many speeches in my\n               life... I don't know why I'm having\n               such a hard time making this one...\n\n     Horrified and unable to speak, Franklin seems temporarily\n     lost, but the tiny audience doesn't seem to notice. They just\n     see Franklin.\n\n 5                                                                65\n     INT. TOM'S AUTOMOBILE - DAY\n\n                         FRANKLIN\n               My God did you see how they were\n               looking at me?\n\n                         TOM\n               They welcomed your company, Franklin.\n\n                         FRANKLIN\n               Don't patronize me.\n\n     Tom is losing his patience.\n\n                         TOM\n               Don't patronize them. These people\n               go to bed night after night with\n               half-empty stomachs -- your legs\n               are the least of their worries.\n\n     They continue to drive in silence.\n\n66                                                                66\n     EXT. POOL - DAY\n\n     It's a cold day and Franklin is swimming in the pool.\n\n     Roy is wearing a sweater. Aunt Sally is there, too, wearing a\n     patched up coat with a scarf around her neck. Tom is nearby\n     raking leaves.\n\n                         AUNT SALLY\n               Mr. Roosevelt, aren't you cold?\n\n                          OY\n               Mr. Roosevelt, you're gonna catch\n               the chill if you don't get out of\n               the water.\n\n     Franklin ignores them and dips under the water as Tom comes\n     over.\n\n                                                             48.\n\n                         AUNT SALLY\n               You got to tell him, Mr. Loyless.\n               He won't listen to us.\n\n     Franklin comes up from under.\n\n                         TOM\n               Franklin, we need to talk...\n               Normally we close up this time of\n               year and the staff goes home for\n               the holidays.\n\n     Franklin looks at Tom, then at Roy and Aunt Sally,\n     acknowledging.\n\n     The sound of a TRAIN WHISTLE is heard.\n\n                                                   DISSOLVE TO:\n\n67                                                                67\n     INT. HYDE PARK, NEW YORK- LIVING ROOM - DAY\n\n     The WHISTLE is coming from a MODEL TRAIN as it zooms around a\n     track set up on a table in the Roosevelt living room. Elliot,\n     now 15, is mesmerized.\n\n     Sara sits at a piano between FRANKLIN, JR., 9, and JOHN, 7.\n     They are finishing a rousing rendition of \"Angels We Have\n     Heard on High\" as an enormous Christmas tree gets decorated.\n\n     JAMES, 18, is at the top of a ladder while his sister, ANNA,\n     19, decorates from the lowest rung.\n\n     Eleanor holds up a tiny porcelain ornament to Anna.\n\n                         ELEANOR\n               Grandmother Delano brought this\n               from China.\n\n     Franklin, working from his wheelchair is filling out the\n     lower branches of the tree, his lap filled with ornaments.\n                          E\n                          LLIOT\n               Have you ever been to China,\n               Father?\n\n                         FRANKLIN\n               No, Elliot. Just your grandmama.\n\n                         SARA\n               I adored China. It smelled of\n               ginger cookies.\n\n               L\n\n\n\n\n                                                                49.\n\n                         FRANKLIN, JR.\n                et's go in the backyard and dig\n               our way there!\n\n                         SARA\n               That sounds like an adventure.\n\n     Anna looks over at her father, sadly and Franklin catches her\n     eye. She quickly looks away.\n\n     From behind his back, John, pulls out the Christmas star and\n     places it on his father's knee.\n\n                         JOHN\n               Put it on top.\n\n     Silence descends over the room. No one dares to breathe.\n\n                         ELEANOR\n               Give it to James. He's the tallest.\n\n                          JOHN\n               No.\n\n                         ANNA\n               John, give it to him!\n\n                         JOHN\n               Papa always does it.\n\n                         FRANKLIN\n               I can do it.\n\n     Franklin tosses the star in an attempt to reach the top. It\n     almost catches, but it falls to the floor.\n\n     Quickly, aiding to avoid his father's embarrassment, James\n     climbs back up and puts the star on top. Sara sensing the\n     awkwardness of the moment begins to play and sing an overly\n     cheery rendition of \"Hark! The Herald Angels Sing.\"\n\n     INT. STUDY - LATER\n68                                                                68\n     Roy is spotting Franklin as he pulls himself along a set of\n     parallel bars. Eleanor observes as Franklin uses his arms to\n     drag his legs behind him.\n\n                         ELEANOR\n               It was an extraordinary turnout\n               this afternoon. Louis says there\n               were over two hundred people in the\n               audience.\n\n                                                               50.\n\n\n\n                         FRANKLIN\n               That's marvelous, Babs.\n\n     Eleanor is flushed with pride. Franklin, catching her look,\n     slips slightly on the bars as Roy grabs hold of him.\n\n                         ROY\n               I've got you, sir.\n\n     Franklin then takes note that Eleanor's expression has turned\n     to one of pure heartbreak.\n\n                         FRANKLIN\n               You wonder why I want to go back to\n               Georgia... it's to avoid people who\n               look at me the way you just did.\n\n                         ELEANOR\n               You truly believe the waters...\n                   (with difficulty)\n               ... that they are helping?\n\n                         FRANKLIN\n               Don't talk to me as if I were a\n               child. Choosing your words so\n               carefully...\n\n                         ELEANOR\n               How am I supposed to talk to you?\n\n                         FRANKLIN\n               Like I was! Talk to me like I was!\n\n     Roy turns Franklin around on the bars and they begin walking\n     away from Eleanor.\n\n                         ELEANOR\n               I don't know how anymore.\n\n                                                     DISSOLVE TO:\n\n     EXT. COTTAGE - DAY\n69                                                                  69\n     Franklin is being lifted out of Pete's wagon by Roy and\n     placed into his wheelchair. He sees Tom approaching.\n                          T\n                          OM\n               You're a sight for sore eyes...\n\n                         FRANKLIN\n               We missed you at the station...\n\n                                                                51.\n\n     The smile on Franklin's face slips to a look of shock as he\n     takes in Tom's changed appearance. His face is sallow and his\n     trademark white suit is hanging on him.\n\n                         FRANKLIN\n                   (concerned)\n               Tom, are you all right?\n\n                         TOM\n               It's just an ulcer. I can't eat\n               anything I like anymore.\n\n     Roy carries the luggage into the cottage.\n\n                         FRANKLIN\n                   (covering)\n               My father had ulcers. Damn irritating.\n\n                         TOM\n               Yes, they are.\n\n     A silence hangs in the air.\n\n                         TOM\n               Ready to swim?\n\n     EXT. POOL - DAY\n70                                                                70\n     Franklin now dressed in his bathing suit is being wheeled by\n     Roy. Tom follows.\n\n                         TOM\n               We've got some new guests. Some\n               paying, some non-paying...\n\n     As they get closer, Franklin is stunned by what he sees --\n\n     A DOZEN PEOPLE -- all in different groupings -- some on\n     crutches, others in wheelchairs, are gathered around the\n     pool.\n\n                         FRANKLIN\n               What in blazes?...\n\n                         TOM\n               The interview you gave was\n               syndicated in Sunday papers all\n               over the country.\n\n     Franklin looks up at Tom, dumbfounded.\n\n                         TOM\n               They're here to see you.\n\n     H\n\n\n\n\n                                                             52.\n\n     This news hits Franklin with the force of a sledgehammer.\n\n     PAT DOYLE, 50, is stuffed into his wheelchair with a huge\n     cigar between his fat lips.\n\n      is eyebrows have a life of their own. He wheels himself to\n     Franklin.\n\n                         PAT\n               Mr. Roosevelt, Pat Doyle. I've come\n               all the way from Minneapolis to\n               shake your hand, sir.\n\n     He reaches out his hand to Franklin.\n\n                         PAT\n               Stuck in this chair I do nothing\n               but read. Newspapers, mostly.\n               Usually I'm just looking for\n               something -- anything -- that'll\n               tell me there's even the slightest\n               chance I'll walk again.\n\n     Franklin is uncomfortable, especially as Pat won't let go of\n     his hand.\n\n                         FRANKLIN\n               I really don't know what to say.\n\n                          PAT\n               Well, you're here. And we're here.\n               Together... we'll think of\n               something.\n\n     Franklin looks to Tom and gestures for him to come closer.\n\n                         FRANKLIN\n                   (whispering)\n               Get me out of here.\n\n     EXT. MERIWETHER INN - GROUNDS - DAY\n71                                                                71\n     Franklin is pushing the chair himself along the dirt path,\n     his anger propelling F\n                          him away from Tom.\n\n                          RANKLIN\n               I want no part of this. I come here\n               for privacy!\n\n                         TOM\n               This isn't your personal spa!\n               I have a business to run.\n\n                                                          53.\n\n                    FRANKLIN\n          Exactly. You have a business to\n          run, not I!\n\n                    TOM\n          No one's asking anything of you!\n\n                    FRANKLIN\n          Of course they are!\n\n                    TOM\n          Do you know what it took for most\n          of them to get here?\n\n                    FRANKLIN\n          It's not my concern. I want to be\n          left alone!\n\n                    TOM\n          My God, you're afraid of these people.\n\n                    FRANKLIN\n          Afraid? What you're talking about?\n\n                    TOM\n          You look at them with the same\n          repulsion and pity as everyone else.\n\n                    FRANKLIN\n          Don't be ridiculous. I resent your\n          trying to --\n\n                    TOM\n          You don't want to be around them\n          because then that would make you\n          one of them, wouldn't it?\n\nFranklin furiously wheels himself back towards the cottage,\ngetting stuck on the dirt path along the way.\n\n                    FRANKLIN\n          God damn it!\n\nTom comes to his aid but he is brushed off by Franklin.\n\n                    FRANKLIN\n          Out of my way! Get out of my\n          goddamn way!\n\nFranklin wheels himself off.\n\n                                                             54.\n\n     EXT. BULLOCHVILLE TRAIN STATION - DAY\n72                                                             72\n     Franklin, in his wheelchair, smokes a cigarette. His bags are\n     next to him, as is Roy. A train's whistle BLOWS and pulls in.\n\n                         ROY\n               Right on time.\n\n     Franklin sees someone else on the platform. He squints in the\n     distance. It's Tom.\n\n     He walks closer towards Franklin and Roy.\n\n                         TOM\n               Good evening.\n\n     Franklin nods in Tom's general direction. Tom has a telegram\n     in his hand which peaks Franklin's curiosity.\n\n                         FRANKLIN\n               Expecting someone?\n\n                         TOM\n               Yes.\n\n     The train comes to a complete stop. A CONDUCTOR steps out\n     onto the platform. A single ELDERLY WOMAN gets off the train.\n\n                         TOM\n                   (to the Conductor)\n               I'm looking for a young gentleman\n               by the name of Botts. Fred Botts?\n\n                         CONDUCTOR\n               Don't know anything about that.\n\n                         TOM\n               I expect he would be in a\n               wheelchair.\n\n                         CONDUCTOR\n               You mean the cripple? He's in the\n               baggage car.\n\n     EXT. BAGGAGE CAR - DAY\n73                                                             73\n     Tom, Franklin and Roy are in front of the large door as the\n     Conductor pushes it back slowly.\n\n                                                               55.\n\n     INT. BAGGAGE CAR - DAY\n74                                                                74\n     Amongst crates and luggage is FRED BOTTS, a young man of\n     fifteen lying on the floor, unconscious. A wheelchair is next\n     to him, turned over on its side.\n\n                         FRANKLIN\n               Mother of God.\n\n     Tom leaps up and into the car as does Roy leaving Franklin\n     below. Tom takes his wrist.\n\n                         TOM\n               His pulse is slow.\n\n75                                                                75\n     EXT. STATION PLATFORM - DAY\n\n     Roy lays Fred on a bench. Franklin wheels himself over.\n\n                         FRANKLIN\n               Son, can you hear me?\n\n     Tom brings a cup of water. Franklin puts it to Fred's lips.\n\n                            FRANKLIN\n               Fred?\n\n     Fred opens his eyes. They are large and brown with a\n     sweetness to them. His face comes alive when he recognizes\n     Franklin.\n\n                         FRED\n               Mr. Roosevelt?...\n\n                         FRANKLIN\n               It's going to be all right, son.\n     H\n      e hands Franklin a worn newspaper clipping from his pocket.\n     The headline reads: \"FRANKLIN ROOSEVELT SWIMS HIS WAY TO HEALTH!\"\n\n                         FRED\n               The conductor wouldn't let me ride\n               in the passenger car with my chair.\n\n     Franklin looks at the clipping, then at Fred.\n\n                         FRANKLIN\n               When did you last eat?\n\n                            FRED\n               Knoxville.\n\n                                                        56.\n\n                    TOM\n          Knoxville had to be three days ago.\n\n                    FRANKLIN\n          Roy, take him to the car.\n\nAs Roy lifts Fred in his arms, Franklin wheels himself to the\nengine car. Tom follows as they approach the CONDUCTOR.\n\n                    FRANKLIN\n          Who in their right mind let's a\n          child ride in the baggage car!\n          You could have killed that boy.\n\n                    CONDUCTOR\n          He had polio. Probably still\n          contagious.\n\nThe Conductor walks away, dismissively. Franklin pushes his\nchair up and stops the Conductor in his tracks.\n\n                    FRANKLIN\n          Don't dismiss me because I sit in\n          this chair!\n\n                    CONDUCTOR\n          Get away from me.\n\nFranklin pushes the wheels of his chair with such force he\nknocks the Conductor over.\n\n                    FRANKLIN\n          You ignorant son of a bitch. If I\n          could, I'd get up right now and\n          lock you in that box car! See how\n          you like it!\n\n                    TOM\n          Franklin...\n\nThe Conductor struggles to get up.\n\n                    CONDUCTOR\n          Get this lunatic off me!\n\nFranklin wheels himself towards Tom's car where Fred is now\nlying across the back seat. The sight of Fred drains all\nanger from Franklin's face.\n\n                    FRANKLIN\n          Where's the nearest hospital?\n\n                                                               57.\n\n                            TOM\n               Atlanta.\n\n                         FRANKLIN\n               What about a doctor?\n\n                         TOM\n               Closer, but not by much.\n\n     The train whistle BLOWS.\n\n                         ROY\n               Train's ready.\n\n     Franklin looks at Fred, then at Roy and Tom.\n\n                         FRANKLIN\n                   (quietly)\n               Let's go home.\n\n     INT. COTTAGE - NIGHT\n76                                                               76\n     Fred lays in Franklin's bed while Franklin sits by the\n     bedside. Roy lays a cold compress on Fred's forehead.\n     F\n      ranklin is using his watch to take Fred's pulse.\n\n     Roy pulls back the sheet to give Fred air revealing his\n     withered legs. Alabaster skin stretched over bones.\n\n     Franklin looks away.\n\n     INT. COTTAGE - DAY\n77                                                               77\n     Franklin sits at a card table with his check book in front of\n     him. Tom stands before him, shifting uncomfortably.\n\n                         FRANKLIN\n               How many can pay?\n\n                         TOM\n               Fewer than half.\n\n     Franklin opens the check book and begins writing.\n\n                         FRANKLIN\n               I want these people in the\n               cottages, not in the inn. It's\n               safer.\n\n                         TOM\n               Well, it's the way it has to be.\n\n                                                          58.\n\n                    FRANKLIN\n          What do you mean?\n\n                    TOM\n          I've already had some complaints.\n              (awkwardly)\n          This is the start of the season,\n          Franklin. I've got regulars who\n          have come for years. Healthy folks\n          over all... They're threatening to\n          check out, afraid they might catch\n          polio.\n\n                    FRANKLIN\n          Such ignorance! Don't they know\n          that after the fever breaks we are\n          no longer contagious?\n\n                    TOM\n          I'm going to have to ask that you\n          not use the pool during regular\n          hours. I'll put time aside for you\n          late in the day... and it won't be\n          possible for you to eat in the\n          dining room either. But I promise\n          I'll find someplace suitable.\n\n                    FRANKLIN\n          They don't want us to eat in their\n          presence?\n\n                    TOM\n          Of course for you I can make other\n          accommodations.\n\n                    FRANKLIN\n              (a beat)\n          That won't be necessary.\n\nFranklin goes back to writing out the check. Tom stands\nwaiting, the sound of the pen scratching seemingly\ninterminable. Their mutual discomfort is obvious.\n\nFranklin rips the check from the ledger and holds it for Tom.\n\n                       TOM\n          Thank you.\n\n                    FRANKLIN\n          We still need a doctor here.\n\n                       TOM\n          For Fred?\n\n                                                          59.\n\n                         FRANKLIN\n                   (pointedly)\n               For everyone.\n\n     EXT. COTTAGE - NIGHT\n78                                                          78\n     Franklin is in his wheelchair, writing.\n\n                         FRANKLIN (V.O.)\n               \"Dear Babs, Things are very\n               different upon my return.\"\n7\n\n 9                                                          79\n     INT. HYDE PARK - DAY\n\n     Eleanor sits in a chair reading Franklin's letter.\n\n                         FRANKLIN (V.O.)\n               I am taking on responsibilities\n               which none of my schooling in the\n               spheres of higher learning or\n               politics could have prepared me\n               for... I have seen the casualties\n               of war. But I have never seen this,\n               a suffering so insidious, so\n               silent, that it rattles my soul.\"\n\n     INT. COTTAGE - NIGHT\n80                                                          80\n     Franklin is tucking Fred in for the night.\n\n                         FRED\n               When can I swim?\n\n                         FRANKLIN\n               Soon. When you're a little stronger.\n\n                         FRED\n               When I'm asleep, in my dreams, I\n               can still walk.\n\n                         FRANKLIN\n               Me too.\n                   (a beat)\n               How long has it been... since you\n               walked?\n\n                          FRED\n               Nine years. I'd just learned to\n               ride a bike. After I got sick my\n               mom was sure that the bike had\n               caused it.\n\n                                                                60.\n\n                         FRANKLIN\n               Did she sell it?\n\n                         FRED\n               No. She took it out back and shot it.\n\n     Franklin howls with laughter, joined by Fred.\n\n     EXT. POOL - DUSK\n81                                                                81\n     Franklin is in the pool with the new guests. They are all\n     nervously waiting to test the water.\n\n     From the looks on their faces it's clear they only want to\n     take their cues from Franklin.\n\n     A MOTHER carries her adorable 4 year old GIRL into the water.\n\n                         FRANKLIN\n               And who is this delightful child?\n\n                         DAISY\n                   (giggling)\n               Daisy.\n\n                         FRANKLIN\n               All right Daisy, try and kick your legs.\n\n     Daisy wiggles back and forth in her MOTHER's arms giving it\n     her very best effort.\n\n                         FRANKLIN\n               Excellent, Daisy!\n\n     JAKE PERRINI, 32, Bronx-born with an upper body of steel\n     wheels over to Roy who is fixing a wheelchair.\n\n                         JAKE\n               Jake Perrini, Bronx, New York.\n\n                           ROY\n               Roy, sir.\n\n                         JAKE\n               How you doin'?\n\n     Jake reaches out his hand to shake. Roy is unsure what to do.\n\n                         JAKE\n               C'mon -- I won't bite.\n\nT\n\n\n\n\n                                                           61.\n\n                    ROY\n              (shaking his hand)\n          Mighty fine, sir. Mighty fine.\n\n                    JAKE\n          Hey, would you mind pulling me\n          outta this trap, Roy? I wanna get\n          airborne.\n\nRoy gently lifts Jake up and out of his chair, into his arms\nlike a child.\n\n                    JAKE\n          Do me one more favor? Throw me in?\n\nRoy tosses Jake to the heavens and he SAILS through the air\nemitting a jungle cry of pure emotional release before\nSPLASHING down hard in the water.\nH\n e bobs up to the surface. There is applause.\n\n                    FRANKLIN\n          Now folks, these exercises are of\n          my own devising so bear with me.\n\nSome laugh, some are confused. This is new territory for\neveryone.\n\n                    FRANKLIN\n          My hope is that in repeating these\n          movements over and over in the\n          water I'm in some way causing the\n          muscles to regenerate themselves\n          and repair the damage.\n\nHe swims to the edge of the pool.\n\n                    FRANKLIN\n          So everybody grab the edge of the\n          pool and move what you can!\n\n hey disperse, eagerly ready to do what Franklin tells them.\n\n                    FRANKLIN\n          Go ahead now, do your best!\n\nTheir legs barely rise up to splash the surface. Undeterred,\nFranklin leads them on, spiritedly.\n\nIn the distance we see Tom, leaning against a tree, watching\neverything.\n\n                          F\n\n\n\n\n                                                                62.\n\n     INT. DINING ROOM - NIGHT\n82                                                                82\n     Tom oversees the dinner service of paying guests -- none of\n     whom have disabilities.\n\n     INT. BACK ROOM - NIGHT\n83                                                                83\n     Segregated in a back room, all the polio guests are gathered\n     for dinner seated around a couple of sawhorses with old doors\n     thrown across them serving as makeshift dining tables.\n\n     Roy carries DAISY in and places her in the chair next to\n     Franklin.\n\n                          RANKLIN\n               Do you have a reservation?\n\n     She begins to giggle. It's infectious and soon everyone has a\n     smile on their face, overriding the awkwardness of the\n     situation.\n\n                         FRANKLIN\n               Whether in here or our there, I\n               guarantee you the food will taste\n               the same... terrible.\n\n                         DAISY\n               Shouldn't we pray first?\n\n                         FRANKLIN\n               By all means. Would you do us the\n               honor?\n\n     Franklin bows his head for grace.\n\n                         DAISY\n               Bless the food on our table. Keep\n               us healthy, strong and able. Amen.\n\n                          ALL\n               Amen.\n\n     EXT. FACTORY - DAY\n\n     With Louis in tow, Eleanor is touring the exterior of an\n     ironworks factory. She is the only woman in a large gathering\n     of men.\n\n                         ELEANOR (V.O.)\n               \"My dear Franklin, I too am\n               embarking on an altogether\n               remarkable experience.\"\n\n8\n\n\n\n\n                                                                63.\n\n     EXT. BUILDING - DAY\n85                                                                85\n      leanor stands against a banner that reads \"CHILD WELFARE\n     LEAGUE.\" She is passing out pamphlets to a small crowd that\n     has gathered.\n\n                         ELEANOR (V.O.)\n               \"It seems everywhere I go there are\n               more people in dire need of help.\n               It would be overwhelming if not for\n               my deep belief that help is\n               possible...\"\n\n     INT. NEW YORK STATE ASSEMBLY - DAY\n 6                                                                86\n     Eleanor is being introduced by Louis to members of the New\n     York State Assembly -- all men -- eager to shake her hand.\n\n                         ELEANOR (V.O.)\n               \"Louis's latest flash of brilliance\n               is to take me 'mainstream.' He said\n               that you would know what he means\n               by this.\"\n\n     EXT. POOL - DAY\n87                                                                87\n     Franklin is in the water. Roy lifts Fred out of his\n     wheelchair and gently puts him in the shallow end. Franklin\n     receives him. Fred's face is ecstatic as he floats on his\n     back in the water.\n\n                         ELEANOR (V.O.)\n               \"I hope you are finding your work\n               to be gratifying in both mind and\n               heart. Your beloved, Eleanor.\"\n\n     EXT. MERIWETHER INN - DAY\n88                                                                88\n     A very old car comes coughing in, steam hissing from its\n     engine.\n\n     HELENA MAHONEY, 43, gets out of the driver's seat. Her iron\n     will is matched only by her deep reserves of empathy. She\n     gets a good look at the Inn. This is what she has come for?\n\n     EXT. COTTAGE PORCH - DAY\n89                                                                89\n     Franklin and Roy, having finished lunch, are playing\n     checkers. Fred is sitting nearby eating a piece of pie.\n\n     Helena approaches. Roy pulls off a triple jump.\n\n                                                        64.\n\n                      FRANKLIN\n          Damn!\n\n                      ROY\n          King me.\n\nFranklin reluctantly tops Roy's checker.\n\n                    FRED\n          You're losing, Doc.\n\n                    HELENA\n          Doc? I'm sorry, you're Franklin\n          Roosevelt, aren't you?\n\n                    FRANKLIN\n          Depends.\n              (suspiciously)\n          Are you a lawyer?\n\n                      HELENA\n          No.\n\n                    FRANKLIN\n          Then Roosevelt it is. Wait!\n\nHe jumps one of Roy's checkers.\n\n                     HELENA\n          I'm Helena Mahoney. I'm a physical\n          therapist.\n              (off their blank looks)\n          You have no idea who I am, do you?\n\n                      FRANKLIN\n          Should I?\n\n                    HELENA\n          I wrote you a letter right after I\n          saw the article in the paper.\n          Didn't you read it?\n\n                    FRANKLIN\n          It got read, I assure you. But\n          probably not by me.\n\nHelena glances down at the checkerboard and points to it.\n\n                    HELENA\n              (to Roy)\n          He's open right there.\n\n                                                       65.\n\n                         ROY\n               He sure is.\n\n     Roy trounces Franklin with three swift moves.\n\n                         ROY\n               Thank you, ma'am.\n\n     Helena sits at the table with them.\n\n                         HELENA\n               I've been studying the effects of\n               moist heat on polio patients and I\n               think with repeated exercise in\n               warm water...\n\n                         FRANKLIN\n               It can help them regain lost\n               strength.\n\n                         HELENA\n               Yes.\n\n                         FRANKLIN\n               Incredibly I've come to the same\n               conclusion myself.\n\n                         HELENA\n                   (a half-smile)\n               Well, you're the doctor.\n\n90                                                       90\n     EXT. MERIWETHER INN - DAY\n\n     Helena is wheeling Franklin around the grounds.\n\n                         HELENA\n               No ramps, no running water, no\n               doctors... from the article in the\n               newspaper I assumed this was a\n               rehabilitation center.\n                         F\n                          RANKLIN\n               Don't believe everything you read.\n\n                         HELENA\n               I feel like I was brought here\n               under false pretenses.\n\n                         FRANKLIN\n               Join the club.\n\n                   (\n\n\n\n\n                                                             66.\n\n     INT. A BARN - DAY\n91                                                                91\n     Franklin lies across a makeshift examining table. Helena's\n     examination is in progress.\n\n     She is completely absorbed -- all business -- pouring over\n     his muscles inch by inch. She kneads, bends and stretches\n     them with a laser-like focus, finally picking up Franklin's\n     leg and rotating it out and around.\n\n                         HELENA\n               Push against my hand.\n\n     Franklin, with difficulty, tries to do so.\n\n                         FRANKLIN\n               Give me the good news first.\n\n                         HELENA\n               Your gluteus maximus is better than\n               I hoped. It will serve you well.\n\n                         FRANKLIN\n               Must be all that sitting.\n\n                         HELENA\n               I'm serious. Your right leg has\n               some movement along the thigh.\n               That's good because we can use it\n               to help extend your hip, flex your\n               knee and rotate your tibia.\n\n                         FRANKLIN\n               I'm supposed to walk on one side?\n\n                         HELENA\n               The water may help build some\n               strength I'm not able to see yet.\n               But to do that you would need to\n               swim in the water much of the day.\n               Not the limited hours you have now.\n                    a beat)\n               Why should this place cater to a\n               few able-bodied folk when it could\n               be opened year round with polios?\n\n     EXT. MERIWETHER INN - DAY\n92                                                                92\n     Tom is pushing Franklin in his wheelchair.\n\n                          FRANKLIN\n               There's a need for a place like\n               this, Tom.\n                          (MORE)\n\n                                                          67.\n          Are you aware NKLIN(cont'd)\n                    FRA that in the last\n          epidemic over 16,000 people got\n          polio in the New York area alone?\n\n                    TOM\n          Sounds like you've been reading up.\n\n                    FRANKLIN\n          I wish there was more to read. Damn\n          few things being written about any\n          of this. To think of someone like\n          Fred... locked away... his mind and\n          heart so vibrant...\n\n                    TOM\n          It's a waste. An awful waste.\n\nFranklin takes a beat -- the weight of this sinking in.\n\n                    FRANKLIN\n          What's the acreage here?\n\n                    TOM\n          Roughly twelve hundred or so. Why?\n\n                    FRANKLIN\n          I want to buy it. I think it would\n          make one hell of an investment.\n\n                    TOM\n          Investment?\n\n                    FRANKLIN\n          Twelve hundred acres? Enough for\n          two resorts, don't you think?\n\n                    TOM\n          It would take money. There's a lot\n          of land, rebuilding the inn, adding\n          ramps and so many people can't pay...\n\n                    FRANKLIN\n              (undeterred)\n          Do you think old Peabody will sell?\n\n                    TOM\n          He'll sell.\n\n                    FRANKLIN\n          How can you be so sure?\n\n                    TOM\n          Have you taken a look at this\n          place?\n\n                                                             68.\n\n     INT. TOM'S OFFICE   - DAY\n93                                                               93\n     Franklin sits in his chair at a desk.\n\n                          FRANKLIN\n                    (full of charm)\n               Peabody you old reprobate! How are\n               you?\n\n     Tom is pacing back and forth\n\n                         FRANKLIN\n               You'll never guess why I'm calling.\n\n     EXT. MERIWETHER INN - MAIN ENTRANCE - DAY\n94                                                               94\n     Helena is training a group of YOUNG MEN how to lift and carry\n     using a raven haired young woman, ELOISE HUTCHISON, 18, as\n     the test model. She sits shyly in her wheelchair before them.\n\n                         HELENA\n               Woodhall, this is Eloise. Lift her\n               gently.\n\n     WOODHALL BUSEY, 17, has bright red hair and a face full of\n     freckles. Over six feet tall he has spent his life working in\n     the fields.          W\n                             OODHALL\n               Yes, ma'am.\n\n     He picks Eloise up effortlessly, then sets her back down.\n\n                         HELENA\n               Very good! Watch her braces.\n\n     Woodhall kneels before Eloise like Prince Charming, carefully\n     straightening out her legs.\n\n                         WOODHALL\n               You're light as a ...\n\n     He notices the long jagged scars along Eloise's wrists.\n     Eloise, sensing his eyes, self-consciously pulls down her\n     sleeves. He stares at her questioningly.\n\n                         ELOISE\n                   (looking away)\n               I was a dancer...\n\n     Tom and Franklin come out. Franklin gives a questioning look\n     to Helena, pondering how these boys have suddenly appeared.\n\n                         T\n\n\n\n\n                                                             69.\n\n                         HELENA\n               Good news... I raided the pool\n               hall. I call them my Push Boys.\n\n                         FRANKLIN\n               Welcome Push Boys! Good day, Eloise.\n\n                         ELOISE\n               Hello, Mr. Roosevelt.\n\n                         TOM\n               Want to tell them your good news?\n\n     Franklin is smiling like the cat that ate the canary.\n\n                         FRANKLIN\n               It's hardly a done deal, but for\n               better or worse, you may be looking\n               at the new owner of this God-\n               forsaken place.\n\n     INT. COTTAGE - EVENING\n95                                                             95\n     A free wheeling game of poker. Heavy with cigarette and cigar\n     smoke, Franklin, Tom, Fred, Jake and Pat are playing.\n\n                         PAT\n               Polio's always going to be a losing\n               financial proposition, but it doesn't\n               mean you shouldn't buy the place.\n\n                         FRANKLIN\n               I am buying it. Make no mistake\n               about that.\n\n                         PAT\n               Good for you, Doc.\n\n                         FRED\n               If you don't mind my asking, how\n               will people pay for the services\n               you are going to offer here? Most\n               people with polio have a hard enough\n               time making ends meet as it is.\n\n                          OM\n                   (gently)\n               The boy makes a good point, Franklin.\n\n                         FRANKLIN\n               Not everything in this world has to\n               be about profits.\n\n                         P\n\n\n\n\n                                                             70.\n\n                         TOM\n               I'll see your twenty-five and raise\n               you twenty-five.\n                         J\n                          AKE\n               C'mon will ya! The night's still\n               young.\n\n                         TOM\n               It's twenty-five cents not twenty-\n               five dollars.\n\n                         PAT\n               Don't mind him, Tom. He's a cheap\n               bastard.\n\n     Fred and Pat fold immediately as does Franklin.\n\n                         FRANKLIN\n               Too rich for my blood.\n\n                         JAKE\n                   (to Tom)\n               Fine! Here's your twenty-five! You\n               better have something.\n\n     They eyeball each other. Gunfight at the O.K. Corral.\n\n                         TOM\n               Take it. I was bluffing.\n\n     Gleefully, Jake slaps his hands together and rakes in the pot.\n\n                          AT\n                   (handing Franklin a fresh\n                    deck)\n               Your deal, Doc.\n\n                         FRANKLIN\n               Very well. Gentlemen, the game is\n               Five Card Stud, sevens are wild.\n\n     Everyone groans.\n\n                         FRANKLIN\n               Sevens are wild and you can all go\n               to Hell!\n\n     EXT. MERIWETHER INN - GROUNDS - DAWN\n96                                                             96\n     The sun is about to rise. Tom's car is parked in front of the\n     Inn, pulled up very close to the main entrance. The trunk is\n     open.\n\n                                                        71.\n\nTom, struggling with a suitcase, comes down the ramp. He\ndeposits it in the trunk and then walks precariously back up\nthe ramp, having difficulty navigating the incline.\n\nHe goes back into the house for one last bag. When he comes\nout, he's surprised by what he sees --\n\n                    FRANKLIN (O.S.)\n          Where do you think you're going?\n\nFranklin is being pushed by Roy in his wheelchair. They are\nboth dressed in pajamas and bathrobes, though Franklin has a\nblanket around his shoulders to shield him from the morning\nchill.\n\nTom is caught. This is everything he wanted to avoid.\n\n                    TOM\n          Going to Asheville to see my\n          parents.\n\nFrom the sight of Tom's car stuffed with luggage, it is clear\nhe is not coming back.\n\n                    FRANKLIN\n          I can't do this without you...\n          we're only just beginning.\n\n                     TOM\n          You. (You're beginning, not me.\n                a beat)\n          I've got cancer, Franklin. It's\n          spread everywhere.\n\nFranklin is stunned -- utterly thrown.\n\n                    FRANKLIN\n          I... I'll take you to the best doctors.\n          We'll go to Atlanta right now --\n\n                    TOM\n          I've seen the best doctors. When\n          you were in New York they opened me\n          up for the second time. Now I just\n          want to die in the bed I was born.\n\nFranklin is struggling with this.\n\n                    TOM\n          You're going to do great things.\n          This place has an identity now --\n          a purpose. It has you.\n\n                                                                72.\n\n     Any guard Franklin had is gone. He reaches out and takes Tom\n     by the sleeve slipping his hand into Tom's gripping it tightly.\n\n                         TOM\n               Take care of yourself, Roy.\n\n                         ROY\n               God be with you, Mr. Loyless.\n\n     Tom takes one last look at Franklin.\n\n                         FRANKLIN\n               You never pitied me. Thank you for that.\n\n                         TOM\n               On the contrary, I envy you.\n\n                         FRANKLIN\n               I will miss you all the days of my\n               life.\n\n     Tom gets into his car and looks at Franklin with a smile.\n\n                         TOM\n               Good luck, Franklin.\n\n     With a wave he slowly lurches down the long driveway and\n     turns onto the main road. Franklin watches the car until it\n     is out of sight.\n\n     INT. HYDE PARK, NEW YORK - LIBRARY - DAY\n97                                                                97\n     Sara paces wildly, waving a letter at Eleanor and Louis.\n\n                         SARA\n               He wants to use his entire trust\n               fund to buy that... leper colony!\n\n                         ELEANOR\n               Franklin has invited Louis and me\n               to see the work he's been doing.\n\n                         SARA\n                   (derisively)\n               Work! Playing in a pool all day\n               long? Squandering his birthright on\n               a group of fawning strangers? I\n               consider this your fault, Eleanor!\n\n                         ELEANOR\n               I beg your pardon, Mama?\n\n                                                             73.\n\n                         SARA\n               You have indulged him and this is\n               the result.\n\n                         ELEANOR\n                   (challenging her)\n               Indulged him? I have indulged him?\n\n     Sara looks away.\n\n                          ELEANOR\n               He's a grown man who makes his own\n               decisions.\n\n                         SARA\n               But he does not need to buy it.\n\n                         ELEANOR\n               If it's of any comfort to you, I\n               agree.\n\n                         LOUIS\n               I'm against it as well. It will\n               consume too much of his time and\n               energy.\n\n                         SARA\n               Then it is settled. We tell him no.\n\n                          ELEANOR\n               No, it is not settled. We must hear\n               him out. Louis and I must see for\n               ourselves the work that he has been\n               doing then we will all discuss this\n               further.\n                    (a beat)\n               A\n                 nd tell him no.\n\n     They all look at each other for a moment. For once they agree.\n\n                         SARA\n               Perhaps I have underestimated you.\n\n                         ELEANOR\n               Perhaps you have. But that has been\n               my fault, not yours.\n\n     EXT. MERIWETHER INN - DAY\n98                                                             98\n     Fred, on crutches, swings himself up using one side and then\n     the next under Helena's supervision.\n\n                                                           74.\n\n                    HELENA\n          Excellent, Fred! Keep going...\n\nThey are surrounded by many others, Franklin, Eloise,\nWoodhall, Pat and Jake.\n\nThe BEEPING of a car horn gets their immediate attention.\n\nRoy leaps off the porch, skipping the stairs as his brother\nPete drives up in Tom's car. He parks it and steps out.\n\n                    PETE\n          Morning, Mr. Roosevelt.\n\n                     FRANKLIN\n          Peter, what are you doing with\n          Tom's car?\n\n                    PETE\n          I was as sorry as anyone to hear\n          about Mr. Loyless's passing. Wished\n          he coulda' lived to see this!\n\n                    FRANKLIN\n          What are you talking about?\n\n                    PETE\n          Mr. Loyless had me come up and\n          fetch this right after he brung it\n          to Asheville. \"Pete, he said, \"Take\n          this home and fix it up for Mr.\n          Roosevelt.\"\n\n                    FRANKLIN\n          Pete... I can't drive a car.\n\n                    PETE\n          You can now.\n\nRoy opens the passenger door and lifts Franklin into the\ndriver's seat.\n\n                    PETE\n          Get on in and I'll teach ya'!\n\nHe begins showing off a system of pulleys and levers that\nhave been attached to both pedals. They thread through holes\nin a second dashboard, attached to polished wood knobs.\nIt's a hand-controlled automobile.\n\n                    PETE\n          That one there is your brake.\n\n                                                               75.\n\n                          FRANKLIN\n                Got it.\n\n                          PETE\n                And this here's the gas.\n\n                          FRED\n                Hot damn! You got hand controls.\n\n                          PAT\n                That is a thing of beauty!\n\n      Franklin begins running his hands over the polished wood knobs.\n\n                          PETE\n                Now you got to push it real smooth\n                or it goes all herky-jerky.\n\n      Franklin excitedly turns the key and starts it up.\n\n                          PETE\n                Wait, Mr. Roosevelt, you're not\n                ready to drive yet!\n\n                          FRANKLIN\n                Oh, yes I am!\n\n      Franklin hits the gas as the car begins HALTING and JERKING\n      the whole way down the driveway. Pete is yelling out\n      instructions but Franklin ignores him.\n\n      They all watch as he pulls away.\n\n      As the car hits the end of the driveway Franklin reaches\n      across Pete and opens his passenger door pushing him out.\n      Franklin tears off alone -- out on his first solo spin.\n\n      OVER MUSIC:\n\n      EXT. COUNTRY ROAD - DAY\n99    F                                                             99\n       ranklin is driving by himself with the top down, thrilled to\n      be moving on his own. No one is pushing him. He's free. The\n      car covers miles of farmland, passing pine forests, peach\n      orchards and cotton fields.\n\n                                                     DISSOLVE TO:\n\n      EXT. BULLOCHVILLE TRAIN STATION - MORNING\n100                                                               100\n      A spent and anxious Eleanor, with Louis in tow, stands on the\n      station platform, suitcase in hand.\n\n                                                                 76.\n\n                          LOUIS\n                It's a far cry from Grand Central\n                Station.\n\n      They are both silent for a moment.\n\n                          ELEANOR\n                The wire said someone would be here\n                to pick us up.\n\n      The sounds of tires screeching and a car horn cause them to\n      turn around.\n\n      It is Franklin, sitting in the driver's seat of his car.\n\n                          FRANKLIN\n                Your chariot awaits, Madame!\n\n      Louis promptly drops the luggage. Then he and Eleanor walk\n      over to the car, taking in the hand-controls.\n\n                          LOUIS\n                When did you learn to drive this\n                thing?\n\n                           FRANKLIN\n                Tuesday!\n\n101                                                               101\n      EXT. COUNTRY ROAD - DAY\n\n      Franklin drives wild and fast. Louis hat flies right off his\n      head. Eleanor just holds on.\n\n      EXT. MERIWETHER INN - DAY\n102                                                               102\n      Franklin, Eleanor and Louis pull up to the Inn. Though the\n      brush has been cleared and the trees are newly trimmed, it's\n      still a wreck. Franklin is too proud to concede Louis and\n      Eleanor's disappointment.\n\n                          FRANKLIN\n                Can't wait to give you the tour!\n\n      EXT. GROUNDS - DAY\n103                                                               103\n      Franklin wheels himself along the circular driveway, pointing\n      things out, almost manic in his energy.\n\n                          FRANKLIN\n                A small schoolhouse will go there.\n                We need it badly as many of the\n                children are barred from the local\n                schools due to their infirmities.\n\n                                                                 77.\n\n      He points to a dilapidated gardener's shed.\n\n                          FRANKLIN\n                We also require a blacksmith's shop\n                so we can craft braces here on the\n                premises. I've found a wonderful\n                local man who can make crutches and\n                canes. His work is outstanding. Of\n                course what is most desperately\n                needed is a hospital. That's going\n                to put my fund raising abilities to\n                the test.\n\n      Franklin wheels himself up a ramp to the Inn as Eleanor and\n      Louis follow.\n\n      INT. LOBBY - CONTINUOUS\n104                                                               104\n      Surrounded by peeling wallpaper and threadbare furniture\n                           E\n      Eleanor and Louis exchange glances.\n\n                           LEANOR\n                What exactly are you proposing,\n                Franklin?\n\n                          FRANKLIN\n                That this will be the first polio\n                rehabilitation and treatment center\n                in the world. My personal trust\n                almost covers the price of the Inn\n                and the surrounding land. There\n                will be a modest tuition charged to\n                the patients which should hold us\n                over while I seek out investors.\n\n                          LOUIS\n                Franklin, you're risking everything\n                you have...\n\n                          ELEANOR\n                And there are other costs to\n                consider.\n\n                          FRANKLIN\n                Mama will see that the children are\n                provided for.\n\n                          ELEANOR\n                I'm not speaking of money.\n\n                                                78.\n\n                    FRANKLIN\n          I have found something here which\n          makes waking up in the morning\n          remotely bearable and the two of\n          you stand there...\n\n                    ELEANOR\n          Franklin, I need for you to be\n          practical and realistic.\n\n                    FRANKLIN\n              (furious)\n          Practical? I am trapped inside a\n          body that no longer moves of my own\n          volition. I am trying to be\n          practical. Now either you're with\n          me or against me. In or out!\n\n                    ELEANOR\n          I don't care for ultimatums\n          disguised as debate.\n\nEleanor starts to leave.\n\n                     FRANKLIN\n          Where are you going? Eleanor! Get\n          back here.\n\n                    ELEANOR\n          I will see you gentlemen tonight.\n\nShe leaves.\n\n                    LOUIS\n          You can't talk to her like that.\n\n                    FRANKLIN\n          Oh really? Are you an expert on\n          this now? How should I speak to my\n          wife, Louis?\n\n                    LOUIS\n          With the respect she deserves.\n              (a beat)\n          Look, I don't deny the work you're\n          doing here could be important --\n\n                      FRANKLIN\n          Could be?\n\n                                                              79.\n\n                          LOUIS\n                The issue is whether you want to\n                run a rehabilitation center or\n                whether you want to run for office\n                again.\n\n                          FRANKLIN\n                When I can walk, I'll run.\n\n      EXT. POOL - DAY\n105                                                            105\n      Eleanor approaches the pool. It is as quiet as a church. She\n      is stunned to observe over a dozen tables set up in the\n      water.\n\n      On each table is a child or an adult polio wearing their\n      bathing suit. Next to them is a Physical Therapist also in\n      bathing attire conducting therapy. In hushed tones the\n      Physical Therapists encourage and work the distressed limbs\n      of the patients as Helena swims to each table overseeing the\n      work being done.\n\n      Eleanor sits down in a chair and watches fascinated.\n\n      INT. DINING ROOM - EVENING\n106                                                            106\n      The camera pans various tables revealing legs in braces,\n      legs in wheelchairs, shapely legs, flaccid legs, children's\n      legs... some reveal illicit romances, betrayed by secret\n      hand holding and hands on thighs.\n\n      Jake and a new physical therapist, MARY BETH, are\n      particularly cozy.\n\n                          FRANKLIN (O.S.)\n                This is a very special night we're\n                celebrating. At last we are together\n                eating in this dining room!\n\n      The hands come up and out from under the table, applauding.\n\n      ON FRANKLIN\n\n      He is in his wheelchair dressed in a jacket and tie.\n\n                          FRANKLIN\n                Now please join me in welcoming\n                Miss Jackie Mills, a new arrival\n                along with her father, Samuel, all\n                the way from Oakland, California.\n\n                                                        80.\n\nCLOSE-UP ON JACKIE\n\nEight years old with black hair. Her legs are in braces and\nshe grips her father's hand tightly.\n\nON FRANKLIN\n\n                    FRANKLIN\n          Let us also take this opportunity to\n          welcome our two able-bodied guests,\n          Mr. Louis Howe and my better half,\n          Mrs. Franklin Roosevelt.\n\nON ELEANOR AND LOUIS\n\nWaving politely from their seats.\n\n                     FRANKLIN\n          Now for the musical portion of our\n          program...\n\n                    JAKE\n          Wait a minute! I can't let this\n          opportunity pass without saying out\n          loud what a lot of us feel in our\n          hearts right now.\n              (a beat)\n          You're a man among men, Franklin.\n\n                       A WOMAN'S VOICE\n          And women!\n\n                    DAISY\n          And children!\n\n                    JAKE\n              (laughing)\n          It's a real democracy at Warm\n          Springs -- everybody gets heard!\n              (to Franklin)\n          You listening?\n\nEleanor, seated next to Franklin, watches as Franklin, in a\nrare moment of emotional nakedness, is at a loss for words.\n\n                     JAKE\n          All right then, if I may do the\n          honors of presenting to you the\n          lovely Miss Eloise Hutchison of\n          Cottage C.\n\nEloise wheels herself out. In a sweet, but untrained voice,\nshe begins the introduction to her song:\n\n                                                        81.\n\n                     ELOISE\n               (singing)\n          \"Think of what you're losing by\n          constantly refusing to dance with me.\n          Y\n          Aou'd be the idol of France with me.\n            nd yet you stand there\n          And shake your foolish head dramatically,\n          W\n            hile I sit here so ecstatically.\n          You just look and say emphatically:\n          Not this season!\n          There's a reason!\"\n\nSome members of the audience begin to smile, knowing what's\ncoming. Various STAFF step out from the kitchen to watch.\n\nEloise is joined by three others -- all of them in wheelchairs.\n\n                    ELOISE & CHORUS\n              (singing)\n          \"I won't dance! Don't ask me!\n          I won't dance! Don't ask me;\n          I won't dance, monsieur, with you.\"\n\nSimple, but clever choreography utilizing the wheelchairs,\nhas the audience cheering.\n\n                    ELOISE & CHORUS\n          \"My heart won't let my feet do\n                    C\n          things they should do.\"\n\n                     HORUS\n          \"You know what? You're lovely.\"\n\n                    ELOISE\n          \"And so what? I'm lovely.\"\n\n                    CHORUS\n          \"But oh! What you do to me!\n          I'm like an ocean wave that's\n          bumped on the shore;\n          I feel so absolutely stumped on the\n          floor!\"\n\nThis is too much for the crowd, including Franklin, Eleanor\nand Louis. They laugh and cry in equal measure at the sight\nof Eloise and her Chorus.\n\nThe song finished, Franklin quiets down the crowd.\n\n                                                                 82.\n\n                           FRANKLIN\n                 Before we say good night,\n                 I understand our Royal-Taskmaster-\n                 in-Residence, Miss Mahoney, insists\n                 on having the last word.\n\n      Helena rises from her seat.\n\n                           HELENA\n                 I don't think words describe\n                 adequately what Daisy and I would\n                 like to show all of you.\n                     (calling out)\n                 Are you ready, Daisy?\n\n      Daisy's mother, Cecile, carries Daisy to the center of the\n      room where Helena meets them. Helena bends down and removes\n      Daisy's braces.\n\n      The room is hushed.\n\n      Daisy then begins to WALK tentatively towards her mother.\n\n      ON FRANKLIN\n\n      Overwhelmed by what is taking place. He looks around and\n      takes in the sight of so many different faces...\n\n      Some are beaming, some are fighting back tears, some look\n      away... the sight of it almost too painful... a reminder of\n      their own private battles.\n\n      ON DAISY\n\n      Only a step or two away from her mother she FALLS the short\n      distance and lands in her mother's outstretched arms.\n\n      WILD CHEERS go up in the room while Daisy's face glows with\n      pride. She connects with Franklin, who matches her smile with\n      his own -- genuine and beatific.\n\n      INT. COTTAGE - BEDROOM - NIGHT\n107                                                               107\n      Roy lifts Franklin out of the wheelchair and on to the bed.\n\n      Eleanor enters holding a lit candle.\n\n      Roy is about to begin Franklin's bedtime routine, but Eleanor\n      gently reaches out and touches him on the arm.\n\n                            ELEANOR\n                 Let me.\n\n                                                          83.\n\nRoy looks to Franklin, who nods it's all right, and exits.\nEleanor closes the door and puts the candle on the bureau.\nA\n fter a beat, Franklin begins to unbuckle his pants. He then\nlies back on the bed.\n\n                    ELEANOR\n          What is your most pressing concern?\n\nEleanor kneels before him and tugs the pants down, slowly, so\nas not to catch on the braces.\n\nEleanor folds the pants and carefully places them over the\nback of a chair.\n\n                    FRANKLIN\n          Getting a doctor to live on the\n          premises full-time. Someone who,\n          at the very least, could monitor\n          our progress. Make us legitimate.\n\nShe begins to take off Franklin's braces -- a series of\nintricate buckles.\n\nEleanor slides the braces off his legs. His legs, though now\ndeeply tanned are withered and spindly. He is still wearing\nhis shoes.\n\n                    ELEANOR\n          And that costs more money.\n\n                    FRANKLIN\n          Yes.\n\nEleanor puts the heavy braces against the wall and kneels\nonce again to untie his shoelaces.\n\n                    FRANKLIN\n          But the real problem is no one is\n          interested. The annual Orthopedics\n          Convention is being held in Atlanta\n          this weekend and I offered to\n          speak.\n              (his anger surfacing)\n          They turned me down flat.\n\nEleanor takes Franklin's pajama bottoms off the bed and with\ntender care pulls them up his legs.\n\n                                                          84.\n\n                    ELEANOR\n          A few weeks ago, the conditions at\n          a garment factory on West 27th\n          Street were brought to my\n          attention. The owners claimed\n          everything was satisfactory, but\n          would never let anyone in to\n          conduct a proper inspection.\n\nShe reaches for Franklin's hands and pulls him up to a seated\nposition. They are now face to face.\n\n                    ELEANOR\n          It took awhile, but we finally got in.\n\n                    FRANKLIN\n          We?\n\nHe searches her face for clues as to the woman she's become.\nHe starts to unbutton his shirt and put on his pajama top.\n\nEleanor sits in a chair across from him.\n\n                    ELEANOR\n          I showed up with someone from the\n          Labor Board and we refused to leave\n          until they let us in.\n\n                    FRANKLIN\n          What are you suggesting?\n\n                    ELEANOR\n          At the risk of my good standing\n          with the Junior Assistance League,\n          I suggest we crash the party.\n\nShe stands and walks over to Franklin and runs her hand\nthrough his hair.    E\n                     LEANOR\n          Good night, Franklin.\n\nShe goes to the door and opens it letting in a shaft of light\nagainst the candle-lit room.\n\n                    FRANKLIN\n          Good night, Babs.\n\nShe blows the candle out and closes the door.\n\n                          E\n\n\n\n\n                                                              85.\n\n      EXT. ATLANTA STREET - DAY\n108                                                            108\n      Franklin's car pulls up to a massive stone building built in\n      Greek revival style. Franklin looks intimidated -- there are\n      two dozen stairs leading up to the main entrance.\n\n      EXT. CONVENTION CENTER - CONTINUOUS\n109                                                            109\n      Roy climbs the stairs like a stevedore with Franklin slung\n      over his shoulder. Using enormous force, Eleanor is pulling\n      the chair up and over each step while walking backwards up\n      the stairs.\n\n      INT. AMPHITHEATER - DAY\n110                                                            110\n      The stage is lit with a skeleton hanging on a stand and large\n      projections on a screen of spinal discs while a DOCTOR, in a\n      dull litany, intones a prepared speech.\n\n                          DOCTOR\n                A clinical situation where the\n                radicular or nerve root is\n                compressed by the prolapsed disc is\n                referred to as a radiculopathy.\n\n      Double doors fly open with a BANG as all heads turn to see\n      Franklin and Eleanor.\n\n                          ELEANOR\n                So sorry we're late!\n\n                          FRANKLIN\n                Good afternoon!\n\n      Eleanor talks quickly while wheeling Franklin down the aisle.\n\n                          ELEANOR\n                    (introducing herself)\n                Eleanor Roosevelt, niece of the\n                late President Theodore Roosevelt\n                and this is my husband, Franklin,\n                former Assistant Secretary of the Navy.\n\n                          FRANKLIN\n                    (sotto to Eleanor)\n                Are you sure this worked on 27th\n                Street?\n\n                           LEANOR\n                    (under her breath)\n                It seemed to at the time.\n\n                                                          86.\n\nThey reach the befuddled Doctor on stage whose name tag\nreads, \"Dr. Bissell.\"\n\n                     ELEANOR\n           Thank you, Dr. Bissell for agreeing\n           to let us share the stage with you\n           today. It was so generous of you.\n\nDr. Bissell smiles limply, saving face. The audience vaguely\napplauds. Franklin and Eleanor are now center stage.\n\n                     ELEANOR\n           My husband, as many of you may have\n           read, is a victim of polio.\n           However, victim is only a\n           definition, not a state of mind.\n           Franklin?\n\nHe looks at her completely amazed. Eleanor gives him an\n                     F\nencouraging nod to take over.\n\n                      RANKLIN\n           We all know that poor circulation\n           is a chronic problem for limbs\n           damaged by polio... I've never been\n           able to swim more than a few\n           minutes without becoming too cold.\n           But there's a place, gentlemen...\n           a miraculous place not three hours\n           from here where the water is filled\n           with natural minerals at a\n           temperature of almost 90 degrees.\n           That place, gentlemen, is called\n           Warm Springs.\n\nCLOSE-UP\n\nOne DOCTOR in particular, 60's, leans forward in his chair,\nlistening with great interest.\n\n                     FRANKLIN\n           Patients can stay in these waters\n           for up to an hour. This is\n           essential in allowing them the time\n           to work on strengthening their\n           muscles.\n\n                     ELEANOR\n           We have come to the shared\n           conclusion that research for the\n           cause and the cure for infantile\n           paralysis is paramount.\n                     (MORE)\n\n                                                              87.\n                However, until NOR(cont'd)\n                          ELEA that day arrives\n                more emphasis has be placed on\n                rehabilitation. We personally\n                invite you to Warm Springs to come\n                and take a look. Thank you.\n\n      ON THE AUDIENCE\n\n      These \"men of science\" are mesmerized by Eleanor's style,\n      both warm and immediate. She has disarmed them with her lack\n      of pretension.\n\n      ON FRANKLIN and ELEANOR\n\n      Their two separate journeys intersecting -- lightning in a\n      bottle.\n\n      INT. LOBBY - DAY\n111                                                            111\n      There is a receiving line in place to get a last word or an\n      autograph with Franklin and Eleanor. DR. WILLIS,\n      bespectacled, speaks with them.\n\n                          DR. WILLIS\n                I saw you speak at the Legion Hall\n                in Cleveland last Spring.\n\n                          ELEANOR\n                For the League of Women Voters?\n\n                          DR. WILLIS\n                You created quite a stir. Not sure\n                you'll be asked back.\n\n      Franklin is ready to intervene but Eleanor puts her hand on\n                           E\n      his shoulder stopping him.\n\n                           LEANOR\n                    (all smiles)\n                Well, I believe you must say what\n                you feel in your heart -- what you\n                feel is right, for you'll be\n                criticized anyway. Damned if you do\n                -- damned if you don't.\n\n      DR. HEBERT, military in bearing -- the doctor who listened so\n      intensely -- steps up in line and shakes hands with Eleanor\n      and then Franklin.\n\n                          DR. HEBERT\n                Dr. Peter Hebert. I've been doing\n                my own studies in this area.\n                          (MORE)\n\n                                                              88.\n                          DR. HEBERT(cont'd)\n                If it is possible I'd like to come\n                and make an evaluation for the\n                Journal of Orthopedic Medicine.\n\n      Franklin looks to Eleanor, elated.\n\n                          FRANKLIN\n                The sooner the better.\n\n      EXT. FRANKLIN'S CAR - TWILIGHT\n112                                                               112\n      Roy is fast asleep tucked around the wheelchair in the back\n      seat.\n\n      Franklin smiles in Eleanor's direction. She looks back at him\n      shyly and smiles in return. But her expression changes when\n      she sees something in his eyes -- something she hasn't seen\n      for a long time.\n\n                          ELEANOR\n                What is it?\n\n                          FRANKLIN\n                    (a beat)\n                Who are you?\n\n      Franklin reaches out and takes her hand, pulling her close.\n      He stretches his whole arm around her and places her hand on\n      one of the driving knobs, his hand on top of hers.\n\n                          ELEANOR\n                I don't know how to drive.\n\n                          FRANKLIN\n                I'll teach you.\n\n      They operate the car together -- their connection complete.\n\n      EXT. TRAIN STATION - DAY\n113                                                               113\n      Franklin and Eleanor are sitting in the front seat of the\n      car. Louis is already up on the train platform.\n\n                          ELEANOR\n                I'll break the news to Mama.\n\n      Franklin smiles as they look at each other like two naughty\n      children.\n\n                          ELEANOR\n                I think it's going to be fun.\n\n      Eleanor bursts out laughing, Franklin joins in.\n\n                             F\n\n\n\n\n                                                               89.\n\n                          FRANKLIN\n                Babs... words fail me.\n\n                          ELEANOR\n                You? Franklin Roosevelt?\n\n      She leans in and kisses Franklin on the mouth.\n\n                          ELEANOR\n                I do so love you.\n\n      She slides out of the car and goes up to the platform and\n      A\n      boards the train while Franklin watches her.\n\n        Farmer and his Wife from the school house graduation\n      approach Franklin.\n\n                           ARMER\n                Mr. Roosevelt you lookin' mighty fit.\n\n                          FARMER'S WIFE\n                Fine day, isn't it.\n\n                           FRANKLIN\n                It is. How's the Boll Weevil\n                situation?\n\n                          FARMER'S WIFE\n                I expect the Boll Weevil is always\n                gonna be a situation, Mr.\n                Roosevelt, but thanks for askin'.\n\n      Franklin's energy and vitality are infectious. The politician\n      within him is being reborn.\n\n      INT. TRAIN CAR - DAY\n114                                                               114\n      A beaming Eleanor sits down next to Louis. He too is looking\n      very pleased. Eleanor takes notice.\n\n                          ELEANOR\n                Why do I get the feeling we're not\n                smiling about the same thing?\n\n      The train begins pulling out.\n\n      They both look out at Franklin. Locals are coming up to his\n      car surrounding him -- he is a magnet.\n\n                          LOUIS\n                He's ready.\n\n                                                              90.\n\n      INT. STATE ASSEMBLY, N.Y. - VIEWING SECTION - DAY\n115                                                               115\n      Louis is seated in the front row of the balcony of the State\n      Assembly, his feet up on the railing, eating pistachio nuts.\n\n      Also seated are two politicos, JAMES HASTINGS and STEPHEN\n      TELLER.\n\n                          HASTINGS\n                You can't kiss babies from a\n                wheelchair. It'll scare their\n                mothers half to death.\n\n                          TELLER\n                Al Smith's got a lock on the\n                presidential nomination.\n\n                          LOUIS\n                Correct me if I'm wrong, but don't\n                you think even after all these\n                years that old Al's still a little\n                rough around the edges?\n\n      They laugh knowing this is a huge understatement.\n\n                          LOUIS\n                Franklin can help soften his image.\n\n                          HASTINGS\n                How?\n\n                          LOUIS\n                Let him put Smith's name in\n                nomination.\n\n      Teller and Hastings are none to sure.\n\n                          TELLER\n                Well, he is a helluva speech maker.\n\n                          HASTINGS\n                Yeah, but is your man up to it?\n\n                          LOUIS\n                It's in the bag, guys. Count on it.\n\n      Bluffing is one of Louis's strong suits and it looks like\n      they're buying it.\n\n      Just then, Louis notices a familiar face down on the floor.\n\n      I\n\n\n\n\n      S\n\n\n\n\n                                                               91.\n\n                          LOUIS\n                Hey, Stansbury, give my best to the\n                Misses!\n                    (to Hastings and Teller)\n                He's lost weight. Must've been the\n                prison food.\n1\n      INT. MERIWETHER INN - HALLWAY - MORNING\n 16                                                               116\n      A line stretches outside with patients waiting to be seen.\n      Among them is Franklin, chatting with everyone else,\n      expecting and receiving no priority attention.\n\n      INT. MERIWETHER INN - DAY ROOM - MORNING\n117                                                               117\n      Dr. Hebert is examining Daisy. Helena is by his side, filling\n      him in on her case history.\n\n      INT. MERIWETHER INN - NIGHT\n118                                                               118\n      Helena, dressed in a robe, walks the halls of the Inn.\n      Something is amiss.\n\n      EXT. GROUNDS - NIGHT\n119                                                               119\n      An empty wheelchair, illuminated by a sliver of moonlight.\n\n      On a blanket nearby are Jake and Mary Beth.\n\n       he unbuttons his shirt and runs her hands over his\n      impressively developed upper body. They begin to kiss\n      hungrily, passionately -- completely in their own world.\n\n      Several yards away, across the lawn, Eloise is in\n      Woodhall's arms -- they are dancing. He is singing softly\n      into her ear as they sway, her feet never touching the ground.\n\n       NT. MERIWETHER INN - NIGHT\n\n      Helena, in a nightgown, is looking out a window into the\n      distance. Fiercely protective and slightly envious of her\n      charges, she pulls a pack of cigarettes from her bathrobe\n      pocket and steals a solitary smoke.\n\n      EXT. COTTAGE - NIGHT\n120                                                               120\n      Franklin seated alone on the porch in the darkness. He drags\n      on his cigarette and the red glow illuminates the contours of\n      his face in repose.\n\n                                                      FADE OUT:\n\n                                                              92.\n\n      INT. MERIWETHER INN - FRONT DESK - DAY\n121                                                            121\n      Franklin is on the phone. Roy stands by his side.\n\n                          FRANKLIN\n                Hello, Souders. How are you?...\n                Couldn't be better. I was wondering\n                if you'd found a buyer for my naval\n                prints?\n                    (clearly not)\n                I see. Well, they're in marvelous\n                condition... All right, Souders. Oh\n                one more thing... I have some\n                beautiful pieces of my\n                Grandfather's -- T'ang Dynasty...\n                Really?... An auction in the Fall?\n                That sounds promising. I'll be in\n                touch.\n\n      Franklin hangs up and sits deep in thought. He rubs his\n      perspiring forehead with the back of his hand. He looks down\n      at his hand and sees that it is shaking.\n\n      EXT. GROUNDS - DAY\n122                                                            122\n      Franklin is walking on crutches aided by Roy. Nearby, a group\n      of children practice on parallel bars with Helena.\n\n                          FRANKLIN\n                What am I going to tell these people\n                if I have to close things down?\n\n                          ROY\n                That you did the best you could.\n\n      Franklin gives Roy a look of gratitude, then notices Lionel\n      approaching with his mail bag.\n\n      Lionel hands Franklin a fistful of open envelopes.\n\n                          FRANKLIN\n                Any good news?\n\n                          LIONEL\n                Creditors are gettin' cranky.\n\n                          FRANKLIN\n                The operative word was good.\n\n                          LIONEL\n                Oh, yah, almost forgot. The doctor\n                that came and studied ya'll sent\n                his report.\n\n                                                              93.\n\n      Lionel offers up the envelope, but then pulls it back before\n      handing it over.\n\n                          LIONEL\n                Save me the stamps?\n\n      Franklin nods then grabs it from Lionel. He rips it open and\n      begins devouring the report.\n\n                            FRANKLIN\n                     (reading)\n                \"... therefore, in conclusion, my\n                research has shown that the\n                overwhelming majority of patients\n                here have shown some improvement.\n                Enough for me to recommend warm\n                water therapy as the standard post\n                polio treatment to the Orthopedics\n                Society of America!\"\n                     (\n                       he grips Roy's arm)\n                Roy!\n\n      Something catches Franklin's eye and his smile begins to fade.\n\n                          ROY\n                What is it, sir?\n\n      INT. COTTAGE - NIGHT\n123                                                               123\n      Helena entering the cottage.\n\n                          HELENA\n                It's not as bad as you think.\n\n      Franklin slams the door behind her and wheels over to the\n      table. He throws back a drink -- clearly not his first.\n\n                          FRANKLIN\n                Read it. Out loud. Page twenty-nine.\n\n                          HELENA\n                I already...\n\n                          FRANKLIN\n                    (angrily)\n                Read it!\n\n                          HELENA\n                \"Of the twenty three patients examined\n                only one, a forty-four year old male,\n                showed little visible signs of\n                improvement...\" This is one doctor's\n                opinion, Franklin.\n\nH\n\n\n\n\n                                                          94.\n\n                    FRANKLIN\n          Keep reading.\n\n                    HELENA\n          \"There is marked falling away of\n          the muscle masses on either side of\n          the spine in the lower lumbar\n          region. His lower extremities\n          present a most depressing picture.\"\n\nShe brings the pages down, but Franklin gestures her to\ncontinue.\n\n                    HELENA\n          \"I feel after studying him that the\n          psychological factor in his\n          management is paramount. He has\n          such courage and ambition. Yet at\n          the same time he is such an\n          extraordinarily sensitive emotional\n          mechanism...\n\nIt is difficult for her to continue.\n\n                    FRANKLIN\n          Please.\n\n                    HELENA\n          ... that it will take all the skill\n          which we can muster to lead him\n          successfully to a recognition of\n          his severe physical limitations\n          without crushing him.\"\n\n                    FRANKLIN\n          Patronizing son-of-a-bitch! I\n          wanted to walk again.\n\n                    HELENA\n          And you still might. This report\n          legitimizes we've worked so hard\n          for. We can raise funs now. It\n          could change everything!\n\n                    FRANKLIN\n          It won't change anything for me.\n\n                    HELENA\n          Franklin, I won't play this game. I\n          won't feel sorry for you.\n\n e reaches for the bottle, but Helena grabs on to it,\nstopping him.\n\n                                                        95.\n\n                     HELENA\n          I met a boy today, ten years old.\n          He's paralyzed from the waist down.\n          Why don't you go regale him with\n          vivid tales about your trips to\n          Europe and playing football at\n          school. Tell him how you courted\n          your wife and fathered children.\n          Tell him of a life he can only\n          dream of.\n              (\n                a beat)\n          I can't help you out of a hole if I\n          climb in with you. Then we're both\n          stuck.\n\nINT. MERIWETHER INN - FRONT DESK - DAY\n\nFred, wearing a bow tie and an oversized jacket, is proudly\npolishing off a desktop sign that reads: \"FRED BOTTS:\nDIRECTOR OF ADMISSIONS.\"\n\nHelena is behind him reading a file.\n\n                    LIONEL\n              (entering)\n          Here's another one he's refusin'.\n\nHe throws a telegram onto an already large stack.\n\n                    HELENA\n          Why don't you read it?\n\n                    LIONEL\n          Don't like telegrams. All them\n          STOPS and stuff.\n\n                    HELENA\n          Make you dizzy, Lionel.\n\n                    LIONEL\n          A little bit.\n\nFred eyes the telegram, then impulsively grabs it, ripping it\nopen.\n\n                    FRED\n          \"Would be honored if you place my\n          name in nomination for President.\n          STOP. The party needs you. STOP.\n          Yours sincerely, Al Smith.\"\n\n                      LIONEL\n          Who's he?\n\n                    (\n\n\n\n\n                                                                96.\n\n                          HELENA\n                The Governor of New York.\n                     handing it to Lionel)\n                Why don't you slide it under\n                his door?\n\n                          LIONEL\n                All right. Probably slide it\n                right back.\n\n      Lionel leaves. Fred and Helena are silent for a moment.\n\n                          FRED\n                He won't go. He doesn't want to be\n                seen walking on crutches or being\n                wheeled to the podium.\n\n                          HELENA\n                The millions listening on radio\n                won't be able to see that.\n\n                          FRED\n                But all the people at the\n                convention will.\n\n      Helena nods, \"That's right.\"\n\n                                                        CUT TO:\n\n      INT. COTTAGE - AFTERNOON\n125                                                              125\n      Responding to a knock at the door, Roy gets up from sitting\n      on the couch with Franklin, sullen and inattentive.\n      H\n       e opens the door to Louis who walks right in.\n\n                          ROY\n                Good afternoon, Mr. Howe.\n\n                          LOUIS\n                Hello, Roy.\n\n      Roy takes his hat and coat and exits to the bedroom.\n\n                          LOUIS\n                I can't believe you've made me come\n                all the way back to this hell hole!\n\n                          FRANKLIN\n                I've done no such thing.\n\nF\n\n\n\n\n                                                        97.\n\n                    LOUIS\n          I'm here to take you to Houston.\n          You started your speech yet?\n\n                    FRANKLIN\n          I'm not going.\n\nHe stares at Franklin, drinking. Shaking his head, he goes\nover to the sidebar and pours one for himself.\n\n                    LOUIS\n          You know what this is, don't you?\n          It's a golden opportunity. A\n          springboard for you to run for\n          Governor.\n\n ranklin is silent. Frustrated, Louis takes a seat in\nFranklin's empty wheelchair.\n\n                    LOUIS\n          Ever hear of a Civil War General\n          named Francis Nicholls?\n\n                    FRANKLIN\n          No.\n\n                    LOUIS\n          Well, I never heard of him either.\n          But this was one brave son-of-a-\n          bitch. Fought for the Confederacy\n          and lost his left arm in one battle\n          and his left foot in another. Then\n          after the war he ran and won the\n          Governorship of Louisiana -- twice!\n\n                    FRANKLIN\n          He was a war hero.\n\n                    LOUIS\n              (with emphasis)\n          Twice.\n              (a beat)\n          Look, I've worked like a dog to\n          keep your name in play, grovelling\n          at the feet of the powers-that-be\n          in back rooms.\n\n                    FRANKLIN\n          As much for you as for me.\n\n                                                              98.\n\n                          LOUIS\n                I'll be damned if I'm going to let\n                you pass up a chance like this.\n                It's time -- and you're ready.\n\n      EXT. COTTAGE - AFTERNOON\n126                                                               126\n      Waiting on the porch are Eleanor and Helena, who are seated,\n      talking. Louis exits the cottage, defeated.\n\n                             LOUIS\n                Your turn.\n\n      Eleanor rises and goes into the cottage as Louis takes her\n      seat next to Helena.\n\n      INT. COTTAGE - CONTINUING\n127                                                               127\n                          ELEANOR\n                Roy, so good to see you.\n\n                           ROY\n                Very good to see you, Mrs.\n                Roosevelt.\n\n      She approaches a surprised Franklin. Leaning in, she runs a\n      hand across his stubbly beard. He looks up at her.\n\n                          ELEANOR\n                You're a mess.\n\n                          FRANKLIN\n                The report. I'll never...\n\n      She sits by his side and Franklin begins to cry. His sobs\n      grow louder connecting to the despair deep inside him. It\n      unleashes an avalanche of grief.\n\n                          ELEANOR\n                Oh my darling...\n\n                          FRANKLIN\n                I'm useless, Eleanor. I feel so\n                useless.\n\n                          ELEANOR\n                That's not true. No one can make\n                you feel inferior without your\n                consent.\n\n      Finally, his sobs subside.\n\n      F\n\n\n\n\n                            E\n\n\n\n\n                                                              99.\n\n                          ELEANOR\n                You have done a brilliant thing\n                here -- a magnificent thing.\n\n      Eleanor picks up the E\n                           doctor's report and puts it in the fire.\n\n                           LEANOR\n                Let's get you in the water.\n\n      EXT. THE POOL - DAY\n128                                                               128\n      Franklin is wheeled down to the pool by Roy and Eleanor. When\n      they get closer, Franklin makes out someone already swimming.\n\n                            ELLIOT\n                Hi, Pop!\n\n                          FRANKLIN\n                   (squinting)\n                Who's that?\n\n      ELLIOT ROOSEVELT is now 17 years old. He has his mother's\n      enormous blue eyes and his father's natural charisma.\n\n                            FRANKLIN\n                Elliot!\n\n                           LLIOT\n                Come on! You getting in?\n\n      Louis and Helena approach the pool.\n\n                          FRANKLIN\n                I sense a conspiracy.\n\n                          LOUIS\n                You ain't seen nothin' yet.\n\n       ranklin smiles, warily.\n\n      EXT. A CLEARING - DAY\n129                                                               129\n      Elliot is climbing a rope dangling high from a tree as\n      Franklin and Eleanor look up at him. Franklin is standing on\n      crutches.\n\n      Elliot descends with a flourish as Helena approaches Franklin\n      with a single cane.\n\n                          HELENA\n                Franklin, let go of your crutches.\n                You're not going to need them.\n\n                                                       100.\n\n                    FRANKLIN\n          What?\n\n                    HELENA\n          We're going to make your arms\n          function as your legs.\n\n                    FRANKLIN\n          How is that possible?\n\n                    HELENA\n          Elliot, go to your father and stand\n          on his left side.\n\n                    ELLIOT\n          Think this may work, Pop.\n\n                    HELENA\n          Eleanor, take the crutch.\n\nEleanor takes one crutch as Helena takes the other, replacing\nit in Franklin's hand with a cane.\n\nThen, with Elliot on Franklin's left side she bends Elliot's\narm at a right angle, like a parallel bar, and hooks\nFranklin's left arm around his.\n\nGoing over to Franklin's right side she puts a cane in his hand.\n\n                    HELENA\n              (to Franklin)\n          Now use your right shoulder and\n          pull your left leg forward.\n\nHe does so.\n\n                    HELENA\n          Good! Now with the muscles in your\n          left shoulder, pull your right leg.\n\n                    FRANKLIN\n          One small bump and I'll land right\n          on my keister!\n\n                    HELENA\n          That's what Elliot is for. He's\n          going to hold you up. Hitch your\n          leg! Come on!\n\nFranklin and Elliot attempt to walk. It requires immense\nstrength and effort on both their parts.\n\n                                                          101.\n\n                     HELENA\n              (ever the taskmaster)\n          Elliot, don't lean in -- stand up\n          straight. Pull against him. He\n          needs you!\n\nAfter one or two steps the enormity of it overwhelms Franklin.\n\n                     FRANKLIN\n          I can't.\n\n                    ELLIOT\n          I'm strong, pop. You can't hurt me.\n\n                    HELENA\n          You can do this, Franklin! Keep\n          going!\n\nThey start the walk again. It's awkward... difficult... but\nit's working.\n\n                    LOUIS\n              (under his breath)\n          I'll be damned.\n\nFranklin stops, exhausted.\n\n                    ELEANOR\n          Franklin, are you all right?\n\n                    FRANKLIN\n          I'm fine. I'm just...\n\nRoy runs in with a chair and helps Franklin into it as\nHelena, Eleanor, Louis, Elliot and Roy all look at him,\nconcerned.\n\n                    HELENA\n          This isn't a replacement for the real\n          work we're doing to get you on your\n          feet again, understand? No one is\n          throwing in the towel or even agreeing\n          with that doctor's report...\n\n                    FRANKLIN\n          I know, I know.\n\n                    HELENA\n          I know it's not practical --\n\n      F\n\n\n\n\n                          H\n\n\n\n\n                                                               102.\n\n                          FRANKLIN\n                No, it's not.\n                    (a beat)\n                It's political.\n\n      Franklin looks at Louis, then to Eleanor, and realizes that\n      this could be it.\n1\n      EXT. GROUNDS - AFTERNOON\n 30                                                               130\n      Franklin and Elliot are walking. Helena is close behind,\n      coaching.\n\n                           ELENA\n                Use Elliot, not the cane. Switch\n                your weight to Elliot... good! Keep\n                your head up.\n\n      Off to the side Pat, Jake, Eloise, Woodhall and Daisy are\n      having an informal picnic, observing Franklin.\n\n                          ELOISE\n                Why is he working so hard to hide it?\n\n                          JAKE\n                He doesn't have a choice.\n\n                          ELOISE\n                Oh, I disagree.\n\n                          JAKE\n                How can you disagree? \"There but\n                for the grace of God goes us,\"\n                that's what they're saying. As if\n                our bodies is who we are, but it's\n                not. It's our souls is who we are,\n                but they don't know that.\n\n                          ELOISE\n                I wish he could just wheel himself\n                out there in front of everybody.\n\n                          PAT\n                He can't do that Eloise, it's\n                politics.\n\n                          JAKE\n                It's not gonna matter if he hides\n                his legs as long as he don't hide\n                what he knows. And what he knows is\n                what it's like to be one of us.\n\n       ranklin, getting closer, raises his cane in greeting.\n\n                                                             103.\n\n                          FRANKLIN\n                Good afternoon, everyone!\n\n      Off-balance Franklin goes down hard bringing Elliot down with\n      him.\n\n      Eleanor, Louis and Roy all rush to his aid, but Helena is\n      there first.\n\n                          HELENA\n                Take a moment to catch your breath...\n\n                          FRANKLIN\n                Damn. You okay son?\n\n                          ELLIOT\n                I'm fine, Pop.\n\n                          DAISY\n                You fell down.\n\n                          FRANKLIN\n                Yes, I did, Daisy. Twelfth time\n                today. Must be a new record!\n\n      Daisy laughs as do the others, though some can't hide their\n      concern.\n\n      Franklin struggles hard as Roy and Elliot help him to his\n      feet.\n\n131                                                               131\n      INT. COTTAGE - NIGHT\n\n      Eleanor is packing Franklin's suitcase while Franklin,\n      sitting up in bed dressed in pajamas, works on his speech.\n\n                           FRANKLIN\n                    (reading aloud)\n                And so America must find...\n                    (\n                      reconsidering)\n                No, America needs a pathfinder...\n\n      Louis, pacing in shirtsleeves, nods approvingly.\n\n                          LOUIS\n                That's good.\n\n                          FRANKLIN\n                To emblaze the trail along a high\n                road that will avoid... avoid the\n                bottomless morass...\n\n      Discouraged, Franklin pushes aside the pages.\n\n                                                              104.\n\n                          LOUIS\n                What is it? What's wrong?\n\n                          FRANKLIN\n                What if I fall... trying to get to\n                the podium.\n\n                          LOUIS\n                If you fall, you show them how to\n                get up.\n\n                          FRANKLIN\n                No, if I fall in front of thousands\n                of people I lose everything but\n                their pity.\n                    (a beat)\n                They'll be writing my obituary\n                before I get up off the floor.\n\n                          LOUIS\n                Elliot won't let you fall, he'll be\n                there. All the arrangements have\n                been made, boss. It'll be fine.\n\n                          FRANKLIN\n                Who are we fooling? This will never\n                work. They'll never let me back\n                into politics. They'll never see\n                past my legs.\n\n                          ELEANOR\n                My darling, they'll never see past\n                your legs unless you do.\n\n132                                                               132\n      EXT. MERIWETHER INN - MORNING\n\n      Franklin is settling into the driver's seat of his car, aided\n      by Roy. Eleanor is seated next to him; Louis and Elliot in\n      back.\n\n      Franklin's attention is diverted by something he sees\n      straight ahead.\n\n      It is the entire Warm Springs group coming down the driveway\n      in chairs and on crutches.\n\n      All the patients, the Push Boys, the physical therapists,\n      Helena, Jake, Fred, Aunt Sally, Eloise and Lionel.\n\n                          FRED\n                Don't worry, Doc -- we're not\n                coming with you.\n\n                       F\n\n\n\n\n                                                       105.\n\n                     FRANKLIN\n          Oh, you'll be with me. No question\n          of that.\n              (a beat)\n          I am proud more than you will ever\n          know to be part of this community.\n              (his voice growing\n                stronger)\n          A community based not on birthright\n          or privilege, but on compassion and\n          courage. The true power of these\n          waters is that they brought us all\n          together. Our ability to help one\n          another is what will make our\n          victory over polio endure. Our\n          ability to survive... despite the\n          odds.\nF\n ranklin looks out at the sea of faces.\n\n                    FRANKLIN\n          What we have done and will continue\n          to do until this disease is\n          defeated is come together -- like a\n          family -- and do what we do best...\n              (his voice breaking)\n          Lift each other up.\n\nFranklin starts the car as the crowd begins to disperse.\nThen, spying Helena, Franklin calls out to her.\n\n                    FRANKLIN\n          Miss Mahoney I need to speak with\n          you, please.\n\n                       HELENA\n          Sure, Doc.\n\nOff her smile, Franklin reaches into his pocket and withdraws\na small box.\n\n                       FRANKLIN\n          Thank you.\n\nHe hands it to Helena. She just stares at it, at a loss for\nwords.\n\n                        RANKLIN\n          Open it.\n\nShe does so, tentatively, revealing a ladies watch.\n\n                                                              106.\n\n                          HELENA\n                It's beautiful.\n\n                          FRANKLIN\n                Don't wear it in the pool.\n\n                          HELENA\n                I'll try not to. Good luck,\n                Franklin.\n\n                          FRANKLIN\n                I'm throwing myself to the wolves.\n\n                          HELENA\n                You've faced worse. And if they\n                bite, you can come back here.\n\n                          FRANKLIN\n                I'll always come back here.\n\n      Helena steps away and Franklin pulls out and down the\n      driveway.\n\n                                                        CUT TO:\n\n133                                                             133\n      INT. HOUSTON TRAIN STATION - NIGHT\n\n      Dark and deserted Roy is carrying Franklin down a flight of\n      stairs. Louis is hastily checking over his shoulder. If\n      possible, Eleanor appears even more nervous than Louis.\n\n                          FRANKLIN\n                You're being superstitious, Louis.\n                There aren't any reporters here.\n\n      Suddenly out of the darkness a FLASHBULB POPS revealing a\n      dozen or more REPORTERS staring incomprehensibly at the sight\n      of a six foot, 200 lb. man being carried like a baby in the\n      arms of a black man.\n\n      No one does or says a thing. The PHOTOGRAPHER who had the\n      wherewithal to snap the one picture raises his camera to take\n      another.\n\n      But DAN REED, a reporter for The New York Herald Tribune and\n      a gentle giant at over six foot-four, reaches out and places\n      a massive hand over the lens.\n\n      Slowly, but firmly, he pulls the camera down.\n\n                            REED\n                      (\n                       quietly)\n                No.\n\n                                                             107.\n\n      Louis and Eleanor stand stock still, tense, watching the\n      scene unfold\n\n      Roy is sweating; his arms growing weak. Elliot brings the\n      chair around and Roy gently lowers Franklin into it.\n\n      It's a measure of Reed's standing with this group that his\n      authority is unquestioned.\n\n      But the Photographer raises his camera again. Only now Reed\n      isn't as kind. He grabs the camera from him and opens the\n      back, pulling out the film and exposing it.\n\n                             PHOTOGRAPHER\n                Hey!\n\n                          REED\n                    (tipping his hat)\n                Good to see you, Mr. Roosevelt.\n\n                             FRANKLIN\n                Thank you.\n\n      INT. CONVENTION HALL - HOUSTON - NIGHT\n134                                                               134\n      The enormous arena is empty but for some maintenance WORKERS\n      and JANITORS. Louis enters and makes his way to the stage.\n\n      He approaches dead center and stands behind the podium looking\n      out. GRIPPING the podium hard he ROCKS it back and forth.\n\n      Taking no chances, he pulls a hammer out from the rear of his\n      waistband and a bunch of nails from his coat pocket.\n\n      Looking around to see if anyone is paying any attention to\n      him he quickly ducks down behind the podium.\n\n      The sound of HAMMERING fills the hall as Louis, on his knees,\n      NAILS the podium to the floor.\n\n                                                   DISSOLVE TO:\n\n      INT. CONVENTION HALL - DAY\n135                                                               135\n      Twenty thousand CONVENTIONEERS are roasting in the hall. It\n      is Houston in the summer and it's broiling hot. A sea of hand-\n      held red, white and blue fans are being waved all at once --\n      most bearing the words \"SMITH FOR PRESIDENT.\"\n\n      Near the stage is a long table where the new breed of RADIO\n      REPORTERS are seated, each in front of a primitive looking\n      microphone.\n\n                A\n\n\n\n\n                                                                108.\n\n      Hovering in a group off to the side are Dan Reed and the\n      REPORTERS from the previous night.\n\n      INT. BACKSTAGE - CONTINUING\n136                                                               136\n      Franklin is standing ramrod straight holding onto Elliot's\n      arm. He looks handsome in a navy pin-striped suit. As\n      everyone else is sweating no one notices that Franklin is\n      perspiring more than F\n                           most.\n\n                           RANKLIN\n                Where is she seated?\n\n      Louis, a human train wreck himself, reaches over to mop\n      Franklin's brow with a handkerchief.\n\n                          LOUIS\n                In a box stage left. Give me your\n                hand.\n\n      Franklin takes his hand off his cane. It's soaking wet. Louis\n      wipes it, gently.\n\n                          FRANKLIN\n                Louis, what the hell am I doing?\n\n                          LOUIS\n                Putting your big toe in the water.\n\n      Just then, a VOICE booms out from the loudspeakers:\n\n                          LOUDSPEAKER (V.O.)\n                Ladies and gentlemen, I would like\n                to introduce to you a man who as\n                Assistant Secretary of the Navy\n                served our country with distinction.\n                  member of an illustrious family\n                of long-standing political\n                commitment to our great nation...\n                Ladies and gentlemen: Franklin\n                Delano Roosevelt!\n\n      Franklin turns to Elliot and they both take deep breaths.\n\n                          FRANKLIN\n                    (to Elliot)\n                Let's go.\n\n      The curtains part and they begin moving forward.\n\n                                                             109.\n\n      INT. THE STAGE OF THE DEMOCRATIC CONVENTION - CONTINUING 137\n137\n      A BLINDING SPOTLIGHT picks up Franklin and Elliot. The\n      SPOTLIGHT follows them as they make their way to the podium.\n\n      Franklin is hitching each leg forward, slowly. The tip of his\n      cane hits the floor with pinpoint accuracy for balance and\n      support.\n\n      He leans heavily on Elliot's arm. The walk appears effortless.\n\n      He chats with Elliot the whole way, still managing to flash\n      the CONVENTIONEERS his million dollar smile. But the walk is\n      slow and the ovation is beginning to fade.\n\n138   L                                                        138\n      INT. BACKSTAGE - CONTINUING\n\n       ouis stands in the wings clutching the curtain with one hand\n      and covering his eyes with the other.\n\n      INT. DEMOCRATIC CONVENTION BOX - CONTINUING\n139                                                            139\n      Eleanor sits looking down at her lap, afraid to even breathe.\n\n      INT. THE STAGE - CONTINUING\n140                                                            140\n      Franklin and Elliot are still ten steps away from the podium.\n      Sensing the crowd noise weakening, he whispers to Elliot.\n\n                          FRANKLIN\n                Laugh as if I'm making a joke.\n\n      Elliot throws back his head and laughs. The crowd, wanting to\n      be in on it, rise as one in a sustained CHEER!\n\n      But a puddle of sweat caused by the dripping perspiration\n      from Franklin's hands is causing the tip of his cane to slip.\n\n      Elliot, ever aware, grips him tighter, averting disaster and\n      finally they reach the podium.\n\n      Franklin grabs one side of the podium while Elliot, with a\n      sleight of hand Houdini would admire, LOCKS his father's\n      braces, whisks the cane away, pulls his father's speech from\n      his breast pocket and lays it smoothly on the podium.\n\n      THE VIEW FROM BEHIND displays how Franklin's legs are spread\n      wide for stability as he clutches the podium. He holds on\n      tightly, as if the wood might snap from his grip.\n\n      FROM OUT FRONT the crowd sees only a powerful man standing\n      tall amidst the flashbulbs POPPING.\n\n                                                             110.\n\n      Franklin has made it. He is home.\n\n      INT. MERIWETHER INN - LOBBY - CONTINUOUS\n141                                                            141\n      All the denizens of Warm Springs are crowded around the radio.\n\n                           RADIO ANNOUNCER (V.O.)\n                Here on the stage is Franklin\n                Roosevelt... a figure tall and\n                proud even in suffering; a face of\n                classic profile; a frame nervous\n                and yet self-controlled. A man\n                softened, cleansed and illumined\n                with pain.\n1\n\n 42   INT. WARWICK HOTEL, HOUSTON - SMITH'S SUITE - CONTINUOUS 142\n\n      GOVERNOR AL SMITH, 51, is seated by a radio, surrounded by\n      CRONIES. An overblown Irishman with gold capped teeth and\n      heavy New York accent. He chomps on a lit cigar that never\n      leaves the side of his mouth.\n\n                          CRONY #1\n                Hell of an ovation, Al. Couldn't\n                have asked for anything more.\n\n      Smith sits silently puffing on his cigar.\n\n                          CRONY #2\n                You may have to be careful though.\n                Looks like you're raising up a rival.\n\n                          SMITH\n                    (after a beat)\n                Mark my words. He'll be dead in a year.\n\n      INT. DEMOCRATIC CONVENTION BOX - CONTINUING\n143                                                            143\n      Eleanor applauds Franklin as a REPORTER leans in.\n\n                          REPORTER\n                Mrs. Roosevelt, one last question.\n\n                          ELEANOR\n                Yes?\n\n                          REPORTER\n                Do you think polio has affected\n                your husband's mind?\n\n                          ELEANOR\n                    (smiling)\n                Yes, I do. I certainly do.\n\n                                                             111.\n\n      INT. CONVENTION STAGE - CONTINUOUS\n144                                                               144\n      Franklin stands before the crowd. His magnetism is\n      incontestable. He radiates infinite possibility.\n\n      He looks up to Eleanor's box and they smile at one another as\n      the crowd continues to applaud.\n\n                                                   DISSOLVE TO:\n\n      EXT. WARM SPRINGS - DAY\n145                                                               145\n      The mineral springs gently ripple as Franklin appears in the\n      water. As the following words appear on the screen, Franklin\n      slowly and confidently swims out of frame.\n\n                                CRAWL\n\n      Four years later, Franklin Delano Roosevelt was elected\n      President of the United States. He was elected three more\n      times -- unprecedented in U.S. History.\n\n      During his years as President, he saw the country through the\n      Great Depression and a world war waged on six continents.\n\n      On April 12, 1945, in the thirteenth year of his presidency,\n      at the age of sixty-three, Franklin Roosevelt died in his\n      cottage at Warm Springs.\n\n      The beneficiary of his $562,000 life insurance policy was\n      Warm Springs... which continues to flourish as a\n      rehabilitation center to this day.\n\n\n\n\n\nWarm Springs\nWriters :   Margaret Nagle\nGenres :   Biography  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:10.839223"}