{"title": "Watchmen", "film_link": "/Movie Scripts/Watchmen Script.html", "script_link": "/scripts/Watchmen.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Watchmen Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Watchmen.jpg\" title=\"Watchmen Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  Lengthy, but brilliant.<br/><br/>\n<b>IMSDb rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (9 out of 10)<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/8-stars.gif\"/> (7.91 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=David Hayter\" title=\"Scripts by David Hayter\">David Hayter</a><br/>  <a href=\"/writer.php?w=Alex Tse\" title=\"Scripts by Alex Tse\">Alex Tse</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Movie Release Date</b> : March 2009<br/>\n<br/>\n<a href=\"/scripts/Watchmen.html\">Read \"Watchmen\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                  WATCHMEN\n</b>\n\n\n                                 Written by\n\n                           David Hayter &amp; Alex Tse\n\n\n\n\n\n<b>          INT. EDWARD BLAKE'S APARTMENT - KITCHEN - EVENING\n</b>\n          CLOSE ON: A \"Have A Nice Day\" HAPPY FACE PIN. STEAM rises\n          past the pin. We hear a KETTLE BOILING.\n          We PULL BACK and find that the pin adorns the lapel of a ROBE\n          worn by EDWARD BLAKE, 63, but amazingly not far from his\n          physical prime--body chiseled, built like a truck. Handsome\n          too, save the LONG SCAR running down the side of his face.\n          Blake removes the kettle from the stove. He scoops some Asian\n          tea leaves from a can, dumps them in a cup .\n\n<b>          INT. EDWARD BLAKE'S APARTMENT - LIVING ROOM - EVENING\n</b>\n          The apartment is expensive but not quite luxurious. Terrific\n          New York view from the window. Blake lives well, if alone. He\n          sits on the couch with his cup of, tea, puts his feet up. Hits\n          the remote, turns the big screen TV on. The news:\n\n<b>          ANCHORWOMAN\n</b>          --addressing the United Nations today,\n          the President expressed his concern over\n          the increasingly intense territorial\n          disputes in both Asia and the Middle\n          East.\n          CUT TO: The PRESIDENT OF THE UNITED STATES--\n\n<b>          PRESIDENT\n</b>          The sound of a bullet at one end of the\n          world echoes across the ocean to the\n          other end. Armed conflict is not self\n          contained in its respective region--the\n          consequences reverberate through every\n          nation across the world and therefore\n          must be avoided at all costs.\n          CUT BACK TO: The Anchorwoman--\n\n<b>          ANCHORWOMAN\n</b>          While the President's position was clear,\n          he did not comment on whether or not he\n          would order Dr. Manhattan into action\n          should the situation continue to\n          escalate.\n          CUT TO: Stock footage of DR. MANHATTAN--a man, at least he\n          appears to be, who has glowing blue skin. The stock footage\n          shows Dr. Manhattan flying through the air as a MISSILE heads\n          straight for him.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          2.\n</b>\n<b>          CONTINUED:\n</b>          With a wave of his hand, Dr. Manhattan stops the missile in\n          its flight--frozen in mid-air--inches from his face.\n          With another wave, Dr. Manhattan DETONATES the missile. Dr.\n          Manhattan disappears in the EXPLOSION . but once the\n          smoke clears, we see he's still there. Unscathed--\n          --Blake snorts at the stock footage, changes the channel--\n          CRASH!--The FRONT DOOR EXPLODES, splintered by a KICK; Blake\n          jumps up, immediately at the ready--\n          --when we see the INTRUDER'S FEET entering. Slowly. Blake\n          sees the Intruder's face, though we never do--we only see\n          that he's dressed in ALL BLACK, including GLOVES and a KNIT\n          HAT. A look of recognition comes over Blake.\n\n<b>          BLAKE\n</b>          Just a matter of time, I suppose.\n          With sudden, blinding speed, Blake WHIPS the SAUCER from\n          under his cup, sending it FLYING like a saw-blade. The\n          Intruder BATS IT out of the air with even quicker reflexes,\n          but the act buys Blake time to pull a PISTOL with a SILENCER\n          from a hollowed out STEREO SPEAKER. He's a pro\n          . but so is our Intruder. Before Blake can get a shot\n          off, the Intruder is already upon him, SNATCHING the gun out\n          of Blake's hand--\n          --Blake PUNCHES the Intruder in the chest plate--the Intruder\n          drops the gun. Blake fights. Not like an old man, but like\n          the trained killer he is. But the Intruder is much, much\n          faster. Younger. Deadlier. He SMASHES Blake with an elbow to\n          the head.\n          Blake falls. BLOOD blurs his vision. The Intruder picks Blake\n          up off the ground. Brings him to the window with the great\n          New York view. Thirty stories up. Blake looks the Intruder in\n          the eye\n          . and starts laughing. Hysterical.\n\n<b>          BLAKE (CONT'D)\n</b>          I always thought I knew the punchline.\n          But I guess the joke's on me now.\n          He laughs. The INTRUDER seems to regard Blake a moment--\n          --then, with incredible strength, he LIFTS BLAKE OVER HIS\n          HEAD AND THROWS BLAKE THROUGH THE WINDOW. Blake never makes a\n          sound as he plummets to the sidewalk.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          3.\n</b>\n<b>          EXT. STREET - EVENING\n</b>\n          CLOSE ON: Blake's dead body. His eyes are wide open, not in\n          fear, but in resignation. As BLOOD starts to POOL behind his\n          head, we move to the happy face pin Blake wore, now on the\n          sidewalk by his neck. We slowly ZOOM IN on the pin as blood\n          DRIPS on it\n          . when the pin is WASHED AWAY.\n\n<b>          EXT. STREET - LATER (TIME CUT)\n</b>\n          A SHOPKEEPER has his HOSE out, spraying off the blood from\n          the sidewalk. Blake's body is gone, a CHALK OUTLINE in its\n          place. A COP comes running up to the Shopkeeper.\n\n<b>          COP 1\n</b>          Hey! This is still a goddamn crime scene!\n\n<b>          SHOPKEEPER\n</b>          It's been over four hours, I got a\n          business to run--\n          As they argue, we're back following the happy face pin, as\n          the water carries it to a DRAIN--\n          --when someone picks the pin up. We're in this person's POV\n          as he studies the pin for a moment before pocketing it.\n          We never see his face. We move from his POV--\n          --to across the street, arriving at a NEWS STAND. People at\n          the news stand stare at. the crime scene. At the cop still\n          arguing with the shopkeeper, the patrol cars, the yellow\n          tape. At the MEDICAL EXAMINER zipping up Blake's BODY BAG.\n          Other people at the news stand ignore the scene and peruse\n          the magazines and periodicals, most of which have\n          inflammatory headlines regarding the tense atmosphere\n          currently in the world--a Newsweek headline reads \"War?\", The\n          New York Times: \"China Moves Battleships near Taiwanese\n          Waters,\" The New York Post, over a PHOTO of the President\n          with Dr. Manhattan: \"What Me Worry?\"\n          The NEWS VENDOR notices a MAN frowning at the papers.\n\n<b>          NEWS VENDOR\n</b>          (re: headlines)\n          Depressing ain't it?\n\n<b>          MAN\n</b>          But good for business, right?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          4.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          NEWS VENDOR\n</b>          Yeah. Irony's a bitch.\n          The man pays for a newspaper when A HOMELESS MAN taps the\n          News Vendor on the shoulder.\n\n<b>          HOMELESS MAN\n</b>          The current issue of The New\n          Frontiersman, where is it?\n\n<b>          NEWS VENDOR\n</b>          It's late this month.\n\n<b>          HOMELESS MAN\n</b>          When will it be here?\n\n<b>          NEWS VENDOR\n</b>          I dunno, pal, like I said, it's late--\n          We MOVE BACK ACROSS THE STREET, to Blake's apartment\n          building, then MOVE UP the building, to the broken glass\n          window Blake was thrown out of. We MOVE INTO THE WINDOW--\n\n<b>          INT. EDWARD BLAKE'S APARTMENT - LIVING ROOM - NIGHT\n</b>\n          --inside the apartment, where DET. GALLAGHER (older, jaded)\n          and DET. FINE (street worn, but not quite cynical yet) walk\n          through the crime scene. Fine studies the broken window.\n\n<b>          DET. FINE\n</b>          Edward Blake--63 years old, six-two, 225.\n          A solid 225, guy was built like a\n          linebacker. This is plate glass too,\n          you'd have to step on the gas just to put\n          a crack in this. Had to be a two man job.\n          At least. You check the bedroom?\n\n<b>          DET. GALLAGHER\n</b>          Drawers were open, tossed through.\n          Mattress flipped.\n\n<b>          DET. FINE\n</b>          Robbery?\n\n<b>          DET. GALLAGHER\n</b>          Or made to look like one.\n          (tosses Fine an ID)\n          Found that in the bedroom.\n          Det. Fine studies it. It's Blake's UNITED NATIONS ID. It\n          reads \"Special Advisor, United States.\"\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          5.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DET. GALLAGHER (CONT'D)\n</b>          You see this?\n          He picks up a PHOTO from the floor, hands it to Fine.\n\n<b>          DET. GALLAGHER (CONT'D)\n</b>          Shaking hands with the President.\n\n<b>          DET. FINE\n</b>          You're saying this guy was a spook? You\n          think this might be a political murder?\n\n<b>          DET. GALLAGHER\n</b>          I think that this is way bigger\n          than the both of us.\n          He leaves Det. Fine to ponder this.\n\n<b>          EXT. STREET - LATE NIGHT/EARLY MORNING\n</b>\n          Outside Blake's apartment building. It's later now, the news\n          stand is closed, businesses closed, people gone.\n          We move into someone's POV. The person stares up at the\n          broken window of Blake's apartment, now covered with PLASTIC\n\n<b>          SHEETING.\n</b>\n<b>          RORSCHACH (V.0.)\n</b>          Rorschach's Journal, October 12th.\n          Earlier today I came across what appeared\n          to be a suicide. It was later learned to\n          be a homicide. Someone's time was up.\n          Still in POV, we see the person pull something from his\n          pocket--the happy face pin. We realize that this was the\n          person whose POV we were in earlier.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          I discovered a clue. Something I\n          recognized. And suddenly, unexpectedly\n          . I heard my own clock ticking.\n          We move out of the POV and see our guy for the first time--\n          RORSCHACH (roar-shock)--a masked vigilante who wears a trench\n          coat, fedora, and a silver-white MASK with oily BLACK SPOTS\n          moving about, creating shifting, doubled PATTERNS like a\n          Rorschach test. Scary looking.\n          Rorschach draws a hydraulic GRAPPLING GUN from his coat, and\n          FIRES the HOOK AND CABLE THIRTY STORIES UP where it latches\n          itself through Blake's broken window. Pressing RETRACT,\n          Rorschach FLIES UP THE WALL to the 30th floor.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          6.\n</b>\n<b>          INT. EDWARD BLAKE'S APARTMENT - LIVING ROOM - LATE NIGHT\n</b>\n          With a grunt, Rorschach pulls himself past the plastic\n          sheeting, through the window, and into Blake's apartment. He\n          investigates, silent. He sees the same things that the cops\n          saw . . but he notices the speakers by the TV. Notices one\n          of the speaker covers is ever so slightly askew.\n          Rorschach pulls the speaker cover off and discovers that the\n          speaker was hollow. (The Intruder clearly took Blake's gun\n          and put the cover back on when he left. Why?)\n\n<b>          INT. BLAKE'S APARTMENT - BEDROOM CLOSET - NIGHT\n</b>\n          Blake's clothing hangs in military rows. Rorschach runs his\n          fingers along the wall-seams. He pauses, presses on the\n          hanger BAR, which SLIDES BACK to reveal a RED BUTTON.\n          Pressing it, the BACK WALL of the closet SLIDES OPEN,\n          revealing a SECRET COMPARTMENT. On the wall is an old FRAMED\n          PHOTO of EIGHT PEOPLE IN COSTUMES, from the 60s. Included in\n          this photo is a young Edward Blake--Blake wasn't a spook--he\n          was a superhero.\n          WEAPONS of all kinds adorn the walls in here. TEAR-GAS,\n          GRENADES, RIFLES, PISTOLS--if it can kill you Blake's got it.\n          But that's not what draws Rorschach's attention.\n          Hanging on the back wall, dead center, is a more current\n          COSTUME. Black leather armor, gloves, boots. Hanging over it\n          all like a vacant, grinning face--a black leather MASK.\n          Rorschach stares. Framed nearby is the FRONT PAGE OF THE\n          BOSTON GLOBE. The headline reads \"The Comedian Gets Last\n          Laugh On Moloch.\" Underneath is a photo of Blake dressed in\n          the costume Rorschach was staring at--Blake was a superhero\n          called the Comedian. In the photo, Blake holds a supervillian\n          named MOLOCH prisoner. (We'll meet Moloch later.)\n          On the same page is a smaller photo of a group of\n          superheroes. Rorschach is in the photo, as is Dr. Manhattan,\n          as is the Comedian. (As are DAN DREIBERG, ADRIAN VEIDT, and\n          LAURIE JUPITER, all of whom we'll be meeting soon). The\n          caption below reads: \"The New Watchmen.\"\n          Suddenly, Rorschach hears the front door open. He quickly\n          closes the secret hatch.\n\n<b>          INT. BLAKE'S APARTMENT - LIVING ROOM - CONTINUOUS\n</b>\n          Two uniformed COPS stand in the doorway.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          7.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          COP 1\n</b>          You sure it wasn't the wind?\n\n<b>          COP 2\n</b>          Nah, I definitely heard something.\n\n<b>          COP 1\n</b>          I tell ya, I'd rather do traffic duty\n          than be posted at a crime scene all\n          night. Watch the door.\n          Cop 1 pulls his gun, going through the motions rather than\n          being concerned. He then enters the bedroom.\n          Cop 2 stands guard, nervous From the bedroom:\n\n<b>          COP 1 (O.S.) (CONT'D)\n</b>          Clear! I'm checking the other rooms.\n          Cop 2 relaxes a bit, turns--\n          --and comes face to \"face\" with Rorschach, standing inches\n          away. The Cop's face goes slack with childish terror. He goes\n          to yell but Rorschach raises two fingers, \"Shhh\"--\n          The fingers JAB INTO THE COP'S WINDPIPE. The cop HISSES and\n          falls silently as Rorschach brushes past him like a whisper.\n\n<b>          HOLLIS (O.S.)\n</b>          See, the Comedian thought he had it all\n          worked out.\n\n<b>          INT. HOLLIS MASON'S APARTMENT - LATE NIGHT/EARLY MORNING\n</b>\n          CLOSE ON: A FRAMED PHOTO of the first Watchmen--identical to\n          the old one in Blake's closet. Holding the photo is HOLLIS\n          MASON. He puts the photo down, but we don't see his face yet.\n\n<b>          HOLLIS (O.S.)\n</b>          He was young and arrogant, but what he\n          lacked in experience, he made up for in\n          . tenacity.\n          As he speaks, we PAN ACROSS various FRAMED MEMORABILIA: The\n          first is a NEWSPAPER CLIPPING dated 1958: MYSTERIOUS MASKED\n          MAN CLEANS UP WHARFS--the caption underneath reads \"Hero\n          Calls Himself The Nite Owl.\"\n\n<b>          HOLLIS (O.S.) (CONT'D)\n</b>          Guess I was that way too, when I started.\n          I'll never know what possessed me to put\n          that mask on the first time.\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          8.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          HOLLIS (O.S.) (CONT'D)\n</b>          It started with the villains, y'know,\n          people forget that. Pirate outfits,\n          ghosts. Gangs that thought it was funny\n          to dress up and pull heists, crap like\n          that.\n          PAN ACROSS: Another FRAMED CLIPPING, dated 1962: NITE OWL\n          FORMS WATCHMEN--COSTUMED HEROES COMBINING FORCES! \"'We're\n          going to clean up this town!' Says costumed crusader.\"\n\n<b>          HOLLIS (O.S.) (CONT'D)\n</b>          So a few cops, we decide it might be\n          funny to mask up too. Be anonymous. Take\n          these guys on at the street level, right?\n          Then the media got wind, ran with it,\n          turned it into a whole different beast.\n          PAN ACROSS: A GOLD STATUE of NITE OWL in his Sixties-era\n          costume. The plaque below reads: IN GRATITUDE, 1969. Another\n          clipping: \"Hero Retires, Reveals Identity In Tell All Book.\"\n          Finally, we come to HOLLIS MASON (aka Nite Owl), 70s, though\n          his eyes sparkle with strength and his face still shows the\n          edges of a born hero. The TV is on in the background.\n\n<b>          HOLLIS (CONT'D)\n</b>          Superheroes, Supervillians--you know who\n          I ran into the other day at the market?\n          The Screaming Skull. We chatted for a\n          while. Turns out he's a born again.\n\n<b>          DAN (V.0.)\n</b>          No way.\n          We see who Hollis is speaking to--DAN DREIBERG (the second\n          Nite Owl), late 30's, handsome, though he's let himself go\n          the past few years--his edges have gone soft. He was in the\n          photo of the new Watchmen in Blake's apartment.\n\n<b>          HOLLIS\n</b>          All the nuts that started popping up,\n          I'll tell ya. Who was that midget you and\n          your partner chased down years ago?\n          What'd he call himself?\n\n<b>          DAN\n</b>          The Big Figure.\n\n<b>          HOLLIS\n</b>          Big Figure. A midget bad guy. Guess it\n          doesn't get lower than that, does it?\n          Hollis laughs at his own joke; Dan chuckles, polite.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          9.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          DAN\n</b>          (glances at his watch)\n          Wow, it's really late.\n          Dan stands, finishes his beer. Hollis sees him to the door.\n\n<b>          HOLLIS\n</b>          Well, even though I spent my time\n          catching real bad guys, you were still a\n          better Nite Owl than I ever was.\n\n<b>          DAN\n</b>          That's bullshit, Hollis, and you know it.\n          They hug.\n\n<b>          HOLLIS\n</b>          With all this talk of war, all that's\n          going on in the world, it's a shame the\n          government forced all you guys out.\n          Before Dan can answer he notices a breaking news report on\n          the TV:\n\n<b>          ANCHORWOMAN\n</b>          This just in--masked vigilante Rorschach\n          has assaulted a New York City police\n          officer who was guarding a crime scene in\n          the early morning hours. Rorschach is on\n          the FBIs ten most wanted list for\n          violation of the Keene Act, which banned\n          masked heroes ten years ago.\n          Dan and Hollis watch as an image of Rorschach flashes on\n          screen.\n\n<b>          HOLLIS\n</b>          Well, forced all of you guys out except\n          one.\n\n<b>          (BEAT)\n</b>          Next week?\n          Dan nods, then leaves.\n\n<b>          EXT. HOLLIS MASON'S APARTMENT - LATE NIGHT/EARLY MORNING\n</b>\n          Dan descends the stairs. He pulls up his collar against the\n          cold and walks down an alley. A SIGN below Hollis' apartment\n          reads: \"MASON AUTO REPAIRS--Obsolete models a specialty!\"\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          10.\n</b>\n<b>          INT. SUBWAY - LATE NIGHT/EARLY MORNING\n</b>\n          Dan rides the subway, lost in thought, when a group of GANG\n          MEMBERS, wearing yellow and black BANDANAS brush past him.\n          ONE stops. Dan's leg is out, a couple inches too far.\n\n<b>          GANG LEADER\n</b>          Move your leg.\n\n<b>          DAN\n</b>          What?\n\n<b>          GANG LEADER\n</b>          I said move, dick.\n          Dan finally realizes what he's talking about. Dan meets his\n          eyes, for just a moment and draws back his leg. The\n          Gang Members snicker at Dan as they pass.\n\n<b>          EXT. DAN DREIBERG'S TOWNHOUSE - LATE NIGHT/EARLY MORNING\n</b>\n          Dan walks down the empty street to his TOWNHOUSE, digging for\n          his keys. Then he stops, suddenly alert.\n          His front door hangs slightly OPEN--the LOCK'S been SMASHED.\n          There's a LIGHT on inside. Cautious, Dan enters the house.\n\n<b>          INT. DAN DREIBERG'S HOUSE - CONTINUOUS\n</b>\n          Dan quietly approaches the light coming from his kitchen. He\n          hears odd, metal scraping SOUNDS.\n\n<b>          INT. DAN'S KITCHEN - CONTINUOUS\n</b>\n          Dan enters the kitchen, stunned to find--\n\n<b>          DAN\n</b>          Rorschach.\n          Rorschach sits at the table, mask half up, eating a cold CAN\n\n<b>          OF BEANS.\n</b>\n<b>          RORSCHACH\n</b>          Hello Daniel. I helped myself to some\n          beans. You don't mind?\n\n<b>          DAN\n</b>          No, of course not. You uh, want me to\n          heat some up for you?\n\n<b>          RORSCHACH\n</b>          No need.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          11.\n</b>\n<b>          CONTINUED:\n</b>          Rorschach finishes the can of beans, stands, pulls his mask\n          back down. There's a strong familiarity between the two but\n          at the same time, Dan is wary.\n\n<b>          DAN\n</b>          You were on the news. They say you\n          attacked a cop.\n\n<b>          RORSCHACH\n</b>          Minor wound. Won't need hospitalization.\n\n<b>          DAN\n</b>          Other than that . How have you been\n          keeping?\n\n<b>          RORSCHACH\n</b>          Out of prison. So far. Look at this.\n          He tosses Blake's happy face pin onto the table. Dan picks it\n          up, runs his fingers over the RED-BROWN SPLOTCH.\n\n<b>          DAN\n</b>          This little stain, is that bean juice or--\n\n<b>          RORSCHACH\n</b>          Human bean juice. It belonged to the\n          Comedian. He's dead.\n\n<b>          DAN\n</b>          The Comedian?\n          Nervous now, Dan glances out the window.\n          DAN (cont'd)\n          Let's talk downstairs.\n\n<b>          INT. DAN'S HOUSE - HALLWAY - LATE NIGHT/EARLY MORNING\n</b>\n          Rorschach follows Dan to a CLOSET, at the end of the hall.\n          Dan opens the closet, revealing an old BOOKSHELF. With some\n          difficulty, Dan PULLS OPEN the HINGED BOOKSHELF with a RUSTY\n          CREAK. STEEL STAIRS lead down into the dark.\n\n<b>          INT. DAN'S OWL-CHAMBER - NIGHT\n</b>\n          The two men descend into Dan's WORKSHOP--the dusty remnants\n          of a hero's LAB; Old computers and an OWL-COSTUME, hanging in\n          a locker. No-one has been down here for years. In the center\n          of the space, an OVAL VEHICLE the size of a subway car is\n          covered by a dusty TARP--the Owl-Ship.\n\n<b>          DAN\n</b>          How did it happen?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          12\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Murder. Someone threw him out a window.\n\n<b>          DAN\n</b>          Maybe it was a burglary. The killer might\n          not have known who Blake was.\n\n<b>          RORSCHACH\n</b>          An ordinary burglar? Kill the Comedian?\n          Ridiculous.\n\n<b>          DAN\n</b>          You're right. I heard he was working for\n          the government. Maybe it was a political\n          killing.\n\n<b>          RORSCHACH\n</b>          Maybe. Or maybe someone's decided to kill\n          off costumed heroes.\n\n<b>          DAN\n</b>          You don't think that's . a little\n          paranoid?\n\n<b>          RORSCHACH\n</b>          Is that what they're saying about me now?\n          That I'm paranoid?\n\n<b>          DAN\n</b>          I-'m just saying the Comedian made a lot\n          of enemies over the years, even amongst\n          his friends, if he had any. The man\n          wasn't exactly endearing. Just because\n          something happened to him doesn't mean it\n          involves us.\n\n<b>          RORSCHACH\n</b>          One of our own has been murdered. I\n          thought you might be interested. An\n          attack on one is an attack on all of us,\n          right?\n          Dan hesitates.\n\n<b>          DAN\n</b>          I'm out, Rorschach. I've been out, we've\n          all been out. Except you. You know that.\n\n<b>          RORSCHACH\n</b>          Yes. I know that. Anyways, I thought I'd\n          let you know. Just in case.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          13.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          DAN\n</b>          Yeah, thanks. You can take the tunnel out\n          to the warehouse on Fleet street--\n          Rorschach turns to walk off down a long, dark TUNNEL.\n\n<b>          RORSCHACH\n</b>          I remember. Used to come here a lot.\n          Back when we were partners.\n\n<b>          DAN\n</b>          Yeah. Those were good times, Rorschach.\n          Great times.\n          (more to himself)\n          What ever happened to them?\n\n<b>          RORSCHACH\n</b>          You quit.\n          Rorschach disappears into the SUBWAY TUNNEL, leaving Dan to\n          reminisce alone. Dan glances at his old costume hanging.\n\n<b>          INT. SLEAZY MOTEL ROOM - EARLY MORNING\n</b>\n          The kind of room you rent by the hour. Or the minute even. A\n          cheap looking HOOKER enters with an ARMY OFFICER, giggling.\n          She playfully pushes the Officer onto the bed.\n\n<b>          HOOKER\n</b>          So tell me what you wanna do. Sir.\n\n<b>          ARMY OFFICER\n</b>          Seeing that I don't have to be back to\n          base till Friday--everything.\n          He puts a stack of BILLS on the dresser. Then takes his\n          UNIFORM off like he can't wait. The Hooker gets on top of him-\n          --when the DOOR FLIES OFF THE HINGES. Rorschach steps in,\n          yanks the Hooker off--\n          --the officer gets to his feet, throws a punch, which\n          Rorschach dodges. Rorschach GRABS the guy's arm, then KICKS\n          the Officer on the side of his KNEE, tearing the joint to\n          shreds. The Officer cries out in pain, falls to the floor--\n          Rorschach nails him in the head with a BLACK JACK, knocking\n          him out.\n          The Hooker screams. Rorschach grabs her by the hair and SLAMS\n          her face into the wall.\n\n<b>          RORSCHACH\n</b>          Quiet, whore.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          14.\n</b>\n<b>          CONTINUED:\n</b>          Nose broken and bleeding, the Hooker quiets to a whimper.\n          Rorschach takes the officer's uniform and ID. Then leaves.\n\n<b>          EXT. VEIDT ENTERPRISES - MORNING\n</b>\n          A mammoth, shining skyscraper. At the 50th-floor there is a\n          HUGE V-SHAPED HOLE where WATER FALLS.\n\n<b>          INT. VEIDT ENTERPRISES - LOBBY - MORNING\n</b>\n          A mammoth lobby. The decor is Egyptian and marble. Dan\n          approaches a beautiful ASSISTANT behind an imposing desk.\n\n<b>          DAN\n</b>          I'm here to see Adrian Veidt.\n\n<b>          ASSISTANT\n</b>          Do you have an appointment?\n\n<b>          DAN\n</b>          No, uh, just tell him Dan Dreiberg is\n          here to see him.\n\n<b>          ASSISTANT\n</b>          I'm sorry, Mr. Veidt doesn't see anyone\n          without an appointment.\n\n<b>          DAN\n</b>          I understand, but if you would just tell\n          Adrian that Dan Dreiberg is here, I'm an\n          old friend.\n\n<b>          ASSISTANT\n</b>          Well, Mr. Veidt is very busy at the\n\n<b>          MOMENT--\n</b>\n<b>          DAN\n</b>          Just tell him I'm here. I assure you\n          he'll see me.\n          Dan glares at her. She glares right back. A game of chicken.\n          She reluctantly gets up, goes inside the office.\n          Once she's gone, Dan's glare disappears, replaced by\n          nervousness. Because he's not sure if Adrian will see him--\n          it's been a long time. He glances at the SECURITY GUARDS\n          eyeing him. Finally, the Assistant returns.\n\n<b>          ASSISTANT\n</b>          Go on in, Mr. Dreiberg.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          15.\n</b>\n<b>          INT. ADRIAN VEIDT'S OFFICE - MORNING\n</b>\n          Dan enters the enormous office--there are three TV feeds\n          PROJECTED onto the walls, architectural models of real estate\n          developments, poster size ad campaigns for \"Nostalgia\"\n          perfume--all reflecting the financial empire of Veidt\n          Enterprises owned by--\n          --ADRIAN VEIDT, late 30s, movie star looks, is at the far end\n          of the office, SPRINTING on a treadmill as journalist DOUG\n          ROTH holds a tape recorder to him. Adrian sees Dan\n          approaching, smiles wide. He holds up a finger, telling Dan\n          to hold on a sec. Dan nods, takes a seat on the couch. Picks\n          up a Fortune magazine with Adrian on the cover.\n\n<b>          DOUG ROTH\n</b>          Mr. Veidt, would you acknowledge that you\n          are considered the world's smartest man?\n\n<b>          ADRIAN\n</b>\n<b>          (LAUGHS)\n</b>          I think it's better to be the world's\n          most modest man. You should ignore my PR\n          people, they tend to be a little too\n          enthusiastic.\n          Though Adrian seems to be sprinting at top speed, he hardly\n          seems out of breath as he answers questions.\n\n<b>          DOUG ROTH\n</b>          If we could move off the subject of\n          business for a moment, I'm curious\n          whether the world's smartest man thinks\n          we're headed for our next World War.\n          Adrian stops the treadmill, towels off as he heads to Dan.\n\n<b>          ADRIAN\n</b>          Predicting stock prices isn't the same as\n          predicting world events. I hope there\n          isn't a war, or even a skirmish for that\n          matter. Because Veidt Enterprises has\n          some exciting plans, plans that will,\n          pardon the cliche, truly make this world\n          a better place. My team of engineers and\n          scientists have been working with Dr.\n          Manhattan himself on synthesizing a new,\n          cheap form of energy which will eliminate\n          the worlds reliance on fossil fuels with\n          no toxic emissions. This energy could\n          power cars, aircrafts, stadiums--there\n          are no limitations--\n          (reaching Dan)\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          16.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          ADRIAN (CONT'D)\n</b>          --but I talk too much. Will you mind\n          pausing the interview a moment, Doug? A\n          good friend of mine is here.\n          Doug Roth leaves. Adrian hugs Dan, despite the sweat.\n\n<b>          DAN\n</b>          You look good, Adrian.\n\n<b>          ADRIAN\n</b>          Dan--it's been far too long.\n\n<b>          INT. ADRIAN VEIDT'S OFFICE - LATER\n</b>\n          Dan and Adrian sit, talking over coffee. Dan examines an\n          ACTION-FIGURE of Adrian as OZYMANDIAS (his superhero alias).\n\n<b>          ADRIAN\n</b>          Rorschach. He paid me a visit too.\n\n<b>          DAN\n</b>          He did? Must've been tough to get past\n          your security, even for him. I thought\n          your assistant was going to take me out.\n\n<b>          ADRIAN\n</b>\n<b>          (LAUGHS)\n</b>          Sara can be tough. Is that why you came\n          to see me? You're worried about this mask\n          killer theory Rorschach's conjured up?\n\n<b>          DAN\n</b>          You're the world's smartest man, Adrian.\n          You tell me.\n\n<b>          ADRIAN\n</b>          Rorschach's a sociopath suffering through\n          nostalgia. I revealed my identity to the\n          public as soon as the Keene Act was\n          passed. If an old enemy wanted me dead it\n          would have been done already.\n          Adrian notices the news on one of his TV projectors.\n          Something about Pakistan putting troops along the Indian\n          border. Adrian turns up the volume, looking grim.\n\n<b>          ADRIAN (CONT'D)\n</b>          No, there are other things in the world\n          I'm far more concerned about.\n          ON THE WALL: The TV projector shows an image of TWO PAKISTANI\n          SOLDIERS on patrol.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          17.\n</b>\n<b>          EXT. PAKISTAN/INDIA BORDER (KASHMIR) - SAME TIME\n</b>\n          We're now actually with the two Soldiers on patrol. One of\n          the Soldiers takes out a pair of binoculars, looking into the\n          mountains. (They speak in Baluchi)\n\n<b>          PAKISTANI SOLDIER\n</b>          We should attack the Indian bastards. I\n          don't understand--\n          CUT TO: POV--a SNIPER SCOPE, locked in on the Pakistani\n          soldier.\n\n<b>          INDIAN SOLDIER #1 (O.S.)\n</b>          --why I can't just pull this trigger.\n          We see two Indian Soldiers, hidden in the mountains, one with\n          his sniper rifle aimed. (They speak in Hindi)\n\n<b>          INDIAN SOLDIER #2\n</b>          Because then a battle begins. Then a war.\n          And then the Americans will send--\n\n<b>          INT. BRIDGE - BATTLESHIP - CHINESE WATERS - SAME TIME\n</b>\n\n<b>          CHINESE CAPTAIN\n</b>          (in Mandarin)\n          --their blue abomination to intervene.\n          And we don't want that. At the same time,\n          we can't assume to know what's on the\n          minds of our enemies.\n          We're in Chinese waters, off the coast of Taiwan. The CHINESE\n          CAPTAIN and his First Mate look out at the water. TAIWANESE\n          GUNBOATS can be seen in the distance.\n\n<b>          INT. MISSILE CONTROL ROOM - ISRAEL - SAME TIME\n</b>\n          We're in the control room as an ISRAELI OFFICER and his much\n          younger AIDE watch SATELLITE IMAGES on the giant screen.\n          Images of potential targets. (They speak in Hebrew)\n\n<b>          AIDE\n</b>          Is Dr. Manhattan even real?\n\n<b>          ISRAELI OFFICER\n</b>          Why don't you ask the Vietnamese. Or the\n          Iraqis? Dr. Manhattan is real. Thank god\n          for that.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          18.\n</b>\n<b>          EXT. ROCKEFELLER MILITARY BASE - EVENING\n</b>\n          A SIGN posted on a RAZOR-WIRE FENCE reads: ROCKEFELLER\n          MILITARY RESEARCH CENTER. An M16-toting GUARD stands at the\n          gate.\n          We move into Rorschach's POV as he approaches the gate. The\n          guard has no reaction to Rorschach--\n          --because Rorschach is in disguise, wearing the Army\n          Officer's uniform he stole. Rorschach presents his ID. The\n          Guard waves him through.\n\n<b>          INT. HALLWAY - DR. MANHATTAN'S COMPOUND - EVENING\n</b>\n          Rorschach ditches the uniform in the trash and puts his mask\n          on. He quietly enters--\n\n<b>          INT. LABORATORY - CONTINUOUS\n</b>\n          --a huge room, which contains technologically advanced\n          MILITARY DEVICES. Distorted in sections of GLASS, we see the\n          REFLECTION of a HUGE MAN, GLOWING BRIGHT BLUE--\n\n<b>          DR. MANHATTAN (O.S.)\n</b>          Good evening, Rorschach.\n          --and we see DR. MANHATTAN (formerly Jon Osterman) for the\n          very first time. He is SIXTY FEET TALL, BLUE LIGHT ripples\n          from his skin, emanating pure power--he is God on earth. He\n          works on a reactor--telekinetically moving parts in the air--\n          not even looking at Rorschach. It's as if Dr. Manhattan\n          already knew he was coming.\n\n<b>          RORSCHACH\n</b>          Dr. Manhattan.\n          Dr. Manhattan continues about his business when his\n          girlfriend, LAURIE JUPITER, 30, very much in her prime,\n          enters from the other end.\n\n<b>          LAURIE\n</b>          Jon, did you say some--Rorschach: What\n          are you doing here? You're a wanted man.\n\n<b>          RORSCHACH\n</b>          Nice to see you too, Silk Spectre.\n\n<b>          LAURIE\n</b>          Don't call me that. My mother made me\n          take that name. I always hated it.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          19.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Sorry, Miss Jupiter. I thought I should\n          tell you the bad news--the Comedian has\n          been murdered.\n\n<b>          DR. MANHATTAN\n</b>          Yes, since he and I are the only two\n          extranormal operatives currently employed\n          by the government, I was informed. The\n          CIA suspects one of the radical Islamic\n          groups.\n          Dr. Manhattan shrinks from sixty to six feet in size. He\n          speaks in a cold, even, matter of fact manner.\n\n<b>          RORSCHACH\n</b>          I have my own theories. But neither of\n          you seem too concerned.\n\n<b>          DR. MANHATTAN\n</b>          A live human body and a dead human body\n          have the same number of particles.\n          Structurally there's no difference.\n\n<b>          LAURIE\n</b>          Well, I might not be able to count\n          molecules, but either way, Blake was a\n          bastard. You know he tried to rape my\n          mother?\n\n<b>          RORSCHACH\n</b>          Sounds like you may have had a score to\n          settle. You or your mother.\n\n<b>          LAURIE\n</b>          What? Are you accusing--\n\n<b>          DR. MANHATTAN\n</b>          Rorschach, please don't upset Laurie. I\n\n<b>          DON'T--\n</b>          He pauses as if he hears something.\n\n<b>          DR. MANHATTAN (CONT'D)\n</b>          Excuse me for a moment.\n          Suddenly he disappears.\n\n<b>          EXT. PORT OF LONG BEACH - CONTINUOUS\n</b>\n          A group of suspicious looking MIDDLE EASTERN MEN watch as a\n          CONTAINER is being loaded onto a TRUCK--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          20.\n</b>\n<b>          CONTINUED:\n</b>          --when suddenly Dr. Manhattan materializes in a blue flash,\n          floating in mid-air. The Middle Eastern Men shield their eyes\n          from the light, then realize in awe and fear\n\n<b>          MIDDLE EASTERN MAN\n</b>          (in Arabic)\n          It's him He's, he's real. Allah\n          help us, he's real!\n          The men run for it but it's useless--Dr. Manhattan shoots\n          BEAMS OF ENERGY at them, freezing all the men in mid motion--\n          --when PORT SECURITY pulls up. They get out of their jeeps,\n          in awe of Dr. Manhattan, still floating in mid-air.\n\n<b>          DR. MANHATTAN\n</b>          These men were transporting a shipment of\n          enriched uranium--\n          With a gesture, the container floats off the truck and\n          separates into pieces . . revealing the URANIUM inside.\n          Suddenly the uranium changes--\n\n<b>          DR. MANHATTAN (CONT'D)\n</b>          I've safely transformed the uranium into\n          sand. I trust you can take things from\n          here.\n          And just like that he disappears--\n\n<b>          INT. LABORATORY - CONTINUOUS\n</b>\n          --and is back in the lab without missing a beat.\n\n<b>          RORSCHACH\n</b>          --I'm not here to judge the moral\n          discrepancies of a man who died in\n          service of his country.\n\n<b>          LAURIE\n</b>          You call rape a moral discrepancy?!\n\n<b>          DR. MANHATTAN\n</b>          Rorschach--you're upsetting Laurie. I\n          think you ought to go.\n\n<b>          RORSCHACH\n</b>          I came here to warn you both, just like I\n          warned Adrian and Dan. I believe someone\n          may be targeting masked heroes--\n\n<b>          DR. MANHATTAN\n</b>          I said you ought to go.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          21.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          It took a lot of effort to get in here.\n          I'm not leaving before I've--\n          With a look, Dr. Manhattan makes Rorschach disappear.\n\n<b>          EXT. ROCKEFELLER MILITARY BASE - CONTINUOUS\n</b>\n          Rorschach materializes down the road from the base.\n\n<b>          RORSCHACH\n</b>          --had my say\n          Rorschach realizes what just happened. Checks himself, his\n          surroundings. Reorients himself. With nothing else he can do,\n          he heads down the road.\n\n<b>          INT. LABORATORY - SAME TIME\n</b>\n          Dr. Manhattan resumes his work. He looks distracted.\n\n<b>          DR. MANHATTAN\n</b>          He's gone. Are you okay now?\n\n<b>          LAURIE\n</b>\n<b>          YEAH\n</b>          (studies Dr. Manhattan)\n          Are you okay, Jon?\n          Dr. Manhattan pauses for a moment, thoughtful.\n\n<b>          DR. MANHATTAN\n</b>          I'm having trouble with my vision. I\n          can't see clearly what lies ahead.\n          There's some static interference.\n\n<b>          LAURIE\n</b>          Interference? Caused by what?\n\n<b>          DR. MANHATTAN\n</b>          I'm uncertain. A power surge of great\n          magnitude? Perhaps a nuclear detonation.\n\n<b>          LAURIE\n</b>          More war talk. I can't deal with this. I\n          don't want to think about the future\n          right now.\n\n<b>          DR. MANHATTAN\n</b>          There's no such thing as the \"future.\"\n          I've explained to you on many occasions--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          22.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE\n</b>          --that time is simultaneous. There's no\n          past to travel back to, no future to\n          travel forward to, everything happens all\n          at once, our actions affect the course of\n          time instantly, yes I know.\n\n<b>          (BEAT)\n</b>          I'm sorry, it's just a little\n          unnerving to be with someone who can see\n          the future, or whatever you call it.\n\n<b>          DR. MANHATTAN\n</b>          I understand your frustration, Laurie.\n          The human mind for some reason is only\n          capable of viewing time frame by frame.\n          Perhaps you'd find it more comforting if\n          you could perceive time as I do\n          Dr. Manhattan touches her head--\n\n<b>          INT. JUPITER HOUSE - NIGHT (FLASHBACK - 25 YEARS AGO)\n</b>\n          Laurie's childhood home. We're in Laurie's POV, as a little\n          girl. There's arguing downstairs. Laurie goes down to\n          investigate.\n          She comes upon the kitchen door, ajar. She can see her\n          PARENTS inside, arguing--\n\n<b>          LAURIE (V.0.)\n</b>          Jon, stop!\n\n<b>          INT. LABORATORY - EVENING\n</b>\n          Back in the present, Laurie pulls away from Dr. Manhattan's\n          touch. That memory seems to be painful for her.\n\n<b>          DR. MANHATTAN\n</b>          I didn't mean to upset you.\n\n<b>          LAURIE\n</b>          I know. I think I've been cooped up on\n          this base for too long. Rorschach\n          mentioned Dan Dreiberg--we haven't seen\n          him in years. Maybe we can give him a\n          call, see if he's available for dinner\n          tonight.\n\n<b>          DR. MANHATTAN\n</b>          You go ahead, Laurie. I want to further\n          investigate this interference with my\n          vision. I find it troubling.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          23.\n</b>\n<b>          INT. RECEPTION - DR. MANHATTAN'S COMPOUND - EVENING\n</b>\n          Laurie, dressed up and looking gorgeous, heads out when she's\n          stopped by a SECRET SERVICE AGENT FORBES.\n\n<b>          AGENT FORBES\n</b>          Going somewhere, Miss Jupiter?\n\n<b>          LAURIE\n</b>          Out.\n\n<b>          AGENT FORBES\n</b>          I'll have a car brought around in a few\n          minutes.\n\n<b>          LAURIE\n</b>          No, thank you. I called a cab already--\n          it's waiting for me outside.\n          She tries to walk past but Agent Forbes steps in front of\n          her.\n\n<b>          AGENT FORBES\n</b>          You look quite nice. Who are you meeting?\n\n<b>          LAURIE\n</b>          An old friend of mine. And of Dr.\n          Manhattan's. Now step out of my way.\n\n<b>          AGENT FORBES\n</b>          Please keep in mind, Ms. Jupiter, that\n          your boyfriend is this country's most\n          valuable asset. You need to keep him\n          happy. And on our side.\n          Laurie glares at him.\n\n<b>          LAURIE\n</b>          Yes, sir.\n          She brushes past him as she leaves.\n\n<b>          EXT. NEW YORK CITY - NIGHT\n</b>\n          We move down the beautifully lit New York city skyline,\n          passing the Brooklyn Bridge . the Statue of Liberty\n          and the in Towers of the World Trade Center?\n          We hear the LAUGHTER--\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          24.\n</b>\n<b>          INT. RESTAURANT - NIGHT\n</b>\n          --of Dan and Laurie as they finish up their meal at this\n          trendy restaurant.\n\n<b>          LAURIE\n</b>          You remember that crazy guy, what did he\n          call himself . Captain Carnage!\n          Pretended to be a supervillian just so he\n          could get beat up all the time?\n\n<b>          DAN\n</b>          Yeah, he tried that with me once. I just\n          walked away but he starts following me\n          down the street in broad daylight\n          yelling, \"punish me! punish me!\"\n\n<b>          LAURIE\n</b>\n<b>          (LAUGHS)\n</b>          Whatever happened to him?\n\n<b>          DAN\n</b>          Uh, well, he pulled that on Rorschach and\n          Rorschach dropped him down an elevator\n          shaft.\n          They look at each other, serious, then explode in laughter.\n\n<b>          LAURIE\n</b>          Sorry, sorry, that's not funny. I can't\n          remember the last time I laughed like\n          this. It feels good.\n          Dan looks at her as she finishes her coffee. We can see he's\n          smitten with her and that he probably has been for years.\n          Laurie seems oblivious.\n\n<b>          DAN\n</b>          It's great seeing you again, Laurie.\n\n<b>          LAURIE\n</b>          Yeah, this was fun.\n          The WAITER arrives with the check; Laurie grabs it.\n\n<b>          DAN\n</b>          You sure I can't get that?\n\n<b>          LAURIE\n</b>          Let me put my expense account to use. You\n          can thank Uncle Sam.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          25.\n</b>\n<b>          CONTINUED:\n</b>          Laurie nods out the window. Dan turns and sees a GOVERNMENT\n          SEDAN parked outside.\n\n<b>          DAN\n</b>          They've been watching the whole time?\n\n<b>          LAURIE\n</b>          Just making sure I'm not doing anything\n          that might upset the country's most\n          powerful weapon.\n\n<b>          DAN\n</b>          How is Jon, by the way?\n\n<b>          LAURIE\n</b>          I really don't know. It's been harder and\n          harder to tell over the years. It's like\n          his emotions are slowly eroding. To be\n          honest, I can't tell if he even cares\n          about me anymore.\n          They're quiet a moment. Laurie glances at her watch.\n\n<b>          LAURIE (CONT'D)\n</b>          I should get back.\n\n<b>          EXT. RESTAURANT - NIGHT\n</b>\n          Dan and Laurie step outside.\n\n<b>          LAURIE\n</b>          Y1 know, when I think back, why did we do\n          it? Why did we dress up like that? I\n          think the Keene Act was the best thing to\n          ever happen to us.\n\n<b>          DAN\n</b>          You're probably right.\n\n<b>          LAURIE\n</b>          I mean, you remember my costume? All that\n          tight spandex? That was awful.\n\n<b>          DAN\n</b>          Uh, yeah. Awful.\n\n<b>          LAURIE\n</b>          And to think my own mother pushed me into\n          that spandex. Pushed me into the whole\n          costume thing in the first place. Wanted\n          her little girl to be just like mommy and\n          fight bad guys.\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          26.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE (CONT'D)\n</b>\n<b>          (BEAT)\n</b>          Well, I guess my ride is here.\n          She gives Dan a hug.\n\n<b>          LAURIE (CONT'D)\n</b>          We'll do this again.\n\n<b>          DAN\n</b>          Yeah. I'd really like that.\n          Laurie crosses the street and gets into the sedan. As Dan\n          watches the car drive off, TWO KIDS nearly bump into him,\n          running around playing. The Kids make flying noises.\n\n<b>          KID 1\n</b>          I'm Dr. Manhattan, saving the Twin\n          Towers!\n\n<b>          KID 2\n</b>          No, I wanna be Dr. Manhattan!\n\n<b>          MOTHER\n</b>          You can take turns, okay?\n          Dan watches the Kids for a moment, then walks away. The Twin\n          Towers looming behind him.\n\n<b>          EXT. CEMETERY - LATE AFTERNOON\n</b>\n          Days later. A few mourners gather in the rain for Edward\n          Blake aka The Comedian's funeral. Mostly government types.\n          Dan, Adrian and Dr. Manhattan line the edge of an open grave.\n\n<b>          INT. HALLWAY - SALLY JUPITER'S CONDO - LOS ANGELES, CA - DAY\n</b>\n          Laurie MATERIALIZES in the hallway of her mother's condo in\n          California. She immediately runs to the bathroom.\n\n<b>          EXT. NEPENTHE VISTA - SAME TIME\n</b>\n          Bright California sunshine gleams over this upscale condo\n          facility. Laurie's mother, SALLY, 60s but looks in her 40s,\n          reclines by the POOL. She hears someone VOMITING in her\n          condo.\n\n<b>          SALLY\n</b>          Laurie? Is that you?\n\n<b>          INT. SALLY'S CONDO - DAY\n</b>\n          Sally steps through the sliding glass doors as we hear the\n          toilet FLUSHING. Laurie wobbles out of the bathroom.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          27\n</b>\n<b>          CONTINUED:\n</b>\n<b>          SALLY\n</b>          I'd figure you'd be used to traveling\n          that way by now.\n\n<b>          LAURIE\n</b>          Well, I'm not. I hate it when Jon\n          teleports me.\n\n<b>          SALLY\n</b>          Margarita?\n\n<b>          LAURIE\n</b>          No.\n          Sally pours herself a margarita from a pitcher on the\n          counter. We see photos, remnants of Sally from her\n          crimefighting days around the condo. Under the pitcher of\n          margaritas is a days old LA Times with the headline: \"Dr.\n          Manhattan Intercepts Terrorists At Port.\"\n\n<b>          SALLY\n</b>          It's Eddie Blake's funeral today, isn't\n          it?\n          Laurie nods. (From here on, intercut between Blake's funeral\n          and Sally's condo)\n          FUNERAL: Blake's coffin is removed from the hearse.\n\n<b>          SALLY (V.0.) (CONT'D)\n</b>          Finally got his punchline, I guess. Poor\n          Eddie.\n\n<b>          LAURIE\n</b>          Poor Eddie? How can you say that? After\n          what he--\n\n<b>          SALLY\n</b>          Laurie, you're still young. You don't\n          understand how things change as time goes\n          by.\n          FUNERAL: Blake's coffin is carried past Adrian, Dan and Dr.\n          Manhattan.\n\n<b>          LAURIE (V.0.)\n</b>          Another lesson on time passing. Y'know,\n          you and Jon should get together and write\n          a book on the subject.\n          Sally reaches into a drawer and pulls out the old photo of\n          the Watchmen, the same one with Blake and Hollis Mason in it.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          28\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          SALLY\n</b>          That leaves just two of the old team\n          left. Me and Hollis Mason.\n          She stops at Blake in the photo, regarding him.\n\n<b>          EXT. CEMETERY - LATE AFTERNOON\n</b>\n\n<b>          SALLY (V.O.)\n</b>          Eddie was the Comedian. He always thought\n          he'd get the last laugh.\n          As the PRIEST speaks, we move down the row of mourners,\n          stopping at Dr. Manhattan looking thoughtfully into Blake's\n\n<b>          GRAVE\n</b>\n<b>          INT. BAR - SAIGON - NIGHT - (FLASHBACK - 1964)\n</b>\n          MATCH CUT TO: Dr. Manhattan. In the night sky, a BURST of\n          FIREWORKS. Outside, a CROWD of Vietnamese people CHEER.\n\n<b>          BLAKE (O.S.)\n</b>          Fireworks.\n          A young Blake sits in a derelict Saigon bar, mean drunk. His\n          face is devoid of his trademark scar.\n\n<b>          BLAKE (CONT'D)\n</b>          You'd think this country'd had enough\n          goddamn fireworks. If we'd've lost this\n          war, I think it might have driven us\n          crazy, y'know? As a country. But we\n          didn't. Thanks to you.\n\n<b>          DR. MANHATTAN\n</b>          You sound bitter.\n\n<b>          BLAKE\n</b>          Me? I think it's hilarious.\n\n<b>           VIETNAMESE GIRL (O.S.)\n</b>          Mr. Eddie?\n          They both turn. A pretty VIETNAMESE GIRL stands in the door.\n          She's pregnant, just starting to show.\n\n<b>          BLAKE\n</b>          Fantastic. Just what I need.\n\n<b>          VIETNAMESE GIRL\n</b>          The war is over now. We must talk.\n          (touching her abdomen)\n          About this.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          29.\n</b>\n<b>          CONTINUED:\n</b>          Blake SLAMS his glass down. He glares at her, drunk and\n          dangerous.\n\n<b>          BLAKE\n</b>          There's nothing to talk about cuz I'm\n          leaving. I'm gonna forget you and your\n          horrible, sweaty little country.\n          He turns away. Her eyes blaze with betrayal and hatred.\n\n<b>          VIETNAMESE GIRL\n</b>          No. You will remember. You will remember\n          me and my country forever.\n          She SMASHES a bottle. Blake turns just as the broken SHARDS\n          SLASH HIS FACE, slicing him his jagged scar\n\n<b>          BLAKE\n</b>          You bitch! My face!\n          He PUSHES HER into the bar and DRAWS HIS PISTOL--\n\n<b>          DR. MANHATTAN\n</b>          Blake . don't.\n          BLAM! Blake shoots her; the Girl SLAMS against the far wall.\n          She drops, dead.\n\n<b>          DR. MANHATTAN (CONT'D)\n</b>          Blake. She was pregnant. You gunned her\n          down.\n          Blake turns on him, spitting fury.\n\n<b>          BLAKE\n</b>          That's right! And you know what? You\n          watched me! You could've changed the gun\n          into steam or the bullets into mercury or\n          the bottle into snowflakes, but you\n          didn't, did you? You're drifting outta\n          touch, Doc--I've seen it. Don't tell me\n          the war got to you.\n          Blake walks off shouting \"Medic!\" Dr. Manhattan turns to the\n          girl's body and regards it, curious. MATCH CUT TO:\n\n<b>          EXT. CEMETERY - EARLY EVENING\n</b>\n          Dr. Manhattan looking down at Blake's grave. We move down to\n\n<b>          ADRIAN\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          30.\n</b>\n<b>          INT. WATCHMEN HEADQUARTERS - NIGHT - (FLASHBACK 15 YEARS AGO)\n</b>\n\n<b>          BLAKE (V.0.)\n</b>          This is all bullshit.\n          Dan, fit and trim in full Nite Owl regalia, attends the\n          meeting of the \"new\" Watchmen. Rorschach is there, as is a\n          teenage Laurie, dressed in her tight spandex costume. Dr.\n          Manhattan, his age unchanged, stands with his girlfriend\n          JANEY SLATER, though he casts occasional glances at young\n          Laurie . who definitely glances back. Dan also pays\n          Laurie attention, but she is oblivious.\n          A younger Adrian, dressed as Oxymandias, leads the meeting.\n\n<b>          ADRIAN\n</b>          What are you saying, Comedian?\n          Blake, now in his forties, smokes a CIGAR, feet on the table,\n          a FLASK in hand. The PAPER in his hand reads: \"Arab Leaders\n          Call Dr. Manhattan: 'America's Weapon of Satan.\"'\n\n<b>          BLAKE\n</b>          What I'm saying is this whole bringing\n          back the Watchmen thing is bullshit. It\n          didn't work twenty years ago, and it\n          ain't gonna work just because you want to\n          keep on playing Cowboys and Indians.\n\n<b>          DAN\n</b>          Maybe we should agree on no drinking at\n          meetings. Look, Rorschach and I have made\n          real headway on the gang problem by\n          pooling our efforts.\n          Rorschach's voice is quiet, not yet its tortured rasp.\n\n<b>          RORSCHACH\n</b>          That's true. But something like this\n          seems too big. Too bureaucratic.\n\n<b>          ADRIAN\n</b>          Bureaucracies can be effective with the\n          right leadership--\n\n<b>          BLAKE\n</b>          And that would be you, right Veidt? I\n          mean you're the \"smartest guy in the\n          world,\" right?\n\n<b>          ADRIAN\n</b>          It doesn't take a genius to see that the\n          world has problems.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          31.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          BLAKE\n</b>          But it takes a roomful of morons to think\n          they're small enough for you guys to\n          handle. You people are a joke. You hear\n          Moloch's back in town and get your\n          panties in a bunch. You think that\n          matters?\n\n<b>          RORSCHACH\n</b>          Of course it does. Justice matters.\n\n<b>          BLAKE\n</b>          Justice. Hilarious. There's no such thing\n          as justice.\n          He stands, moving to Adrian's DISPLAY which outlines the\n          Watchmen's agenda: GANGS, RACKETEERING, DRUGS. Blake flicks\n          his ZIPPO and the display GOES UP IN FLAMES.\n\n<b>          ADRIAN\n</b>          My display .\n\n<b>          BLAKE\n</b>          Justice doesn't matter, alright? Because\n          twenty years from now we're all gonna be\n          dust. Mankind's been trying to kill each\n          other off since the beginning of time and\n          now we finally got the power to finish\n          the job. Ain't nothin' gonna matter when\n          the nukes start flying, and I promise you\n          they will. Then Ozymandias here is gonna\n          be the smartest man on the cinder.\n          He sneers and walks out. Silence. Uncomfortable in the wake\n          of truth, the others pack up to go, muttering apologies to\n          Adrian, but Adrian ignores them, staring at the flames\n          flickering across his face. He seems more thoughtful than\n          upset. MATCH CUT TO:\n\n<b>          EXT. CEMETERY - LATE AFTERNOON\n</b>\n          Adrian, moving down to Dan as we FADE TO:\n\n<b>          EXT. CITY STREETS - NIGHT - (FLASHBACK 10 YEARS AGO)\n</b>\n          A NEWSPAPER BOX. The headlines: \"Cops Say: 'Let Them Do It',\"\n          \"Senator Keene Proposes Emergency Bill Banning Vigilantism.\"\n          PAN UP TO REVEAL: The streets JAMMED with ANGRY PROTESTORS,\n          waving signs decrying vigilantes.\n          ANGLE ON: AN OVAL AIRSHIP--the OWL SHIP--its forward windows\n          sculpted like the eyes of a great owl.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          32.\n</b>\n<b>          CONTINUED:\n</b>          Dan, in costume, pilots the ship. The Comedian stands outside\n          the ship, in one of the \"owl eyes,\" wielding a MACHINE GUN.\n\n<b>          DAN\n</b>          (over loudspeakers)\n\n<b>          EVERYONE, PLEASE CLEAR THE STREETS. WE\n</b>\n<b>          ARE TRYING TO RETAIN ORDER UNTIL THE\n</b>\n<b>          POLICE STRIKE IS OVER.\n</b>\n<b>          BLAKE\n</b>          Crawl back in yer holes before you get\n          hurt! I got rubber bullets!\n\n<b>          MAN IN CROWD\n</b>          We want regular cops! No more vigilantes!\n\n<b>          WOMAN IN CROWD\n</b>          My son is a cop, asshole!\n          The Comedian gets HIT IN THE HEAD by a flying SODA CAN.\n\n<b>          BLAKE\n</b>          Okay, that's how you wanna do it?!\n          Smiling grimly, he FIRES TEAR GAS CANNISTERS INTO THE CROWD.\n\n<b>          DAN\n</b>          Oh God.\n          (over speakers)\n\n<b>          LOOK, I'M SORRY. YOU'VE LEFT US NO\n</b>\n<b>          CHOICE. PLEASE CLEAR THE STREETS!\n</b>          The Comedian DIVES into the crowd, knocking random people\n          aside with his rifle butt, then starts firing rubber bullets\n          into the crowd. The protestors scatter and retreat. Dan lands\n          the Owl Ship, exits wearing a GAS MASK, hands one to Blake.\n\n<b>          DAN (CONT'D)\n</b>          Comedian, this is a nightmare! The whole\n          city is erupting!\n\n<b>          BLAKE\n</b>          Hah! You seen this?\n          The smoke clears enough for Dan to see a message SPRAY-\n          PAINTED on a brick wall: \"WHO WATCHES THE WATCHMEN?\"\n\n<b>          DAN\n</b>          How long can we keep this up?\n\n<b>          BLAKE\n</b>          My government contacts tell me they're\n          pushing some new bill through Congress.\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          33.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>           BLAKE (CONT'D)\n</b>          Until then, we're society's only\n          protection.\n\n<b>          DAN\n</b>          Protection from what?\n          Blake laughs, exultant in the blowing smoke, the chaos.\n\n<b>          BLAKE\n</b>          Are you kidding? From themselves.\n          CLOSE ON: the happy face pin on Blake's costume. MATCH CUT TO-\n\n<b>          EXT. CEMETERY - EVENING\n</b>\n          --Dan fingering Blake's happy face pin.\n\n<b>          PRIEST\n</b>          Lord have mercy upon us. Amen.\n          Dan DROPS the pin into Blake's grave. The mourners linger a\n          moment as dirt is shoveled onto Blake's casket, then start\n          filing out. We follow one particular mourner all the way in\n          the back--a LONE MAN, as he walks away.\n\n<b>          EXT. CEMETERY GATES - CONTINUOUS\n</b>\n          The Lone Man leaves quickly.\n\n<b>          INT. MOLOCH'S BROWNSTONE - NIGHT\n</b>\n          The Lone Man removes his hat and coat. He is old, withered.\n          He is EDGAR JACOBI. In his younger days, he was a\n          supervillain known as MOLOCH--we recognize him from the news\n          clipping in Blake's closet.\n\n<b>          INT. MOLOCH'S KITCHEN - NIGHT\n</b>\n          Moloch goes to the REFRIGERATOR, opens it. Then stops,\n          staring. There is a scrawled NOTE inside. Moloch picks it up--\n          in spiky handwriting it reads: \"LOOK BEHIND YOU.\"\n          Over Moloch's shoulder Rorschach's hat-brim TILTS UP. As\n          Moloch turns, Rorschach lunges, PINS Moloch's ARM behind his\n          back and SLAMS him to the floor.\n\n<b>          RORSCHACH\n</b>          Edgar William Jacobi. Also known as Edgar\n          William Vaughn. Also known as William\n          Edgar Bright. Also known as Moloch.\n\n<b>          MOLOCH\n</b>          What are you talking about? I'm a retired\n          business maaAAAHHH!\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          34.\n</b>\n<b>          CONTINUED:\n</b>          Rorschach TWISTS the man's arm back viciously.\n\n<b>          RORSCHACH\n</b>          Lie again, I'll break your arm.\n\n<b>          MOLOCH\n</b>          Oh God, please. I did my time. I'm not\n          Moloch anymore. What do you want from me?\n          Rorschach lets him go. Moloch's hollow eyes follow him.\n\n<b>          RORSCHACH\n</b>          You attended a funeral today. Why?\n\n<b>          MOLOCH\n</b>          The funeral? I don't know why I went. I\n          just felt I should. I'd been thinking\n          about the Comedian--\n          Rorschach SLAMS Moloch against the wall.\n\n<b>          RORSCHACH\n</b>          How did you know Blake was the Comedian?\n\n<b>          MOLOCH\n</b>          He broke in here! A week ago! He, he had\n          his mask off. He was drunk--\n\n<b>          RORSCHACH\n</b>          You were enemies for forty years. Why\n          would he visit you?\n\n<b>          MOLOCH\n</b>          I don't know! I woke up in my bedroom and\n          there he was! He was upset! Crying!\n\n<b>          RORSCHACH\n</b>          The Comedian? Crying?\n\n<b>          MOLOCH\n</b>          He, he was babbling, not making sense. I\n          was pissing in my pants--I thought he was\n          going to kill me!\n\n<b>          RORSCHACH\n</b>          What did he say?!\n\n<b>          MOLOCH\n</b>          He said he was wrong. About it all being\n          a joke, that it wasn't funny anymore. He\n          said he was scared--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          35.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          RORSCHACH\n</b>          Scared of what?!\n\n<b>          MOLOCH\n</b>          Something he saw, I think. He said\n          something about wishing he never broke\n          into that building. But that he had to\n          keep his mouth shut. Then, then he left!\n          Rorschach studies Moloch a moment, then releases him.\n\n<b>          RORSCHACH\n</b>          Hm. Funny story. Sounds unbelievable.\n          Probably true.\n          Rorschach glances around the kitchen. He opens some drawers,\n          looking inside. He picks up a stack of MAIL, flips through\n          it. One of the envelopes contains a PENSION CHECK from\n          \"Pyramid Industries.\"\n\n<b>          MOLOCH\n</b>          So that's it? I'm clean?\n\n<b>          RORSCHACH\n</b>          Clean? I searched your house. Found\n          illegal drugs.\n\n<b>          MOLOCH\n</b>          Illegal--I don't use drugs.\n          Rorschach pulls a PILL BOTTLE from his coat.\n\n<b>          RORSCHACH\n</b>          Laetril. Phony medication made from\n          apricot pits. Illegal.\n\n<b>          MOLOCH\n</b>          oh c-come on. Look, please don't\n          confiscate that. I'm trying anything\n          . I have cancer.\n\n<b>          RORSCHACH\n</b>          What kind of cancer?\n\n<b>          MOLOCH\n</b>          The kind you don't get better from.\n\n<b>          RORSCHACH\n</b>          Fine. You're off the hook, for now. If\n          you remember anything else, leave me a\n          note in the trash can opposite the Gunga\n          Diner at Fortieth and Seventh. Keep out\n          of trouble, Moloch.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          36.\n</b>\n<b>          EXT. CITYSCAPE - NIGHT\n</b>\n           CLOSE ON: Rorschach blasting through the night air as the\n           city streams by. This close, he appears to be flying.\n\n<b>           RORSCHACH (V.0.)\n</b>           Rorschach's Journal, October 17th.\n          Thought about Moloch's story on my way to\n          the cemetery. Could all be lies. A scheme\n          for revenge planned during his years\n          behind bars.\n          CUT WIDE: To reveal he is actually PERCHED ATOP AN ELEVATED\n          SUBWAY CAR. Just one way he gets around.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          But if it's true, then what? What could\n          have possibly scared the Comedian? What\n          building was he talking about? What was\n          it that he saw? So many questions.\n\n<b>          EXT. CEMETERY - NIGHT\n</b>\n          Rorschach stands alone over Blake's fresh grave. Paying his\n          proper respects.\n\n<b>          RORSCHACH (V.0.)\n</b>          Edward Blake--the Comedian. Born 1944,\n          buried in the rain. Murdered.\n          FLASH TO: Blake, the night of his murder, turning as his door\n          is kicked in.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          Violent lives ending violently.\n          FLASH TO: Adrian's display burning.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          Blake understood. Humans are violent in\n          nature. No matter how much you try to\n          dress it up, to disguise it.\n          FLASHES OF: The group photo of the old Watchmen. Then the\n          photo of the new Watchmen.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          Blake saw the true face of human kind and\n          chose to become a parody of it, treated\n          it like a joke.\n          FLASHES OF: Blake being beaten in his apartment.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          37.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          I heard a joke once. Man goes to a\n          doctor, says he's depressed. Life seems\n          harsh and cruel.\n          Blake is KICKED in the stomach.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          Says he feels all alone in a threatening\n          world.\n          Blake stands alone in the blowing tear gas smoke.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          Doctor says, \"the treatment is simple.\n          The great clown Pagliacci is in town\n          tonight. Go and see him. That should pick\n          you up.\"\n          Blake is lifted up by the Intruder's hands.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          The man bursts into tears.\n          A bloodied Blake laughs at the Intruder.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          \"But doctor,\" he says.\n          ULTRA-SLOW, Blake crashes through his apartment window.\n\n<b>           RORSCHACH (CONT'D)\n</b>          \"I am Pagliacci.\"\n          Blake FLIES TOWARD FRAME on his silent trip to the ground.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          Good joke. Everybody laugh.\n          Blake FALLS INTO FRAME--GO BLACK .\n\n<b>          INT. ROCKEFELLER MILITARY BASE - BEDROOM - AFTERNOON\n</b>\n          CLOSE ON: Laurie, eyes closed with pleasure, as Dr.\n          Manhattan's GLOWING BLUE HANDS caress her face.\n\n<b>          LAURIE\n</b>          Mmm. What time do you have to be at your\n          TV interview?\n\n<b>          DR. MANHATTAN (O.S.)\n</b>          Don't worry, we have plenty of time.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          38.\n</b>\n<b>          CONTINUED:\n</b>          Eyes still closed, she does not see a THIRD BLUE HAND trace a\n          line down her cheek. She kisses it.\n\n<b>          LAURIE\n</b>          Hey, your finger, it's like licking a\n          battery. It's all--\n          She opens her eyes. They widen in shock and horror as she\n          sees TWO DR. MANHATTANS in bed with her.\n\n<b>          LAURIE (CONT'D)\n</b>          Oh God! That's horrible! Stop it!\n          Laurie jumps up. The two Dr. Manhattans stand, confused.\n\n<b>          DR. MANHATTAN 1 DR. MANHATTAN 2\n</b>          Please don't be upset. I thought you'd enjoy it.\n\n<b>          LAURIE (CONT'D)\n</b>          I'm sorry, I--You startled me, that's all\n\n<b>          DR. MANHATTAN 1\n</b>          I don't know what stimulates you anymore.\n          Laurie backs into the hall, trying to get a grip.\n\n<b>          LAURIE\n</b>          Forget about it. I overreacted. It was\n          just strange to see--\n          Laurie can now see into the KITCHEN, where yet a THIRD DR.\n          MANHATTAN is working on an experiment. Her eyes blaze.\n\n<b>          LAURIE (CONT'D)\n</b>          How long have you been working in here?\n\n<b>          DR. MANHATTAN 1\n</b>          Laurie, try to understand--\n\n<b>          LAURIE\n</b>          Understand!? You're working in here at\n          the same time we're in bed!?\n\n<b>          DR. MANHATTAN 3\n</b>          My work with Adrian is at an important\n          stage. It seemed unnecessary to--\n\n<b>          LAURIE\n</b>          Shut up! Just SHUT YOUR MOUTH!\n          Laurie WHIPS a full BEAKER at 3's chest. It PASSES THROUGH\n          HIM and SMASHES IN THE KITCHEN SINK. Laurie storms out.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          39.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          DR. MANHATTAN 3\n</b>          Laurie, please--If you think there's a\n          problem with my attitude, I'm prepared to\n          discuss it--\n          As he speaks, the smashed BEAKER and its contents RISE INTO\n          THE AIR, REASSEMBLING perfectly in the palm of 3's hand.\n          IN THE HALL: Laurie nearly bumps into Dr. Manhattan 2.\n\n<b>          DR. MANHATTAN 2\n</b>          --but logically, not clouded with human\n          emotion.\n\n<b>          LAURIE\n</b>          Human emotion? You were human once.\n          That's the problem, Jon. You've forgotten\n          that.\n\n<b>          DR. MANHATTAN 2\n</b>          Laurie, where are you--\n          The door slams. Laurie's left. For good.\n          Dr. Manhattan 2 stands there. He walks back to the BEDROOM\n          where 1 is. Dr. Manhattan 1 holds an OLD PHOTO. In the photo\n          is a COUPLE, smiling into the camera. We recognize the woman\n          as Janey Slater, Dr. Manhattan's ex-girlfriend, who we saw in\n          Adrian's flashback at Blake's funeral. We recognize the man\n          in the photo as . Dr. Manhattan. When he was human.\n          Dr. Manhattan stares at the photo. Perhaps feeling the tingle\n          of human emotion again\n\n<b>          INT. DAN'S HOUSE - KITCHEN - EVENING\n</b>\n          Dan heats up some leftover Chinese food in the microwave as\n          the TV plays in the B/G:\n\n<b>          NEWS ANALYST (V.O.)\n</b>          --no one's fired their weapons yet, but\n          no one's lowered them either. Maybe these\n          other countries aren't so afraid of Dr.\n          Manhattan, maybe they're calling the\n          President's bluff. I'm very curious to\n          see what Dr. Manhattan himself has to say\n          in his live interview which should be in\n          about an hour or so\n          BOOM, BOOM! Dan looks up. Someone's banging on the door.\n          Hard.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          40.\n</b>\n<b>          INT. LIVING ROOM - EVENING\n</b>\n          Dan approaches the door, cautious, mask killer on his mind?\n\n<b>          DAN\n</b>          Who is it?\n\n<b>          LAURIE (O.S.)\n</b>          It's Laurie.\n\n<b>          DAN\n</b>          Laurie?\n          It takes a few moments for him to open the door.\n\n<b>          DAN (CONT'D)\n</b>          Sorry, I had a new lock installed, it's a\n          little sticky--\n\n<b>          LAURIE\n</b>          I left Jon.\n\n<b>          INT. DAN'S KITCHEN - NIGHT\n</b>\n          Dan pours a teary eyed Laurie a glass of RED WINE.\n\n<b>          DAN\n</b>          Did, uh, the Secret Service follow you\n          here?\n\n<b>          LAURIE\n</b>          I lost them in the subways. I think.\n\n<b>          DAN\n</b>          I'm really sorry, Laurie.\n\n<b>          LAURIE\n</b>          Living with him . Dan, you don't know\n          what it's been like.\n          INTERCUT TO: Dr. Manhattan, holding Laurie's BRA. Staring.\n\n<b>          LAURIE (V.0.) (CONT'D)\n</b>          The way he looks at things, like he can't\n          remember what they are, like he doesn't\n          really care. This world, the real world\n          to him it's like walking through\n          mist, and all the people are just\n          shadows. Shadows in the fog.\n          Dr. Manhattan lowers his head. A SHADOW FALLS OVER HIM. He\n          looks up to see a THREE PIECE SUIT floating before him--\n          waiting for its wearer.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          41.\n</b>\n<b>          EXT. STREET - NIGHT\n</b>\n          Dan and Laurie walk the streets, getting some air.\n\n<b>          LAURIE\n</b>          I hope I didn't ruin your night.\n\n<b>          DAN\n</b>          Not at all. I was just going to see\n          Hollis for our weekly beer session.\n          You're more than welcome to join. In\n          fact, I insist\n          They pass the news stand from the opening scene. The Homeless\n          Man is arguing with the News Vendor:\n\n<b>          NEWS VENDOR\n</b>          --I told you, this month's issue still\n          hasn't arrived yet! Why do you care about\n          that right wing rag so much? Cuz those\n          bastards don't give a damn about you,\n          pal! They--hold up, here it comes.\n          They turn as SEYMOUR, a fat slob of a man, arrives with a\n          BUNDLE of the latest issue of \"The New Frontiersman.\"\n          CUT TO: Dr. Manhattan stepping THROUGH and INTO the empty,\n          floating suit. His TIE knots itself.\n          Dr. Manhattan looks around the empty room . sad? Again,\n          he looks at the photo of him and Janey Slater . . then\n\n<b>          DISAPPEARS IN A BURST OF PARTICLES.\n</b>\n<b>          EXT. STREET - SAME TIME\n</b>\n          Dan and Laurie turn down a darker, less populated street.\n\n<b>          DAN\n</b>          Laurie, will you please stop apologizing?\n          I'm here for you anytime.\n          SHADOWS trail behind them, ominous. Someone's following.\n\n<b>          LAURIE\n</b>          I know. I just find it rude when people\n          show up at your door--\n\n<b>          INT. TELEVISION STUDIO - NIGHT\n</b>\n          The main waiting area. People go about their jobs. The\n          RECEPTIONIST hears a strange, electric CRACKLING\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          42.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE (V.0.)\n</b>          --completely out of the blue.\n          Suddenly, Dr. Manhattan appears in a burst of energy. The\n          receptionist SHRIEKS. The PRODUCER looks out his office.\n\n<b>          PRODUCER\n</b>          Terrific. Dr. Manhattan arrives and no\n          one thinks to tell me?\n\n<b>          RECEPTIONIST\n</b>          He, he just--\n\n<b>          PRODUCER\n</b>          All geez. We don't have time for make-up.\n          That blue is too light for television.\n          The light from Dr. Manhattan's SKIN DARKENS to a DEEPER BLUE.\n\n<b>          DR. MANHATTAN\n</b>          Is this dark enough?\n\n<b>          PRODUCER\n</b>          Uh, yeah\n\n<b>          EXT. ALLEY - SAME TIME\n</b>\n          Dan and Laurie turn down an alley. We now see who's following\n          them--a group of YOUNG THUGS.\n\n<b>          PRODUCER (V.0.)\n</b>          that's dark enough.\n\n<b>          INT. TELEVISION STUDIO - BACK STAGE - SAME TIME\n</b>\n          A White House PRESS AGENT escorts Dr. Manhattan to the set.\n\n<b>          PRESS AGENT\n</b>          Just another reminder that if the second\n          Geneva Convention comes up, our official\n          position is that talks will not resume\n          until the Chinese agree to exclude you\n          from the agenda. The President approved\n          this interview because he wanted to\n          strengthen morale at home and to gently\n          remind the rest of the world who holds\n          the cards. Please keep that in mind.\n          Dr. Manhattan stands off stage, waiting. The LIGHTS come up\n          and we're live with the glossy NEWS HOST.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          43.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          NEWS HOST\n</b>          He's been called many things; Hero,\n          weapon, linchpin of our security--\n          CUT TO: Dan and Laurie turning as the Young Thugs BLOCK THE\n          ALLEYWAY. One of the Thugs pulls a KNIFE. Laurie and Dan\n          exchange a look. Dan removes his glasses. CUT BACK TO:\n\n<b>          NEWS HOST (CONT'D)\n</b>          His given name is Jonathan Osterman--Dr.\n          Jonathan Osterman--a renowned nuclear\n          physicist who through a terrible accident\n          became the man the world knows today as\n          Dr. Manhattan.\n          The audience APPLAUDS loudly as Dr. Manhattan takes his seat.\n\n<b>          DR. MANHATTAN\n</b>          Thank you.\n\n<b>          NEWS HOST\n</b>          Thank you, Dr. Manhattan, and not simply\n          for appearing on this program. I believe\n          I speak for all of America when I thank\n          you for thwarting the terrorist plot at\n          the port of Long Beach over a week ago--\n          Furious applause from the audience, which Dr. Manhattan\n          regards curiously.\n\n<b>          DR. MANHATTAN\n</b>          It was my duty.\n           CUT TO: Dan and Laurie surrounded by the Thugs . when\n          suddenly they DIVE INTO the group, fighting like the heroes\n          they once were.\n          Dan grapples with one of the Thugs and knocks his knife away--\n          --when another Thug nails him from behind with a BAT. Dan\n          drops to the ground . BACK TO:\n\n<b>          NEWS HOST\n</b>          Before we start, I want to explain to our\n          viewers the unconventional format for\n          this interview. Our live audience is made\n          up entirely of news media and Dr.\n          Manhattan will be taking questions from\n          the floor. This commercial free broadcast\n          is presented to you by Veidt Enterprises.\n          We see Adrian standing near the audience with the Press\n          Agent, smiling for the camera.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          44.\n</b>\n<b>          CONTINUED: (2)\n</b>          CUT TO: Laurie, driving a FIST into a Thug's NOSE, when\n          another Thug GRABS HER HAIR.\n\n<b>          NEWS HOST (V.0.) (CONT'D)\n</b>          We will now take our first question--\n          The Thug draws a PISTOL on her. Dan, still on the ground,\n          sees the gun and his eyes narrow, harden. He pushes himself\n          up off the ground.\n          CUT BACK TO: The TV Studio AUDIENCE: where Doug Roth, the\n          journalist who interviewed Adrian earlier, stands.\n\n<b>          DOUG ROTH\n</b>          Dr. Manhattan, Doug Roth, Nova Times. Do\n          you remember a man named Wally Weaver?\n\n<b>          DR. MANHATTAN\n</b>          Yes, he was a good friend of mine. When\n          we were both physicists.\n\n<b>          DOUG ROTH\n</b>          He died of cancer.\n\n<b>          DR. MANHATTAN\n</b>          I remember. I attended his funeral.\n\n<b>          DOUG ROTH\n</b>          How about Edgar Jacobi, also known as the\n          supervillian Moloch? You had a lot of\n          battles with him, didn't you? Did you\n          know that he has cancer as-well?\n          The News Host looks confused. Adrian turns to the Press\n          Agent, growing concerned with where this is leading.\n          CUT TO: Dan, snapping the GUNMAN'S wrist back and up--\n          Barrel aimed at the Thug's CHIN. In the last fraction of a\n          second, Dan SHIFTS the gun two inches left as it FIRES,\n          deafening the Thug, but leaving him alive. BACK TO:\n\n<b>          DR. MANHATTAN\n</b>          I was not aware--\n\n<b>          DOUG ROTH\n</b>          And what about Jose Flores? He was the\n          longtime janitor at the Watchmen\n          Headquarters where you worked for many\n          years. Cancer.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          45.\n</b>\n<b>          CONTINUED: (3)\n</b>\n<b>          DR. MANHATTAN\n</b>          By your line of questioning, you're\n          suggesting that I was the cause of cancer\n          in these individuals.\n\n<b>          DOUG ROTH\n</b>          You tell me, doc.\n          Adrian turns to him.\n\n<b>          ADRIAN\n</b>          Doug, that `s enough.\n\n<b>          DR. MANHATTAN\n</b>          It is irrelevant whether I was the cause\n          or not.\n\n<b>          DOUG ROTH\n</b>          Irrelevant?\n\n<b>          DR. MANHATTAN\n</b>          A live human body and a dead human body\n          have the same number of particles.\n          Structurally there's no difference.\n          An appalled then angry buzz comes over the audience.\n\n<b>          DOUG ROTH\n</b>          What about Janey Slater? Do you think it\n          makes a difference to her?\n\n<b>          DR. MANHATTAN\n</b>          Janey Slater? Wh--\n\n<b>          DOUG ROTH\n</b>          Your ex-girlfriend, she was a physicist\n          too. You were with her for ten years. Or\n          does she have to remind you herself?\n          Suddenly Janey Slater emerges from a door at the top of the\n          stands. She is old now, frail, barely recognizable from the\n          images we've see of her.\n\n<b>          DOUG ROTH (CONT'D)\n</b>          She has cancer as well. Doctors have\n          given her six months. What do you have to\n          say, Ms. Slater?\n          He sticks the microphone in her face.\n\n<b>          JANEY SLATER\n</b>          D-damn you, Jon. God damn you\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          46.\n</b>\n<b>          CONTINUED: (4)\n</b>          She leaves as fast as she came, bursting into tears. Dr.\n          Manhattan stands, visibly shaken--\n\n<b>          DR. MANHATTAN\n</b>          No, Janey, wait!\n          In the audience, Adrian turns to the Press Agent, frantic.\n\n<b>          ADRIAN\n</b>          We need to stop this now.\n          Adrian and the Press Agent hurry on stage, SECURITY\n          following.\n\n<b>          PRESS AGENT\n</b>          That's it! Interview's over!\n          BACK TO: The alley, littered with the unconscious BODIES of\n          the Thugs. Laurie and Dan lean back on the wall, gasping for\n          air, horribly out of shape, but victorious.\n          CUT TO: The TV studio, as Adrian and Security surround Dr.\n          Manhattan, trying to escort him out. The audience spills out\n          of the stands, RUSHING Dr. Manhattan with questions and,\n          FLASHING cameras--it's madness. Adrian shoves a camera out of\n          Dr. Manhattan's face.\n\n<b>          ADRIAN\n</b>          As the sponsor of this program I demand\n          all cameras off!\n          His plea is futile, of course. A REPORTER breaks through,\n          gets in Dr. Manhattan's face.\n\n<b>          REPORTER 1\n</b>          Did you give Ms. Slater cancer by\n          sleeping with her?\n\n<b>          DR. MANHATTAN\n</b>          No. Please let me through\n\n<b>          REPORTER 2\n</b>          Do you even care about human life?\n\n<b>          DR. MANHATTAN\n</b>          Please. If everyone would just go away\n          and leave me alone.\n          Adrian hears the note of warning in his voice.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          47.\n</b>\n<b>          CONTINUED: (5)\n</b>\n<b>          ADRIAN\n</b>          Everyone back off! Don't you understand?\n          He's the only thing preventing the world\n          from chaos!\n\n<b>          DOUG ROTH\n</b>          How many other people did you do this to?\n          Dr. Manhattan finally SNAPS--\n\n<b>          DR. MANHATTAN\n</b>          I said LEAVE ME ALONE!\n          Every last person BURSTS INTO PARTICLES and DISAPPEARS. Dr.\n          Manhattan is suddenly alone. He looks stunned almost.\n\n<b>          EXT. ROOF - SAME TIME\n</b>\n          The TV audience materializes out on the roof\n\n<b>          EXT. ALLEY - NIGHT\n</b>\n          Dan and Laurie exit the quiet alley, trying to play it off.\n\n<b>          LAURIE\n</b>          I should find a hotel. God. Imagine, us\n          getting mugged.\n\n<b>          DAN\n</b>          Why don't you come by Hollis' with me?\n          Shake off the adrenaline.\n\n<b>          LAURIE\n</b>          No thanks, I've had enough hero stuff for\n          one night.\n          (walking away)\n          You take care, Dan. It's a dangerous\n          world out there.\n\n<b>          INT. HOLLIS MASON'S APARTMENT - NIGHT\n</b>\n          Hollis opens the door for Dan--\n\n<b>          HOLLIS\n</b>          You're late.\n\n<b>          DAN\n</b>          I know, you won't believe it--\n\n<b>          HOLLIS\n</b>          You missed it--Dr. Manhattan just lost it\n          on live TV.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          48.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          Wait, what?\n          Dan turns to the TV, which replays the clip of Dr. Manhattan\n          being accosted and then teleporting everyone to the roof.\n\n<b>          DAN (CONT'D)\n</b>          I was just with Laurie. She doesn't know.\n\n<b>          HOLLIS\n</b>          She'll know soon enough. The whole world\n          will know.\n\n<b>          INT. CAB (MOVING) - NIGHT\n</b>\n          Laurie rides in back, staring out at the street, calming\n          down. The cab stops at a red light; The CABBIE takes outa\n          ZIPPO,lights a cigarette. Laurie stares at the FLAME\n\n<b>          INT. WATCHMEN HEADQUARTERS - NIGHT (FLASHBACK - 15 YEARS AGO)\n</b>\n          like she stares at the flame here, as Adrian's display\n          burns. Laurie glances around as everyone leaves, apologizing\n          to Adrian.\n\n<b>          EXT. WATCHMEN HEADQUARTERS - NIGHT (FLASHBACK - 15 YEARS AGO)\n</b>\n          Outside Watchmen HQ, Dan's Owl Ship rises out of view.\n          Rorschach skulks off into the shadows. Dr. Manhattan and\n          Janey Slater get into a Town Car as young Laurie watches from\n          around the corner.\n\n<b>          BLAKE (O.S.)\n</b>          Laurel? Laurel Jane?\n          Startled, Laurie turns. Blake steps out of the shadows.\n\n<b>          BLAKE (CONT'D)\n</b>          You're Sally Jupiter's kid.\n\n<b>          LAURIE\n</b>          You're the Comedian, right? You were\n          pretty cool in there.\n          Blake lights a smoke, looks her over.\n\n<b>          BLAKE\n</b>          You got your mom's eyes. Even that funny\n          little mole.\n\n<b>          LAURIE\n</b>          Got another smoke?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          49.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          BLAKE\n</b>          She was one of the all-time champion\n          beauties, your mom. She talk about me\n          much?\n\n<b>          LAURIE\n</b>          No. Not really.\n          As Blake gives her a light, Laurie touches his hand to cover\n          the lighter from the wind. She looks up at him, sly.\n\n<b>          SALLY (O.S.)\n</b>\n<b>          TAKE YOUR HANDS OFF HER.\n</b>          Laurie nearly jumps out of her skin. A younger Sally marches\n          toward them from a LIMO, waiting at the sidewalk.\n\n<b>          BLAKE\n</b>          Hey Doll. Long time no see.\n\n<b>          SALLY\n</b>          Not long enough in my book, Eddie.\n          She eyes Laurie with cool death.\n\n<b>          SALLY (CONT'D)\n</b>          Put that out. Get in the car.\n          INSIDE THE LIMO: Laurie cracks her window an inch. Her\n          mother's harsh, low tone drifts clearly back.\n\n<b>          SALLY (CONT'D)\n</b>          Are there no depths you won't sink to?\n\n<b>          BLAKE\n</b>          Christ, we were just talking! Can't a guy\n          talk to his, y'know, friend's daughter?\n          What the hell do you think I am?\n\n<b>          SALLY\n</b>          I know what you are, Eddie. I've always\n          known. Don't ever forget that.\n          Driving off, Laurie watches Blake through the window--\n\n<b>          INT. CAB (STOPPED) - NIGHT\n</b>\n          --like she watches through the window in the present. The\n          light turns green--\n          --when a BLACK SUV pulls in front of the cab, BLOCKING its\n          path.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          50.\n</b>\n<b>          CONTINUED:\n</b>          The Cabbie honks his horn as a team of SECRET SERVICE AGENTS\n          get out of the SUV. Agent Forbes knocks on Laurie's window.\n\n<b>          AGENT FORBES\n</b>          Ms. Jupiter, you need to come with us now.\n\n<b>          INT. ROCKEFELLER BASE - COMMUNICATIONS ROOM - NIGHT\n</b>\n          Agent Forbes escorts her into the room.\n\n<b>          LAURIE\n</b>          I don't understand, what do you mean,\n          Jon's gone?\n\n<b>          AGENT FORBES\n</b>          I mean he snapped and disappeared during\n          the interview. Now our trackers can't\n          detect him anywhere on the planet. If we\n          want to find him you're our only hope.\n          A TECHNICIAN wires Laurie up; GRAPHS record Laurie's neural\n          responses, MONITORS show satellite images.\n\n<b>          TECHNICIAN 1\n</b>          Miss Jupiter, we need you to visualize\n          Dr. Manhattan. Do you need a prompt?\n\n<b>          LAURIE\n</b>          No.\n\n<b>          TECHNICIAN 2\n</b>          Neurotransmissions tracking.\n\n<b>          TECHNICIAN 3\n</b>          Transmitting on all frequencies.\n\n<b>          TECHNICIAN 1\n</b>          We're ready Miss Jupiter. We need you to\n          try and talk to him.\n          Laurie, wired like a porcupine, seems embarrassed.\n\n<b>          LAURIE\n</b>          Jon? Jon, can you hear me?\n          The GRAPH-NEEDLES jump and tick, searching\n          . when a high, clear TONE rings through the room.\n          Needles fly. Technicians dash to lock it down. Agent Forbes\n          hurries to the graph, looking over their shoulders.\n\n<b>          AGENT FORBES\n</b>          Have you got him?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          51.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          TECHNICIAN 1\n</b>          We've located his signal, yes.\n\n<b>          AGENT FORBES\n</b>          Well? Where the hell is he?\n          The Technician looks up, not happy about the answer.\n\n<b>          TECHNICIAN 1\n</b>          He's on Mars.\n\n<b>          EXT. REMOTE SATELLITE STATION - NIGHT\n</b>\n          HUGE DISHES scan the skies. We hear the high, clear tone,\n          above all the RADIO CHATTER, NEWS REPORTS and MILITARY\n          FREQUENCIES, the endless, echoing chaff of the world...\n\n<b>          NEWS REPORTER 1 (V.0.)\n</b>          --massive mobilization of troops in\n\n<b>          KASHMIR--\n</b>\n<b>          NEWS REPORTER 2 (V.0.)\n</b>          --unconfirmed reports of a gunfire\n          exchange in Tehran--\n\n<b>          NEWS REPORTER 3 (V.0.)\n</b>          --prompting the President to call an\n          emergency meeting with his National\n          Security Advisors--\n\n<b>          LAURIE (V.0.)\n</b>          Jon. Can you hear me, Jon?\n          But these VOICES get progressively QUIETER, as we--\n          ZOOM BACK: Up, out of the atmosphere, at a blinding rate--\n\n<b>          EXT. MARS - NIGHT\n</b>\n          --landing on A VAST MARTIAN PLAIN, and the tiny BLUE FIGURE,\n          walking across it, RED DUST BILLOWING behind him. The peace\n          and quiet after the cacophony of Earth is soothing.\n          Dr. Manhattan stops, looking over the landscape. He holds the\n          photo of him and Janey Slater in his hand, when he was human.\n          He stares at the photo a moment and closes his eyes--\n          --and we FLASHBACK to the moment that photo was taken. He and\n          Janey are at a CARNIVAL. After the flash, Janey turns to him.\n\n<b>          JANEY SLATER\n</b>          Aww, Jon, look--you've got cotton candy\n          on the side of your mouth\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          52.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          JON OSTERMAN\n</b>          You do too. Here, let me get it for you.\n          He pulls her close. They giggle like the young lovers they\n          are and then kiss, passionate\n          BACK TO: Dr. Manhattan walking on mars' surface. He\n          approaches a LARGE ROCK FORMATION which blocks his path.\n          He PARTS the rock formation telekinetically, like Moses\n          parting the sea--\n          --and we FLASHBACK, mirroring the parting of the rock\n          formation to the parting of two SLIDING DOORS, in the LAB OF\n          A NUCLEAR TESTING FACILITY, as Jon steps into the REACTOR\n\n<b>          CHAMBERÂ\u0080\u0094\n</b>\n<b>          JON OSTERMAN (CONT'D)\n</b>\n<b>          (YELLING)\n</b>          I'll catch up with you guys--I left my\n          watch inside .\n          Jon backs into the chamber without noticing the DIGITAL CLOCK\n          above the doors counting down: 3 2 1--\"TIME LOCK\n          INITIATED\"--the doors CLOSE .\n          BACK TO: Dr. Manhattan on Mars as he stops to pick up a\n          STRANGE ROCK. It's beautiful--the colors, the crystals--\n          unlike anything we've ever seen--\n          --and we FLASHBACK to Jon's lab COLLEAGUES watching in horror\n          as Jon retrieves his WATCH, oblivious. They try to open the\n          door, but it's no use--the time lock can't be overridden.\n          Janey arrives, SCREAMS when she sees Jon inside. Jon turns,\n          sees all the terrified faces staring at him.\n\n<b>          JON OSTERMAN (CONT'D)\n</b>          Janey? What's wrong?\n\n<b>          JANEY SLATER\n</b>          The time lock, Jon!\n          As it dawns on Jon, he hears the hum of the REACTOR\n          INITIATING, the big mechanical parts moving. Jon runs to the\n          door, BANGS on it.\n\n<b>          JON OSTERMAN\n</b>          Janey: Oh my god!\n          TEARS stream down Janey's face as she looks at him through\n          the thick glass, helpless, hopeless. Inside, the chamber\n          starts to GLOW .\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          53.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          JANEY SLATER\n</b>          I'm sorry, Jon, I can't--\n          Janey can't bear to watch--she runs out of the lab as the\n          reactor initiates\n\n<b>          JON OSTERMAN\n</b>\n<b>          JANEY!\n</b>          . and with a BLINDING FLASH--Jon and his watch are\n          OBLITERATED to bits .\n          BACK TO: Dr. Manhattan on Mars, as he obliterates the strange\n          rock he was holding to bits\n          and we FLASHBACK to the lab CAFETERIA. Janey sits at a\n          table, crying softly, being consoled by her colleagues\n          CUT TO: OUTSIDE THE NUCLEAR FACILITY, by the barbed wire\n          fences, A DISEMBODIED BRAIN, A SET OF EYES, AND A SPINAL\n\n<b>          COLUMN MATERIALIZES .\n</b>          BACK TO: Dr. Manhattan on Mars, as he RISES into the air. At\n          a thought, the RED SAND FUSES into a beautiful, PINK GLASS\n\n<b>          STRUCTURE--\n</b>          --and we FLASHBACK to the cafeteria KITCHEN as a COOK SHRIEKS\n          at A WALKING NETWORK OF HUMAN VEINS--\n          BACK TO: The pink glass structure on Mars which SPREADS OUT\n          INTO COMPLEX GLASS PATTERNS, RISING FROM THE PLAIN at Dr.\n          Manhattan's command--\n          --and we FLASHBACK to the cafeteria HALLWAY as a SKELETON\n          passes two terrified GUARDS\n          BACK TO: Dr. Manhattan, now dwarfed by the RISING, EVOLVING\n          GLASS STRUCTURE, which begins to resemble parts of a WATCH--\n          --and we FLASHBACK to the cafeteria. Janey's still crying.\n          One of her Colleagues reaches for her hand when STATIC SPARKS\n          snap around them. All over the cafeteria, the METAL UTENSILS\n          begin to SPARK. In the center of the room, GLOWING BLUE\n          PARTICLES begin to collect, SLAMMING INTO EACH OTHER with\n          amazing force\n          and in a BLINDING FLASH, THE PARTICLES FORM DR.\n          MANHATTAN, hovering over the room like a newborn god.\n          Everyone in the cafeteria looks up in awe, in fear and--\n\n<b>          JANEY SLATER\n</b>          Oh god . Jon is that you?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          54.\n</b>\n<b>          CONTINUED: (3)\n</b>          --recognition.\n          BACK TO: Mars, where Dr. Manhattan's GLASS PALACE rises in\n          its full glory. A home fit for a god.\n\n<b>          INT. ROCKEFELLER BASE - COMMUNICATIONS ROOM - NIGHT\n</b>\n          PULL OUT FROM: A SATELLITE IMAGE of MARS. NOISE filters back\n          in, as TECHNICIANS buzz this way and that, desperate.\n\n<b>          AGENT FORBES\n</b>          There must be some way to contact him.\n          Laurie sits in the room, largely forgotten.\n\n<b>          LAURIE\n</b>          Agent Forbes.\n\n<b>          AGENT FORBES\n</b>          (distracted, annoyed)\n          What?\n\n<b>          LAURIE\n</b>          I need to go to the bathroom.\n          Agent Forbes gives her a look, then waves for a SECRET\n          SERVICE AGENT to escort her.\n\n<b>          INT. ROCKEFELLER MILITARY BASE - HALLWAY - NIGHT\n</b>\n          Laurie heads to the bathroom, trailed by the Secret Service\n          Agent. As she reaches the bathroom door--\n          --she suddenly SPINS and ELBOWS the agent in the GROIN. The\n          Agent buckles; Laurie grabs him by his coat, SHOVES his head\n          through the bathroom door and SLAMS THE DOOR on his head.\n\n<b>          INT. BATHROOM - CONTINUOUS\n</b>\n          Laurie drags the groggy Agent into the bathroom. She takes\n          his GUN, pulls it on him.\n\n<b>          LAURIE\n</b>          You're getting me out of here.\n\n<b>          SECRET SERVICE AGENT\n</b>          We're only detaining you for national\n          security purposes. Don't you understand?\n\n<b>          LAURIE\n</b>          Don't you understand that sitting there\n          with a bunch of high tech radios and\n          monitors isn't going to bring him back?\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          55.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE (CONT'D)\n</b>          Only one thing can bring ion back and\n          that's Jon. If he wants to find me, he's\n          quite capable of doing so on his own.\n          I've been a prisoner in my live long\n          enough. You are taking me out of here\n          because if you don't, and Jon does come\n          back, I'm going to let him know who was\n          naughty and who was nice. And he won't\n          give you a lump of coal--he'll turn you\n          into one, understand?\n          The Agent eyes her, then reluctantly gets to his feet.\n\n<b>          INT. DAN DREIBERG'S HOUSE - BEDROOM - DAWN\n</b>\n          Dan sleeps peacefully in his bed when a SHADOW moves over Dan\n          . dropping a NEWSPAPER on his LAP, waking Dan with a\n          gasp. Rorschach hovers beside the bed.\n\n<b>          DAN\n</b>          Jesus! Rorschach\n\n<b>          RORSCHACH\n</b>          Good morning, Daniel. I brought in your\n          paper.\n          Dan reads the headline: \"DR. MANHATTAN LEAVES EARTH.\"\n\n<b>          RORSCHACH (CONT'D)\n</b>          The Comedian murdered. Dr. Manhattan\n          exiled. Two of us gone within a week.\n          Who's next? Veidt? Ms. Jupiter? Me? You?\n          Rorschach turns for the door as Dan reads the story.\n\n<b>          RORSCHACH (CONT'D)\n</b>          By the way, that new lock broke after one\n          shove.\n\n<b>          DAN\n</b>          My new lock?\n\n<b>          RORSCHACH\n</b>          Get a stronger one, Daniel. You can't be\n          too security conscious these days.\n\n<b>          START WORLD MONTAGE:\n</b>\n<b>           RORSCHACH (V.0.) (CONT'D)\n</b>          These days nobody's safe.\n          We see the same Pakistani Soldiers from before, only now\n          there are dozens more TROOPS with them, mobilizing on the\n          border as are their Indian counterparts--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          56.\n</b>\n<b>          CONTINUED:\n</b>          CUT TO: The Chinese Battleships we saw before, moving towards\n          the coast of Taiwan. They FIRE SHOTS--\n          CUT TO: The Israel Missile Control room we were in before now\n          bustles with frantic action.\n\n<b>          AIDE\n</b>          --three synagogues were bombed in Tel\n          Aviv, a bus exploded in Jerusalem--\n\n<b>          ISRAELI OFFICER\n</b>          Enough!\n\n<b>          (BEAT)\n</b>          Begin the first wave of air strikes.\n\n<b>          INT. WHITE HOUSE - WAR ROOM - DAY\n</b>\n          A HUGE MAP OF THE WORLD is projected onto the war-room\n          screens. The President and his ADVISORS look up at it.\n\n<b>          SECRETARY OF STATE\n</b>          The Chinese have already made their move.\n          India and Pakistan have engaged and\n          everyone in the Middle East is going at\n          Israel. Time to start picking sides, Mr.\n          President.\n\n<b>          PRESIDENT\n</b>          Forget picking sides--first, are we safe?\n\n<b>          SECRETARY OF HOMELAND SECURITY\n</b>          We've increased security at all entry\n          points: water ports, airports and border\n          patrol.\n\n<b>          PRESIDENT\n</b>          I want the National Guard put on the\n          border. As for the rest of it . let's\n          not jump into the fray just yet.\n\n<b>          SECRETARY OF DEFENSE\n</b>          Mr. President, I urge you to--\n\n<b>          PRESIDENT\n</b>          Let's just wait, okay?! Maybe he'll come\n          back.\n          (beat, wishful)\n          Maybe he'll come back.\n\n<b>          INT. VEIDT ENTERPRISES - MAIN LOBBY - DAY\n</b>\n          Adrian steps off the elevator when he's met by his Assistant.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          57\n</b>\n<b>          CONTINUED:\n</b>\n<b>          ASSISTANT\n</b>          Clock's ticking, Mr. Veidt.\n\n<b>          ADRIAN\n</b>          I know. I'm meeting the toy people, yes?\n\n<b>          ASSISTANT\n</b>          Eleven-thirty. They want to talk to you\n          about some new villains for the\n          \"Ozymandias\" line.\n\n<b>          ADRIAN\n</b>          All the old villains are dead.\n\n<b>          ASSISTANT\n</b>          What's with everybody today? Everyone's\n          on this death trip.\n\n<b>          ADRIAN\n</b>          I suppose the threat of war has that\n          effect.\n          ACROSS THE WAY, Dan enters the building, intercepts Adrian.\n\n<b>          DAN\n</b>          Adrian, I need to talk to you.\n          Adrian looks put off.\n\n<b>          ADRIAN\n</b>          Dan, I'm sorry, this is a bad time.\n\n<b>          DAN\n</b>          But what about what happened with ion?\n          Adrian excuses himself from his Assistant.\n\n<b>          ADRIAN\n</b>          Jon's departure is terrible. Not only for\n          what's happening in the world now, but\n          for what could have happened. The energy\n          project he and I were working on--it's\n          dead now .\n\n<b>          DAN\n</b>          Rorschach came to see me again. Maybe\n          there's something to this mask killer\n          thing.\n\n<b>          ADRIAN\n</b>          Are you still preoccupied with the\n          ramblings of that lunatic? I really don't\n          have time for this, Dan.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          58.\n</b>\n<b>          CONTINUED: (2)\n</b>          Adrian walks away, continuing on with his Assistant\n          when a MAN in a TRENCHCOAT approaches the pair. He DRAWS A\n          GUN on them .\n\n<b>          PERSONAL ASSISTANT\n</b>          Sometimes I can't bear to watch the news.\n          It makes it so hard to be\n          optimistic Is that a gun?\n          Dan sees what's happening--\n\n<b>          DAN\n</b>          Adrian!\n          BANG! The man SHOOTS the Assistant in the gut; Adrian\n          immediately springs into action--he moves with unbelievable\n          speed and quickness, grabbing a velvet ROPE-STANCHION--\n          --DEFLECTING A SECOND BULLET with it--\n          --and SMASHING IT INTO THE FACE OF THE ASSASSIN, knocking him\n          into a FOUNTAIN.\n          SECURITY GUARDS run, guns drawn, toward the fountain where\n          Adrian GRAPPLES with the dazed man.\n\n<b>          SECURITY GUARD\n</b>          Mr. Veidt! Let us handle it!\n\n<b>          ADRIAN\n</b>          Wait, he's got a poison capsule!\n          He JAMS his fingers into the Assassin's mouth when Dan\n          arrives.\n\n<b>          ADRIAN (CONT'D)\n</b>          Don't bite down, you scum! I want to know\n          who sent you!\n          The Assassin's eyes BULGE\n\n<b>          ADRIAN (CONT'D)\n</b>          I want to know who's behind this!\n          The Assassin CHOKES and dies. Adrian DROPS him,\n          unanswered. He looks over at Dan, frustrated.\n\n<b>          INT. CAFE - AFTERNOON\n</b>\n          Dan and Laurie sit in the back of the cafe, making sure they\n          have privacy.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          59.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE\n</b>          Oh my god. Where's Adrian now?\n\n<b>          DAN\n</b>          Talking to the cops. Thank god he's still\n          in great shape. You get so caught up with\n          the whole smartest man in the world thing\n          you forget what a physical specimen he is-\n          -he's as fast as I've ever seen him\n\n<b>          (BEAT)\n</b>          What about you? What are you going to do?\n\n<b>          LAURIE\n</b>          I'm not sure. I can't go stay with my mom-\n          -I'm sure that's the first place they'll\n          look. But I need to get out of the city.\n          It's only a matter of time before they\n          find me.\n\n<b>          DAN\n</b>          Listen, why don't you . how about you\n          stay at my place?\n\n<b>          LAURIE\n</b>          Oh, Dan, I couldn't impose--\n\n<b>          DAN\n</b>          It wouldn't be an imposition, I have an\n          extra room. We're friends. And with\n          everything that's been happening\n\n<b>          LAURIE\n</b>          You're buying into Rorschach's \"mask\n          killer\" theory?\n\n<b>          DAN\n</b>          I don't know. But it can't hurt to be\n          safe. Besides, I've already had one\n          wanted person visit me, another one won't\n          make a difference.\n          They look at each other. Laurie smiles.\n\n<b>          LAURIE\n</b>          Okay.\n\n<b>          (BEAT)\n</b>          So this guy who tried to kill Adrian--who\n          was he?\n\n<b>          INT. LIVING ROOM - APARTMENT - SAME TIME\n</b>\n\n<b>          DAN (V.0.)\n</b>          Some local low-life named Roy Chess\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          60.\n</b>\n<b>          CONTINUED:\n</b>          Rorschach investigates the apartment of ROY CHESS, Adrian's\n          would-be assassin. The place is decent but messy.\n          Rorschach spots a PORNO MAG on the coffee table. On the couch\n          nearby, a pair of PANTS. Rorschach picks them up, reaches\n          into the pockets. He pulls out some cash, credit cards--\n          --and an ID for Pyramid Industries. It says Chess was a\n          security guard\n          . and then Rorschach remembers the pension check he saw\n          at Moloch's house. From Pyramid Industries.\n          Rorschach sees a LAPTOP over on the kitchen table. The\n          computer is on and shows the SERVER for Pyramid Industries.\n          Rorschach navigates the server until he finds the EMPLOYEE\n\n<b>          DIRECTORY.\n</b>          Once in the directory he pauses for a second. Then he types\n          in a name: \"Jane Slater.\"\n          A photo of Janey Slater pops up--\"Status: RETIRED.\"\n          Rorschach stares at the screen, excited at the connection.\n\n<b>          EXT. STREET - NIGHT\n</b>\n          We're in Rorschach's POV as he walks down the street. From\n          the non-reaction of passers by, he obviously doesn't have his\n          mask on.\n\n<b>          RORSCHACH (V.O.)\n</b>          Rorschach's Journal, October 19th.\n          Someone tried to kill Adrian Veidt.\n          Proves mask killer theory--the murderer\n          is closing in. Pyramid Industries is the\n          key.\n          Rorschach approaches a TRASH CAN. He rummages through it and\n          finds an ENVELOPE. He opens it and finds a NOTE that reads:\n          \"Tonight 11:30, M.\"\n\n<b>           RORSCHACH (V.O.) (CONT'D)\n</b>          Checked mail drop, got a message from\n          Moloch. Was just going to pay him a\n          visit.\n          Rorschach turns down an alley, approaches a DUMPSTER. He\n          reaches behind the dumpster.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          My things are where I left them. My coat.\n          My gloves\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          61.\n</b>\n<b>          CONTINUED:\n</b>          Still in his POV, we watch him put each article on. Then he\n          pulls out his MASK.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          . my face.\n          Rorschach pulls his mask on, FILLING THE SCREEN\n\n<b>          INT. MOLOCH'S KITCHEN - NIGHT\n</b>\n          CLOSE ON: MOLOCH'S EYES staring fearfully out the rainy\n          window. Rorschach APPEARS in the darkness behind him.\n\n<b>          RORSCHACH\n</b>          Somebody tried to shoot the world's\n          smartest man today, Moloch.\n          Moloch sits at the kitchen table. CLOSE ON: MOLOCH'S HAND. An\n          ignored CIGARETTE smolders. In his other hand, a NOTE.\n\n<b>          RORSCHACH (CONT'D)\n</b>          The hitman worked for Pyramid Industries.\n          So did Janey Slater and everyone else Dr.\n          Manhattan allegedly gave cancer to. And\n          last time I was here, I saw a pension\n          check sent to you from the same company--\n          obviously a front set up by whoever it is\n          that killed the Comedian, that pushed Dr.\n          Manhattan over the edge, that wants us\n          masks dead. Is that why you left me a\n          note in my mail drop? You have something\n          to confess?\n          Rorschach turns. A HOLE gapes between Moloch's staring eyes.\n          A PISTOL lies on the table--Moloch's dead.\n          Rorschach carefully pulls the NOTE from Moloch's hand. It's\n          the note Rorschach had left in Moloch's refrigerator, the one\n          that reads: \"LOOK BEHIND YOU.\"\n          Behind Rorschach, BLINDING LIGHT GLARES THROUGH THE WINDOW.\n\n<b>          DET. FINE (O.S.)\n</b>          (over LOUDSPEAKERS)\n\n<b>          RORSCHACH, THIS IS THE POLICE!\n</b>\n<b>          RORSCHACH\n</b>          No.\n\n<b>          DET. FINE (O.S.)\n</b>\n<b>          WE KNOW YOU'RE IN THERE.\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          62.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          No. No, no, no\n\n<b>          DET. FINE (O.S.)\n</b>\n<b>          IF THERE'S ANYONE IN THERE WITH YOU, SEND\n</b>\n<b>          THEM OUT UNHARMED.\n</b>          Moloch's corpse stares at Rorschach. Rorschach TEARS OPEN the\n          cupboards, pulling items off the shelves.\n\n<b>          RORSCHACH\n</b>          Framed. Set up. Walked right into it.\n          Stupid, stupid, stupid.\n\n<b>          DET. FINE (O.S.)\n</b>\n<b>          LET'S MAKE THIS A NICE, CLEAN SURRENDER.\n</b>\n<b>          RORSCHACH\n</b>          Heh. Never. Never surrender.\n          Rorschach takes an AEROSOL CAN and a PEPPER SHAKER.\n\n<b>          DET. FINE (O.S.)\n</b>\n<b>          ALRIGHT. I HOPE YOU'RE READY, \"HERO.\"\n</b>          Rorschach's mask DISAPPEARS back into darkness.\n\n<b>          RORSCHACH\n</b>          When you are\n\n<b>          INT. MOLOCH'S BROWNSTONE - FOYER - CONTINUOUS\n</b>\n          CRASH! Moloch's door is SMASHED OPEN. Armed SWAT COPS swarm\n          in, but no more than three can fit in the narrow entry way.\n\n<b>          SWAT COP 1\n</b>          It's a bum tip, I'm telling you.\n\n<b>          SWAT COP 2-\n</b>          Keep your eyes open.\n          SWAT Cop 1 moves down the hall, carelessly ahead of formation-\n          --BEHIND HIM, Rorschach APPEARS out of the darkness. He\n          IGNITES the AEROSOL CAN'S STREAM, SPRAYING THE COPS WITH\n          FIRE. They fall back, screaming, shooting. SWAT Cop 1 catches\n          the worst of it--he DROPS AND ROLLS on the floor, trying to\n          extinguish the flames on him.\n          Rorschach BOLTS upstairs, IGNITING the staircase behind him.\n          Pandemonium.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          63.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          SWAT COP 3\n</b>          Where'd he go?\n\n<b>          SWAT COP 2\n</b>          Upstairs! He's upstairs! Go!\n\n<b>          INT. MOLOCH'S BROWNSTONE - SECOND FLOOR - CONTINUOUS\n</b>\n          SWAT COPS top the 2nd floor landing, already lit by fire.\n\n<b>          SWAT COP 3\n</b>          Where is he?!\n          (into radio)\n          Send the second team in! Graves is down!\n          And we need a fire unit. All this smoke--\n\n<b>          SWAT COP 2\n</b>          Stay calm, the file says he never goes\n          armed.\n          Rorschach APPEARS, blowing PEPPER INTO COP 2'S EYES.\n\n<b>          SWAT COP 2 (CONT'D)\n</b>\n<b>          AHH! I CAN'T SEE!\n</b>\n<b>          SWAT COP 3\n</b>          Get out of the way! I don't have room to--\n          SWAT Cop 3 CLEARS his line of fire and finds Rorschach\n\n<b>          AIMING THE GRAPPLING GUN AT HIS CHEST .\n</b>\n<b>          SWAT COP 3 (CONT'D)\n</b>\n<b>          SHIT\n</b>          The HOOK BLOWS THE BODY-ARMORED COP OVER THE RAILING.\n\n<b>          EXT. MOLOCH'S BROWNSTONE - NIGHT\n</b>\n          Det. Gallagher and Fine watch from behind a LINE OF COP CARS.\n          The house is now BLAZING. Smoke and men's screams drift out.\n\n<b>          DET. FINE\n</b>          We've got him. There's no way out.\n          From the second floor, Rorschach SMASHES THROUGH THE WINDOW,\n          snarling like a rabid dog, landing hard on the concrete. His\n          ankle TWISTS, dropping him to the ground.\n          Rorschach struggles to get to his feet. When he looks up he\n          finds TWENTY COPS IN A SEMI-CIRCLE before him. A loaded,\n          pregnant pause. The COPS RUSH FORWARD.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          64.\n</b>\n<b>          CONTINUED:\n</b>          But Rorschach holds up a gloved hand. And they all stop,\n          unsure what this lunatic will do next.\n\n<b>          RORSCHACH\n</b>          Ten years. I've waited for this.\n          He beckons them forward. The cops PILE INTO HIM. Rorschach\n          brutally disables six cops before he is overwhelmed.\n\n<b>          RORSCHACH (CONT'D)\n</b>          No pain. Must get up. Find who framed me--\n          A Cop KICKS HIM in the throat. Rorschach drops again.\n\n<b>          FINE\n</b>          Get that mask off him!\n\n<b>          COP 1\n</b>          I got it. Christ, he stinks!\n\n<b>          RORSCHACH\n</b>          No no no NO NO NO!\n          The Cop peels back the shifting mask to reveal the Homeless\n          Man from the news stand. He screams at them wildly.\n\n<b>          RORSCHACH (CONT'D)\n</b>          My face! Give it back to me!\n          Rorschach is finally beaten, surrounded by cops, as Moloch's\n          house blazes in the background.\n\n<b>          RORSCHACH (CONT'D)\n</b>\n<b>          GIVE ME BACK MY FACE!\n</b>\n<b>          INT. DAN'S HOUSE - DAY\n</b>\n          Dan is at the front door, fixing the lock Rorschach busted\n          twice, when Laurie comes down the stairs, yawning.\n\n<b>          LAURIE\n</b>          What time is it?\n\n<b>          DAN\n</b>          Noon. Thought I'd let you sleep in.\n          Laurie smiles at him. Is Dan crazy or does he sense a spark?\n          She touches his shoulder as she turns into the living room,\n          then turns on the TV:\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          65.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          ANCHORWOMAN\n</b>          Today, police searched the apartment of\n          Walter Kovacs, better known as the masked\n          vigilante Rorschach. Kovacs was captured\n          last night and charged with the murder of\n          Edgar Jacobi, formerly known as the\n          supervillain Moloch. Moloch was found\n          shot in the head at point blank range.\n          Both Dan and Laurie stop what they're doing, eyes fixed on\n          the TV: They see Rorschach, unmasked, IN SHACKLES.\n\n<b>          ANCHORWOMAN (CONT'D)\n</b>          Inside the decrepit apartment, police\n          discovered stacks of right-wing\n          literature, including several years of\n          back issues of the ultra-conservative\n          publication, \"The New Frontiersman.\" We\n          asked \"New Frontiersman\" editor, Hector\n          Godfrey, for comment.\n          CUT TO: A clip of the EDITOR being interviewed. We see\n          Seymour, who we met at the news stand, in the background.\n\n<b>          EDITOR\n</b>          Rorschach is an American patriot and we\n          are proud that he reads this publication.\n\n<b>          ANCHORWOMAN\n</b>          During his capture, Kovacs assaulted and\n          severely injured at least nine police\n          officers, shooting one officer with a\n          grappling gun. That officer is in serious\n          but stable condition.\n\n<b>          ANCHORMAN\n</b>          Meanwhile, in Kashmir, fighting continues\n          to intensify. Both India and Pakistan\n          alluded that the use of nuclear weapons\n          is not out of the question--\n          Laurie shuts off the TV, not wanting to hear the war talk.\n\n<b>          LAURIE\n</b>          That mask's eaten Rorschach's brains\n          away.\n\n<b>          DAN\n</b>          He wasn't always like that. We were a\n          great team--tactically, he was brilliant.\n          But I don't know, something about this\n          murder charge I just can't see\n          Rorschach shooting Moloch.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          66\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          LAURIE\n</b>          He shot a cop with a grappling gun.\n\n<b>          DAN\n</b>          Don't remind me, I made that thing for\n          him. But a regular gun just seems too\n          . ordinary\n\n<b>          LAURIE\n</b>          And this war, god. Sometimes I wish I\n          could just leave the planet. Like Jon.\n\n<b>          DAN\n</b>          Oh sure. The old Manhattan Transfer.\n\n<b>          LAURIE\n</b>          Now, that's funny. That's what you call\n          Jon's teleportation?\n\n<b>          DAN\n</b>          Well, not to his face.\n          Laurie laughs.\n\n<b>          INT. PRISON HALLS - DAY\n</b>\n          Rorschach walks, led by TWO CORRECTIONAL OFFICERS. From the\n          cells, PRISONERS shout insults, death threats. Rorschach\n          stares ahead. Silent. Calm.\n\n<b>          INT. PRISON PSYCH ROOM - DAY\n</b>\n          The PRISON PSYCHIATRIST, Black, amiable, a mite portly, sits\n          across the table from Rorschach sans mask: Cold and\n          frightening. The Psychiatrist reads his FILE.\n\n<b>          PSYCHIATRIST\n</b>          Walter Kovacs. Is that your name?\n          Walter?\n\n<b>          RORSCHACH\n</b>          No.\n          The Psychiatrist sits back, considering Rorschach carefully.\n\n<b>          PSYCHIATRIST\n</b>          Let me explain your situation here,\n          Walter. If you cooperate with me, I may\n          be able to convince them that you should\n          to be treated medically, in a hospital,\n          which I believe is best for you. But the\n          authorities want to put you in General\n          Population.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          67\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          A prison is a prison.\n\n<b>          PSYCHIATRIST\n</b>          Yes, but the difference is, downstairs?\n          They'll eat you alive.\n          He holds up a RORSCHACH BLOT-CARD.\n\n<b>           PSYCHIATRIST (CONT'D)\n</b>          Now . . tell me what you see.\n          FLASH OF: A DEAD DOG. Bloody, horrible.\n\n<b>          RORSCHACH\n</b>          A pretty butterfly.\n          The Psychiatrist holds up another blot-card.\n\n<b>          PSYCHIATRIST\n</b>          How about this one? What do you see here?\n          FLASH OF: Rorschach, as a LITTLE BOY, watching his MOTHER,\n          HALF NAKED, EMBRACE A MAN AS HE HANDS HER SOME MONEY. When\n          she catches Rorschach interrupting, she SMACKS him in the\n          face. Shuts the door on him.\n\n<b>          RORSCHACH\n</b>          Some nice flowers.\n          The Psychiatrist eyes him, dubious. Holds up another card.\n          FLASH OF: Rorschach as a little boy looking up at TWO OLDER\n          BOYS, teasing him. Calling him \"son of a whore.\" Rorschach\n          just wants to be left alone when one of the Boys SPITS in his\n          face. Suddenly, Rorschach's face changes. He attacks the Boy\n          like a wild animal--biting, clawing .\n\n<b>          RORSCHACH (CONT'D)\n</b>          Clouds.\n          The Psychiatrist sighs, puts the cards down.\n\n<b>          PSYCHIATRIST\n</b>          Tell me about Rorschach. Will you do\n          that?\n\n<b>          RORSCHACH\n</b>          Why are you here with me, doctor?\n\n<b>          PSYCHIATRIST\n</b>          Because I want to make you well.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          68.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          RORSCHACH\n</b>          There's other men in here with behavior\n          more extreme than mine. Of course,\n          they're not famous. You want to know\n          about Rorschach, doctor? I'll tell you\n          about Rorschach\n\n<b>          EXT. CITY STREETS - NIGHT (FLASHBACK - 13 YEARS AGO)\n</b>\n           Rorschach, walks through intermittent STREETLIGHTS. In his\n           GLOVE, he holds a PHOTO of an angelic SIX YEAR OLD GIRL.\n\n<b>           RORSCHACH (V.0.)\n</b>           I was investigating a kidnap case. Blair\n          Roche, 6 year old girl. I was young then.\n          Too soft on criminals. I let them live.\n\n<b>          EXT. HOUSE - NIGHT (FLASHBACK - 13 YEARS AGO)\n</b>\n          A creepy, deserted-looking house. Rorschach peers through a\n          slatted fence at TWO GERMAN SHEPHERDS FIGHTING.\n\n<b>          RORSCHACH (V.0.)\n</b>          Broke a man's arm to get a tip. Led me to\n          the missing girl's location.\n\n<b>          INT. HOUSE - NIGHT (FLASHBACK - 13 YEARS AGO)\n</b>\n          CRACK! The front door is KICKED OPEN, smashing the lock.\n          Rorschach moves between a line of headless MANNEQUINS. In one\n          corner rests an old WOOD-BURNING STOVE. Rorschach peers\n          inside, removes a BLACKENED scrap of UNDERWEAR. It's\n          decorated with little hearts and bears.\n\n<b>          RORSCHACH (V.0.)\n</b>          I knew the girl was here. But when I\n          searched the place I found nothing.\n\n<b>          INT. HOUSE - KITCHEN - NIGHT (FLASHBACK - 13 YEARS AGO)\n</b>\n          Rorschach enters the kitchen. Out the window, the DOGS are\n          fighting. Rorschach opens a cupboard, where a line of KNIVES,\n          CLEAVERS and a HACKSAW hang on hooks. Outside, the snarling\n          dogs get LOUDER.\n          Slowly now, Rorschach's gaze moves from the knives . to\n          the counter. He runs his gloved finger along RED STAINED,\n          DEEP-CUT GROOVES in a THICK WOODEN CHOPPING BLOCK. Blood. His\n          gaze continues out the window\n\n<b>          RORSCHACH (V.0.)\n</b>          And then I found her.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          69.\n</b>\n<b>          CONTINUED:\n</b>          . to the dogs, still fighting over the BONE, which we now\n          recognize as a small, HUMAN FEMUR--that of the little girl.\n          Rorschach clenches his hands in fury, his fists tremble\n          and suddenly, he relaxes. Calms.\n          Rorschach slowly turns to the cupboard. He reaches for a\n          large CLEAVER .\n\n<b>          EXT. HOUSE - LATER (FLASHBACK - 13 YEARS AGO)\n</b>\n          The CHILD MOLESTER, greasy and fat, walks past the now-silent\n          fence.\n\n<b>           RORSCHACH (V.0.)\n</b>           It was dark when the murderer got back.\n           As dark as it gets.\n\n<b>          INT. HOUSE - NIGHT (FLASHBACK - 13 YEARS AGO)\n</b>\n           The Man flicks a LIGHT SWITCH. Nothing. He draws a GUN.\n\n<b>           INT. HOUSE KITCHEN - NIGHT (FLASHBACK - 13 YEARS AGO)\n</b>\n          He tries the light in here. Nothing again. He turns away as\n          the BODY of a DEAD GERMAN SHEPARD CRASHES THROUGH THE WINDOW!\n          He SCRAMBLES through the warehouse, falling over mannequins.\n          He FIRES madly into the dark. The SECOND DOG SMASHES INTO HIM\n          FROM A SECOND WINDOW. His gun goes flying. He scrambles\n          backward against the stove.\n          FROM BEHIND, Rorschach CUFFS THE MAN'S WRIST TO THE STOVE.\n          When the Child Molester sees that \"face,\" he loses his\n          bladder. Rorschach just stares, mask-blots shifting\n\n<b>          CHILD MOLESTER\n</b>          You think I had something to do with that\n          girl? I didn't! Where's your evidence?\n          Rorschach calmly points to body of the dog. (It is the\n          same image Rorschach saw in the first blot-card.)\n\n<b>          CHILD MOLESTER (CONT'D)\n</b>          Okay, I confess! I kidnapped her! I\n          killed her! Arrest me!\n\n<b>          RORSCHACH\n</b>          Men get arrested.\n          Rorschach RAISES THE CLEAVER, high over his head\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          70.\n</b>\n<b>          CONTINUED:\n</b>          RORSCHACH (cont'd)\n          Dogs get put down.\n          Rorschach SWINGS the cleaver DOWN. Blood SPATTERS his mask.\n\n<b>          INT. PRISON PSYCH ROOM - DAY\n</b>\n          The Psychiatrist listens, paralyzed. Horrified.\n\n<b>          RORSCHACH\n</b>          A tremor of impact shook my arm. Warm\n          blood splashed my face. It was Walter\n          Kovacs who screamed, who closed his eyes--\n          it was Rorschach who opened them again.\n          The silence reels out\n          RORSCHACH (cont'd)\n          You see, Doctor. God didn't kill that\n          little girl, fate didn't butcher her and\n          destiny didn't feed her to those dogs. If\n          God saw what any of us did that night, he\n          didn't seem to mind. From then on, I\n          knew. God doesn't make the world this\n          way. We do.\n          The Psychiatrist rises shakily. He crosses to the GUARD.\n\n<b>          PSYCHIATRIST\n</b>          I can't help him.\n\n<b>          INT. PRISON COMMISSARY - EVENING\n</b>\n          The Mess hall is PACKED, hundreds of INMATES eat dinner.\n          Rorschach enters. The place goes instantly, heavily SILENT.\n          Suddenly someone yells:\n\n<b>          RANDOM VOICE\n</b>          Hey Rorschach, I heard your momma was a\n          whore!\n          A cruel RIPPLE OF LAUGHTER and the mass conversation begins\n          again as Rorschach takes his place in the food line. A HUGE\n          PRISONER moves in behind him. He whispers:\n\n<b>          PRISONER\n</b>          Hey, Rorschach. You're pretty famous,\n          right? Y'know, I'm pretty famous too.\n          Maybe I can give you my autograph.\n          The Prisoner slides a SHIV from his sleeve\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          71.\n</b>\n<b>          CONTINUED:\n</b>          Rorschach doesn't register this. He waits for the FRY-COOK\n          behind the counter to turn away--\n          --then casually reaches across and lifts the DEEP-FRYER\n          BASKET from its mount--\n          --the Prisoner JABS the shiv forward--Rorschach spins,\n          GRIPPING the man's wrist and FLINGING the BOILING GREASE INTO\n          THE MAN'S FACE. The man SHRIEKS like a FIRE WHISTLE and\n          CRASHES TO THE GROUND. The Guards DESCEND on Rorschach.\n          Rorschach is calm as he's dragged away. As the injured man's\n          screams fall away to weak, bubbling hitches, the room once\n          again goes silent. Rorschach eyes the fearful, hateful eyes\n          of the room, marking each one. And in the silence he speaks,\n          his icy voice carrying easily.\n\n<b>          RORSCHACH\n</b>          None of you understand. I'm not locked up\n          in here with you.\n          Rorschach is placidly dragged off INTO DARKNESS\n\n<b>          RORSCHACH (CONT'D)\n</b>          You're locked up in here with me.\n\n<b>          INT. DAN'S OWL-CHAMBER -.EVENING\n</b>\n          CLOSE ON: THE NITE-OWL UNIFORM, staring its blank, empty\n          stare. Laurie stares back, alone down here, fascinated with\n          the costume, the gadgets, the whole place. She wanders to the\n          OWL-SHIP, whose tarp has been pulled back. She runs her\n          finger through the DUST caked on the windshield.\n\n<b>          INT. OWL-SHIP - EVENING\n</b>\n          Inside the ship, Laurie pulls open a HATCH filled with\n          ALTERNATE COSTUMES; designed for underwater work, cold\n          conditions, heavy armor. She puts a cigarette in her mouth.\n\n<b>          LAURIE\n</b>          All these gadgets and there isn't even a\n          dash lighter\n          She hits a BUTTON--the lights inside go DIM. Creepy. She hits\n          the button again to turn the lights back on but nothing\n\n<b>          HAPPENS\n</b>\n<b>          INT. DAN'S KITCHEN - EVENING\n</b>\n          Dan returns home with some TAKE OUT FOOD . . when he hears\n          Laurie SCREAM downstairs.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          72.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          Laurie?!\n          Dan BOLTS for the basement door, thoughts of the mask-killer\n          on his mind.\n\n<b>          INT. DAN'S OWL-CHAMBER - EVENING\n</b>\n          Dan descends the stairs and sees FIRE.\n\n<b>          DAN\n</b>\n<b>          LAURIE!\n</b>          Dan grabs a FIRE EXTINGUISHER.\n\n<b>          DAN (CONT'D)\n</b>          Where are you?!\n          Dan SPRAYS the fire. Laurie stumbles from the smoke, out of\n          the Owl-Ship. Dan's got the fire under control now.\n\n<b>          LAURIE\n</b>          I'm so sorry--I hit the wrong button. I\n          was looking for the lighter in.there.\n\n<b>          DAN\n</b>          I don't smoke. Are you hurt?\n\n<b>          LAURIE\n</b>          I'm fine, but your ship--\n\n<b>          DAN\n</b>          Ah, that's mostly just soot. Archie's\n          pretty resilient.\n\n<b>          LAURIE\n</b>          Archie?\n\n<b>          DAN\n</b>\n<b>          (EMBARRASSED)\n</b>          Short for Archimedes--Merlin's owl. I'm\n          just glad you're okay. I heard you scream\n          and well, you know, after the Comedian--\n\n<b>          LAURIE\n</b>          Still with the mask-killer theory?\n          Rorschach is insane.\n\n<b>          DAN\n</b>          Maybe, but the Comedian murdered; Jon\n          exiled; Someone tries to shoot Adrian;\n          Rorschach gets arrested. It makes me\n          uneasy.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          73.\n</b>\n<b>          CONTINUED:\n</b>          Dan goes to a BANK OF SWITCHES on the wall. Flicking them,\n          the Owl-Chamber LIGHTS UP. Hidden FANS dissipate the smoke.\n\n<b>          LAURIE\n</b>          How did you ever afford all this?\n\n<b>          DAN\n</b>          My Dad was in corporate banking. He left\n          me quite a bit. Which always surprised\n          me.\n\n<b>          LAURIE\n</b>          How did he die?\n\n<b>          DAN\n</b>          Mugging. He was shot.\n          As Dan cleans up, Laurie watches him, like she's seeing him\n          for the first time.\n\n<b>          LAURIE\n</b>          You really do worry about me, don't you?\n\n<b>          DAN\n</b>          Huh? Well, yeah, of course I worry about\n          you, I mean, we're, y'know, friends--\n          Laurie takes off his glasses . and KISSES him. It's what\n          Dan's been wanting all this time . but he pulls away.\n\n<b>          DAN (CONT'D)\n</b>          Sorry, I\n\n<b>          LAURIE\n</b>          What's wrong?\n          But Dan is already walking up the stairs, pathetic. Laurie's\n          left there, alone. The Owl-Costume looming in the background.\n\n<b>          INT. PRISON CELL - NIGHT\n</b>\n          Rorschach sits in his cell, staring impassively at the wall.\n\n<b>          BIG FIGURE (O.S.)\n</b>          It's been a long time, Rorschach.\n          Rorschach turns to see TWO THUGS standing side by side, one\n          muscle bound, the other very fat, staring at him through the\n          bars. PAN DOWN: To reveal a MIDGET between them--the\n          supervillain known as the BIG FIGURE--his silver hair combed\n          neatly back, a big CIGAR perched in his tiny mouth.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          74.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Big Figure. Small world.\n\n<b>          BIG FIGURE\n</b>          (chuckles through smoke)\n          I like that. But you know, it is a small\n          world in here. I've been in it for--how\n          long now, Billy?\n\n<b>          DUMB THUG\n</b>          Twenty years, Mr. Figure.\n\n<b>          BIG FIGURE\n</b>          That's right. Twenty years since you and\n          that owl fella put me away. Rorschach--\n          that guy you burned is dying. Could go\n          any minute now. And when he does, this\n          place is gonna explode. Then you die by\n          inches.\n\n<b>          RORSCHACH\n</b>          Tall order.\n\n<b>          FAT THUG\n</b>          (SLAMS into the bars)\n          I'm gonna tear this guy a new hole!\n\n<b>          BIG FIGURE\n</b>          Relax, Lloyd. Soon.\n          Chuckling, Big Figure walks off down the long, shadowed\n          corridor. Rorschach continues staring, straight ahead.\n\n<b>          INT. DAN'S NIGHTMARE - NIGHT\n</b>\n          CLOSE ON: Dan, naked, on his knees in the center of an\n          INFINITE FIELD OF BLACKNESS. No corners, no exits. In the\n          DISTANCE, he sees a FEMALE FORM. Desperate, he runs to her.\n          It's Laurie, waiting for him IN COSTUME. They kiss. She tears\n          at him passionately. His SKIN suddenly TEARS AWAY like\n          wrapping paper. Beneath the false skin, Dan wears his NITE-\n          OWL COSTUME. Confident, he touches her face. She smiles with\n          palpable heat. They kiss.\n          In the background, a NUCLEAR BLAST ERUPTS. Still kissing, the\n\n<b>          BLAST BLOWS THEM INTO TWO EMBRACING SKELETONS.\n</b>\n<b>          INT. DAN'S BEDROOM - NIGHT\n</b>\n          Dan wakes with a jolt, sweat beaded on his forehead\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          75.\n</b>\n<b>          INT. DAN'S OWL-CHAMBER - NIGHT\n</b>\n          The DOOR opens. Laurie stands in the SHAFT OF LIGHT.\n\n<b>          LAURIE\n</b>          Dan? Is everything okay? I heard you\n          coming down the stairs\n          Descending the stairs, she finds Dan before his costume,\n          naked. He fiddles with an OWL-WING THROWING WEAPON.\n\n<b>          DAN\n</b>          Mask killers. War. Nuclear annihilation.\n          I feel so powerless, so I've been\n          afraid of this damn costume. Afraid of\n          how much I need it.\n          He FLINGS the owl wing crescent, whizzing into the dark.\n\n<b>          LAURIE\n</b>          So. Let's take the ship out.\n\n<b>          DAN\n</b>          What?\n\n<b>          LAURIE\n</b>          Who's to know? I used to be a \"masked\n          avenger\" too, remember? I'm used to\n          getting up at three in the morning to do\n          something stupid. Besides, I'm already a\n          wanted lady, you're already in trouble\n          for hiding me, how much more trouble can\n          we be in? Just give me a second--can't go\n          out like this.\n          She jogs upstairs. Dan turns to the empty, waiting suit.\n\n<b>          INT. DAN'S OWL-CHAMBER - LATER\n</b>\n          PAN UP: DAN'S COSTUMED BODY. The Nite Owl suit is fantastic,\n          intricate, but above the belly . it just barely fits, Dan\n          managing to CLICK it closed.\n\n<b>          DAN\n</b>          I can't believe it still fits. Luckily I\n          constructed it with material that was\n          elastic and--\n          Dan turns as Laurie appears at the door, decked in her BLACK\n          SPANDEX. SILK SPECTRE, looking every bit as good as seventeen-\n\n<b>          DAN (CONT'D)\n</b>          --form fitting\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          76.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE\n</b>          I'm ready.\n          Dan turns and sees his reflection in the owl-Ship's window.\n\n<b>          DAN\n</b>          Me too.\n\n<b>          INT. OWL-SHIP (MOVING) - NIGHT\n</b>\n          Laurie holds on as the Owl-Ship's ENGINES ROAR to life. The\n          ship RISES INTO THE AIR and slips easily into the TUNNEL.\n          Laurie watches the LIGHTS of the tunnel whiz by. At the end,\n          two big STEEL DOORS open, allowing a passage UP.\n\n<b>          DAN\n</b>          Let's have some cloud cover.\n\n<b>          INT. WAREHOUSE - NIGHT\n</b>\n          THICK FOG POURS FROM LOWER-DECK JETS as the ship RISES into\n          an ABANDONED WAREHOUSE, whose steel roof ROLLS BACK.\n\n<b>          INT. OWL-SHIP (MOVING) - NIGHT\n</b>\n          Laurie touches the window, the SPARKLING CITY laid out below.\n\n<b>          LAURIE\n</b>          It's so beautiful\n\n<b>          DAN\n</b>          Hang on.\n          Dan BANKS, wheeling the ship toward the VELDT BUILDING.\n\n<b>          DAN (CONT'D)\n</b>          Got to clean her up a bit. I'm sure\n          Adrian wouldn't want to impede the course\n          of justice.\n          Heading straight for the building, Dan JIGS at the last\n          moment, flying the ship THROUGH THE V-SHAPED WATERFALL in the\n          skyscraper's center. The water washes clean the years of\n          dust. The Owl-Ship emerges, sparkling like new.\n\n<b>          LAURIE\n</b>          Look!\n          Below, a TENEMENT BUILDING is ENGULFED IN FLAME. Dan's jaw\n          sets. He wheels the ship around and down. As they zoom\n          closer, they can see people SCREAMING from the windows.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          77.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE (CONT'D)\n</b>          There's children in there!\n\n<b>          DAN\n</b>          I'm putting the water cannons on the\n          lower stories.\n          (over the LOUDSPEAKERS)\n\n<b>          PLEASE REMAIN CALM. WE ARE SLOWING THE\n</b>\n<b>          FIRE DOWN FROM BELOW. CALMLY MAKE YOUR\n</b>\n<b>          WAY TO THE ROOF AND I'LL EXTEND A RAMP TO\n</b>\n<b>          YOU.\n</b>          (to Laurie)\n          Can you escort the people over?\n          She watches him move, quick, confident. She smiles.\n\n<b>          LAURIE\n</b>          I'm on it. Nite Owl.\n\n<b>          EXT. TENEMENT BUILDING - NIGHT\n</b>\n          The ship EXTENDS AN ESCAPE RAMP with Laurie on board. The\n          residents forget their fear of fire for a moment as they soak\n          in the spectacle of this sexy lady on this Owl-Ship.\n\n<b>          LAURIE\n</b>          Hi. If you could all form a line, we'll\n          have you out of here in just a moment.\n          ATOP THE SHIP: Dan latches the steering column into its roof\n          socket. He stands; Takes a deep, chest-expanding breath. Who\n          has he been kidding? This is who he is. Flicking a switch OLD\n          JAZZ plays pleasantly.\n\n<b>          INT. OWL-SHIP - NIGHT\n</b>\n          Below, the residents file on board, in a daze at their\n          surroundings. Laurie grins at the music.\n\n<b>          LAURIE\n</b>          Anybody want coffee?\n\n<b>          EXT. OWL-SHIP (MOVING) - NIGHT\n</b>\n          FIRE rising behind, Dan wings the ship STRAIGHT INTO FRAME.\n\n<b>          EXT. STREET - NIGHT\n</b>\n          The Owl-Ship RISES, leaving a grateful CROWD behind. In the\n          background FIRE TRUCKS are just arriving. A FIREFIGHTER looks\n          up in time to see the Owl-Ship disappear into the clouds.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          78.\n</b>\n<b>          INT. OWL-SHIP (MOVING) - NIGHT\n</b>\n          Dan skims the clouds like a man waking from a dream.\n\n<b>          LAURIE\n</b>          I can't believe we did that! That was\n          actually fun\n\n<b>          DAN\n</b>          Yeah.\n          He puts a hand on her shoulder. His eyes locked onto hers. He\n          knows what he wants and this time he's not afraid of it\n          He kisses her. Hard. Running her hands up his cheeks, they\n          slide each other's masks off. Their mouths melt together.\n\n<b>          INT. OWL-SHIP - LATER\n</b>\n          Soft music plays. Dan and Laurie lie in a heap of discarded\n          costumes.\n\n<b>          LAURIE\n</b>          It was good, wasn't it?\n\n<b>          DAN\n</b>          Yeah, saving those people from the fire.\n          Taking Archie out\n          Laurie swats him on the chest--that's not what she meant. Dan\n          grins, having fun with her.\n\n<b>          DAN (CONT'D)\n</b>          It--you were unbelievable.\n          They kiss.\n\n<b>          LAURIE\n</b>          So . what do we do next?\n          Dan sits up, serious. Very serious.\n\n<b>          DAN\n</b>          I've been thinking about that. And I\n          believe we have certain obligations to\n          our fraternity.\n\n<b>          (BEAT)\n</b>          I think we should spring Rorschach.\n\n<b>          EXT. OWL-SHIP - CONTINUOUS\n</b>\n          Long beat. The ship hovers, silent in the clouds.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          79.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE (V.0.)\n</b>          What?\n\n<b>          INT. PRISON MEDICAL ROOM - NIGHT\n</b>\n          The Prisoner Rorschach burned lies in bed, his face\n          completely bandaged, hooked to an IV . . when he FLATLINES.\n\n<b>          INT. RORSCHACH'S PRISON CELL - NIGHT\n</b>\n          Down the dark corridors, a ROAR is building. ALARMS ring. Big\n          Figure and his two Thugs appear at the door.\n\n<b>          BIG FIGURE\n</b>          He's dead, Rorschach--the riot's already\n          begun. While everyone's distracted, we\n          thought we'd bring you a housewarming\n          gift. Something from the machine shop.\n          The Fat Thug wheels an ELECTRICAL WELDER to the door.\n          Rorschach sits, idly TEARING his PRISON SHIRT into STRIPS.\n\n<b>          FAT THUG\n</b>          Hey Boss, y'notice? None of that \"small\n          world, tall order\" crap, cuz he knows\n          once we slice open this lock, he's next\n          on the block.\n\n<b>          RORSCHACH\n</b>          Fat chance.\n          The Fat Thug reddens. He DIVES forward, HANDS SWIPING for\n          Rorschach.\n\n<b>          FAT THUG\n</b>          You're dead, Rorschach! We got a prison\n          full of killers out here! What've you\n          got?\n          Rorschach SPINS, WRAPPING A SHIRT-STRIP AROUND HIS WRISTS,\n          trapping the Fat Thug's hands inside the cell.\n\n<b>          RORSCHACH\n</b>          Your hands. My pleasure.\n          Rorschach SNAPS Fat Thug's pinky fingers. Fat Thug SHRIEKS.\n          Rorschach roughly binds the fingers around the bars.\n          Dumb Thug tries to reach the welder around Fat Thug's body.\n\n<b>          DUMB THUG\n</b>          I can't reach the lock. Should I cut the\n          bars?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          80\n</b>\n<b>          CONTINUED:\n</b>\n<b>          BIG FIGURE\n</b>          This riot won't last. And I've been\n          waiting twenty years for this\n          Big Figure nods to the Dumb Thug, who then grabs Fat Thug's\n          neck.\n\n<b>          DUMB THUG\n</b>          Nothing personal, big guy.\n\n<b>          FAT THUG\n</b>          Boss, you can't be serious! Wait--\n          Dumb Thug SNAPS Fat Thug's neck. He then CUTS OFF Fat Thug's\n          hands with the welder, pushes the corpse out of the way to\n          reach the lock. Big Figure grins at Rorschach.\n\n<b>          BIG FIGURE\n</b>          Now you find out what the score is.\n\n<b>          RORSCHACH\n</b>          One-nothing. Come and get me.\n\n<b>          INT. OWL-SHIP (MOVING) - NIGHT\n</b>\n          Dan and Laurie are back in costume.\n\n<b>          LAURIE\n</b>          Look, Dan, I'm glad you were able to\n          rediscover your calling in life, but I\n          think you're getting carried away. You're\n          talking about springing a homicidal\n          psychopath from prison.\n\n<b>          DAN\n</b>          Rorschach may be sick, but I think he's\n          on to something--four heroes attacked in\n          a week is not a coincidence. I mean, that\n          whole cancer thing with ion, does that\n          make sense to you? You didn't contract\n          cancer from him.\n          He says as Laurie's about to light a cigarette. She changes\n          her mind.\n\n<b>          LAURIE\n</b>          Why would someone want to drive ion away?\n          Look what's happening now. With Jon gone\n          it looks like we're headed for another\n          World War. Who would want that?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          81.\n</b>\n<b>          CONTINUED:\n</b>          OUTSIDE THE WINDOW: The Owl-Ship approaches a ROOFTOP with a\n          HELIPAD. On the helipad is a HELICOPTER with the Veidt\n          Enterprises LOGO.\n\n<b>          DAN\n</b>          I don't know. But I know someone who\n          might be able to help.\n          Dan lands the Owl-Ship on the roof.\n\n<b>          INT. ADRIAN'S MANSION - NIGHT\n</b>\n          Surprisingly, Adrian is awake, packing his things, hustling\n          about his grand mansion as Dan and Laurie trail.\n\n<b>          DAN\n</b>          You're leaving town? So you do believe\n          Rorschach's theory.\n\n<b>          ADRIAN\n</b>          Please. Right now, I'm not concerned with\n          this so-called mask-killer, I'm concerned\n          with the mass killer called war, or have\n          you not heard.\n          (calling out)\n          On !\n          A WALL SIZED MIRROR turns into a TV:\n\n<b>          CNN NEWSCASTER\n</b>          --US Aircraft Carriers have already moved\n          into the Persian Gulf and US Battleships\n          have left Japan en route to the Far East\n\n<b>          THEATRE--\n</b>\n<b>          LAURIE\n</b>          It's happening\n          Dan breaks away from the terrible news, follows Adrian.\n\n<b>          DAN\n</b>          All the more reason we need to get to the\n          bottom of this. Maybe we can get Jon to\n          come back in the process and stop all\n          this madness.\n\n<b>          ADRIAN\n</b>          Nothing we do will bring Jon back!\n          (glances at Laurie)\n          But I think you know that already. And\n          breaking Rorschach out of prison\n          certainly isn't the answer.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          82\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          Rorschach's been the only one\n          investigating this from the start.\n          Without him, we're starting at the\n          beginning and we don't have that kind of\n          time. We need your help, Adrian.\n\n<b>          ADRIAN\n</b>          I'm leaving, Dan. And I suggest you both\n          do the same.\n          Adrian pulls on a thick WINTER COAT and heads upstairs.\n\n<b>          EXT. HELICOPTER PAD - NIGHT\n</b>\n          Adrian walks briskly to his idling COPTER, propellers loudly\n          cutting through the air. Dan gives one last effort, shouting.\n\n<b>          DAN\n</b>          Where are you going to go?\n\n<b>          ADRIAN\n</b>          Antarctica.\n          It takes Dan a moment to realize Adrian is serious. By then,\n          Adrian's halfway into the helicopter.\n\n<b>          ADRIAN (CONT'D)\n</b>          Good luck, Dan.\n          He says it sincerely. Dan watches the helicopter fly off.\n\n<b>          INT. PRISON CELL - NIGHT\n</b>\n          Dumb Thug WELDS, the lock GLOWS RED. Nearly through.\n          Rorschach backs away from the door as Big Figure trembles in\n          excitement.\n\n<b>          BIG FIGURE\n</b>          Hurry Lloyd! I wanna smell this\n          sonofabitch cooking!\n          The lock MELTS AWAY. Rorschach climbs onto his bunk as Dumb\n          Thug enters, JABBING the electric welder at him menacingly.\n          Rorschach drives his HEEL into the porcelain TOILET BOWL,\n          SHATTERING IT. WATER SPILLS across the floor. Rorschach KICKS\n          Dumb Thug in the stomach; Dumb Thug buckles, then SLIPS in\n          the water--Dumb Thug falls, welder still in hand as he hits\n          the water\n          Dumb Thug's hand FUSES to the welder as ELECTRICITY SURGES\n          THROUGH HIM. He collapses, smoking. Dead.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          83\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Hmm. Never disposed of sewage with a\n          toilet before. Obvious, really.\n          Big Figure looks very small and alone now\n\n<b>          RORSCHACH (CONT'D)\n</b>          Two-nothing. Your move.\n          Panic stricken, Big Figure moves, or rather, runs. Rorschach\n          calmly follows him out of the cell.\n\n<b>          INT. OWL-SHIP (MOVING) - NIGHT\n</b>\n          The Owl-Ship tears through the sky, the prison ahead on the\n          horizon. Dan has his game face on; Laurie's still unsure.\n\n<b>          DAN\n</b>          You don't have to do this. I know the\n          whole crimefighting thing wasn't\n          necessarily your choice in life.\n\n<b>          LAURIE\n</b>          No. But this is.\n          She moves next to him.\n\n<b>          LAURIE (CONT'D)\n</b>          But I'm not doing it for Rorschach or\n          even for Jon. And I'm sure as hell not\n          doing if for the Comedian.\n          They look at each other--Dan knows who she's doing it for.\n          The Owl-Ship is upon the prison now\n\n<b>          LAURIE (CONT'D)\n</b>          Look!\n          They see a RIOT below--Inmates spilling out into the yard,\n          overwhelming the Correctional Officers on the ground; TOWER\n          GUARDS take shots at some of the Inmates; Broken glass,\n          broken furniture parts scattered through the yard; SMOKE\n          emits from inside the prison.\n\n<b>          DAN\n</b>          Hmm, Rorschach gets locked up in here and\n          suddenly there's a riot. I wonder if\n          that's a coincidence.\n          They descend toward the hell of TEAR-GAS, FIRE and VIOLENCE.\n          The Tower Guards, stunned at the sight of the Owl-Ship, begin\n          SHOOTING at it. The bullets bounce right off.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          84.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN (CONT'D)\n</b>          Put your ear-plugs in.\n\n<b>          EXT. PRISON YARD - NIGHT\n</b>\n          The ship emits a PIERCING SHRIEK. WINDOWS SHATTER. The\n          Inmates and Guards fall to the ground in sonic agony.\n\n<b>          INT. OWL-SHIP (MOVING) - CONTINUOUS\n</b>\n\n<b>          LAURIE\n</b>          How are we going to find Rorschach in all\n          of this?\n\n<b>          DAN\n</b>          When he and I were partners, we each had\n          tracking implants put under our skin so\n          old Archie here could find us if either\n          one of us were ever in trouble. Let's see\n          if Rorschach kept his in.\n          Dan turns on the GPS monitor. There's a BLIP on the screen.\n\n<b>          DAN (CONT'D)\n</b>          He's in that wing.\n          Dan steers the ship toward the Maximum Security Wing. 9\n\n<b>          EXT. PRISON - MAXIMUM SECURITY WING - CONTINUOUS\n</b>\n          The Owl-Ship stops to a hover position. The LOWER HATCH OPENS\n          and a LADDER extends\n          As Laurie descends the ladder, Dan simply, joyously LEAPS\n          OUT, his wings SNAP WIDE to GLIDE him through the air.\n\n<b>          INT. PRISON HALLS - NIGHT\n</b>\n          Fires burn in the cells. Shotguns and screams echo in the\n          emergency lighting. Archie's Owl-Shriek is dulled here--it's\n          quiet. Tense.\n          Laurie and Dan turn the corner, searching. Laurie spots the\n          BODY of a DEAD GUARD. She crouches to take his PISTOL, slips\n          it into her waistband.\n\n<b>          LAURIE\n</b>          How do we know he's still alive?\n          They come upon Rorschach's cell. Dan sees the SMOKING CORPSE\n          of Dumb Thug. Sees the CUT OFF HANDS of Fat Thug, HANGING\n          from the bars.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          85\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          He's alive.\n\n<b>          INT. PRISON HALLS - NIGHT\n</b>\n          Big Figure runs, turns a corner, ducking into the BATHROOM.\n          Rorschach sees this and walks serenely after him . when\n          Dan and Laurie enter the far hall.\n\n<b>          LAURIE\n</b>          Is that--\n\n<b>          DAN\n</b>          Rorschach? Rorschach!\n\n<b>          RORSCHACH\n</b>          Hello, Daniel, Ms. Jupiter. Excuse me, I\n          just have to visit the men's room.\n          He disappears into the dark bathroom. Laurie watches after\n          him in stunned disbelief.\n\n<b>          LAURIE\n</b>          Oh, for Christ's sake.\n\n<b>          DAN\n</b>          Hey, it happens. I remember I lost a big\n          arrest like that once. Had to redesign\n          the costume after that--\n          Rorschach exits the bathroom, wiping his hands.\n\n<b>          RORSCHACH\n</b>          We can leave now.\n          He walks off.\n\n<b>          LAURIE\n</b>          Are you sure you're ready? We don't want\n          to go diving head-first into things.\n\n<b>          RORSCHACH\n</b>          Good Advice. I'm sure there are many\n          who'd agree with you.\n          Behind them: BLOODY WATER FLOODS from the bathroom door as\n          they go.\n\n<b>          EXT. PRISON ROOFTOP - NIGHT\n</b>\n          The trio crosses the roof as Dan calls Archie by REMOTE.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          86.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Good to see you in uniform, Daniel. What\n          happened? Finally taking the mask-killer\n          seriously?\n\n<b>          LAURIE\n</b>          I'm not.\n\n<b>          RORSCHACH\n</b>          Of course you haven't been attacked yet.\n          Funny, most everyone else has.\n\n<b>          LAURIE\n</b>          What's that supposed to mean? We came\n          here to rescue you, asshole!\n\n<b>          DAN\n</b>          Hey! Survive now! Argue later! I had to\n          turn the screechers off, so we'll be\n          drawing fire.\n          The owl-Ship rises to the roof. They all jump in.\n\n<b>          EXT. PRISON - NIGHT\n</b>\n          Under HEAVY FIRE the Owl-Ship ZOOMS OFF, leaving the chaos\n          behind.\n\n<b>          INT. OWL-SHIP (MOVING) NIGHT\n</b>\n          Dan weaves and whips the ship into the sky, above the clouds.\n          Satisfied that they've escaped, Dan allows himself a grin. He\n          looks at Laurie, who grins back.\n\n<b>          DAN\n</b>          Rorschach, you remember how to handle\n          Archie?\n\n<b>          RORSCHACH\n</b>          I believe so.\n          Rorschach sits in the pilot's seat. Dan turns to Laurie, high\n          on adrenaline and love. Dan moves in to kiss her--\n\n<b>          RORSCHACH (CONT'D)\n</b>          Daniel.\n\n<b>          DAN\n</b>          Give us a second--\n\n<b>          RORSCHACH\n</b>          I don't think this can wait.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          87.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          What? What is it\n          Dan looks up, through the windshield, and sees--\n          --Dr. Manhattan WALKING ACROSS THE CLOUDS--STRAIGHT FOR THE\n\n<b>          SHIP.\n</b>\n<b>          LAURIE\n</b>          It `s him.\n          The ship COLLIDES with Dr. Manhattan, who PASSES THROUGH into\n          the CABIN with a SHOWER of BLUE PARTICLES--\n\n<b>          DR. MANHATTAN\n</b>          Hello Laurie.\n\n<b>          LAURIE\n</b>          They said you were on Mars.\n\n<b>          DR. MANHATTAN\n</b>          I am on Mars. You and I are about to have\n          a conversation there.\n\n<b>          LAURIE\n</b>          Where? What are you talking about?\n\n<b>          DR. MANHATTAN\n</b>          You are going to try to convince me to\n          save the world.\n\n<b>          DAN\n</b>          Wait, what? You're taking her to Mars?\n          No, she can't--Laurie, I don't know about\n\n<b>          THIS\n</b>          Laurie looks at Dan then at Dr. Manhattan. Comprehending\n\n<b>          LAURIE\n</b>          I have to go, Dan. Jon and I, we're going\n          to talk. Maybe we'll find some way out of\n          this mess the world's gotten itself in.\n          I'll be okay. Really.\n\n<b>          DAN\n</b>\n<b>          LAURIE--\n</b>          Laurie and Dr. Manhattan BURST INTO PARTICLES--they're gone.\n          Dan stares at the space where Laurie just was.\n\n<b>          RORSCHACH\n</b>          No time for heartbreak, Daniel.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          88\n</b>\n<b>          CONTINUED: (2)\n</b>          Dan notes TWO BLIPS on the RADAR.\n\n<b>          EXT. NEW YORK AIRSPACE - NIGHT\n</b>\n          TWO NYPD HELICOPTERS appear behind the Owl-Ship\n          INSIDE THE OWL SHIP: Dan takes the controls.\n\n<b>          DAN\n</b>          Let's try and lose them in the city.\n          He hits the jets, heading for the New York SKYLINE.\n\n<b>          EXT. MARS - NIGHT\n</b>\n          A red vista. Dr. Manhattan and Laurie appear atop a rise.\n\n<b>          DR. MANHATTAN\n</b>          So. What do you think?\n\n<b>          LAURIE\n</b>          J--huc? Hhhhhhh--\n          Laurie GRIPS her throat and TUMBLES down the hill. She rolls\n          into Jon, waiting for her at the bottom. She CLAWS at him.\n\n<b>          DR. MANHATTAN\n</b>          Oh. Forgive me. These things sometimes\n          slip my mind.\n          He TOUCHES her mouth, forming a small ATMOSPHERE around her.\n          She HEAVES in air, retching and choking at the same time.\n\n<b>          LAURIE\n</b>          Jon, you stupid bastard! Listen, you\n          better not forget this air supply or\n          whatever it is\n          (looking up)\n          Oh shit.\n          Laurie stands up before Jon's huge GLASS PALACE.\n\n<b>          LAURIE (CONT'D)\n</b>          I'm on Mars.\n\n<b>          EXT. NEW YORK CITY AIRSPACE - NIGHT\n</b>\n           The Owl-Ship WEAVES around the buildings, trying to shake the\n          copters . but the pilots are good, staying on its tail.\n          The Owl-Ship shoots out of the city over the water . Dan\n          LOOPS Archie around--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          89.\n</b>\n<b>          CONTINUED:\n</b>          --and heads straight for a SUBWAY TUNNEL\n\n<b>          INT. SUBWAY TUNNEL - CONTINUOUS\n</b>\n          . just clearing it. The Owl-Ship SKIMS the sides of the\n          tunnel, SPARKS flying--\n          --when a SUBWAY appears. They're heading straight for it.\n\n<b>          DAN\n</b>          oh no.\n\n<b>          RORSCHACH\n</b>          Tactical error, Daniel.\n\n<b>          DAN\n</b>          I know--\n          They head straight for the subway--\n          --when the tunnel opens up--\n          --Dan SWERVES to the adjacent track just in time.\n\n<b>          EXT. NEW YORK CITY AIRSPACE - NIGHT\n</b>\n          The Owl-Ship emerges from the subway tunnel . when one of\n          the NYPD copters cuts it off.\n\n<b>          DAN\n</b>          Shit.\n          Dan accelerates, weaving Archie around the skyscrapers, the\n          Empire State Building . but the copter's still there.\n          Dan cuts around the UNITED NATIONS BUILDING. The copter\n          follows the Owl-Ship around to the East River\n          . but the Owl-Ship is nowhere to be found\n          The copter hovers there. Baffled.\n\n<b>          EXT. EAST RIVER (UNDERWATER) - SAME TIME\n</b>\n          The Owl-Ship rests at the bottom of the river, hidden\n\n<b>          EXT. STREET - NIGHT\n</b>\n          A group of GANG MEMBERS (with the black and yellow bandanas\n          who confronted Dan on the subway earlier in the film) walks\n          down the block when another Gang Member catches up, running.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          90.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          GANG MEMBER 1\n</b>          Yo, y'all hear? Some super owl dude broke\n          Rorschach outta prison.\n\n<b>          GANG LEADER\n</b>          Rorschach? That fool put my cousin in a\n\n<b>          WHEELCHAIR\n</b>\n<b>          GANG MEMBER 2\n</b>          You say Nite Owl broke him out? Didn't he\n          write a book or something? He lives over\n          a garage near here.\n\n<b>          GANG LEADER\n</b>          Does he now\n\n<b>          INT. HOLLIS MASON'S APARTMENT - BEDROOM - NIGHT\n</b>\n          Hollis sits up in bed, TV on: CNN; Grainy, shaky CLIPS of the\n          Owl-Ship. He's on the phone, beaming.\n\n<b>          HOLLIS\n</b>          It's just like old times, Sal. Nite Owl\n          and Silk Spectre back at it again.\n          CUT TO: Sally Jupiter on the other end in California,\n          watching the same footage.\n\n<b>          SALLY\n</b>          I always knew Laurie had it in her. Sorry\n          for waking you, Hollis.\n\n<b>          HOLLIS\n</b>          I may be retired from the costume, but my\n          sleeping habits have never changed.\n          There's a KNOCK at Hollis's door.\n\n<b>          HOLLIS (CONT'D)\n</b>          Who--there's someone at the door. It\n          might be Dan and Laurie--they may need\n          help. I better go.\n          Hollis hangs up, heads to the door, excited. He opens the\n\n<b>          DOOR--\n</b>          --and the Gang Members PILE INTO HIM. The picture SLOWS DOWN.\n          Hollis turns, mouth bleeding. HOLLIS' POV IS SEPIA TONED. The\n          gang appears as a COLLECTION of VILLAINS in COSTUMES.\n          SLOW, SEPIA: A young Hollis is in his old COSTUME. The VOICES\n          come from the present, while Hollis is lost in the past.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          91.\n</b>\n<b>          CONTINUED:\n</b>          In his SLO-MO world, Hollis PASTES at Villain in the mouth--\n          in reality, he gets nailed. This intercutting continues until\n          the Gang Leader picks up the GOLD STATUE of Hollis in costume\n          whose base reads: IN GRATITUDE\n\n<b>          GANG MEMBER 1\n</b>          Hold on, Derf, are you sure this is the\n          right guy--he, he's just an old man.\n\n<b>          GANG LEADER\n</b>          Then I'm probably doing him a favor.\n          Hollis, old again, looks up. The SHADOW of the statue\n\n<b>          DESCENDS HARD TOWARD HIS FACE--GO BLACK.\n</b>\n<b>          INT. OWL-SHIP (UNDERWATER - MOVING) - NIGHT\n</b>\n          The Owl-Ship moves slowly through the water.\n\n<b>          RORSCHACH\n</b>          I hate this. How long are we going to\n          stay down here? Daniel!\n          Dan says nothing. Rorschach puts on his costume.\n\n<b>          RORSCHACH (CONT'D)\n</b>          You're letting fear paralyze you. And\n          that woman--\n\n<b>          DAN\n</b>          Hey! We took enough unnecessary risks\n          bringing Archie up so you could get your\n          spare costume. We stay put until it cools\n          down out there--they're looking for us.\n\n<b>          RORSCHACH\n</b>          Unnecessary? Cowering in the sludge, from\n          the authorities, that's unnecessary.\n          Rorschach pulls his mask on, turns.\n\n<b>          RORSCHACH (CONT'D)\n</b>          While we waste time, the mask-killer gets\n          closer. We need to get to Pyramid\n          Industries.\n          Dan sits at the COMPUTER.\n\n<b>          DAN\n</b>          I know, you told me already. I'm tapping\n          into all the databases, finding out about\n          the company--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          92.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Sitting at a computer? No. We need to\n          trace the killer--hit up underworld\n          contacts, squeeze people. You've\n          forgotten how we do things. You've been\n          lazing around too long.\n\n<b>          DAN\n</b>          Listen, I HAVE HAD IT! Who the hell do\n          you think you are? You live off people\n          while insulting them, and no one\n          complains because they think you're a\n          goddamn lunatic!\n          Dan turns away, shaking. He leans against the console.\n\n<b>          DAN (CONT'D)\n</b>          I'm sorry. I shouldn't have said that.\n          Maybe you're right, maybe--\n\n<b>          RORSCHACH\n</b>\n<b>          DANIEL\n</b>          Dan turns. Rorschach holds out an open hand.\n\n<b>          RORSCHACH (CONT'D)\n</b>          You are a good friend. I'm sorry\n          that it is sometimes difficult with me.\n          Touched, Dan shakes his hand. An awkward, lovely moment.\n\n<b>          DAN\n</b>          Hey forget it It's okay, man.\n          Releasing his hand with some effort, Dan sits, invigorated.\n\n<b>          DAN (CONT'D)\n</b>          You're right. It's time to head up.\n\n<b>          EXT. OWL-SHIP (MOVING) - HARBOR - NIGHT\n</b>\n          The Owl-Ship BURSTS THROUGH THE SURFACE OF THE WATER\n\n<b>          DAN (V.0.)\n</b>          Let's really start plumbing the depths.\n\n<b>          EXT. MARS - NIGHT\n</b>\n          Jon leads Laurie into the Glass Palace.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          93.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DR. MANHATTAN\n</b>          Our conversation commences when you\n          surprise me with the information that you\n          and Dreiberg have been sleeping together.\n\n<b>          LAURIE\n</b>          You . know about me and Dan?\n\n<b>          DR. MANHATTAN\n</b>          Not yet. But in a few moments, you're\n          going to tell me.\n\n<b>          LAURIE\n</b>          Jon, I'm having enough problems right now\n          without getting into your predestination\n          crap.\n\n<b>          DR. MANHATTAN\n</b>          Why does my perception of time distress\n          you so?\n\n<b>          LAURIE\n</b>          Because. If you already know the future,\n          why were you surprised when I left you,\n          or when that reporter ambushed you? Why\n          even debate if you already know the\n          outcome?\n\n<b>          DR. MANHATTAN\n</b>          Because everything is pre-ordained. Even\n          my responses.\n\n<b>          LAURIE\n</b>          Agh! This is so typical of you! Do you\n          know what a relief it is to be with\n          somebody human, like Dan?\n\n<b>          DR. MANHATTAN\n</b>          You mean you're sleeping with Dan\n          Dreiberg?\n          Contemplating this, he steps to the balcony's edge.\n\n<b>          LAURIE\n</b>          But you already know . You said--\n\n<b>          DR. MANHATTAN\n</b>          I said, often, that you were my only\n          remaining link with the world. Now that\n          link is shattered. Don't you see the\n          futility of asking me to save a world\n          that I no longer have any stake in?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          94.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          LAURIE\n</b>          That's ridiculous. The Earth is too\n          important to hinge on one relationship.\n\n<b>          DR. MANHATTAN\n</b>          Not to me. My red world here means more\n          to me than your blue one. I'll show you\n          around if you like.\n          The giant Glass Palace begins to RUMBLE.\n\n<b>          LAURIE\n</b>          Are you doing this? I'm not in the mood\n          for jokes.\n\n<b>          DR. MANHATTAN\n</b>          Nor I. Believe me, I fully understand the\n          gravity of the situation.\n          The clockwork Glass Palace RISES HIGH INTO THE AIR\n\n<b>          EXT. PYRAMID INDUSTRIES - NIGHT\n</b>\n          The Owl-Ship approaches the large warehouse building that is\n          Pyramid Industries. The ship lands in the alley nearby.\n          Dan and Rorschach exit the ship. Shady neighborhood.\n          Rorschach goes to the door which is AJAR\n\n<b>          INT. PYRAMID INDUSTRIES - HALLWAY - NIGHT\n</b>\n          Dan and Rorschach slowly make their way down, peering into\n          ROOMS. The place looks abandoned--scattered papers, dusty\n          file cabinets, leftover computer components\n\n<b>          RORSCHACH\n</b>          You sure this is the correct location,\n          Daniel?\n\n<b>          DAN\n</b>          Positive. Pyramid Industries. Specializes\n          in industrial plastics. At least they\n          did.\n\n<b>          INT. PYRAMID INDUSTRIES - PROCESSING PLANT - NIGHT\n</b>\n          They enter the large, dark industrial section of the\n          building. They pass huge PROCESSING VATS, CONVEYOR BELTS.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          95.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          I tapped into all the databases--tax\n          records, business registries, real estate\n          records--trying to get a bead on who's\n          behind Pyramid but it's a never ending\n          paper trail.\n          Rorschach investigates ahead when Dan catches some MOVEMENT--\n          --he turns his FLASHLIGHT to find a few HOMELESS PEOPLE\n          squatting in the warehouse. Upon seeing Dan in.costume, the\n          Homeless People run away.\n\n<b>          RORSCHACH\n</b>          Daniel.\n\n<b>          DAN\n</b>          They're harmless, Rorschach.\n\n<b>          RORSCHACH\n</b>          Daniel.\n          Rorschach is looking down at something. Dan heads over and\n          sees a DEAD BODY in the early stages of decomposition. He\n          turns the body over--bullet between the eyes just like Moloch\n          . but we recognize the corpse--it's journalist Doug Roth.\n\n<b>          DAN\n</b>          Hey, I know this man.\n\n<b>          RORSCHACH\n</b>          Yes. Doug Roth. Journalist who grilled\n          Dr. Manhattan on national television.\n\n<b>          DAN\n</b>          No I didn't watch that interview.\n          This was the guy who was doing a story on\n          Adrian when I went to see him.\n\n<b>          RORSCHACH\n</b>          Hmm. Journalist set up Dr. Manhattan, was\n          probably working to set up Veidt also.\n          Dan stands there thinking. As if hit with an epiphany. He\n          opens his mouth like he can't believe what he's going to say.\n\n<b>          DAN\n</b>          Rorschach. What, what if it's Adrian?\n\n<b>          RORSCHACH\n</b>          Veidt? Behind everything? Makes no sense.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          96.\n</b>\n<b>          CONTINUED: ( 2)\n</b>\n<b>          DAN\n</b>          On the surface it doesn't, but hear me\n          out--Adrian's the only one who could've\n          taken on the Comedian in hand to hand\n          combat. He's the only one with the\n          finances to create an entire company for\n          the sole purpose of setting up Dr.\n          Manhattan. And Adrian was directly\n          involved in arranging that broadcast. He\n          probably supplied this journalist with\n          the whole cancer list.\n\n<b>          RORSCHACH\n</b>          That doesn't explain the attempt on\n          Veidt's life.\n\n<b>          DAN\n</b>          If we say that Adrian set that up\n          himself, he could've had the hitman shoot\n          his assistant first. It was a risk, but--\n\n<b>          RORSCHACH\n</b>          But why?\n\n<b>          DAN\n</b>          I don't know. Let's go ask him.\n\n<b>          EXT. ANTARCTICA - NIGHT\n</b>\n          The endless white blanket that is Antarctica is interrupted\n          by a SPLASH OF COLOR in the distance. As we approach, we see\n          that the color is a BIO-DOME--a tropical RAINFOREST inside.\n          This is part of KARNAK: Adrian Veidt's Arctic Fortress.\n\n<b>          INT. KARNAK - BIO-DOME - NIGHT\n</b>\n          Adrian stands at the entrance of the Bio-Dome, amidst the\n          exotic foliage, where a GROUP of SCIENTISTS and ENGINEERS are\n          gathered. They all hold CHAMPAGNE FLUTES--Adrian raises his\n          glass for a toast when the HEAD SCIENTIST interrupts.\n\n<b>          HEAD SCIENTIST\n</b>          Mr. Veidt, may I?\n\n<b>          ADRIAN\n</b>          By all means, Eric.\n\n<b>          HEAD SCIENTIST\n</b>          I just would like to say that when I was\n          first offered this position, I was\n          hesitant. A multi-year commitment to work\n          in Antarctica?\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          97.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          HEAD SCIENTIST (CONT'D)\n</b>          But the opportunity to experiment with\n          Dr. Manhattan's atomic fusion energy was\n          too great for me to pass up, too great\n          for any of us to pass up. And now that\n          our work is finished, and we finally get\n          to go home, I can say that it was all\n          worth it. Mr. Veidt, you are a genius.\n          The world will be a better place because\n          of you.\n\n<b>          ADRIAN\n</b>          I certainly hope so.\n          The group applauds. Then they sip their champagne. All except\n          for Adrian\n          The group goes around congratulating each other, when\n          suddenly the Head Scientist COLLAPSES, choking. The others\n          surround him, trying to help--\n          --when one by one they each start collapsing themselves--\n          POISONED by the champagne.\n          Adrian regards them all, writhing on the floor, and leaves.\n\n<b>          EXT. PYRAMID INDUSTRIES - NIGHT\n</b>\n          In the alley, the Gang Members who killed Hollis Mason stand\n          around the Owl-Ship arguing amongst themselves, when Dan\n          appears behind them.\n\n<b>          DAN\n</b>          Something I can help you with, boys?\n          They all spin around, frightened at the costume.\n\n<b>          GANG MEMBER 1\n</b>          (to Gang Leader)\n          I told you we had the wrong guy.\n          The Gang Leader shits his pants as Dan steps closer.\n\n<b>          GANG LEADER\n</b>          L-listen, I didn't mean to kill that old\n          guy. Things just got outta hand\n\n<b>          DAN\n</b>          What old guy?\n\n<b>          EXT. PYRAMID INDUSTRIES - MOMENTS LATER\n</b>\n          Hearing SCREAMS outside, Rorschach bursts out of the\n\n<b>          WAREHOUSE--\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          98.\n</b>\n<b>          CONTINUED:\n</b>          --and sees Dan gripping the bloody Gang Leader by the THROAT,\n          CHOKING him as the other Gang Members flee.\n\n<b>          DAN\n</b>          You're dead! You and the rest of your\n          gang, you're all DEAD! You know how much\n          fire-power I've got floating out there!?\n          Oh god damn. Hollis. God damn god damn\n          god damn\n          Dan begins to break up. Rorschach quietly pulls him away.\n\n<b>          RORSCHACH\n</b>          Not now, Daniel.\n\n<b>          EXT. CITY STREETS - EARLY MORNING\n</b>\n          The Owl-Ship slows to a hover besides an OLDER BUILDING.\n\n<b>          RORSCHACH (V.0.)\n</b>          Rorschach's Journal. Final entry?\n          Dreiberg is convinced that Veidt is\n          behind everything. Apparently, the Owl-\n          Ship is capable of the trip to\n          Antarctica, but are we? I cannot imagine\n          a more dangerous opponent. Veldt is\n          faster than Dreiberg and myself. He used\n          to joke that he was fast enough to catch\n          a bullet. I believe he could. He could\n          kill us both, alone in' the snow. No one\n          would know.\n          Rorschach descends the ladder, goes to the door of the\n          building. He places his JOURNAL in an ENVELOPE.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          I have done my best to make this legible.\n          Whether I am alive or dead upon this\n          reading, know that whatever the nature of\n          this conspiracy--Adrian Veldt is\n          responsible.\n          He drops the envelope into the MAIL SLOT, climbs back up the\n          ladder.\n\n<b>          RORSCHACH (V.0.) (CONT'D)\n</b>          I appreciate your recent support and hope\n          the world survives long enough for this\n          to reach you. For my own part, I regret\n          nothing. I have lived my life free of\n          compromise, and step now into the shadow\n          without complaint. Rorschach. October\n          21st.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          99.\n</b>\n<b>          CONTINUED:\n</b>          Rorschach disappears into the dark hatch. The Owl-Ship blasts\n          off . disappearing, just as Seymour arrives. Seymour\n          picks up the mail and walks inside.\n\n<b>          INT. THE NEW FRONTIERSMAN - EARLY MORNING\n</b>\n          The Editor walks in as Seymour goes through the mail.\n\n<b>          EDITOR\n</b>          SEYMOUR! Is that Dulmage's editorial\n          cartoon?\n\n<b>          SEYMOUR\n</b>          It's the mail. Hey cool, someone sent us\n          their journal.\n\n<b>          (READING)\n</b>          \"Earlier today I came across what\n          appeared to be a suicide. It was later\n          learned to be a homicide. Someone's time\n          was up.\"\n\n<b>          EDITOR\n</b>          War's coming, Seymour--I don't wanna hear\n          some knob's life story! Chuck it in the\n          crank file!\n          Seymour tosses Rorschach's journal into a PILE OF LETTERS.\n\n<b>          EXT. GLASS PALACE - MARS - NIGHT\n</b>\n          Laurie's hair blows in the cold wind. She lowers her head.\n          Jon serves her some WATER.\n\n<b>          LAURIE\n</b>          Can't you just tell me how this all ends\n          and save us the trouble?\n\n<b>          DR. MANHATTAN\n</b>          It ends with you in tears.\n\n<b>          LAURIE\n</b>          Tears. You mean I lose? You don't come\n          back to Earth?\n\n<b>          DR. MANHATTAN\n</b>          I return to Earth at some point. The\n          streets are filled with death.\n\n<b>          LAURIE\n</b>          You mean there's going to be a war? An\n          actual, nuclear war?\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          100.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DR. MANHATTAN\n</b>          I can't be sure. I'm still experiencing\n          some static interference preventing any\n          clear vision of what lies ahead.\n\n<b>          LAURIE\n</b>          Static?\n\n<b>          DR. MANHATTAN\n</b>          Tachyon particles. Tachyons are a rare\n          occurrence. The detonation of nuclear\n          warheads could conceivably be the cause.\n\n<b>          LAURIE\n</b>          Jon, you've got to stop it! Everyone will\n          die!\n\n<b>          DR. MANHATTAN\n</b>          And the universe will not even notice.\n          See the dual moons. Aren't they\n          breathtaking?\n          Above, TWO MOONS cross overhead. One is HUGE, CRIMSON RED,\n          the smaller is a delicate SHELL PINK. Spectacular.\n\n<b>          LAURIE\n</b>          You're right, Jon--what does human life\n          matter next to a, a neutrino. Look, I'm\n          not going to debate you when you clearly\n          don't see anything terribly miraculous\n          about life. I guess quantum physics\n          doesn't allow for miracles.\n\n<b>          DR. MANHATTAN\n</b>          No, thermodynamic miracles are--\n\n<b>          LAURIE\n</b>          Oh God, Jon. Land this thing. Now.\n\n<b>          DR. MANHATTAN\n</b>          On the Argyre Planitia? As you wish.\n          The structure descends. Laurie stomps down the stairs.\n\n<b>          LAURIE\n</b>          That's it then. You can send me back to\n          Earth to fry with Dan and my Mom and all\n          the other worthless humans. And look, you\n          were wrong. You said this ended with me\n          in tears and see? Not a damp eye in the\n          house. Maybe you're wrong about\n          everything.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          101.\n</b>\n<b>          CONTINUED: (2)\n</b>          Jon is waiting for her at the bottom of the stairs.\n\n<b>          DR. MANHATTAN\n</b>          Laurie. You complain that I refuse to see\n          life on life's terms. And yet you\n          continuously refuse to see things from my\n          perspective. If only you'd try to see the\n          whole continuum, life's pattern, you'd\n          understand. But you deliberately shut it\n          out as if afraid to see.\n\n<b>          LAURIE\n</b>          I'm not afraid, okay? You want me to see\n          things your way? Go ahead, do that thing\n          you do.\n          She stands there, arms folded, waiting. Then, just like\n          earlier in the lab, Jon touches her head--\n\n<b>          INT. JUPITER HOUSE - NIGHT (FLASHBACK - 25 YEARS AGO)\n</b>\n          Same flashback as before, in Laurie's childhood home. We're\n          in Laurie's POV, as a little girl. There's arguing\n          downstairs. Laurie goes down to investigate.\n          She comes upon the kitchen door, ajar. She can see her\n          PARENTS inside, arguing .\n\n<b>          SALLY\n</b>          You wanted to hear it, so I'm telling\n          you, okay?. Magic! Dreams! That's what I\n          had before. I was a hero goddammit!\n\n<b>          LAURIE'S FATHER\n</b>          It's not my fault you got old! What do\n          you have to complain about?! I'm putting\n          food on the table for you and your child.\n          Why don't you give your friend Eddie a\n          call? Maybe he can give you a better\n          life!\n\n<b>          SALLY\n</b>          It was a mistake--one time! Am I never--\n          And then they notice Laurie looking at them.\n\n<b>          LAURIE\n</b>          Mommy?\n\n<b>          SALLY\n</b>          Oh. Oh, Laurie\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          102.\n</b>\n<b>          CONTINUED:\n</b>          Tears run down little Laurie's face. Her parents are\n\n<b>          HORRIFIED--\n</b>\n<b>          INT. GLASS PALACE - MARS - NIGHT\n</b>\n          --Laurie breaks away from ion and drops down to her knees,\n          tears flowing.\n\n<b>          LAURIE\n</b>          No. No, no, no, no not him\n\n<b>          DR. MANHATTAN\n</b>          The comedian was your father.\n\n<b>          LAURIE\n</b>          But he--\n\n<b>          DR. MANHATTAN\n</b>          Attacked your mother. Yes.\n          (searching in his mind)\n          Two years later he came back to her, to\n          make amends. And you were conceived on\n          that day.\n\n<b>          LAURIE\n</b>\n<b>          NO!!I\n</b>          Laurie WHIPS a BOTTLE at the palace--\n          --and the huge glass construction CRUMBLES. Jon protects them\n          with a FORCE FIELD as debris collapses around them. Laurie\n          sobs in the echoing SILENCE.\n          Jon's eyes SHUT. He seems to feel . empathy. A TEAR slips\n          down his cheek. Laurie's realization is a revelation for ion.\n\n<b>          LAURIE (CONT'D)\n</b>          The comedian is my father. I guess my\n          life is just one big joke.\n\n<b>          DR. MANHATTAN\n</b>          I don't think your life is a joke.\n\n<b>          LAURIE\n</b>          Well, of course you're going to say that.\n\n<b>          DR. MANHATTAN\n</b>          But I've changed my mind. There are\n          miracles in your world that are worth\n          preserving.\n\n<b>          LAURIE\n</b>          What? But you were saying--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          103.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DR. MANHATTAN\n</b>          I tried to explain. Thermodynamic\n          miracles--events with odds against so\n          astronomical, like oxygen turning into\n          gold. I have longed to witness such a\n          thing and yet I neglect that in human\n          coupling, millions upon millions of cells\n          compete to create life over generation\n          after generation: Until finally, your\n          mother loves a man--Edward Blake, the\n          Comedian--a man she has every reason to\n          hate. And out of that contradiction,\n          against unfathomable odds, it was you,\n          only you, that emerged. To distill so\n          specific a form from all of that chaos;\n          Your creation is like . turning air\n          into gold. A miracle.\n\n<b>          LAURIE\n</b>          But if my birth is a miracle you, you\n          could say that about anyone.\n\n<b>          DR. MANHATTAN\n</b>          Yes, anyone in the world. But the world\n          is so crowded with miracles that they\n          become commonplace and we forget. I\n          forget.\n          They stand there in silence. Connected for the first time in\n          years.\n\n<b>          DR. MANHATTAN (CONT'D)\n</b>          Now. Dry your eyes.\n          FROM ABOVE: We see the full CRATER--the ARGYRE PLANITIA.\n          Round, with two, eye-like BOULDERS set side by side, a RIDGE\n          of land curling below . like a smiley-face.\n\n<b>          DR. MANHATTAN (V.0.)(CONT'D)\n</b>          And let's go home.\n\n<b>          EXT. ANTARCTICA - DAWN\n</b>\n          The owl-Ship sails through a TOWERING CLOUD BANK. The COAST\n          approaches as SNOW starts to fall.\n\n<b>          INT. OWL-SHIP (MOVING) - DAWN\n</b>\n          Dan stares ahead, stoic. Thinking about Hollis, Laurie and\n          Adrian. He glances at a MONITOR, tracking heat signatures.\n          There's a LARGE SIGNAL ahead.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          104.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN\n</b>          I've got a large reading ahead. Anything\n          that's emitting that much heat out here,\n          must be a pretty big facility. Adrian.\n\n<b>          (BEAT)\n</b>          We're not going to make it, are we?\n          Rorschach says nothing . when a halting WHINE sputters\n          from the engines. A HUGE CLIFF APPEARS before them.\n\n<b>          RORSCHACH\n</b>          The engines--\n\n<b>          DAN\n</b>          They're icing up, hold on!\n          Dan pulls the stick back. The ship SHUDDERS UPWARD.\n\n<b>          EXT. ANTARCTICA - DAWN\n</b>\n          The ship, tiny before the massive ice-wall, climbs slowly.\n          It's going to be close. The wall is 100 yards away now, the\n          top-most edge barely in view. 50 yards. 20 and then\n\n<b>          SILENCE--\n</b>\n<b>          DAN\n</b>          We just lost the engines--find something\n          to grab on to!\n          The ship BARELY CLEARS THE CLIFF. BOUNCING hard, it SKIPS\n          across the snow like a stone, finally CRASHING INTO A DRIFT.\n\n<b>          INT. OWL-SHIP - DAWN\n</b>\n          Dan opens the hatch. Shrieking WIND blows the snow in. Dan\n          pulls on a white, FUR-LINED SNOW-OWL costume.\n\n<b>          DAN\n</b>          The engines are de-icing. You sure I\n          can't fit you with something warmer?\n\n<b>          RORSCHACH\n</b>          Fine like this.\n\n<b>          EXT. OWL-SHIP - DAWN\n</b>\n          Rorschach pulls up his trench-collar against the bitter wind.\n          Dan pulls two stand-up HOVER-SCOOTERS from an OUTSIDE HATCH.\n          They exchange a look and ride the scooters off into the snow.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          105.\n</b>\n<b>          INT. KARNAK - CONTROL HALL - DAWN\n</b>\n          Adrian, dressed in his Ozymandias costume, sits alone in the\n          massive hall, opposite a wall of giant PLASMA-SCREENS which\n          show various television NEWS CHANNELS showing all the IMAGES\n\n<b>          OF WAR IN THE WORLD.\n</b>          Adrian sighs and hits the remote--the screens become ONE\n          IMAGE--ALEXANDER THE GREAT slicing the Gordian Knot.\n          By Adrian's feet is an exotic LYNX. Its unnatural beauty\n          almost hides a feral danger in its eyes. Adrian pets the\n          beast.\n\n<b>          ADRIAN\n</b>          See this painting? Alexander the Great.\n          Before his conquest of Phoenicia, he\n          struck North for Gordium, where the\n          world's greatest puzzle waited. A great\n          knot, impossible to untie. For a young\n          man determined to rule the world, it was\n          a challenge he couldn't resist. So he\n          sliced it in two with his sword. Lateral\n          thinking, you see.\n          Suddenly the Lynx stands, GROWLS.\n\n<b>          ADRIAN (CONT'D)\n</b>          What is it, girl?\n          He hits the remote--the TV screens switch to MULTIPLE VIEWS\n          OF Dan and Rorschach, heading toward Karnak.\n\n<b>          ADRIAN (CONT'D)\n</b>          Ah. It's all right, girl. Everything's\n          all right.\n\n<b>          EXT. ANTARCTICA - SNOWFIELDS - DAWN\n</b>\n          Flying on the scooter, Dan wipes frost and fog from his\n          goggles. He then looks up and--\n          --sees KARNAK, a GARGANTUAN GLASS PYRAMID, rising out of the\n          snow, the Bio-Dome attached to it.\n\n<b>          INT. KARNAK - CONTROL HALL - DAWN\n</b>\n          Adrian watches Dan and Rorschach reach the door on the\n          monitors.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          106.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          ADRIAN\n</b>          Really, getting even this far is an\n          admirable effort, given their\n          limitations. Of course the ice they're\n          skating on is slippery and thinner than\n          it looks. Let's hope they don't overstep\n          themselves.\n          On the monitors, Dan takes a LASER TORCH to the door.\n\n<b>          ADRIAN (CONT'D)\n</b>          Let's hope they know when to stop.\n\n<b>          INT. KARNAK - DAWN\n</b>\n          Having burnt through the control panel, Dan pushes the huge\n          door open. They enter the grand palace, dwarfed by its\n          Macedonian massiveness.\n\n<b>          DAN\n</b>\n<b>          JESUS\n</b>\n<b>          (BEAT)\n</b>          I don't understand any of this. Adrian's\n          a pacifist. He's never killed anyone in\n          his life. He's a vegetarian for Christ's\n          sake!\n\n<b>          RORSCHACH\n</b>          Hitler was a vegetarian. If you're\n          squeamish, leave him to me. We won't get\n          a second chance.\n\n<b>          INT. KARNAK - CONTROL HALL - DAWN\n</b>\n          Dan and Rorschach pass the wall of plasma screens into--\n\n<b>          INT. DINING HALL - CONTINUOUS\n</b>\n          --the dining hall, where Adrian eats alone, at a long table.\n          Though they're only a few yards away, Adrian doesn't appear\n          to see them, hidden by some PILLARS.\n          Dan and Rorschach signal to each other, quiet. Adrian eats--\n          --and Rorschach RUSHES him from behind--\n          --Adrian moves at the last second, grabs Rorschach's arm,\n          ELBOWS him in the chest, spins and BACKHAND FISTS him,\n          sending him flying back.\n\n<b>          ADRIAN\n</b>          Mind your manners.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          107.\n</b>\n<b>          CONTINUED:\n</b>          Dan draws his PEN-LASER.\n\n<b>          DAN\n</b>          Adrian, don't make me--\n          Adrian picks up a GOLDEN SERVING TRAY off the table as Dan\n          FIRES. Adrian DEFLECTS the laser with the tray--\n          --then DISCUS-SLINGS the tray into Dan's NOSE. Blood SPRAYS,\n          Dan drops to his knees. Adrian turns his back on them, calm.\n\n<b>          ADRIAN\n</b>          Now. What can I do for you?\n\n<b>          DAN\n</b>          You know! You killed the Comedian! You\n          set up Rorschach! You created Pyramid\n          Industries, hired all those people, gave\n          them cancer and blamed it on Jon!\n\n<b>          ADRIAN\n</b>          Yes.\n\n<b>          DAN\n</b>          Dammit Adrian, what are you trying to do?\n\n<b>          ADRIAN\n</b>          What we always intended--to improve the\n          world.\n          As Adrian speaks, Rorschach sneaks up behind him, with a\n          FORK. He tries to stab Adrian in the back, but Adrian\n          effortlessly dodges the blow, GRABS Rorschach's mask, TWISTS\n          it, then KNEES him in the gut. Rorschach drops to the floor.\n          Adrian starts walking out of the hall. Dan helps Rorschach up\n          and they follow.\n\n<b>          ADRIAN (CONT'D)\n</b>          I never intended to kill the Comedian--\n          that was an accident. Part of his duties\n          as a government operative was to keep\n          track of all former masked heroes, make\n          sure there was no rocking of the boat. He\n          must have liked Rorschach because he\n          allowed him to continue to exist. I had\n          thought that the Comedian might be\n          incompetent, but he disproved that\n          hypothesis when he discovered what was\n          really going on. here in Karnak--no easy\n          task. Even my staff was unaware--I made\n          sure to keep each department separate.\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          108.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>           ADRIAN (CONT'D)\n</b>          The Comedian was appalled by my plan, but\n          still, he understood the scope of what I\n          was trying to accomplish. Frankly, I\n          never thought he'd actually talk. But by\n          the time he visited poor Moloch, he was\n          cracking badly. So I had to kill him.\n\n<b>          INT. CONTROL HALL - CONTINUOUS\n</b>\n          As they enter the control hall, Rorschach moves to attack\n          Adrian again when he and Dan hear a growl . the Lynx\n          steps in between, protecting its master.\n\n<b>          ADRIAN\n</b>          After Blake, I neutralized Jon--a plan\n          nearly a decade in the works after\n          analyzing confidential psychological\n          profiles which predicted his withdrawal\n          from human existence. By then,\n          Rorschach's mask theory, 'though\n          erroneous, needed to be addressed, so I\n          faked my own assassination--\n\n<b>          DAN\n</b>          Why take that risk? What if the hitman\n          shot you first instead of your assistant?\n\n<b>          ADRIAN\n</b>          I suppose I'd have to be fast enough to\n          catch the bullet then, wouldn't I?\n          Adrian smiles enigmatically.\n\n<b>          ADRIAN (CONT'D)\n</b>          After apprehending my own assassin, I\n          shoved a cyanide capsule in his mouth,\n          disposing of him, and soon after that,\n          the journalist Doug Roth, tying up all\n          the loose ends if you will. Then I knew\n          nothing stood in the way of my triumph.\n\n<b>          DAN\n</b>          Triumph? Adrian, what are you going to\n          do?\n\n<b>          ADRIAN\n</b>          I'm firing a beam of concentrated energy,\n          synthesized from Dr. Manhattan himself,\n          into the hearts of nine key regions\n          around the globe, crossing all\n          traditional politics and ideologies;\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          109.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          ADRIAN (CONT'D)\n</b>          Paris, Tehran, Kashmir, Beijing, Taiwan,\n          Pyongyang, London, Jerusalem, New York--\n          destroying approximately three million\n          people.\n\n<b>          DAN\n</b>          Three million people? You're joking.\n\n<b>          RORSCHACH\n</b>          He's not. Listen to his voice.\n\n<b>          DAN\n</b>          Rorschach, he's making it up!\n\n<b>          ADRIAN\n</b>          I understand your disbelief, Dan. When I\n          began the plan ten years ago, my moral\n          safeguards gave me pause at the necessary\n          sacrifice. See, the Comedian was correct.\n          What we were doing with the Watchmen was\n          pointless--the savage nature of humankind\n          would inevitably lead to the end of the\n          world. So in order to save the world, I\n          had to trick it--to frighten the world\n          towards salvation with history's greatest\n          practical joke.\n\n<b>          DAN\n</b>          By killing millions of people? And when\n          were you planning on doing this?\n\n<b>          ADRIAN\n</b>          When? Dan, my dear friend, I am the\n          smartest man in the world--do you\n          seriously think I'd explain my master\n          stroke if there remained even the\n          slightest chance of you affecting it's\n          outcome?\n\n<b>          (BEAT)\n</b>          I did it thirty minutes ago.\n\n<b>          EXT. KARNAK- ANTARCTICA - MORNING\n</b>\n          A BEAM of BLUE ENERGY SHOOTS INTO THE SKY from Karnak. The\n          energy infects the CLOUDS, CHARGED with CRASHING, ERRATIC\n          BLUE LIGHTNING SPREADING out across the globe\n\n<b>          EXT. NEWS STAND - MORNING\n</b>\n          As the News vendor opens his stand--\n\n<b>          DR. MANHATTAN (V.0.)\n</b>\n<b>          PEOPLE OF THE WORLD...\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          110.\n</b>\n<b>          INT. WHITE HOUSE - CONFERENCE ROOM - SAME TIME\n</b>\n          The President and his Cabinet look out the windows, up at the\n          electric blue clouds\n\n<b>          DR. MANHATTAN\n</b>\n<b>          THIS IS DR. MANHATTAN. FOR YEARS, I HAVE\n</b>\n<b>          WATCHED HUMANITY BARREL IGNORANTLY DOWN\n</b>\n<b>          THE PATH TO DESTRUCTION .\n</b>\n<b>          EXT. KASHMIR - SAME TIME\n</b>\n          We're with the Pakistani and Indian Soldiers from earlier,\n          stopping their gun fight to look up at the sky--\n\n<b>          DR. MANHATTAN (V.0.)\n</b>          (in Hindi)\n\n<b>          THIS ENDS TONIGHT.\n</b>\n<b>          EXT. TAIWAN COAST - SAME TIME\n</b>\n          We're with the Chinese Battleships from earlier--\n\n<b>          DR. MANHATTAN (V.0.)\n</b>          (in Mandarin)\n\n<b>          FROM THIS MINUTE ON, YOU SHALL CHANGE\n</b>\n<b>          YOUR POLICIES AND YOUR WAYS OF VIOLENCE-\n</b>\n<b>          INT. MISSILE CONTROL ROOM - SAME TIME\n</b>\n          We're with the Israelis from earlier, watching on screen--\n\n<b>          DR. MANHATTAN (V.0.)\n</b>          (in Hebrew)\n\n<b>          ANY NATION THAT DOES NOT IMMEDIATELY\n</b>\n<b>          STAND DOWN AND DISMANTLE THEIR WEAPONS\n</b>\n<b>          ARSENALS, SHALL BE DESTROYED.\n</b>\n<b>          EXT. TIMES SQUARE - NIGHT\n</b>\n          Realization is dawning on the faces of the New Yorkers.\n\n<b>          DR. MANHATTAN (V.0.)\n</b>\n<b>          FROM THIS MINUTE ON--I WILL BE WATCHING.\n</b>          Suddenly the SOUND of a rising, HOWLING WIND and the\n          LIGHTNING STRIKES begin, CRASHING TO EARTH with savage,\n          blistering force. Their expended blue energy SPREADS like\n\n<b>          LIQUID FIRE, FLOODING THROUGH THE STREETS.\n</b>          People SCREAM and RUN. As the LIGHT OVERTAKES the unlucky\n          ones, they are instantly BLOWN TO ASH--\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CONTINUED:\n</b>          (WORLD MONTAGE): --as is the News Vendor; the Pakistani and\n          Indian Soldiers; the Chinese Battleships; the Israeli Missile\n          Control Room; Paris; the Great Wall of China. Destroyed.\n\n<b>          EXT. NEW YORK STREET - MORNING\n</b>\n          The smoke-filled street is silent. Then GLOWING PARTICLES\n          COALESCE, slamming together to form Jon and Laurie, but Jon's\n          teleportation falters, shorting out. They FALL from the air.\n          Laurie drops roughly to her knees.\n\n<b>          LAURIE\n</b>          God Jon, what was that?\n          Jon looks around the street. Even he is awe-struck.\n\n<b>          DR. MANHATTAN\n</b>          Interference. Cataclysmic interference.\n          Laurie looks up and screams. THOUSANDS OF BLACK SILHOUETTES\n          are IMPRINTED on the STREET and the WALLS. Everywhere. There\n          is no rubble--some buildings have simply disintegrated.\n\n<b>          LAURIE\n</b>          Was it a war? It doesn't seem like--\n\n<b>          DR. MANHATTAN\n</b>          Not a war. I .don't know what it was.\n          Dr. Manhattan looks up into the sky, studying it.\n\n<b>          LAURIE\n</b>          Take me out of here, Jon. Please.\n\n<b>          DR. MANHATTAN\n</b>          I'm sorry. This must be very upsetting\n          for you. I have traced the source of the\n          Tachyon particles to Antarctica. Shall\n          we?\n\n<b>          LAURIE\n</b>          Anywhere. Anywhere's better than here.\n\n<b>          INT. KARNAK - CONTROL HALL - MORNING\n</b>\n          PULL OUT FROM: The televisions--NEWS REPORTS from all over\n          the world, documenting the tragic destruction caused by Dr.\n          Manhattan. Dan turns away shaken. Rorschach boils. Adrian\n          beams.\n\n<b>          DAN\n</b>          God. God, he\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          112.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          RORSCHACH\n</b>          Impersonated Dr. Manhattan. Murdered\n          millions of people.\n          (re: Lynx)\n          Call off your cat. Call off your cat and\n          face me!\n\n<b>          ADRIAN\n</b>          Don't you understand? I've ended the war--\n          I've ended all wars. Because of their\n          fear of ion, I've forced the world into\n          everlasting peace.\n\n<b>          DAN\n</b>          By committing the biggest mass murder in\n          history. You have no right to play God!\n\n<b>          ADRIAN\n</b>          I wasn't playing God. Just Dr. Manhattan.\n          Suddenly there's a LOUD BEEPING in the hall. The Lynx growls.\n          Adrian switches the monitors to the security cameras\n          which show ion and Laurie materialize in the snow.\n\n<b>          ADRIAN (CONT'D)\n</b>          Speak of the devil.\n\n<b>          EXT. KARNAK - SAME TIME\n</b>\n          Laurie vomits in the snow.\n\n<b>          DR. MANHATTAN\n</b>          Adrian, of course. Who else would have\n          the resources\n\n<b>          LAURIE\n</b>          Wait, this is Adrian's compound? Are you\n          saying he's responsible for this--\n          Jon walks toward the building, entranced. Distracted.\n\n<b>          DR. MANHATTAN\n</b>          Yes. Yes, he killed Blake and millions of\n          others. Excuse me, Daniel, I'm talking to\n          Laurie ninety seconds ago\n\n<b>          LAURIE\n</b>          What, Daniel? Millions of others? Jon\n          don't start that crap now, not here!\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          113.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DR. MANHATTAN\n</b>          I'm sorry. It's these tachyons. They're,\n          muddling things up. I'd better follow him\n\n<b>          INSIDE\n</b>          In a burst, he's gone.\n\n<b>          INT. KARNAK - CONTROL HALL - CONTINUOUS\n</b>\n          Jon materializes in the hall. Adrian sprints like lightening,\n          out of the room, followed by the Lynx.\n\n<b>          RORSCHACH\n</b>          No, don't let him escape!\n\n<b>          DAN\n</b>          Jon, stop him, he killed millions of\n          people, who knows what else he'll do.\n          Jon walks calmly after Adrian.\n\n<b>          DAN (CONT'D)\n</b>          Jon, are you okay? You seem drugged.\n\n<b>          DR. MANHATTAN\n</b>          Yes. Yes, he killed Blake and millions of\n          others. Excuse me, Daniel, I'm talking to\n          Laurie ninety seconds ago\n\n<b>          DAN\n</b>          What? Where's Laurie?\n\n<b>          DR. MANHATTAN\n</b>          I'm sorry. It's these tachyons. They're,\n          muddling things up. I'd better follow him\n\n<b>          INSIDE\n</b>          Jon follows Adrian into the next room.\n\n<b>          INT. REACTOR CHAMBER - CONTINUOUS\n</b>\n          Jon enters the MAZE of advanced technology.\n\n<b>          DR. MANHATTAN\n</b>          Adrian, don't be foolish. Even if I can't\n          predict where I'm going to find you, I\n          can turn the walls to glass. The tachyons\n          were clever but it's time to give up\n          Jon spots the Lynx in a METAL CORRIDOR.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          114.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DR. MANHATTAN (CONT'D)\n</b>          Very well. If I must, let us follow this\n          through to the bitter end.\n          ON THE OTHER SIDE OF THE WALLS is Adrian, waiting by a\n          CONTROL PANEL. He takes one last look at his Lynx.\n\n<b>          ADRIAN\n</b>          Forgive me, girl.\n          Jon enters the corridor with the Lynx; Adrian flicks a\n          SWITCH. The Lynx' FUR STANDS ON END as ENERGY CRACKLES\n          BETWEEN THE METAL WALLS. The Lynx HOWLS.\n\n<b>          DR. MANHATTAN\n</b>          Adrian? Adrian, don't--\n          LIGHT BLASTS through Jon and the Lynx--both are OBLITERATED.\n          Adrian peers around the corner, winded by his success.\n\n<b>          ADRIAN\n</b>          You know, I really wasn't sure that would\n          work.\n\n<b>          LAURIE (O.S.)\n</b>\n<b>          ADRIAN--\n</b>          Adrian turns. Laurie aims the prison guard's pistol at him.\n\n<b>          LAURIE (CONT'D)\n</b>          You're such an asshole.\n          Adrian cries out, LEAPS at her as she FIRES--\n          --and hits Adrian. He COLLAPSES. Dan and Rorschach find them\n          as Laurie approaches Adrian's body\n\n<b>          DAN\n</b>          Laurie, shoot him again!\n          Adrian's hand falls from his chest to the floor, blood\n          trickling, as his PALM OPENS--\n          --holding a BULLET inside.\n\n<b>          LAURIE\n</b>          Oh shit.\n          Adrian opens his eyes and KICKS her in the stomach, sending\n          her flying back.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          115.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          DAN\n</b>          LAURIE! If you've hurt her, I'll--\n\n<b>          ADRIAN\n</b>          Oh Dan. Grow up.\n          Adrian exits as Dan helps the winded Laurie to her feet.\n          Together, Rorschach, Dan and Laurie follow him back to:\n\n<b>          INT. KARNAK - CONTROL HALL - MORNING\n</b>\n          Adrian approaches his wall of TV screens when--\n\n<b>          DR. MANHATTAN (O.S.)\n</b>\n<b>          I AM DISAPPOINTED IN YOU ADRIAN. VERY\n</b>\n<b>          DISAPPOINTED.\n</b>          Jon, now 100 FEET TALL, SMASHES THROUGH THE WALL. Adrian\n          crawls desperately away, grasping for his remote on the\n          floor. As Jon approaches him, Jon SHRINKS to six feet.\n\n<b>          DR. MANHATTAN (CONT'D)\n</b>          Restructuring myself was the first trick\n          I learned! It didn't kill me before, did\n          you seriously think it would kill me now?\n          You are nothing but a man. And the\n          world's smartest man means no more to me\n          than its smartest termite!\n          Out of tricks, out of traps, Adrian lifts the remote.\n\n<b>          DR. MANHATTAN (CONT'D)\n</b>          What is that, Adrian? Some new, ultimate\n          weapon?\n\n<b>          ADRIAN\n</b>          Yes. Yes, you could say that.\n          Adrian goes back to his wall of screens, watching the news\n          reports. We hear SOUND BITES and IMAGES: \"India and Pakistan\n          immediately call for truce,\" \"China stands down,\" \"US\n          withdraws forces,\" \"Israel agrees on cease fire.\"\n          TEARS stand in Adrian's eyes. He raises his fists in triumph.\n\n<b>          ADRIAN (CONT'D)\n</b>          I did it. I DID IT! I've saved Earth from\n          Hell. Next, I will elevate her to the\n          vaulting stature of Heaven.\n\n<b>          LAURIE\n</b>          Next? You can't get away with this!\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          116.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          ADRIAN\n</b>          No? Will you expose me, undoing the peace\n          so many have just died for? Morally,\n          you're in checkmate, just like the\n          Comedian was.\n          Jon examines the many screens, taking it all in.\n\n<b>          DR. MANHATTAN\n</b>          I'm afraid he's correct. Exposing Adrian\n          would only doom the world to nuclear\n          destruction again.\n\n<b>          DAN\n</b>          He's right. All we did was fail to stop\n          him from saving Earth.\n\n<b>          LAURIE\n</b>          We we can't say anything about this\n\n<b>          ?\n</b>\n<b>          RORSCHACH\n</b>          You're joking, of course.\n          Rorschach walks toward the exit.\n\n<b>          DAN\n</b>          Rorschach, wait a second! Let's talk this\n          out!\n\n<b>          RORSCHACH\n</b>          Never. Not even in the face of\n          Armageddon. Never compromise.\n          Adrian and Jon's eyes meet--an unspoken communication. Seeing\n          this, Dan runs after Rorschach.\n\n<b>          DAN\n</b>          Rorschach!\n          Across the hall, ion materializes between Rorschach and the\n          exit.\n\n<b>          DR. MANHATTAN\n</b>          Where are you going, Rorschach?\n\n<b>          RORSCHACH\n</b>          Back to the Owl-Ship. Back to America.\n          People must be told. Evil must be\n          punished.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          117.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          DR. MANHATTAN\n</b>          Rorschach, you know I can't let you do\n          that.\n          Rorschach pauses. Dan is halfway there . Rorschach\n          removes his mask, tears stand in his eyes.\n\n<b>          RORSCHACH\n</b>          Suddenly you've rediscovered humanity? If\n          you had cared from the start, none of\n          this would be necessary. None of this\n          would have happened. So what are you\n          waiting for? Do it.\n\n<b>          DAN\n</b>\n<b>          NO WAIT!\n</b>\n<b>          RORSCHACH\n</b>\n<b>          DO IT!!!!\n</b>          Jon WAVES HIS HAND and BLOWS RORSCHACH APART. Dan collapses\n          to his knees, sobbing. Jon contemplates the BURN-MARK where\n          Rorschach stood only seconds ago, then disappears--\n          --reappearing across the hall where Laurie is. She is also in\n          tears, watching all the horrible footage on the TV screens.\n\n<b>          DR. MANHATTAN\n</b>          Laurie. I'm leaving this galaxy. For one\n          a little less complicated.\n\n<b>          LAURIE\n</b>          Leaving? I, I thought you regained an\n          interest in human life.\n\n<b>          DR. MANHATTAN\n</b>          I have. I think maybe I'll create some.\n          Goodbye, Laurie.\n          He kisses her on the cheek--\n\n<b>          ADRIAN\n</b>          Jon, I'd hoped to talk to you. I've made\n          myself feel every death, see every\n          innocent face I've murdered to save\n          humanity--you understand, don't you?\n\n<b>          DR. MANHATTAN\n</b>          Without condoning or condemning, I\n\n<b>          UNDERSTAND\n</b>          And with that, he disappears. Forever.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          118.\n</b>\n<b>          CONTINUED: (3)\n</b>          Across the hall, Dan recovers from mourning Rorschach. He\n          stands, gritting his teeth. Walks toward Adrian.\n\n<b>          ADRIAN\n</b>          What's on your mind, Dan?\n\n<b>          DAN\n</b>          Your death.\n\n<b>          ADRIAN\n</b>          Really. You want to kill me?\n\n<b>          DAN\n</b>          Yeah. You might have created peace, but\n          not at the expense of justice. You need\n          to pay for what you've done.\n\n<b>          ADRIAN\n</b>          That doesn't sound like you, Dan. That\n          sounds more like Rorschach.\n\n<b>          DAN\n</b>          Exactly.\n          Adrian readies himself. Laurie breaks away from the TV\n          screens.\n\n<b>          ADRIAN\n</b>          Only you're not Rorschach, are you now?\n          How do you expect to succeed where he\n          failed?\n\n<b>          DAN\n</b>          Tell you the truth, Adrian. I don't.\n          Dan FLIES at Adrian, fighting like a madman for his life.\n          His fighting style has changed. Dan's newfound brutality is\n          informed by everything he's learned from Rorschach. About\n          justice. About life.\n          But Adrian is the best. He takes Dan's attacks apart with\n          ease, delivering blows which would kill a man not quite so\n          focused on his goal. In the end, he CATCHES Dan's final\n          strike and TWISTS. Dan's arm SNAPS easily.\n\n<b>          LAURIE\n</b>          Dan!\n          Laurie charges Adrian. With one hand, Adrian blocks her\n          attack, grabs her by the hair and SLAMS her to floor,\n          knocking her out.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          119.\n</b>\n<b>          CONTINUED: (4)\n</b>          Dan falls to his knees, bloody and beaten. Out of tricks, out\n          of time, he searches his belt for something, anything, and\n          finds one last OWL-WING. The WINGS SNAP OUT. Desperate, he\n\n<b>          FLICKS IT AT ADRIAN--\n</b>          Who merely SNATCHES the owl-Wing out of the air. He laughs.\n          Prepares to finish Dan off.\n\n<b>          ADRIAN\n</b>          I have to say, I've always thought your\n          choice of an owl was quite juvenile.\n\n<b>          DAN\n</b>          Really? I've always liked owls\n          Adrian sees that Dan has pulled one last item from his belt.\n          Adrian STEPS on Dan's WRIST, bones crunching. Dan's HAND\n          falls OPEN, revealing the OWL-SHIP REMOTE.\n\n<b>          DAN (CONT'D)\n</b>          because you can never hear them\n          coming.\n          BEHIND ADRIAN: FLOODLIGHTS BLAZE, targeting Adrian as the OWL-\n          SHIP CRASHES THROUGH THE WINDOW and into Adrian and Dan.\n          Silence, but for the tinkling of GLASS falling to the floor.\n          Dan tries to stand, but he falls, his left leg shattered.\n          Most of Adrian has been CRUSHED under the ship. He coughs a\n          fine blood spray. Adrian looks over to Dan, dying.\n\n<b>          ADRIAN\n</b>          I . don't regret my actions. I know\n          in my heart . I did the right thing.\n\n<b>          DAN\n</b>          So do I.\n          Adrian lays back, calm, accepting and dies.\n\n<b>          INT. OWL-SHIP - MORNING\n</b>\n          Dan sits painfully in the passenger seat, as Laurie tries to\n          pilot the ship out of Adrian's bedroom.\n\n<b>          DAN\n</b>          That's it. Careful. Now, pull the stick\n          to the left\n          The ship RISES and TURNS awkwardly in the hall, smashing out\n          more glass.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          120\n</b>\n<b>          CONTINUED:\n</b>\n<b>          DAN (CONT'D)\n</b>          Now, the thrusters . There.\n          She HITS THE THRUSTERS. The ship FLIES from the control room.\n          It's afterburners IGNITING the room, and Adrian's body.\n\n<b>          EXT. ANTARCTICA - MORNING\n</b>\n          The Owl-Ship RISES into the sky, the Pyramid of Karnak\n          BLAZING from it's tip like a Roman candle. Dan watches out\n          the window, until his eyes slip shut\n\n<b>          EXT. NEW YORK STREETS - MORNING (SOME TIME LATER)\n</b>\n          Time has passed. The disintegrated buildings are being\n          rebuilt. The shock of the attack is wearing off, and though\n          the streets may not be as crowded as they once were, a sense\n          of normalcy is returning.\n          Sally Jupiter walks the sidewalk, looking for an address.\n\n<b>          INT. DAN AND LAURIE'S TOWNHOUSE - MORNING\n</b>\n          Sally mixes herself a tall drink at the bar. Sally calls out:\n\n<b>          SALLY\n</b>          You sure you don't want a drink?\n\n<b>          LAURIE (O.S.)\n</b>          I'm okay. Thanks.\n          We finally see Laurie now--her hair dyed, appearance changed.\n\n<b>          LAURIE (CONT'D)\n</b>          Mom--I just want to get this out of the\n          way . . I know Eddie Blake, the\n          Comedian--I know he was my father.\n          Sally freezes.\n\n<b>          LAURIE (CONT'D)\n</b>          I remember.\n          Sally downs her drink, immediately starts making another.\n\n<b>          SALLY\n</b>          It, it was years later, he stopped by out\n          of the blue, and, and apologized. I don't\n          know, I just couldn't stay mad. It\n          just happened--\n          Laurie kisses her mother's teary cheek.\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          121.\n</b>\n<b>          CONTINUED:\n</b>\n<b>          LAURIE\n</b>          Mom. People's lives take them strange\n          places. You never did anything wrong by\n          me.\n          Sally jumps as a CLICK/WHIR SOUND comes from a BOOKCASE.\n\n<b>          SALLY\n</b>          What the hell is that?\n\n<b>          LAURIE\n</b>          Oh that's Dan. Home from \"work.\"\n          The bookcase SLIDES ASIDE and a blond DAN enters from the\n          secret ELEVATOR. He is trim and confident, cheeks flushed\n          with color. Buttoning up his shirt, he spots Sally.\n\n<b>          DAN\n</b>          Oh hi.\n\n<b>          SALLY\n</b>          Hello, Dan. Excuse me, I should clean up.\n          Sally wipes her runny make-up, goes to the bathroom.\n          Dan and Laurie embrace, kiss.\n\n<b>          LAURIE\n</b>          Any bad guys last night?\n\n<b>          DAN\n</b>          There are always bad guys. Even in\n          today's world.\n          Slow, Laurie turns to the window. Looks out at the New York\n          skyline being rebuilt.\n\n<b>          LAURIE\n</b>          Dan.\n\n<b>          DAN\n</b>          Hmm?\n\n<b>          LAURIE\n</b>          Will it be alright? The world, I mean.\n          He puts his arm around her shoulder.\n\n<b>          DAN\n</b>          As long as no-one ever finds out that\n          Adrian was behind it all, the public will\n          think ion is still up there, watching.\n\n<b>          (MORE)\n</b>\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          122.\n</b>\n<b>          CONTINUED: (2)\n</b>\n<b>          DAN (CONT'D)\n</b>          The threat remains, and everything should\n          be fine.\n\n<b>          LAURIE\n</b>          Yeah. Just fine\n\n<b>          INT. THE NEW FRONTIERSMAN - DAY\n</b>\n          CLOSE ON: A YELLOW HAPPY FACE--suddenly SPLOTCHED with RED--\n          printed on A T-SHIRT now stained with ketchup.\n          WE PULL BACK: And find Seymour wears the shirt, eating a\n          burger when the Editor bursts in.\n\n<b>          EDITOR\n</b>          SEYMOUR! What the hell do you got for me?\n\n<b>          SEYMOUR\n</b>\n<b>          UH\n</b>\n<b>          EDITOR\n</b>          We got nothing to write about. Everyone\n          in the country, every country in the\n          world is holding hands now, singing songs\n          about peace and love--it's like we're\n          living in a goddamn global hippie\n          commune !\n\n<b>          SEYMOUR\n</b>          Um, I guess I can look for stuff in the\n          crank file.\n\n<b>          EDITOR\n</b>          Crank file? Whatever! Take some\n          initiative! Run whatever you like--\n          Seymour turns to the PILE of submissions known as the crank\n          file, where RORSCHACH'S JOURNAL sits on top. Seymour reaches--\n\n<b>          EDITOR (CONT'D)\n</b>          --I leave it entirely in your hands.\n          --and picks up Rorschach's Journal . Just as he's about\n          to open it, we CUT TO BLACK.\n\n\n\n<b>          THE END\n</b>\n<b>          \n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Watchmen.jpg\"/>\n</td><td><h1>Watchmen</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=David Hayter\" title=\"Scripts by David Hayter\">David Hayter</a>  <a href=\"/writer.php?w=Alex Tse\" title=\"Scripts by Alex Tse\">Alex Tse</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a>  <a href=\"/genre/Sci-Fi\" title=\"Sci-Fi Scripts\">Sci-Fi</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Watchmen Script.html#comments\" title=\"Watchmen comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:19:31.332192"}