{"title": "What Lies Beneath", "film_link": "/Movie Scripts/What Lies Beneath Script.html", "script_link": "/scripts/What-Lies-Beneath.html", "info_raw": "\n\nWhat Lies Beneath Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (7.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Sarah Kernochan  Clark Gregg\nGenres  Horror.Mystery  Thriller  Drama\nScript Date : June 1999\n\nRead \"What Lies Beneath\" Script\n\n\n", "script": "\n\n\n                      WHAT LIES BENEATH\n\n\n                              by\n\n                         Clark Gregg\n\n\n                                                June 14, 1999\n\n\nFADE IN:\n\nMoving through a murky haze.  Dark blues and greens, shafts\nof prismed purple.  A pale shard appears in the distance.\nGliding closer, a group of tiny fish dart before the camera.\nWe're UNDERWATER.  Arriving at the form, it finally sharpens\ninto focus.  It's a WOMAN'S BODY submerged in dark water,\narms floating lazily at her side.  The face is obscured by\nflowing hair.  All that is visible is a pair of COLD, STARING\nGREEN EYES, which blink closed...\n\n                                                    MORPH TO:\n\n...then open as BLUE EYES, as a DIFFERENT FACE emerges from\nwater.  CLAIRE SPENCER awakens from this unsettling dream in\nher bathtub.  She pivots the large BRASS SHOWER HEAD (the\nkind that moves up and down on a pipe) off to one side,\nreaches toward her feet and we hear the sound of a plug being\npulled.\n\nINT.  BATHROOM - DAY\n\nA HAZY SHAPE-- accompanied by a whirring sound.\n\nA steam covered mirror is cleared with a BLOW DRYER.  Claire\nstarts to come into focus.  The dryer stops.  She presses the\nred G.F.I. button on the socket.  ZAP!  A big blue spark\nshoots out.  Claire pulls her hand back...and the dryer\nstarts whirring again.\n\nShe clears the mirror and replaces the dryer on a hook.  She\nregards herself in the mirror, and attractive, elegant-\nlooking woman around forty.\n\nClaire traces a finger along a small but noticeable SCAR\nabove her left eye, then slowly drops the hand to her cheek,\nas if confirming her existence.\n\nINT.  CLAIRE'S HOUSE - DAY\n\nClaire, now dressed, presses her face against a door,\nlistening for the sounds of stirring from within.  Silence.\nShe quietly pushes open the door.\n\nINT.  ROOM - DAY\n\nClaire makes her way past half-filled boxes and duffels to a\nwindow, then pulls the curtains to reveal:\n\nA LOVELY, WOODED LAKE.  It couldn't be more picturesque.  A\n24' SAILBOAT is moored at the dock and an OLD STONE\nLIGHTHOUSE sits on a point across the lake.\n\nThe sunlight motivates an unconscious groan from A FIGURE\nstill shrouded by covers.\n\nClaire sits beside the sleeping form.  She scans the room\nbriefly, taking in a Greenpeace flag and a picture of a\ntomboyish ten year-old girl at camp.\n\nShe gently pulls back the covers and peers down at the same\nface, now a waifish, pretty seventeen year-old, with chopped\nhair and tiny nose ring.  Claire leans over and inhales the\nsleeping scent of her only daughter, CAITLIN.  She places her\nhand on a cheek.  The girl's eyelids flutter softly.\n\n                     CLAIRE\n          Morning, beauty.\n\nCaitlin lets out a grunt and rolls over onto her belly.\n\n                     CLAIRE\n          Let's go.  Or we'll never leave on time.\n\nFrom out of the pillow comes Caitlin's voice.\n\n                     CAITLIN\n               (muffled)\n          I'm totally ready.\n\nClaire glances around at the piles of unpacked clothes.\n\n                     CLAIRE\n          Come on, I'll make you some waffles,\n          maybe we'll squeeze in a trip to the\n          mall.\n               (beat)\n          Caitlin...\n\nClaire gently swats at the tiny lump that is Caitlin's\nbehind.\n\n                     CAITLIN\n          Mother...\n\nClaire stands and instinctively scoops up some clothes from\nthe floor, then folds and neatly stacks them on a box.\nCaitlin turns her head sideways on the pillow.\n\n                     CAITLIN\n          You're such a morning person.\n\nClaire turns at the door.\n\n                     CLAIRE\n          It is unwise to heckle the keeper of the\n          plastic.\n\nShe starts to leave.  Caitlin calls out.\n\n                     CAITLIN (O.S.)\n          Blueberries!\n\nClaire smiles as she closes the door behind her.\n\nINT.  HALLWAY - DAY\n\nClaire bends down to pick up one of Caitlin's socks.  When\nshe stands, something catches her eye out a window.  She\ngazes down, transfixed.\n\nANGLE\n\nThrough a stand of trees over a HIGH WOODEN FENCE, A YOUNG\nCOUPLE is in the midst of a heated argument next door.\nClaire watches as the HUSBAND, a large imposing man with an\nunruly shock of red hair, snarls at his wife across the hood\nof their huge old Buick.  She tries to get a glimpse of the\nwoman, but all that's visible is THE BACK OF HER BLOND HEAD.\n\nA TAN, SINEWY ARM encircles Claire's waist.  She lets out a\nsmall gasp as a hand closes on her breast.  It's Claire's\nhusband, DR. NORMAN SPENCER, nibbling gently at her neck.\nHe's older than she, pushing fifty, with silver streaks\nbeginning to permeate the shaggy mop of hair that makes him\nlook more like a preppy rocker or a lacrosse coach than the\nprominent academic that he is.  Claire, however, can't take\nher eyes off the scene below.\n\n                     NORMAN\n          They at it again?\n\nClaire nods.\n\n                     NORMAN\n          Christ, that's twice in...When did they\n          move in?\n\n                     CLAIRE\n          I think three...\n\n                     NORMAN\n          Three weeks.\n\nShe continues to gaze downward.  The man leans over the hood,\nmurmuring darkly at his wife, though for Claire and Norman\nthe scene is entirely silent.\n\n                     CLAIRE\n          What's their name?\n\n                     NORMAN\n          Feur, I think.  Psych department.  Figures.\n          They're all psychotic.\n\nOutside, Mr. Feur turns and walks toward his house.  Norman\nbegins, once again, to nuzzle Claire.  Her eyes close, but\nthen she gently demurs.\n\n                     CLAIRE\n          She's awake.\n\n                     NORMAN\n          We'll be quiet.  Quick and quiet.\n\nShe turns to him.\n\n                     CLAIRE\n          I don't want to be either.\n\nHe smiles.  A really good smile.  The lips and tongue on his\nfaded T-shirt mark him as a 'Stones fan.\n\n                     NORMAN\n          When's she out of here?\n\n                     CLAIRE\n          Norman Spencer.\n\nNorman gives up.  He busses her cheek.\n\n                     NORMAN\n               (moving toward the stairs)\n          Alright.  I can't take the rejection.  I'm\n          going to class.\n\n                     CLAIRE\n          Don't.\n\n                     NORMAN\n          Claire, I have to show up for the--\n\n                     CLAIRE\n          It's Saturday.\n\nNorman stops.\n\n                     NORMAN\n          I knew that.  You think I didn't know\n          that?\n\nShe smiles at him.  After a beat:\n\n                     NORMAN\n          It's today?\n\n                     CLAIRE\n               (wistfully)\n          Yep.\n\nThey share a warm, poignant look.  He turns and moves down\nthe stairs.\n\n                     NORMAN\n               (calling over his shoulder)\n          We're going to have to leave by three if\n          we want to beat the traffic.\n\nClaire returns her gaze to the scene below as Mr. Feur says\nsomething ominous to his wife, then stalks into the house.\n\n                     NORMAN (O.S.)\n          Claire?\n\n                     CLAIRE\n               (absently)\n          Three o'clock.\n\nANGLE\n\nMrs. Feur drops her face into her hands.\n\nEXT.  SIDEWALK CAFE - DAY\n\nClaire peruses her \"to do\" list as Caitlin munches a panini.\n\n                     CLAIRE\n          ...and I still think we should get you\n          some mittens.\n\nCaitlin puts down the sandwich and regards her mother warmly.\nThe bond between them is palpable.\n\n                     CLAIRE\n          Do you have a scarf?\n\n                     CAITLIN\n          Hey.\n\nClaire looks up from her little pad of paper.\n\n                     CLAIRE\n          Yes?\n\n                     CAITLIN\n          It's only two hours away.\n\n                     CLAIRE\n          I know that.\n\n                     CAITLIN\n          I'll come back all the time.\n\n                     CLAIRE\n          Of course you will.\n\n                     CAITLIN\n          I'm just saying, you're going to be\n          fine.\n\nClaire smiles.\n\n                     CLAIRE\n          Sweetheart, I've known this day was\n          coming for a long time.  I've got your\n          father and the garden and the new house.\n          You really don't have to worry.\n\nCaitlin smiles back and nods, her face betraying some\nconcern.  Claire takes her hand.\n\n                     CLAIRE\n          Really.\n\nShe nods reassuringly and pulls Caitlin into an embrace.  Her\neyes close.\n\n                     CAITLIN (V.O.)\n          Mother...\n\nEXT.  COLUMBIA UNIVERSITY - DAY\n\nClaire's frozen in the hug.\n\n                     CAITLIN\n               (beat)\n          Mom.\n\nHer eyes open.  Widen to reveal Claire, holding Caitlin on\nthe college campus.  The URBAN SKYLINE looms in the\nbackground.\n\n                     CAITLIN\n          I have'ta go.\n\nAfter a moment's hesitation, she releases her grip.  Caitlin\nglances over her shoulder to make sure no one's witnessed\nthis overt display of maternal affection.\n\n                     CAITLIN\n          I'll call you.\n\nClaire produces an ENVELOPE, which she presses into her\ndaughter's hand.  It's a book of TRAIN TICKETS.\n\n                     CLAIRE\n          Come home anytime.\n\nCaitlin looks at Norman.\n\n                     NORMAN\n          Really gonna leave me, huh?\n\nShe nods.  They share a tender look.\n\n                     NORMAN\n          Be good.\n\nShe throws her arm, briefly, tightly around his waist.  A bit\noverwhelmed, he slowly brings his hand to the back of\nCaitlin's head.  After a moment, she steps back...\n\n                     CAITLIN\n          Bye.\n\n...then turns and makes her way toward the large, old\nColumbia dorm.  A banner is draped across its portals which\nreads:\n\n                  \"WELCOME CLASS OF '04.\"\n\nClaire watches her daughter melt into a crowd of similarly\nshaggy freshmen, smoking and talking on the front steps.  Her\neyes are shining.  Norman wraps an arm around her waist as\nshe daps at a tear with a Kleenex.\n\n                     CLAIRE\n               (smiling)\n          I almost made it.\n\nThey turn and head for the car.  Claire sneaks one last look\nover her shoulder.\n\nANGLE\n\nCaitlin glancing back at Claire with an apprehensive smile.\n\nINT.  NORMAN AND CLAIRE'S ROOM - NIGHT\n\nClaire walks in from the bathroom wearing a sexy cotton\nnightgown.  Norman is in bed, absorbed in some notes.\n\nShe gets into bed, then picks up a thick text from beside him\nand starts reading.  After a moment:\n\n                     NORMAN\n          Whatcha reading?\n\n                     CLAIRE\n               (reading the cover, sexy voice)\n          Genetic repair mechanisms in eukaryotic\n          organisms.\n\n                     NORMAN\n               (slight smile)\n          How is it?\n\nClaire snuggles up.\n\n                     CLAIRE\n          Excellent.  Couple of Swedish sailor cells\n          just gang divided a virginal cheerleader\n          cell.\n\n                     NORMAN\n               (lost in his book)\n          Nice.\n               (beat)\n          Almost done.\n\nShe pulls slightly away.\n\n                     CLAIRE\n          If you have to work...\n\n                     NORMAN\n          No, no.  I'm just about...\n               (beat)\n          There.\n\nHe places his book on the bedside table and turns to her.\n\n                     NORMAN\n          How are you?\n\n                     CLAIRE\n          Fine.\n\n                     NORMAN\n          It's okay if you're not.\n\n                     CLAIRE\n          I am, really.\n\n                     NORMAN\n          It's just she's been the focus for a\n          while.\n\n                     CLAIRE\n          Not the focus.\n\n                     NORMAN\n          You know what I mean.\n\nClaire thinks for a moment.\n\n                     CLAIRE\n          To tell you the truth...I'm\n          excited.\n\n                     NORMAN\n          You are...\n\n                     CLAIRE\n          To get my life back.  To have some time\n          for myself.  Some time for us.\n\nHe caresses her.\n\n                     NORMAN\n          You did a great job.  She's a good kid.\n\n                     CLAIRE\n          We did.\n\nThere's a weighty pause.\n\n                     NORMAN\n          It's just us now.\n\n                     CLAIRE\n          I know.\n\nHe kisses her.\n\n                     NORMAN\n          Tired?\n\n                     CLAIRE\n          Nope.\n\n                     NORMAN\n          Wanna fool around?\n\n                     CLAIRE\n          Yup.\n\nThey start to kiss.  It's slow and a bit methodical in the\nmanner of long time lovers.  Suddenly, the SOUND OF A WOMAN\nWAILING can be heard.  They stop.\n\n                     NORMAN\n          Did you...\n\n                     CLAIRE\n          Shhh.\n\nThey listen.  The sounds start to become louder.  It is\nclearly two people in the throes of some very vocal and\nsavage love making.\n\n                     NORMAN\n          Jesus.\n\nHe walks over and closes the window.  It doesn't help.\n\n                     NORMAN\n          I guess they're making up.\n\nThe woman's moaning becomes embarrassingly loud.\n\n                     CLAIRE\n          What is he doing to her?\n\nThey lie together in silence as the cacophony drones on.\n\n                     NORMAN\n          And we moved out here for the quiet.\n\n                     CLAIRE\n          Mmm.\n\nBeat.  The mood has passed.\n\n                     NORMAN\n          Maybe we should just...\n\n                     CLAIRE\n          Tomorrow.\n\n                     NORMAN\n          I'm finished at three.  No.  Squash with\n          Stan.\n\n                     CLAIRE\n          After that.\n\n                     NORMAN\n          I'll be there.\n\nBeat.\n\n                     NORMAN\n          Love you.\n\nShe smiles.\n\n                     CLAIRE\n          Night.\n\nThey lie together in the darkness as the Feurs finally\nclimax.\n\nINT.  CAITLIN'S ROOM - DAY\n\nClaire pushes open the door to Caitlin's room carrying an\narmful of FOLDED LAUNDRY.  She moves quickly to the bureau,\nnot wanting to spend much time in here, then grabs a TINY\nBLACK TOP from the pile, and drops it into a drawer.  She's\njust about to close it, when something catches her eye.\n\nCLAIRE'S POV\n\nShe drops the laundry and slowly pulls a tattered, old\nJUILLIARD T-SHIRT with a very seventies logo from the drawer.\nClaire gazes around the room, which is a reliquary of\nCaitlin's recently concluded childhood; PICTURES, TROPHIES,\nSTUFFED ANIMALS.\n\nShe brings the now faded T-shirt to her face and drinks in\nthe smells.  She stares down at the word \"Juilliard.\"\n\n                                                MATCH CUT TO:\n\nINT.  BASEMENT - DAY\n\n\"JUILLIARD\"...now it's on the same T-shirt only Claire's\nwearing it and she's much younger.  It's an old photograph in\nan album.  Younger Norman stands next to her in the shot, his\narm draped around her waist.  A CELLO CASE stands beside her.\n\nClaire glances around at several hastily unpacked boxes and\nsees propped in the corner...THE CELLO CASE.  She gazes at\nother photos.\n\n-- Claire in her wedding dress, Norman beside her in a tux\n   with a very wide bow-tie.\n\n-- Claire and Norman in front of a UNIVERSITY BUILDING.  A\n   tiny Caitlin rests on her hip.\n\nClaire's chin begins to tremble and she chokes out a sob.\n\nEXT.  FRONT YARD - DAY\n\nHer face streaked with tears, Claire stumbles out into the\nimmaculately manicured ROSE GARDEN.\n\nThe yard is surrounded by a HIGH WOODEN FENCE.  She collapses\ninto a lawn chair as the tears begin to subside.  Suddenly,\nshe hears something coming from next door.\n\nShe cocks her head and attempts to make out the sound.  It\nis, ironically, the sound of a WOMAN CRYING.  Claire makes\nher way over to the fence.  The women's sobbing becomes more\nplaintive and fevered.\n\nShe places her face against the prickly, vine covered fence\nand tries to peer through the crack.  All she can make out is\nA DARK BLUE BLUR that seems to be rocking.  Claire gathers\nher nerve and calls out...\n\n                     CLAIRE\n          Hello...\n\nThere's no reaction.\n\n                     CLAIRE\n          Mrs. Feur?\n\nThe sobbing chokes down to a breathless whimpering.  The blue\nshape vanishes from view.\n\n                     CLAIRE\n          Wait a minute.  I just want--\n\nSomething bumps against the fence.  Claire draws back.  She\nhears heavy breathing.\n\n                     MRS. FEUR\n               (sniffling)\n          Who are you?\n\n                     CLAIRE\n          It's Mrs...It's Claire...Spencer.  From\n          next door.  Is everything--\n\n                     MRS. FEUR\n          You're the flower lady.\n\n                     CLAIRE\n          Um...yes.\n\n                     MRS. FEUR\n          I've seen you.  From the window.\n\n                     CLAIRE\n          Is everything alright?\n\nClaire leans closer to the tiny crack.  She sees a fleshy\nblur and what might be part of an eye.  There's no response,\njust the breathing.\n\n                     CLAIRE\n          Hello?\n\n                     MRS. FEUR\n          I'm not...\n\nShe seems on the verge of losing it again.\n\n                     MRS. FEUR\n          He's so...it's too much...and I can't...I\n          can't breath...\n\n                     CLAIRE\n          Who?  Your husband?\n\n                     MRS. FEUR\n          And I'm afraid.  Oh god, I'm so afraid\n          of...\n\nShe trails off.\n\n                     CLAIRE\n          What?  What are you afraid of?\n\n                     MRS. FEUR\n          I can't, no, no, I can't...\n\nClaire edges closer to the crack.\n\n                     CLAIRE\n          Tell me.  Please.\n\n                     MRS. FEUR\n          That I'll just...that one day I'll\n          just...disappear.\n\nBeat.  Claire's taken aback by this admission.\n\n                     CLAIRE\n          Tell me.  I can help you.\n\n                     MRS. FEUR\n          How?  How can you help me?  With your\n          flowers and your perfect life...\n\n                     CLAIRE\n          That's not...It's not like that.\n\n                     MRS. FEUR\n          I've never even met you.\n\n                     CLAIRE\n          I know.  And I'm sorry.  I've been consumed\n          with...my daughter left...for school.\n\n                     MRS. FEUR\n          This fence...it's so...\n\n                     CLAIRE\n          I'm sorry.  It's for the flowers.  Why\n          don't you...\n\nTires can be heard crunching the gravel as a car pulls into\nthe Feur's driveway.\n\n                     MRS. FEUR\n          Oh God.  He's back.  I'm sorry.  Please\n          forget that I...I don't know what I'm\n          saying.  Please...\n\n                     CLAIRE\n          Wait!  Don't go...\n\nClaire listens to the sound of NAKED FOOTSTEPS, followed by a\nLARGE FRONT DOOR swinging shut.  A CAR DOOR swings open and a\nMAN'S SHOES follow down the path.\n\nClaire pulls back from the crack and leans against the fence\nas the door closes a second time.  She sits there for a\nmoment listening, but all is quiet.\n\n                     CLAIRE (V.O.)\n          She sounded terrified.\n\nINT.  DINING ROOM - NIGHT\n\nClaire and Norman eat dinner.  A rainstorm pelts the windows.\n\n                     NORMAN\n          Of what?\n\n                     CLAIRE\n          Of him I think.\n\n                     NORMAN\n          Did she say that?\n\n                     CLAIRE\n          More or less.\n\nNorman chews.\n\n                     NORMAN\n          Honey, they're young.  They're probably\n          newlyweds.\n\n                     CLAIRE\n          I'm telling you.  There was something in\n          her voice...\n\n                     NORMAN\n          Remember how we were?\n\n                     CLAIRE\n          Not like this.  We were never like this.\n               (beat)\n          I want to go over there.  After dinner, we\n          can--\n\n                     NORMAN\n          Why?\n\n                     CLAIRE\n          To make sure she's all right.\n\nNorman puts down his fork.\n\n                     NORMAN\n          Claire, honey, we are not going to march\n          next door and accuse our new neighbor of--\n\n                     CLAIRE\n               (overlapping)\n          That's not what I'm sug--\n\n                     NORMAN\n          ...when tonight they'll probably be\n          keeping us awake.\n\n                     CLAIRE\n          But what if something happens?\n\n                     NORMAN\n          Claire...\n\n                     CLAIRE\n          I'd never be able to live with mysel--\n\n                     NORMAN\n               (reassuring)\n          Nothing's going to happen.\n               (beat)\n          Besides, I have to work tonight.  The\n          conference is in less than two weeks.\n          I've got to stay focused on that for just\n          a little longer.\n               (beat)\n          This is...\n\n                     CLAIRE\n          I know.\n\n                     NORMAN\n          It's what I've been working for.\n\nShe glances down at her untouched plate.\n\n                     CLAIRE\n          I just wish you could have heard her.\n\n                     NORMAN\n          Look, I'll call Harvey Tomes in the Psych\n          department, see what I can find out.\n\n                     CLAIRE\n          Promise?\n\nHe gives her a \"Didn't I just say so\" look.  She smiles.\n\n                     CLAIRE\n          I'll make you some coffee.\n\nShe reaches for his plate to clear it.  Norman grabs her hand\nand kisses it.\n\nINT.  NORMAN AND CLAIRE'S ROOM - NIGHT\n\nNorman snores softly.  Claire is awakened by the continuing\nSTORM.  She pads out to Norman's turreted library.  Rain\npelts the glass.  Her face is briefly illuminated by the\nLIGHTHOUSE BEAM.\n\nShe hears the sound of a DOOR CLOSING and moves to get a\nbetter view of the Feur's.  Nothing but blackness.  Just as\nshe's turning to go back to bed.  A LIGHTNING FLASH lights up\nthe night.  Claire's eyes go wide.\n\nCLAIRE'S POV\n\nIn the split second of brilliance, she sees Mr. Feur, in\nshirtsleeves, drenched, dragging A LARGE DUFFEL toward the\nopen trunk of his car.\n\n                     CLAIRE\n               (in a hoarse whisper)\n          Norman!\n\nHe's dead to the world.  She calls to him again.\n\n                     CLAIRE\n          Norman, you have to look at this!\n\n                     NORMAN\n          Mmnph.\n\n                     CLAIRE\n          Hurry...\n\nAnother flash illuminates...Norman at her side.\n\n                     CLAIRE\n          Look!\n\n...an EMPTY DRIVEWAY, then blackness.\n\n                     NORMAN\n          What is it?  What's the matter?\n\nShe stares down into the darkness.\n\n                     CLAIRE\n          Nothing.  There was...I thought I saw\n          something.\n\n                     NORMAN\n          Is it gone?\n\nTHE BEACON illuminates the empty driveway.  She nods.\n\n                     NORMAN\n          Come on, let's go back to bed.\n\nYet another bolt of lightning reveals Claire, still at the\nwindow.\n\nEXT.  BACKYARD - MORNING\n\nClaire sets up a camera and tripod.  She steps back and aims\nher camera.  She glances up at a large upstairs window at the\nFEUR'S HOUSE.  One side of the curtain seems to be pulled\nopen, but no one's there.\n\nFeeling self-conscious, she turns back to the camera.  The\nmorning sun hits the flowers just right and she SNAPS SEVERAL\nPICTURES OF THEM against her lovely house.\n\nShe glances back at the Feur's window.  The CURTAIN IS NOW\nCLOSED.\n\nShe walks over to the fence and tries to peek through it.\nWhen this doesn't work, she drags a lawn chair over and peers\nacross the fence.  She can barely see over, but glimpses:\n\nA DEEP FURROW in the mud of the driveway.  Just then, a car\npulls into the driveway, Claire scrambles down from her\nperch.\n\nEXT.  DRIVEWAY - DAY\n\nClaire walks out to find her best friend, JODY, pretty, in\nher forties, wearing hip, hippie-ish clothes.\n\n                     CLAIRE\n          Hey there.\n\nJody hugs her.\n\n                     JODY\n          How you holding up?\n\n                     CLAIRE\n          Good.  I'm good.\n\n                     JODY\n          You are?\n\n                     CLAIRE\n          Why does everyone find that so\n          surprising?\n\n                     JODY\n               (are you kidding?)\n          Cause...your...only daughter just went\n          away to school...who you were incredibly\n          close with aaand I'd be tripping...\n\n                     CLAIRE\n          Okay, I'm a little tender.\n\n                     JODY\n          Well good.  So you're human.\n\n                     CLAIRE\n          And so far my day has consisted of taking\n          pictures of my roses for the garden club.\n\n                     JODY\n          Wow.  Got here just in time.\n               (reaching into her bag)\n          I brought you this.\n\nShe proffers several homemade tea bags.\n\n                     CLAIRE\n          What is it?\n\n                     JODY\n          Kambucha mushroom tea...\n\n                     CLAIRE\n          Jody--\n\n                     JODY\n          It soothes heart-ache and promotes\n          psychic wellness.  Sela suggested I bring--\n\n                     CLAIRE\n          You're discussing me with your psychic?\n\n                     JODY\n          She's not a psychic.  Just a very\n          enlightened spirit.\n\n                     CLAIRE\n          Thanks, but I'm fine.\n\n                     JODY\n               (pressing it into her hand)\n          So you'll have some later.\n               (beat)\n          Notice anything...different?\n\nClaire gives her friend the once over, then notices the mint\nKarman-Ghia behind her.\n\n                     CLAIRE\n          Oh my god.  You bought it.\n\n                     JODY\n          Yep.\n\n                     CLAIRE\n          It's niiice.\n\n                     JODY\n          Beautiful thing, alimony.  Lose a husband,\n          get a car.  Think it'll help me pick up\n          dudes?\n\n                     CLAIRE\n          Absolutely.\n\n                     JODY\n          Listen, I've gotta run.  I just thought\n          I'd stop by and see if you want to take\n          the boat out, say Thursday morning?\n\n                     CLAIRE\n          You got it.\n\nJody grins.\n\n                     JODY\n          See you then.\n\nJody drives off.  Claire walks down the driveway to her front\ndoor and sees Mr. Feur staring at her from a window.  She\nstarts to wave, but the curtain is drawn shut.\n\nClaire arrives at the front door and reaches out to touch the\ndoorknob.  She stops.  A FAINT RUSTLING can be heard from\nwithin.  Claire quietly opens the door and moves into:\n\nINT.  FOYER - DAY\n\nClaire stops inside the door.  Now it sounds like WHISPERING.\nTwo voices, tense, impassioned.  It seems to be coming from\nNorman's study.  She gathers her nerve, then bursts into the\nroom.\n\nINT.  NORMAN'S STUDY - DAY\n\nBut the whispering has suddenly stopped.\n\n                     CLAIRE\n          Hello?\n\nThe lovely circular room is completely empty.  She looks\naround, puzzled.  Cooper, the family's aging lab, casually\nambles over.\n\n                     CLAIRE\n               (to Cooper)\n          Please tell me you heard that.\n\nEXT.  LAKE - DAY\n\nClaire and Cooper, out on a walk, emerge onto large rocks at\nthe water's edge.  Claire tosses a long stick for Cooper, who\nbolts out onto the LONG WOODEN DOCK.  Claire gazes at the\nLIGHTHOUSE across the lake and a long BRIDGE in the distance.\nCooper starts BARKING and looking down into the water.\n\nClaire arrives at Cooper's side and stares down into the dark\nwater.\n\n                     CLAIRE\n          Cooper...what do you see?\n\nShe looks down and sees nothing but her own reflection.\nAfter a moment, she notices a FAINT WHITE SHAPE directly in\nthe reflection of her face.  Cooper rumbles a low growl.  The\nshape seems to be gaining definition.\n\nRRRING!\n\nClaire gasps quietly, then reaches into a pocket in her\nsweater and pulls out a cordless phone.\n\n                     CLAIRE\n               (into phone)\n          Hi.\n\n                     NORMAN (V.O.)\n               (on the other end)\n          I'm stuck here for another couple of\n          hours.\n\nClaire's smile fades.\n\n                     CLAIRE\n          Oh.\n\n                     NORMAN (V.O.)\n          Unless you need me to come home...\n\n                     CLAIRE\n          No, no.  It's fine.\n\nClaire slowly leans out over the water to check her\nreflection...\n\n                     NORMAN (V.O.)\n          You sure?\n\n...but the shape is gone.\n\n                     NORMAN (V.O.)\n          Claire?\n\n                     CLAIRE\n          Huh?  Absolutely.  Take your time.\n\nShe clicks off the phone and looks down at the calm water.\n\nINT.  WORK ROOM - NIGHT\n\nClaire sits in a small workroom at a computer.  She focuses\nintently on the screen.\n\nANGLE\n\nIt's ALICE'S COMPUTER SOLITAIRE.  She flips the last card and\nan animated Queen of Hearts, accompanied by a series of\nmusical notes, parades across the screen.\n\n                     QUEEN OF HEARTS\n               (on computer)\n          You lost!  Off with your head!\n\nClaire hits \"New Game\" and watches as a fresh hand of cyber\nsolitaire is dealt.  She suddenly has a thought and\ndisappears into the kitchen.\n\nINT.  KITCHEN - NIGHT\n\nShe glances at Jody's tea, smiles, then refills her glass of\nred wine.  She picks up the phone from its cradle and moves\ninto:\n\nINT.  LIVING ROOM - NIGHT\n\nShe dials a number.  LOUD REGGAE can be heard blaring through\nthe phone.\n\n                     CLAIRE\n               (straining to be heard)\n          Hello?  I'm looking for Caitlin Spencer.\n          She's in 314...Well, could you check?\n\nShe plugs one ear.\n\n                     CLAIRE\n          Oh.  Well, just tell her that her mother\n          called.  Her mother.  Thank you.  Excuse\n          me, how can you study with that?\n\nThe noise abruptly stops.  Claire clicks off the phone and\nreplaces it in the sweater pocket.  She tunes the stereo to a\nclassical music station.\n\nINT.  WORK ROOM - NIGHT\n\nShe walks in, places the cordless phone on a BASE UNIT, then\nhears a different set of musical notes from the computer.\nShe stares at the screen, stunned.\n\nANGLE\n\nThe game has been finished.  Cards with faces swarm\nchaotically across the screen with the message:  YOU WIN!\n\n                     CLAIRE\n          Oh.  Kay.\n\nWithout warning, the radio dial rips cacophonously past\nseveral stations and comes to a stop on some angry, punkish\nrock and roll.\n\n                     CLAIRE\n          Jesus...\n\nShe bolts around a corner to the stereo.  The music is\nchaotic and deafening.  She finds Cooper growling at...no\none.  She turns off the stereo.  Cooper suddenly bolts down\nthe hall.  She follows him.\n\nINT.  FOYER - NIGHT\n\nThe foyer's empty, but the front door is open.  Claire\nnervously walks out and looks around.\n\n                     CLAIRE\n          Cooper!\n\nPOV - THE GARDEN\n\nNo sign of the dog.\n\nClaire turns to go back inside.  When she touches the\ndoorknob, she hears the whispering again.  A fleeting shadow\ndraws her eye to a COAT RACK MIRROR which reflects directly\ninto the study.\n\n                     CLAIRE\n          Hello...?!\n\nThe whispering stops.\n\nINT.  NORMAN'S LAB - NIGHT\n\nClaire walks in to find Norman surrounded by several GRAD\nSTUDENTS.  At school he's a very different man; pressed shirt\nand tie, hair neatly brushed back.  They're preforming some\nunseen procedure on a live sheep in a containment harness.\nShe stops by the door to watch him.\n\n                     NORMAN\n          ...and then what...Courtney?\n\nAn intense ASIAN GIRL answers.\n\n                     COURTNEY\n          We administer the Halothane.\n\n                     NORMAN\n          Dosage?\n\nShe glances at her notes.\n\n                     COURTNEY\n          Three point five cc's.\n\n                     NORMAN\n          Excellent.  Properties?  Andrew from\n          downtown...\n\nAndrew, tall razor thin, was waiting for this.\n\n                     ANDREW\n          An organic, neuromuscular blocking agent,\n          which when administered in aerosol form\n          temporarily renders the subject immobile.\n\n                     NORMAN\n          Nothing but net.\n\nHe measures out the liquid from a blue plastic bottle into an\napparatus connected to an inhalation mask on the sheep.\n\n                     NORMAN\n          Prudence here's an old friend.\n\nHe moves to the sheep's head and strokes it as he nods to\nCourtney who turns a valve on the apparatus.  The sheep\nsuddenly goes completely still.  Norman moves around and\nbegins a brief procedure.\n\n                     NORMAN\n          I try to stay on her good side because I\n          owe her my career and most of our grant\n          money.  Why else?\n\nHe completes the procedure.  They look at him blankly.\n\n                     NORMAN\n          Always do unto others as you'd have\n          others do unto your ewe.\n\nGroans, laughter.  He stops Claire.\n\n                     NORMAN\n          That'll do it.  Write this up for Tuesday!\n\nAndrew and Amy tend to Prudence, the rest leave.  Claire\nmoves over to him.  They kiss.  Norman packs notes and some\nof the chemicals into a LEATHER CASE.\n\n                     NORMAN\n               (warm)\n          What are you doing here?\n\n                     CLAIRE\n          There were some noises.  I didn't want to\n          disturb you.\n\nShe watches as the sheep slowly becomes reanimated and is led\nout of the room.\n\n                     NORMAN\n          What do you mean?  Some noises where?\n\n                     CLAIRE\n          In the house.  I was scared.\n\n                     NORMAN\n          Did you call the police?\n\n                     CLAIRE\n          No.  Can you drive me home?  I'll bring you\n          back in the morning.\n\n                     NORMAN\n          Of course.\n\nHe takes her arm.\n\nINT.  THE FOYER - NIGHT\n\nNorman pushes open the front door.  Cooper pads over, wagging\nhis tail.  They walk together past the stereo into...\n\nINT.  LIVING ROOM - NIGHT\n\n...the living room.  All is quiet.  They move into...\n\nINT.  NORMAN'S STUDY - NIGHT\n\nIt's undisturbed.  Norman checks the window locks.\n\n                     CLAIRE\n          It was there.  This angry music all by\n          itself.  And I heard whispering.\n\n                     NORMAN\n          What kind of whispering?\n\n                     CLAIRE\n          I don't know.  Just...whispering.\n\nHe nods as Cooper appears.\n\n                     NORMAN\n          What'd you see, Coop?\n\nThe dog stares blankly.\n\n                     CLAIRE\n               (to Cooper)\n          Tell him!\n\nNorman smiles.\n\nINT.  BEDROOM - NIGHT\n\nNorman sits on the bed and pulls off his shoes.\n\n                     NORMAN\n          I'm gonna have the police check on the\n          house.\n\nClaire leans against the window sill.\n\n                     CLAIRE\n          Oh great, \"Can you look in on my wife,\n          she's hearing voices?\"  Wait'll that gets\n          around.\n\nHe walks over to her.\n\n                     NORMAN\n          I've got the conference next week.  I want\n          you to feel safe.\n\n                     CLAIRE\n          I do, I do.  I'm sure I'm just...how\n          was your day?\n\nHe goes to his dresser and fishes a little joint from a box\nin his dresser.\n\n                     NORMAN\n          Think I may have cracked it.\n\n                     CLAIRE\n          Really?\n\nShe produces a match and lights it.  They sit on the bed.\n\n                     NORMAN\n          I think so.  Maybe.\n\n                     CLAIRE\n          You are so brilliant.\n\n                     NORMAN\n          Yep.\n\n                     CLAIRE\n          Madame Curie, Jonas Salk, Norman\n          Spencer...\n\n                     NORMAN\n               (smiling)\n          You know what that does to me.\n\nShe takes a little puff on the joint as he kisses her neck.\n\n                     NORMAN\n               (stopping)\n          Ohmigod.  You'll never believe...I saw\n          Schumway...\n\n                     CLAIRE\n          You're kidding.\n\n                     NORMAN\n          He's here giving some arcane spiel for\n          the physics department, so Bob Shine\n          introduces us...\n\n                     CLAIRE\n          Wow.\n\nHe nods, Claire passes the joint back.\n\n                     NORMAN\n          And he says...you'll fucking love this,\n          he says, \"Doctor Spencer, I am a great\n          admirer of your work...\"\n\n                     CLAIRE\n          Well, that's nice.\n\n                     NORMAN\n          \"...especially Spencer's Theorem...\"\n\n                     CLAIRE\n               (overlapping)\n          Oh, no...\n\n                     NORMAN\n          \"...of Perpetual Distances.\"\n               (beat)\n          Everybody's checking their shoelaces.\n          Pins drop.  \"I'm afraid you've mistaken\n          me,\"  I say...\n\n                     CLAIRE\n               (overlapping)\n          That's...\n\n                     NORMAN\n          \"...for my father.\"\n\n                     CLAIRE\n          I'm so sorry.\n\n                     NORMAN\n          Didn't know he was dead, every stinking\n          paper on the globe.\n\n                     CLAIRE\n          That's just mean.\n               (indicating joint)\n          Oh.  Jody wanted to know if I could get\n          her some.\n\n                     NORMAN\n               (quickly glancing over)\n          Did you tell her?\n\n                     CLAIRE\n          What?  No.  No.\n\n                     NORMAN\n          You didn't?\n\n                     CLAIRE\n               (with a smile)\n          Norman, you are so funny about that.  No,\n          I didn't.\n\nHe takes a little toke, then vanishes into the bathroom.\n\n                     NORMAN (O.S.)\n          Cause that would be really--\n\nShe lays back on the bed.  Sounds of flushing.\n\n                     CLAIRE\n          I didn't.\n\nHe reappears without the joint.\n\n                     NORMAN\n          Sorry.  You understand.\n\n                     CLAIRE\n          Did you call about the Feurs?\n\n                     NORMAN\n          Oh, right.  Yes.  Harvey says the guy's a\n          sweetheart.  Wouldn't hurt a fly.\n\n                     CLAIRE\n          Huh.\n\nClaire ponders this.  Norman turns off the light and joins\nher on the bed.  He kisses her knee.\n\n                     NORMAN\n          Do the brilliant Norman stuff some more.\n\nThen starts working his way up her thigh.\n\n                     NORMAN\n          And speak up.\n\nClaire smiles.\n\nINT.  LIVING ROOM - AFTERNOON\n\nClaire sits frozen, cello between her legs, bow hovering in\nposition.  After an uncomfortable long pause, she touches bow\nto string, drawing in a breath at the power of the sound.\n\nClaire takes another deep breath, then launches into a\nbeautiful and melancholy piece of music.  She's very, very\ngood.  Eyes closed.  Her body begins to sway slightly as her\nleft hand vibratos like butterfly wings on the neck.\n\nShe reaches a difficult transition and falters.  She seems\nalmost surprised.  She attacks the transition again, and\nagain falters.  Claire bites her lower lip and tries yet\nagain, this time failing completely.\n\nShe sits back in the chair, despondent.  Almost as an\nafterthought, she sadly drags the bow across strings.  At the\nend of the tone, something catches her ear.  She can just\nmake out the HINT OF A FAINT FEMININE VOICE echoing the tone.\n\nShe sits up and plays a different note, then another.  Each\ntime the soft mournful voice becomes more distinct.  Finally\nshe plays a sharp, higher pitched note.  The voice echoes\nwith a distinct, unsettling shriek.\n\nCRASH!\n\nINT.  NORMAN'S STUDY - DUSK\n\nClaire walks in and sees:\n\nINSERT-- Lying on the floor...A FRAMED NEWSPAPER PHOTOGRAPH\nOF NORMAN AND CLAIRE.\n\nThe caption announces that he's being promoted to the\n\"distinguished DUPONT CHAIR IN GENETICS.\"  Through the\nspiderwebbed glass, Norman can be seen shaking hands with an\nolder academic, hugging a smiling Claire to his side.\n\nClaire kneels down to gather the picture.  A single shard of\nglass is missing.  She finds it a foot away by a distinctive\nknot in the wood floor.\n\nShe notices a COPPER GLINT in the point of glass, but when\nshe moves it, it's gone.  She places the pieces of broken\nglass on the frame and stands.\n\nOut of the window directly in front of her sees:  Mr. Feur,\nremoving a DIRT COVERED SHOVEL from his trunk.  She glances\ndown at the picture, then back up at Mr. Feur, who carries\nthe shovel around back.\n\n                     CLAIRE\n          Oh no...\n\nClaire wraps up the broken picture.  She hears a car door\nslam and glances out the window in time to see Mr. Feur\ndriving off.\n\nEXT.  GARDEN - DAY\n\nA stiff autumn breeze.  Claire stands at the fence.\n\n                     CLAIRE\n          Mrs. Feur?\n\nShe looks through the tiny crack.  Nothing.\n\n                     CLAIRE\n          Hello?\n               (beat)\n          Are you there?\n\nSilence.\n\nEXT.  THE FEUR'S - DAY\n\nClaire glances down as she walks past THE FURROW.  She looks\nup at the house, which seems quite placid, then slowly heads\naround back.\n\nEXT.  FEUR'S BACK PORCH - DAY\n\nShe takes in the lake view from the large porch.  The wind is\nreally blowing.  Her eye catches on something.  Propped\nagainst the back door...\n\nTHE SOIL COVERED SHOVEL\n\nClaire takes a pinch of soil from the shovel and tastes it,\nthen knocks at the back door.  There's no answer.  She knocks\nagain.  Nothing.  She's turning to go, then the door swings\nopen.  The smile fades from Claire's face.\n\nCLAIRE'S POV\n\nThe immense MR. FEUR filling the doorway.\n\n                     MR. FEUR\n          Yes?\n\n                     CLAIRE\n          Um...\n\n                     MR. FEUR\n          I'm running late here.  I just came back\n          for my briefcase.\n\n                     CLAIRE\n          Right.  Well, I wanted to stop by to\n          welcome you to the uh, to the\n          neighborhood.  I'm Claire Spencer.  From\n          next door.\n\n                     MR. FEUR\n          This really isn't a good time.\n\nHe starts to close the door.\n\n                     CLAIRE\n          Well maybe your wife...\n\n                     MR. FEUR\n               (growing cold)\n          She isn't here.\n\n                     CLAIRE\n          When...when will she be back?\n\n                     MR. FEUR\n          I don't know.\n\n                     CLAIRE\n          Oh-kay...\n\n                     MR. FEUR\n          I have to go.\n\nSlam.  And Claire is staring at a closed door.\n\n                     JODY (V.O.)\n          What do you mean she's gone?\n\nEXT.  LAKE - DAY\n\nClaire and Jody knife slowly through the water in the\nSpencer's sailboat heading back toward the dock, the OLD\nLIGHTHOUSE, the BRIDE in the background.\n\n                     CLAIRE\n          She's not there.  I haven't seen her since\n          that morning.  Well, I mean, I've never\n          actually seen her, but I'm telling you,\n          she's disappeared.\n\nJody finishes securing a line.  The breeze is mild, so they\njust cruise with the wind.\n\n                     JODY\n          What are you saying?\n\nClaire just looks at her.\n\n                     JODY\n          You think he killed her?\n\n                     CLAIRE\n          I don't know.  When you say it, it sounds\n          crazy.  But what else could it all be?\n\nJody shakes her head.\n\n                     CLAIRE\n          I mean, he's so kind of grim and\n          daunting, and she sounded terrified of\n          something.\n\nClaire glances over at Jody.\n\n                     CLAIRE\n               (laughing to herself)\n          Listen to me.  I sound like some middle-\n          aged Nancy Drew.\n\nJody regards her.  After a beat:\n\n                     JODY\n          Know what I think?\n\n                     CLAIRE\n          What?\n\n                     JODY\n          Seance.\n\n                     CLAIRE\n          Jody, no...\n\n                     JODY\n          Telling you...\n\n                     CLAIRE\n               (overlapping)\n          ...no...no...no...\n\n                     JODY\n          Just bought this beautiful antique Ouija.\n\n                     CLAIRE\n          Please.  That's all I need.\n\nJody shrugs, \"Have it your way.\"  Beat.\n\n                     JODY\n          Hey, look.\n\nCLAIRE'S HOUSE across the lake.\n\n                     JODY\n          So pretty.\n\nCLAIRE'S POV\n\nA FIGURE in the turreted window of Norman's study.\n\n                     CLAIRE\n          Someone's there.\n\n                     JODY\n          What?\n\n                     CLAIRE\n          In the window.  Norman's at work.\n\n                     JODY\n          I don't...\n\nClaire looks over at Jody.\n\n                     CLAIRE\n               (pointing)\n          There.  In the study.  Don't you see--\n\nShe looks again-- nothing.\n\n                     CLAIRE\n          Wow.  I'm losing it.\n\n                     JODY\n          No, you're not.\n               (beat)\n          But a presence in your house is not\n          something to be taken lightly.\n\nClaire stares back at the house.\n\nINT.  KITCHEN - NIGHT\n\nClaire walks in and sets down some packages.  She opens one\nand pulls out new toothpaste and...AN ENVELOPE-- the kind\nyour pictures come back in.  She absently leafs through them,\nthen freezes.  She gapes at one of the shots.\n\n                     CLAIRE\n          Oh boy...\n\nINT.  UPSTAIRS - NIGHT\n\nClaire turns off the lights and crouches down.  She raises a\npair of BINOCULARS.\n\nPOV - BINOCULARS\n\nClaire rakes the binoculars across the Feur's house...past\ntheir car parked in front until she finds A LIGHT ON\nDOWNSTAIRS.\n\nThe tall, powerfully built Mr. Feur walks into the room and\nsits by himself at the dining room table, which is set for\none.  He eats a TV dinner, slowly chewing and staring\nstraight ahead.  He sips from a can of beer.\n\nJust then...A HAND GRABS CLAIRE'S ARM.  She lets out a\nscreech and turns to see Norman standing beside her.\n\n                     NORMAN\n          What are you doing?\n\nShe glances back out the window and sees Mr. Feur standing\nat the window, paging the curtain.  She squats down, pulling\nNorman with her.\n\n                     CLAIRE\n               (shrill whisper)\n          Get down!  He'll see.\n\n                     NORMAN\n               (also whispers)\n          What's going on, Claire?\n\n                     CLAIRE\n          Shhhh.\n\nShe peers over the sill in time to see Mr. Feur turning away\nfrom the window.  She takes Norman by the hand and leads him\ndownstairs.\n\nINT.  CLAIRE'S KITCHEN - NIGHT\n\nShe leads Norman in.\n\n                     NORMAN\n               (still whispering)\n          Why am I...\n               (full voice)\n          Why am I whispering in my own house?\n\nClaire turns.\n\n                     CLAIRE\n          He killed her.\n\n                     NORMAN\n          What?\n\n                     CLAIRE\n          He did.  She's in the picture.  I went\n          over to look and she's gone.  The table\n          was set for one.\n\n                     NORMAN\n          And that means he murdered his wife?\n          This is getting ridic--\n\n                     CLAIRE\n          No, no, no, no.  The soil on the shovel,\n          his shovel...that's clay.  It's not from\n          here, believe me, I...\n               (frustrated, she grabs the\n                photos)\n          All right, look at this.\n\nShe triumphantly thrusts one before him.  Norman looks at it.\n\n                     NORMAN\n          Our house.\n\n                     CLAIRE\n          No.  Look!  In the window.\n\nThe ROSES.  She points out a HAZY FIGURE in the TURRETED\nWINDOW of the study.  Norman takes it over to the light.\n\n                     NORMAN\n          It's a flare.\n\n                     CLAIRE\n          A flare?\n\n                     NORMAN\n          From the sun.  It's a reflection on the\n          glass.\n\n                     CLAIRE\n          It's her!  I'm telling you.  She whispered\n          and turned on the music.  She's trying to\n          contact me!\n\n                     NORMAN\n               (making sure he's got it)\n          It's a ghost.\n\nNorman shakes his head.  He looks again at the picture, does\na quick calculation.\n\n                     NORMAN\n          You took this in the morning, didn't you?\n\nShe nods slightly.\n\n                     NORMAN\n          When the sun would be exactly right.\n\nShe's got him.\n\n                     CLAIRE\n          Then why isn't it in any of the other\n          pictures?\n\nShe thrusts the batch at him.  He peruses the other few shots\nof the garden.\n\n                     NORMAN\n          A cloud passed.  Or it's a bounce off the\n          lake.  See?\n\nShe looks.  He might not be wrong.\n\n                     CLAIRE\n          Where is she then?\n\n                     NORMAN\n          She could be out.  She could be sick in\n          bed for all we know.\n\n                     CLAIRE\n          Okay.  Okay.  I'll bet there's...Look at\n          this.\n\nShe leads him out of the room.\n\nINT.  WORK ROOM - NIGHT\n\nClaire stares at the computer screen triumphantly.\n\n                     CLAIRE\n          See?\n\n                     NORMAN\n          What am I looking at?\n\n                     CLAIRE\n               (indicating completed solitaire\n                game)\n          I didn't do that.\n\n                     NORMAN\n          Who did?  Mrs. Feur?\n\n                     CLAIRE\n          Maybe.  Point is...not me.\n\n                     NORMAN\n          Right.  And why is she here?  If he killed\n          her, why doesn't she haunt him?\n\n                     CLAIRE\n          She was lonely, I talked to her.  Norman,\n          I know how it looks, but--\n\n                     NORMAN\n          Claire, listen to me.  I know you're under\n          some strain.  But there's no such thing as\n          ghosts.  They don't exist.  Our neighbor\n          did not kill his wife, and I...wait, why\n          aren't you dressed?\n\n                     CLAIRE\n          Dressed?\n\n                     NORMAN\n          Dinner.  With Stan and his new girl.\n\n                     CLAIRE\n          When?\n\n                     NORMAN\n          What do you mean?  Claire, we talked about\n          it.  You didn't want Japanese, I said, Our\n          first date since...\n\n                     CLAIRE\n               (she seems confused)\n          Oh.\n\n                     NORMAN\n          ...since Caitlin.  You don't remember\n          this?\n\n                     CLAIRE\n          Tonight?\n\n                     NORMAN\n          Yes, tonight.  We're going to be--\n\nShe looks at his watch.\n\n                     CLAIRE\n          Fashionably five minutes late.\n\nShe bolts up the stairs.\n\nINT.  NORMAN'S PICKUP TRUCK - NIGHT\n\nThey drive across the bridge.\n\n                     NORMAN\n               (concerned, exasperated)\n          When you do this, I swear...\n\n                     CLAIRE\n               (overlapping)\n          ...Don't get all...\n\n                     NORMAN\n          ...like it never even happened...\n\n                     CLAIRE\n          Okay, okay, I'm sure that I just...\n\nHe pulls out a cell phone and punches in a number.\n\n                     CLAIRE\n          What are you doing?\n\n                     NORMAN\n          Restaurant.  Let them know we're running\n          late.\n\n                     CLAIRE\n          Five minutes?\n\nThe phone flashes...\"NO SERVICE.\"\n\n                     CLAIRE\n          You're not at the center.\n\n                     NORMAN\n               (overlapping)\n          I know I'm not at the center of the\n          bridge.\n\n                     CLAIRE\n          We're going to be fine.\n\nThey near the far side of the bridge.  Norman looks down at\nthe cell phone, which now reads, \"ROAM.\"  He presses a\nbutton.\n\n                     NORMAN\n          There we go.\n\n                     CLAIRE\n          Well, that's a relief.\n\nHe shoots her a look.\n\nINT.  RESTAURANT - NIGHT\n\nA cozy, candlelit Italian place in town.  Claire and Norman\narrive at the table.  STAN rises.  The chair next to him is\nempty.  He kisses her cheek.\n\n                     CLAIRE\n          Hi Stan.  Sorry we're late.\n               (too earnest)\n          It was my fault.\n\nShe greets Stan, a friendly looking man in his forties.\n\n                     STAN\n          We just got here.\n\nClaire flashes a semi-playful look back at Norman.\n\n                     CLAIRE\n          Where's the new squeeze?\n\nA VOICE speaks out from behind her.\n\n                     VOICE\n          Here I am.\n\nClaire turns to find A TALL, ELEGANT BRUNETTE standing behind\nher.  The woman's face registers some shock.\n\n                     STAN\n          I'd like you to meet...\n\n                     CLAIRE\n          Elena?\n\n                     ELENA\n          Ohmigod...\n\nThe two women embrace, then beam at each other.\n\n                     CLAIRE\n          Wow.\n\n                     ELENA\n          This is...\n\n                     CLAIRE\n               (to Norman)\n          We know each other.\n\n                     NORMAN\n          Hope so.\n\nLATER\n\nPost meal.  Several empty wine bottle decorate the table.\n\n                     ELENA\n          We had this Finnish conductor, Aki, Laki,\n          something.  He had these ridiculous bangs.\n          And he'd sweep them off with his baton\n          every minute or so, and it drove us\n          insane, remember?\n\nClaire nods.\n\n                     CLAIRE\n          He looked like one of the Monkees.\n\n                     ELENA\n          Anyway, Claire slept with him...\n\n                     CLAIRE\n          I didn't sleep with him.\n\n                     ELENA\n          ...just so she could cut them off.\n\n                     CLAIRE\n          He was so pissed.\n\n                     ELENA\n          I came in from my room...\n\n                     CLAIRE\n               (interjecting)\n          We were suite mates.\n\n                     ELENA\n          And there's this brilliant conductor in\n          purple briefs with no bangs cursing his\n          ass off in Finnish.\n\n                     CLAIRE\n          Oh God...\n\nThey dissolve into giggles.  Norman and Stan smile.\n\n                     STAN\n          Well...\n\n                     NORMAN\n               (to Stan)\n          I made an honest woman out of her.\n\nElena puts her hand on Claire's.\n\n                     ELENA\n               (to Stan)\n          You should have heard her play.\n\n                     CLAIRE\n          Stop.\n\n                     ELENA\n          We both auditioned for the Philharmonic.\n          One cello position open.\n\n                     CLAIRE\n          Do we have to?\n\n                     ELENA\n          And I kicked ass.  My best stuff.  Then I\n          stood in the hallway and listened to her\n          audition...and I cried.\n\n                     CLAIRE\n          She's making this up.\n\n                     ELENA\n          I'm not.  Couldn't pick up my cello for\n          weeks.\n\n                     STAN\n          What happened?\n\nElena looks at Claire, then smiles.\n\n                     ELENA\n          She got it.\n               (beat)\n          Turned it down.\n\n                     CLAIRE\n          I met a dashing young grad student after a\n          recital one night...\n\nClaire puts her arm around Norman.\n\n                     CLAIRE\n          ...and three months later I was married.\n\nHe squeezes her hand.\n\nINT.  WORK ROOM - DAY\n\nClaire walks into the work room with the portable phone to\nher ear and a cup of Jody's special tea.  She sniffs it and\nmakes a face as she turns on the computer.  After several\nrings a GIRL picks up on the other end.\n\n                     CLAIRE\n               (on phone)\n          Caitlin?\n\n                     GIRL'S VOICE\n               (overlapping)\n          Can you hang up?  I'm trying to make a\n          call.\n\nThe line goes dead.  Claire hits redial and gets...a BUSY\nSIGNAL.  She clicks the phone off as the computer boots up.\nClaire puts the phone down and starts a game of Alice's\nSolitaire.  She turns a card and waits.\n\n                     CLAIRE\n          Gee, that's tricky.  Sure could use some\n          help.\n\nShe waits, the cursor blinks benignly.\n\n                     CLAIRE\n          Come on...\n\nNothing happens.\n\nINT.  NORMAN AND CLAIRE'S ROOM - DAY\n\nShe walks into the room and notices STEAM wafting from the\ncracked bathroom door.\n\nINT.  BATHROOM - DAY\n\nClaire enters the steamy bathroom.  The tub is nearly\noverflowing with water.  She squats down to drain the tub.\n\nShe stops, feeling watched, then slowly peers behind her...no\none's there.  Claire reaches toward the water to yank the\nplug's chain, then freezes.  In the bathwater's still\nreflection she see:\n\nA PRETTY YOUNG BLOND standing beside her.  Startled, she pops\nup and slams into the SHOWER HEAD.\n\nClaire collapses over the side of the tub, her head dipping\nunderwater.  A small cloud of red surrounds her.  Moments\nlater, an arm wraps around her.\n\n                                                      CUT TO:\n\nBlurry shapes.\n\n                     VOICE (O.S.)\n          Claire...\n\nINT.  BATHROOM - DAY\n\nCLAIRE'S POV - A FACE sharpens into focus hovering above\nher...Norman.\n\nINT.  BEDROOM - DAY\n\nClaire sits on the bed.  Norman dabs the blood from a tiny\ncut on the back of her head.\n\n                     CLAIRE\n          I don't need a shrink.\n\n                     NORMAN\n               (gently)\n          Harvey says he's amazing.\n\n                     CLAIRE\n          Norman...\n\n                     NORMAN\n          What can it hurt to talk to someone?\n\nShe goes to her dresser and gets a PRESCRIPTION BOTTLE and\nstarts to open it.  Norman gently places a hand on her arm.\n\n                     NORMAN\n          Please.\n\nShe shoots him a look...\n\n                     NORMAN\n          You promised.\n\n...and puts the pills down.\n\n                     NORMAN\n               (gently)\n          Claire, she's been a huge part of your\n          life for seventeen years.  If you weren't\n          thrown off balance by this, then\n          something would be wrong.\n\n                     CLAIRE\n          I never said I wasn't upset.  Of course\n          I'm upset.  I miss her terribly.  But I\n          know what I saw and what I heard...and it\n          wasn't some \"symptom\" of something...\n\n                     NORMAN\n          I never said...\n\n                     CLAIRE\n          ...and I don't think I'm some lonely,\n          middle-aged woman cracking up.\n\nBeat.\n\n                     NORMAN\n          Are you lonely?\n\n                     CLAIRE\n          No!  And I don't need a psychiatrist!\n\nINT.  DR. DRAYTON'S OFFICE - DAY\n\nClaire sits in a comfortable looking chair with her purse in\nher lap, arms crossed.\n\n                     DR. DRAYTON (O.S.)\n               (a smooth, mellifluous\n                baritone)\n          Who's idea was it?\n\n                     CLAIRE\n          Mine.  His.  We both...thought...\n\nShe trails off.  Camera slowly pulls back to reveal, DR.\nTIMOTHY DRAYTON, a stocky, light skinned black man in his\nlate forties with a kind face and piercing brown eyes.\n\n                     CLAIRE\n          I didn't want to come.\n\n                     DR. DRAYTON\n          Then why did you?\n\n                     CLAIRE\n          Because he was worried about me.\n\n                     DR. DRAYTON\n          Your husband?\n\n                     CLAIRE\n          Yes.\n               (beat)\n          I'm sure he's hoping you'll pack me full\n          of prozac so he can live out his life in\n          peace.\n\n                     DR. DRAYTON\n          Do you really think so?\n\n                     CLAIRE\n          No.\n\nThere's a pause.\n\n                     DR. DRAYTON\n          Why is he worried?\n\n                     CLAIRE\n          Because, I don't know, because\n          sometimes...sometimes I forget\n          things...and ever since Caitlin left,\n          ever since my daughter left for school,\n          there've been...I fainted and...\n               (beat)\n          Why is this so hard?\n\nDr. Drayton takes a little silver bowl full of shiny, red\nFIREBALLS next to his chair.  He proffers it to Claire.\n\n                     DR. DRAYTON\n          Fireball?\n\n                     CLAIRE\n          You're joking.\n\nHe shakes his head.  She shrugs, then grabs one and pops it\ninto her mouth.\n\n                     DR. DRAYTON\n          It's hard because I'm a complete stranger\n          and what we're talking about is\n          incredibly personal.  Besides, the first\n          time most people come here, a part of\n          them is wondering if I'm gonna think\n          they're crazy.\n\nShe sucks on the fireball and slowly nods.\n\n                     DR. DRAYTON\n          Don't worry, I'm required to have at\n          least three sessions in order to commit.\n\nHer eyes get a little wider.\n\n                     DR. DRAYTON\n          Now that's a joke.\n\nShe manages an unsteady smile.\n\n                     DR. DRAYTON\n          I have some training at helping people\n          through the stressful moments in life,\n          one of which you may or may not be\n          experiencing.  If you want to get some\n          stuff off your chest, great.  If not...\n\nHe smiles and shrugs, \"no problem.\"  She stares at him for a\nmoment.\n\n                     CLAIRE\n               (re: fireball)\n          These are good.\n\n                     DR. DRAYTON\n          Mm-hmm.\n\nShe studies him for a moment.\n\n                     CLAIRE\n          There's a ghost in my house.\n\nHe nods slightly, as if she's told him, \"I have some\nanxiety.\"  Claire goes on.\n\n                     CLAIRE\n          She finished my solitaire game and turned\n          on the radio...she likes rock and roll.\n          Angry rock and roll.\n\n                     DR. DRAYTON\n          How do you know it's a she?\n\n                     CLAIRE\n          I saw her in the water.  Beside me.  She\n          was filling the bathtub.\n\n                     DR. DRAYTON\n          What does she look like?\n\n                     CLAIRE\n          Pretty.  She's a blond.\n\n                     DR. DRAYTON\n          Do you have any idea who she is?\n\n                     CLAIRE\n          Um...I'd rather not say...just yet.\n\n                     DR. DRAYTON\n          Fine.\n\n                     CLAIRE\n          What do you think I should do?\n\nHe thinks for a moment, then:\n\n                     DR. DRAYTON\n          Try to contact her.\n\nClaire nearly swallows her fireball.\n\n                     CLAIRE\n          What?\n\n                     DR. DRAYTON\n          Try to communicate with her somehow.\n\n                     CLAIRE\n          You think that'll help?\n\n                     DR. DRAYTON\n          Can't hurt.  And I think it's important\n          you find out what she wants.\n\nClaire ponders this for a moment, then looks back up at him.\n\n                     CLAIRE\n          Are you humoring me?\n\n                     DR. DRAYTON\n          Nope.\n\nShe seems satisfied by his sincerity.\n\n                     CLAIRE\n          How?\n\n                     DR. DRAYTON\n          I don't know.  My aunt used to use my\n          uncle's old pajamas and a candle.\n\nHe stands.  Claire nods, then stands.  She smiles too.\n\n                     CLAIRE\n          Is this time okay?\n\nHe nods.\n\nINT.  BATHROOM - NIGHT\n\nClaire walks in carrying a half-empty bottle of wine.  She\nlooks over at Jody, who turns off the lights.  Jody then\nstrikes a match and lights a LARGE CANDLE.  She unveils her\ncarved ANTIQUE OUIJA BOARD.\n\n                     JODY\n          Sit down here.\n\n                     CLAIRE\n               (nervous, jokey)\n          Are we hoping the ghost is going to\n          have to pee?\n\nJody turns to her, deadly serious.\n\n                     JODY\n          Isn't this where you saw her?\n\nClaire's smile fades.  She nods.\n\n                     JODY\n          Then this is where she'll be.\n\nThey sit cross legged, the board between them.\n\n                     JODY\n          Place your fingers on the planchette.\n\n                     CLAIRE\n          The planchette?\n\n                     JODY\n          This.\n\nJody indicates the wooden pointing device.  Each woman grasps\nan edge.\n\n                     JODY\n               (in a low voice)\n          We wish to commune with the spirit of\n          Mrs. Feur.\n               (to Claire)\n          What's her first name?\n\n                     CLAIRE\n          I don't know.\n\nJody closes her eyes.  Claire follows suit.\n\n                     JODY\n          I call forth the entity that is haunting\n          this house.\n\nThey look down at the planchette, which hasn't moved.\n\n                     JODY\n          Mrs. Feur?\n\nThere's still no movement.\n\n                     CLAIRE\n          Nothing's happening.\n\n                     JODY\n          Shhh.\n\nJody focuses intently.\n                     JODY\n          Reveal yourself to us.\n\nA long moment passes.  It's starting to seem like a bust.\nSuddenly, THE CANDLE FLARES.  Even Jody seems startled.\n\n                     JODY\n               (to the spirit)\n          Who...who are you?\n\nAt first, nothing happens.  Then, slowly, the planchette\nstarts to move across the board.\n\n                     CLAIRE\n          Are you doing that?\n\nJody shakes her head.\n\n                     CLAIRE\n          I'm not doing that.\n\nThe planchette comes to rest on the letter \"M.\"  Moments\nlater, it starts to move again drifting over and stopping on\n\"E.\"\n\n                     CLAIRE\n          Oh...\n\n                     JODY\n          M-E...\n\nIt starts to drift again, moving slowly toward the space\nbetween \"E\" and \"F.\"  The planchette stops on \"F.\"  Jody\nremoves her fingers from the device.\n\n                     JODY\n          Mef?  What's Mef?\n\n                     CLAIRE\n          It's initials.  F is Feur.  It's her.\n\nSuddenly, the CANDLE starts flickering strangely and THE\nPLANCHETTE SLIDES JERKILY ON ITS OWN...M-E-F, M-E-F...\n\n                     JODY\n          Shit...\n\nJody stumbles backwards, gasping.\n\n                     JODY\n          Did you see that?\n\nClaire leans in.\n\n                     CLAIRE\n               (to ghost)\n          What happened to you?\n\nThe CANDLE GOES OUT.\n\n                     JODY\n          Oh God...\n\nJody bolts.  Claire follows.\n\nEXT.  HALLWAY - NIGHT\n\nClaire catches up to the completely spooked Jody outside the\nwork room.  She holds onto her arm.\n\n                     JODY\n          I have to go.\n\n                     CLAIRE\n          Jody, wait.\n\nCooper's growling in the work room.  They look in.\n\n                     JODY\n          Claire, this is...this is...\n\nClaire, transfixed, walks in.\n\nINT.  WORK ROOM - NIGHT\n\nShe stares at the computer screen, which is being filled with\nletters at an amazing speed.\n\nMEFMEFMEFMEFMEFMEFMEF...\n\nShe hears the front door swing open.\n\n                     CLAIRE\n          Jody!\n\nINT.  FOYER - NIGHT\n\nClaire arrives at the open front door in time to see the\nKarman-Ghia tearing out of the driveway.  She turns and goes\nback into the house.\n\nCRASH!\n\nShe edges into...\n\nINT.  NORMAN'S STUDY - NIGHT\n\nThe picture has, once again, tumbled from its spot.  She\ndrops to her knees over the picture.  This time THE GLASS IS\nSHATTERED.  When she picks out the remaining shards, the\nnewspaper photo slides out.  Claire glances at the benign\nnews stories on the back.\n\nShe looks around and spots a piece of glass wedged in a crack\nin the floor boards by the knot.\n\nCLAIRE'S POV\n\nThe piece of glass, wedged next to what looks like A COPPER\nCOIN in the crack.  It's too big to be a penny.\n\nShe tries to use the piece of glass to pry it free, but\nrecoils.  A tiny drop of blood appears on her finger, which\nshe pops into her mouth.\n\nINT.  BATHROOM - NIGHT\n\nStill sucking on her finger, Claire walks in and begins to\nclean up the remains of the seance.  She bends down to pick\nup the Ouija board, then stops when she notices that the tub\nis again full to the brink of overflowing.\n\n                     CLAIRE\n          What do you want?!\n\nClaire peers around, frustrated, half waiting for a reply.\nThere is only silence.  She reaches in to pull the plug,\nnearly scalding her hand.  When she turns for a hand towel\nshe finds a message traced into the steamed-up mirror:\n\n                      \"YOU KNOW\"\n\nShe draws in a breath and darts out of the bathroom.\n\nEXT.  LAB BUILDING - NIGHT\n\nNorman nods to a SECURITY GUARD as he leaves a darkened\nuniversity building.  He sees Claire standing at the foot of\nthe steps.\n\n                     NORMAN\n          What are you doing out here?\n\n                     CLAIRE\n          He killed her.  I'm not crazy.  He killed\n          her and--\n\n                     NORMAN\n          This is the Feur thing?\n\n                     CLAIRE\n          Yes.  And he's going to get away with it.\n\nNorman's momentarily speechless.\n\n                     NORMAN\n          How do you know this?\n\n                     CLAIRE\n          We had a seance.\n\n                     NORMAN\n          Who did?\n\n                     CLAIRE\n          Jody and I.  And she was there, Norman,\n          she was.  It scared Jody so bad she had to\n          leave.\n\n                     NORMAN\n          How did you--\n\n                     CLAIRE\n          Jody brought a Ouija board and we\n          summoned her.\n\nHe regards her for a moment.\n\n                     NORMAN\n          Are you angry at me?\n\nThis stops Claire in her tracks.\n\n                     CLAIRE\n          What?\n\n                     NORMAN\n          Maybe you resent how busy I've been.\n\n                     CLAIRE\n          What are you...?  No.\n\n                     NORMAN\n          You know what I've got at stake with this\n          paper.  You know that.  I can't help but\n          think that you're doing this now to hurt\n          me, or to sabotage me somehow.\n\n                     CLAIRE\n          Sabotage?\n\n                     NORMAN\n          Ever since the accident I've been\n          worried that you'd been unhappy, or...\n\n                     CLAIRE\n          The accident...?\n\n                     NORMAN\n          But then you've been so much better...\n\n                     CLAIRE\n          Norman, this isn't about you.  This is\n          something that's happening to me.  It's\n          not to get even...and it's not some\n          warped bid for attention.  Some strange\n          things are happening in our house,\n          whether you believe in them or not...\n\n                     NORMAN\n          Sweetheart--\n\n                     CLAIRE\n          No!  Not sweetheart, no.  I believe in\n          what's happening.  I don't want to, but I\n          do.  I guess I was foolish enough to think\n          that would be enough for you.\n\nShe turns on a heel and walks toward her car.\n\nEXT.  CAMPUS - NIGHT\n\nNorman catches up to her as a LARGE CROWD is filing out of\nthe concert hall next door.\n\n                     NORMAN\n          You're overreacting.\n\nShe turns on him.\n\n                     CLAIRE\n          Don't tell me how to react!\n\nNorman glances around at the crowded sidewalk.\n\n                     NORMAN\n          Keep your voice down.\n\n                     CLAIRE\n          I will NOT.\n\nSome of the bystanders stop to watch.\n\n                     CLAIRE\n               (still loud)\n          Maybe you're right.  Maybe I'm losing my\n          mind...\n\n                     NORMAN\n               (looking around)\n          Claire, please...\n\nClaire leans in and lowers her voice without diminishing her\nintensity.\n\n                     CLAIRE\n          ...But what if I'm not?  What if she died\n          in terror and betrayal and some part of\n          her can't move on while that's\n          unresolved.  Can't you just...\n\nSomething behind him catches her eye.  She trails off.\n\n                     CLAIRE\n          Wow...\n\nClaire walks past him toward the parking lot.\n\n                     NORMAN\n          Claire, please...\n\nThere's a dangerous energy to her walk.  People step out of\nthe way.\n\nEXT.  PARKING LOT - NIGHT\n\nClaire walks past several cars until she sees the one she's\nafter.  MR. FEUR steps out from behind the open trunk of his\nold Buick.\n\n                     CLAIRE\n               (walking up)\n          You!\n\nHe looks up at her.\n\n                     CLAIRE\n          You think you're smart, don't you?  You\n          think you got away clean.  Well, I know\n          you killed her.  You drowned her in the\n          bathtub and got rid of her somewhere and\n          I'm gonna find her, you murdering\n          sonofabitch.\n\nMr. Feur stares, dazed, through the tirade.  Norman arrives\nat her side.\n\n                     MR. FEUR\n          Who?\n\n                     CLAIRE\n               (scoffing)\n          Give me that shit.  Your wife.\n\n                     MR. FEUR\n          I didn't kill my wife.\n\n                     NORMAN\n               (to Mr. Feur)\n          I'm sorry...\n\n                     CLAIRE\n               (over Norman)\n          Then where is she?\n\nHe stares at both Spencers for a moment.  Then calls past\nthem.\n\n                     MR. FEUR\n          Honey...\n\nClaire and Norman turn.  A BLOND WOMAN backs out of the\npassenger seat.  She turns.  IT'S NOT THE FACE CLAIRE HAS\nSEEN.  Claire looks sucker punched.\n\nINT.  DR. DRAYTON'S OFFICE - DAY\n\nClaire sits back in the chair.  She looks drained.  A soft\nrain taps against the windows.\n\n                     CLAIRE\n          And his face...it seemed so gentle, and I\n          knew...in that second I knew that I'd\n          imagined the whole thing.\n\nDr. Drayton takes this in.  She seems genuinely frightened.\n\n                     CLAIRE\n          What's happening to me?\n\n                     DR. DRAYTON\n          Well, that's what we're here for.\n\nHe watches her calmly, some empathy on his face.\n\n                     DR. DRAYTON\n          Whether you imagined it or not, you\n          actually saw and heard things that\n          frightened you...that gave you reason for\n          concern.\n\n                     CLAIRE\n          Yes, but...\n\n                     DR. DRAYTON\n          Your friend saw them.\n\n                     CLAIRE\n          Isn't there something called group\n          hysteria?\n\n                     DR. DRAYTON\n          You think you influenced her?\n\n                     CLAIRE\n          Maybe.  I don't know.  I just know that\n          when all this was happening, I felt, some\n          part of me felt...alive.  Like somebody\n          needed me.  And the more I reached out to,\n          it, the fuller it became.\n\n                     DR. DRAYTON\n          You're saying you willed these events to\n          happen?\n\n                     CLAIRE\n          I don't know, I'm very confused right\n          now.\n\nBeat.\n\n                     DR. DRAYTON\n          Did you ever find out what it wanted?\n\nClaire remembers.\n\n                     CLAIRE\n          She said, \"You know.\"  That I know.\n\n                     DR. DRAYTON\n          Do you?\n\n                     CLAIRE\n          No.\n\n                     DR. DRAYTON\n          What do you think?\n               (beat)\n          Guess.\n\nClaire ponders this.\n\n                     CLAIRE\n          I felt...pain.  That she'd been hurt by\n          someone.\n               (beat)\n          This is great.  I'm trying to intuit the\n          emotions of a figment of my--\n\n                     DR. DRAYTON\n          Have you been hurt?\n\n                     CLAIRE\n          Me?  No.  Well, in the accident I was\n          injured, but...\n\n                     DR. DRAYTON\n          You were in an accident?\n\n                     CLAIRE\n          Last year.  I drove my car up a tree.\n          Nothing serious, this...\n               (she indicates her scar)\n          ...a minor concussion.  But the car looked\n          bad.  It could have been bad.  I think it\n          scared the hell out of Norman.\n\nBeat.\n\n                     DR. DRAYTON\n          How's your marriage?\n\nClaire's eyes widen.\n\n                     CLAIRE\n          Listen, don't hold back.\n\nDr. Drayton smiles kindly.\n\n                     CLAIRE\n          Well, he's been amazing throughout this\n          whole thing.  Patient and caring...\n               (beat)\n          I mean, sure, he can be obsessed with his\n          work, and...it's a very important time\n          right now with all that.  But,\n          sometimes...I mean with everybody, right?\n          Sometimes it's like...\n\nShe trails off.\n\n                     DR. DRAYTON\n          What?\n\n                     CLAIRE\n          That he doesn't...see me, or, you know,\n          that I'm...that's something's wrong...with\n          me.\n\n                     DR. DRAYTON\n          That can't feel good.\n\n                     CLAIRE\n          No, it doesn't...Okay, look, I see what\n          you're doing here, and that's, I'm sorry,\n          but that's not it.  My marriage is fine.\n          I've had some kind of \"empty-nest\"\n          episode where I saw some things that\n          weren't there.  Let's deal with that.  I'm\n          willing to deal with that.\n               (beat)\n          I just don't want to go conjuring\n          problems where none exist.\n\nClaire finishes her tirade.  Dr. Drayton lets her settle for\na moment.\n\n                     DR. DRAYTON\n          Fair enough.  But you should know that I'm\n          far less concerned with whether things\n          you saw \"existed,\" than I am with why you\n          saw them.\n\nShe takes in the ramifications of that.\n\nEXT.  PORCH - DAY\n\nClaire's carrying some cuttings into the house.  She hears a\nknock at the gate, walks over and opens it to discover...Mrs.\nFeur.  The real one.\n\n                     MRS. FEUR\n          I wanted to apologize.\n\n                     CLAIRE\n          You do?\n\n                     MRS. FEUR\n          For scaring you like I did.  When I\n          thought about what that must have seemed\n          like that day...\n\n                     CLAIRE\n          And then you weren't there.\n\n                     MRS. FEUR\n          Right.  I'm sorry.\n\nThere's an awkward pause.\n\n                     CLAIRE\n          Would you like some iced tea?\n\n                     MRS. FEUR\n          Very much.\n\nClaire leads her toward the house.\n\nEXT.  PORCH - DAY\n\nClaire pours Mrs. Feur a glass of iced tea from a pitcher.\nShe's small and delicate looking with big, watery eyes.\n\n                     MRS. FEUR\n          Your house is so beautiful.\n\n                     CLAIRE\n          Thank you.\n\n                     MRS. FEUR\n          And these roses.  They're much prettier\n          up close.\n\nShe regards Mrs. Feur for a moment.  She seems skittish and\nshy.\n\n                     CLAIRE\n          I...there's something I have to ask\n          you.\n\nMrs. Feur waits.\n\n                     CLAIRE\n          That day...at the fence.  You seemed\n          terrified.  I don't think I was imagining\n          that.\n\nThere's a pause.  Mrs. Feur looks down into her lap.\n\n                     MRS. FEUR\n          No.\n\n                     CLAIRE\n          Of what?  What were you so afraid of?\n\n                     MRS. FEUR\n          You're going to think I'm crazy or\n          something.\n\nA tiny smile.\n\n                     CLAIRE\n          Not this week.\n\nShe looks away for a moment, then looks back at Claire.\n\n                     MRS. FEUR\n          Love.\n\n                     CLAIRE\n          What?\n\n                     MRS. FEUR\n          Have you ever felt so completely consumed\n          by a feeling for someone that you\n          couldn't breathe?  That the time together\n          is so passionate and consuming that you\n          felt physical pain when they would leave?\n\n                     CLAIRE\n          Um...sure.\n\n                     MRS. FEUR\n          I couldn't catch my breath.  That's not a\n          metaphor, that's...And I panicked.  I\n          never dreamed anyone would hear me back\n          there...\n               (beat)\n          I tried to leave him.  Went to my mother's\n          in Boston.  He brought my things up and\n          pleaded with me to come home.\n\nClaire is mesmerized.\n\n                     MRS. FEUR\n          You must think I'm pathetic.\n\n                     CLAIRE\n          No.  No, I don't.\n\n                     MRS. FEUR\n          I'm sorry that I frightened you like\n          that.  But I was so touched by your\n          concern.  I've been lonely here.\n               (beat)\n          Perhaps we could be friends.\n\nClaire stares at this strange, passionate woman.\n\n                     CLAIRE\n          I would like that.\n\nMrs. Feur smiles at her.\n\nINT.  VOLVO - NIGHT\n\nClaire pulls up in front of a large NEW YORK HOTEL.\n\n                     NORMAN\n               (on a cell phone)\n          ...I'm pulling up, Yuri.  I'll see you for\n          dinner.\n               (to Claire)\n          Sure you won't stay?\n\n                     CLAIRE\n          No, it's fine.  I'm fine.\n\n                     NORMAN\n               (tempting her)\n          Really big bed.\n\nShe smiles and shakes her head.  Norman kisses her goodbye,\nthen grabs his bag from the backseat.\n\n                     NORMAN\n          Do I have everything?\n\n                     CLAIRE\n          Yep.\n\n                     NORMAN\n          Call ya later.\n\nHe starts to walk into the hotel.\n\n                     CLAIRE (O.S.)\n          And you glad you married me?\n\nHe turns.  She's standing next to the car.\n\n                     NORMAN\n          What?\n\n                     CLAIRE\n          Are you glad?  I'm glad.\n\nNorman walks over to her and cradles her chin with his hand.\n\n                     NORMAN\n               (softly)\n          You know I am.\n\n                     CLAIRE\n          Good.\n               (She gazes at him, then\n                softly)\n          You sat in front...I saw you there...\n\nNorman takes his cue.\n\n                     NORMAN\n          You were lost in the music...eyes\n          closed...your chest heaving...\n\n                     CLAIRE\n          I felt you...looking through me...\n\n                     NORMAN\n          We walked all night...\n\n                     CLAIRE\n          You told me that I was...\n\nHe gently cups her chin in his hand.\n\n                     NORMAN\n               (overlapping)\n          ...that you were everything I'd ever\n          dreamed of.\n\nShe smiles, kisses him warmly, then gets in the car.\n\nEXT.  COLUMBIA UNIVERSITY - NIGHT\n\nClaire stands outside Caitlin's Columbia dorm, watching young\nlives in motion.\n\nINT.  DORM HALLWAY - NIGHT\n\nClaire walks past a number of doors.  Music booms out of one,\nshards of a conversation out of another.  Finally, she\narrives at a door that says \"Fur is murder.\"  She smiles to\nherself and knocks.  There's no answer.\n\n                     DIFFERENT VOICE (O.S.)\n          She's out.\n\nClaire turns to find an attractive YOUNG MAN standing at her\nelbow.\n\n                     YOUNG MAN\n          They're playing at CBGB's down on Bowery.\n          Probably won't be back for awhile.  You\n          her mom?\n\n                     CLAIRE\n          Yes.  Who was playing?\n\n                     YOUNG MAN\n          Bitch.  Caitlin's band.\n\n                     CLAIRE\n               (stunned)\n          Caitlin's band?\n\n                     YOUNG MAN\n          Yeah.  They're really good.  I would have\n          gone, but I have a paper.\n               (beat)\n          And I'm not just saying that because\n          you're a mother.\n\nClaire nods slightly.\n\n                     CLAIRE\n          Thank you.\n\nShe walks down the hall.\n\nINT.  CBGB'S - NIGHT\n\nClaire moves past a huge, BLACK SKINHEAD DOORMAN into an\nentrance area in the dark throbbing punk club.  She looks out\nover the MOB OF SEETHING YOUNG PEOPLE, swaying to a pulsing\npower-pop band.  PUNKS and CLUB KIDS push past her as they\nmove into the throng.  She looks up and her face changes.\n\nCLAIRE'S POV\n\nA shaggy trio of musicians on the stage, pumping through a\njangly, but surprisingly melodic song.  Her eyes race across\nthe faces of a BUTCH FEMALE DRUMMER, an emaciated\nGUITARIST/SINGER and stop on the BASS PLAYER...Caitlin.  She\nrocks back and forth to her own hypnotic bass line, EYES\nCLOSED, SWAYING TO THE MUSIC.\n\nClaire is transfixed, her face a mix of pride and sadness.\nThe song ends and Caitlin's eyes open.  She smiles for a\nmoment, then the smile fades as she spots Claire.  Panicked,\nClaire ducks behind a pillar.\n\nEXT.  CBGB'S - NIGHT\n\nThe last groups of YOUNG PEOPLE file out of the club.  A\ncouple of them glance at Claire, who seems very out of place\nstanding on the Bowery late at night.\n\n                     VOICE (O.S.)\n          Mom?\n\nShe turns to see Caitlin standing before her, a bass guitar\ncase on a strap over her shoulder.  There's an awkward pause.\n\n                     CLAIRE\n          That was very good.\n\n                     CAITLIN\n          Mom, I'm sorry.  I wanted to tell you.\n          But it never felt right.\n\n                     CLAIRE\n          Why?\n\nCaitlin stares at the ground.\n\n                     CAITLIN\n          I didn't want to bring up memories.  I\n          didn't want to do anything that might\n          make you regret your choices.\n\nClaire winces silently.\n\n                     CAITLIN\n          Besides, Dad would have freaked.\n\n                     CLAIRE\n          No, he wouldn't.\n\n                     CAITLIN\n          I think playing in a band called \"Bitch\"\n          might put a dent in the whole \"perfect\n          family\" thing.\n\n                     CLAIRE\n          That's not true.\n\n                     CAITLIN\n          Yes it is.  Can we please not do that?\n          Please?  Cause it is.\n\nClaire doesn't disagree.\n\n                     CLAIRE\n          He loves you very much.  He just--\n\n                     CAITLIN\n          I know he does.\n\nBeat.  Claire studies her surprisingly strong daughter.\n\n                     CAITLIN\n          Are you mad at me?\n\n                     CLAIRE\n          Listen to me.  The one thing in life that\n          I definitely don't regret...is the choice.\n          I made to be your mother.\n\nThey hug.  For a moment, Claire's got her little girl back.\nHer eyes well up.\n\n                     CLAIRE\n          I miss you.\n\n                     CAITLIN\n          So much.\n\n                     CLAIRE\n               (laughing)\n          It got so bad your father almost had to\n          put me away.\n\n                     CAITLIN\n          What do you mean?\n\n                     CLAIRE\n          I started seeing things.\n\n                     CAITLIN\n          A ghost?\n\nBeat.  Claire stares at her daughter.\n\n                     CLAIRE\n          Did you?\n\n                     CAITLIN\n          No.  But once I heard...\n\n                     CLAIRE\n          What?\n\n                     CAITLIN\n          Someone crying.  A girl.\n               (beat)\n          I thought I was crazy.\n\n                     CLAIRE\n               (quietly)\n          Then we both are.\n\nCaitlin nods.\n\nINT.  PRESIDENT'S HOUSE - NIGHT\n\n...a large cocktail party.  The house is crowded with\nPROFESSORS, ADMINISTRATORS, and their SPOUSES.  PRESIDENT\nTEMPLETON, a frosty-haired, avuncular chap, greets them with\nhis WIFE, a sharp looking woman in her late fifties.\n\n                     TEMPLETON\n          There they are.\n\n                     NORMAN\n          You remember my wife, Claire.\n\n                     MRS. TEMPLETON\n               (shaking hands)\n          Of course.  You must be so proud.\n\n                     CLAIRE\n          I am.\n\n                     MRS. TEMPLETON\n               (to Norman)\n          Everyone's very anxious to shake hands\n          with our newest academic celebrity.\n\nShe takes their coats.  Dean Templeton leads them in.\n\n                     TEMPLETON\n          Must've been some paper.  Your father\n          would be very proud.\n\nThis seems to strike a nerve.\n\n                     NORMAN\n          Uh-huh.\n\nClaire notices this and squeezes his hand.  Templeton leads\nNorman into a large living room which is filled with\ncolleagues.  Several of them turn and begin clapping.  Others\nfollow suit.\n\nEXT.  PATIO - NIGHT\n\nClaire stands at a small bar.\n\n                     CLAIRE\n               (to bartender)\n          White wine please.\n\nShe scans the party and spots the Feurs deep in some intimate\nconversation with each other.  She's speaking about something\nastonishing.  He's rapt.\n\nClaire locates Norman in a corner listening as some AGED\nALUMNUS holds forth.  He sees her and mouths, \"I'm sorry.\"\nHe points to his watch and flashes five fingers.  She smiles\nand nods.\n\n                     VOICE (O.S.)\n          Guess I'm not much of a medium.\n\nShe turns to see Jody.\n\n                     CLAIRE\n          Jody...\n\nThey hug.\n\n                     JODY\n          Are you okay?\n\n                     CLAIRE\n          I think so\n\n                     JODY\n          I'm sorry for leaving, but I mean, Jesus,\n          Claire...\n\n                     CLAIRE\n          It's alright.\n\n                     JODY\n          I mess around with this stuff, but I\n          never thought anything would happen.\n\nClaire looks uncomfortable.\n\n                     JODY\n          Does Norman know?\n\n                     CLAIRE\n          Jody, she's alive.\n\n                     JODY\n          What?\n\n                     CLAIRE\n          Mrs. Feur.  She's alive.  I met her.\n          She's really sweet.\n\n                     JODY\n          Then what was it?\n\n                     CLAIRE\n          Nothing.  It wasn't anything.  I've been\n          on edge lately.  Maybe since the accident.\n          And I'd prefer, I really would, to just--\n\n                     JODY\n          Something was there.  You saw it.\n\n                     CLAIRE\n          Did I?\n\n                     JODY\n          Yes.  Now I talked to Sela and there's a\n          guy, this Pakistani guy down in\n          Hartford...\n\n                     CLAIRE\n          Hartford?\n\n                     JODY\n          And he's the real thing.  Specializes in\n          cases like this, like yours.\n\n                     CLAIRE\n          No.  Jody, listen to me.  You have to\n          listen to me.  This is not something that\n          I can do right now.  Whatever it was,\n          it's gone.  I need it to be gone now.\n\n                     JODY\n          But Claire--\n\n                     CLAIRE\n          Please.\n\nJody recognizes her fragility.\n\n                     JODY\n          Okay.  Okay.\n\n                     CLAIRE\n          I've got to find a bathroom.  I'll call\n          you.\n\nJody nods as Claire walks off.\n\nINT.  POWDER ROOM - NIGHT\n\nClaire stands in the spacious powder room, checking her\nmakeup in the mirror.  Mrs. Templeton enters from the\nbathroom.\n\n                     MRS. TEMPLETON\n          How're you holding up?\n\n                     CLAIRE\n          Just fine.  It's a lovely party.\n\nThe two women fix their makeup side-by-side in the mirror.\n\n                     MRS. TEMPLETON\n          Norman was telling me the dream house is\n          finally finished.\n\n                     CLAIRE\n               (nodding)\n          Almost.\n\n                     MRS. TEMPLETON\n          Wonderful.  It's good to see you two doing\n          so well.\n\nClaire looks confused.\n\n                     CLAIRE\n          I'm sorry?\n\n                     MRS. TEMPLETON\n          I know how hard it can be sometimes.\n\nClaire turns to her.\n\n                     CLAIRE\n          Uh-huh.  What can be?\n\n                     MRS. TEMPLETON\n          Well, I don't think I've seen you since\n          the reception at Dean Ackerman's last\n          year.\n\nClaire's still in the dark.\n\n                     MRS. TEMPLETON\n          For the Dupont Chair.\n               (off Claire's look)\n          I swear.  I'm becoming the nosy old lady I\n          used to run from at Amherst.\n\n                     CLAIRE\n          No.  I'm just not sure what you mean.\n\n                     MRS. TEMPLETON\n          There was just...some tension.  You were\n          upset.  I remember being concerned.\n\n                     CLAIRE\n          At the party.\n\n                     MRS. TEMPLETON\n          Toward the end.  You remember?\n\n                     CLAIRE\n               (recovering)\n          Ohhh yes.  No, no.  Just a little, you\n          know...We're fine.\n\n                     MRS. TEMPLETON\n          Well, I'm glad.  Pardon my intrusiveness,\n          but we do have to stick together you\n          know.\n\n                     CLAIRE\n          Who's that?\n\n                     MRS. TEMPLETON\n          The wives.\n\nBeat.\n\n                     CLAIRE\n          Right.\n\nMrs. Templeton leaves.  Claire looks into the mirror.\n\n                     CLAIRE (V.O.)\n          What was it about?\n\nEXT.  TEMPLETON'S HOUSE - NIGHT\n\nClaire and Norman walk toward the car.\n\n                     NORMAN\n          You don't remember?\n\n                     CLAIRE\n          When she said it, there was something\n          familiar...but no.\n\nHe looks at her for a moment.\n\n                     NORMAN\n          You dropped a glass.\n\n                     CLAIRE\n          I...\n\n                     NORMAN\n          A cheap wine glass from the caterers.  You\n          started crying.  I tried to comfort you...\n\n                     CLAIRE\n               (something's triggered)\n          In the living room...\n\n                     NORMAN\n          You shoved me away and ran out to the\n          patio.  I took you home.\n\n                     CLAIRE\n          But why?  I can't understand how I could\n          just completely--\n\n                     NORMAN\n          It was maybe a week after the accident.\n          We were moving.  It was a hard time.\n\n                     CLAIRE\n          But I don't remember.\n\n                     NORMAN\n          Sweetheart, it was over a year ago.\n\n                     CLAIRE\n          What's wrong with me?\n\nHe stops, takes her shoulders gently.\n\n                     NORMAN\n               (reassuring)\n          Nothing.  Nothing at all.  It's been a\n          hard year.  But you're better now.  And\n          things are really looking up for us.  So\n          let's try to enjoy that.\n               (gently)\n          Please?\n\nShe thinks for a beat.\n\n                     CLAIRE\n          Yes.  Yes.  That's what I want.\n\nShe takes his hand and kisses it.\n\nEXT.  CLAIRE'S HOUSE - DAY\n\nClaire walks up to the door.  When she touches the knob she\nhears...the WHISPERING.  She opens the door and moves into:\n\nINT.  FOYER - DAY\n\nThe same intense whispered exchange.  She glances into the\nmirror and sees...SHAPES MOVING, BODIES, A FLASH OF SILVER.\nShe turns the corner and again...NO ONE'S THERE.\n\nINT.  NORMAN'S STUDY - DAY\n\nShe walks in and stands before:\n\nThe repaired photograph of herself and Norman...at the party\nfor the DUPONT CHAIR.\n\nShe takes it from the wall, stares at it for a moment, then\nSMASHES IT ON THE EDGE OF THE DESK.  She extricates the\npicture from the broken glass.  The caption reads:\n\n\"Dr. Norman Spencer being awarded the distinguished Dupont\nChair in Genetics by Dean of Sciences Torvald Ackerman.\"\n\nShe stares at the picture for a moment, then flips it over\nand scans the stories on the back.  One tells of a hotly\ncontested city council race, another contains details of a\nlarge alumni donation to the university.\n\nShe notices the bottom corner of another story she hadn't\nnoticed before.  It's only a small portion of one column, but\nit seems to detail the search for A MISSING GIRL.\n\nINT.  WORK ROOM - DAY\n\nClaire, online, logs onto a missing persons website.  She\nnarrows her search to NEW ENGLAND.  A screen pops up with a\nlist of names.  She scrolls down the list until she\nfinds...FRANK, MADISON ELIZABETH.\n\n                     CLAIRE\n          M-E-F...\n\nClaire double clicks on it, then waits breathlessly as a\nblurry cyber photo fills the screen.  Slowly, higher\nresolution moves down the image.\n\nIT'S THE GHOST.\n\nUnder the photo is the legend:\n\n             \"DISAPPEARED - OCTOBER 22, 1998\"\n\nClaire stares at the familiar face, then shakily hits PRINT.\n\nLATER\n\nClaire is staring down at the girl's face on the print out.\n\n                     VOICE\n               (on phone)\n          ...she was practically a townie.  Grew up\n          in Bradford.\n\n                     CLAIRE\n          And she was never found?\n\n                     VOICE\n               (on phone)\n          Nah.  She was a live wire.  Had this old\n          Mustang Fastback.  It's gone too.  Most of\n          her friends think she's tooling around\n          Mexico somewhere.  Police downgraded her\n          to a runaway.\n\n                     CLAIRE\n          Thank you, Mr...\n\nShe glances at the byline on the back of the newspaper photo.\n\nINSERT\n\n\"by Neil McCann\"\n\n                     CLAIRE\n          ...McCann.\n\nShe hangs up.\n\nINT.  NORMAN'S STUDY - NIGHT\n\nNorman is unpacking NOTES and CHEMICALS from his LEATHER BAG.\nClaire walks in.\n\n                     CLAIRE\n          Remember this?\n\nShe places the printout on his desk.  He takes a long look at\nit.\n\n                     NORMAN\n          Is this that girl from last year?\n\nClaire nods.\n\n                     CLAIRE\n          Did you know her?\n\nNorman looks again.\n\n                     NORMAN\n          I may have seen her on campus.\n\n                     CLAIRE\n          Not personally.\n\n                     NORMAN\n          No.\n               (beat)\n          I'm afraid to ask what this is about.\n\n                     CLAIRE\n               (solemnly)\n          It's her.  This is the woman who I've\n          seen.\n\n                     NORMAN\n          The...\n\n                     CLAIRE\n          Yes.  The ghost.\n\nNorman leaves the hung frame and walks over to a window.\n\n                     CLAIRE\n          I thought it was Mrs. Feur, but it's\n          not...\n\n                     NORMAN\n               (quietly overlapping)\n          Stop...\n\n                     CLAIRE\n          ...I'm positive this time...\n\n                     NORMAN\n               (overlapping)\n          ...Please stop...\n\n                     CLAIRE\n          It's Madison Fra--\n\n                     NORMAN\n          STOP IT!\n\nClaire falls silent, Norman turns from the window.\n\n                     NORMAN\n               (calmly)\n          Claire, I've tried to be there.  I know\n          you're going through something that I\n          can't understand...but it's enough.\n\nClaire looks down.\n\n                     NORMAN\n          Do you want to go see someone?  Together?\n          Should we call Dr. Drayton?\n\nShe shakes her head.\n\n                     NORMAN\n          Well then what?  Claire, what?  Tell me\n          what I can do.\n\nLong pause.  Claire looks up, then timidly holds out the\nprintout.\n\n                     CLAIRE\n          It's her.\n\nNorman's jaw tightens.\n\n                     CLAIRE\n          I don't want to make you angry.  But she's\n          here.  And I don't know why...\n\nHe silently walks out of the room.  Claire stares down at the\nface in the photo.\n\nEXT.  MADISON FRANK'S HOUSE - DAY\n\nClaire parks in front of a small, clapboard house in a\nneighborhood that is decidedly less upscale than her own.\nShe gets out and tentatively walks up to the tiny porch.\n\nEXT.  PORCH - DAY\n\nClaire rings the bell.  A DRAWN LOOKING WOMAN in her early\nfifties answers the door.\n\n                     CLAIRE\n          Mrs. Frank?\n\n                     MRS. FRANK\n          Yeah.\n\n                     CLAIRE\n          I'd like to talk to you about Madison.\n\n                     MRS. FRANK\n          You know where she is?\n\n                     CLAIRE\n          No, I don't.\n\n                     MRS. FRANK\n          Please leave me alone.\n\nShe starts to close the door.  Claire leans forward.\n\n                     CLAIRE\n          She's my friend.\n\nThe woman stops.\n\n                     CLAIRE\n          Was.  We were...acquainted.  I've been\n          away for awhile.  When I came back...\n\nShe studies Claire.\n\n                     MRS. FRANK\n          What's your name?\n\n                     CLAIRE\n          Claire.\n\n                     MRS. FRANK\n          She never mentioned you.\n\nClaire doesn't know what to say to this.\n\n                     MRS. FRANK\n          Then again, she didn't say much about her\n          college friends.\n\nShe gives Claire the once over.\n\n                     MRS. FRANK\n          I'm watchin' my shows.\n\nShe motions Claire in.\n\nINT.  LIVING ROOM - DAY\n\nClaire sits on a couch in the cramped living room.  Mrs.\nFrank serves up a mug of coffee.  A soap plays silently on an\nold 19\" RCA.\n\n                     MRS. FRANK\n          Just plain old coffee.  None of that mocha\n          nonsense.\n\n                     CLAIRE\n          It's fine.\n\nShe sizes Claire up.\n\n                     MRS. FRANK\n          You look a little old for a student.\n\n                     CLAIRE\n          I'm not.  We...we met at a party.\n\n                     MRS. FRANK\n          Sounds about right.  Never understood how\n          a girl that wild got all A's.  Sure didn't\n          get it from me.  They wanted to put her in\n          a special school for the gifted when she\n          was young.  Maddie wouldn't hear about it.\n\n                     CLAIRE\n          She never mentioned her father.\n\n                     MRS. FRANK\n          Well she wouldn't.  He left when she was\n          twelve.  Never spoke about him after that.\n\nThere's a silence.  Mrs. Frank stares at the TV.\n\n                     MRS. FRANK\n          Don't need the sound.  You can pretty much\n          tell what's happening by the faces.  Turn\n          it up sometimes, though.  Feels like\n          someone's here.\n\nClaire doesn't know what to say.  Mrs. Frank turns to her.\n\n                     MRS. FRANK\n          Why are you here?\n\n                     CLAIRE\n          I don't know.\n\n                     MRS. FRANK\n          It's like that.  Doesn't seem real.  No\n          note.  Nothing.\n               (beat)\n          Cops say she'll be back.  I just wanna\n          know what happened.\n\nClaire stares at this tough, tragic woman.\n\n                     MRS. FRANK\n          Wanna see her room?\n\nClaire nods.\n\nINT.  MADISON'S ROOM - DAY\n\nClaire enters the room.  Her face freezes.\n\nANGLE\n\nSEVERAL POSTERS FOR ALTERNATIVE AND METAL BANDS, side by side\nwith ACADEMIC PLAQUES AND AWARDS.\n\n                     MRS. FRANK\n          Full scholarships.  Princeton too.  She\n          wanted to stay close.\n\n                     CLAIRE\n          You must have been very proud.\n\nShe nods.  Claire moves along looking at pictures.  Some with\ndifferent men, others with rough looking friends.  Claire\nstops at a picture tucked into a mirror.\n\nINSERT\n\nMadison singing at a recital of some kind.  She's lovely,\nwith striking GREEN EYES.  Around her neck is a distinctive\nSILVER NECKLACE, with a perfectly wrought, SILVER ROSEBUD.\n\n                     MRS. FRANK\n          Such a pretty voice.  Surprised she didn't\n          major in music.\n               (beat)\n          That's the last picture.\n\nA phone rings in the hallway.\n\n                     MRS. FRANK\n          S'cuse me.\n\nClaire's eye is pulled past the picture into the mirror, the\nreflection of something pinned to the edge of a bulletin\nboard.  She turns and moves over to:\n\nA SHORT BLOND BRAID.  She reaches out to touch it.  Claire\nhears footsteps.  Mrs. Frank leans back into the room.\n\n                     MRS. FRANK\n          They're calling me in to work.\n\n                     CLAIRE\n          I should be going anyway.\n\nEXT.  PORCH - DAY\n\nMrs. Frank walks Claire out.\n\n                     MRS. FRANK\n          Y'hear anything you'll let me know?\n\n                     CLAIRE\n          Of course.\n\nClaire walks to her car.  She turns and calls out:\n\n                     CLAIRE\n          What was her major?\n\n                     MRS. FRANK\n          Biology.  She wanted to be a doctor.\n\nClaire stands, frozen, as Mrs. Frank disappears into the\nlittle house.\n\nINT.  BATHROOM - NIGHT\n\nClaire shuts the blinds, then places the large candle on the\nfloor, then places the MISSING GIRL PRINTOUT at the base of\nthe candle.  On top if it, she places THE BRAID.\n\nThen Claire lights the candle, puts the braid on the picture,\nand hunches over it, whispering intensely:\n\n                     CLAIRE\n          I need to know the truth.\n\nShe waits a beat.  Nothing.\n\n                     CLAIRE\n          Madison, please...help me.\n\nNothing happens.  She looks around at the seance props.\n\nShe stands and places her hands on the sink.  She glances at\nherself in the mirror.\n\n                     CLAIRE\n          What am I doing?\n\nSuddenly, her head droops over, she shudders softly.  When\nshe looks back into the mirror, her eyes are a DEEP GREEN.\nShe hears the front door open downstairs.\n\n                     NORMAN (O.S.)\n          Hello...Anybody home?!\n\nA strange smile creeps across her face.\n\nINT.  CLAIRE'S HOUSE - NIGHT\n\nPOV - Gliding down the stairs and into...\n\nINT.  KITCHEN - NIGHT\n\nThe refrigerator door is open.  Norman is leaning over.  Only\nhis ass protrudes.\n\nREVERSE\n\nNorman closes the refrigerator door and sees Claire standing\nbefore him, stripped down to a skirt and slip top.  There's a\ndifferent physicality to her movements...a different rhythm\nto her speech.\n\n                     CLAIRE\n          Hello, Dr. Spencer.\n\nNorman smiles.\n\n                     NORMAN\n          Mrs. Spencer.\n\nShe shakes her head.\n\n                     CLAIRE\n          Forbidden fruit...\n\nShe takes the apple...\n\n                     CLAIRE\n          Got a problem with that...\n\n...then takes a ravenous bite and walks out of the room.\n\nINT.  NORMAN'S STUDY - DAY\n\nNorman finds Claire seated on his desk, her legs spread.\n\n                     NORMAN\n          I take it your not mad at me.\n\n                     CLAIRE\n          Wouldn't go that far.\n\nShe grabs his belt and pulls him into her, then holds the\napple to his mouth.  Norman tentatively takes a bite.  She\nmashes it slowly into his mouth until he recoils slightly.\n\n                     NORMAN\n               (mouth full)\n          Okay...\n\nWhen he chews the huge bite, a glistening drop of juice runs\ndown his chin.  Claire leans forward and licks it off.\n\n                     NORMAN\n          What's gotten into you?\n\nShe just smiles mischievously, then starts kissing him.  It\nlooks like she's eating his lips.  Norman's getting hot.  She\nbites down on a lip.\n\n                     NORMAN\n          Ow!\n\n                     CLAIRE\n          What's the matter?\n\n                     NORMAN\n          It's too rough.\n\n                     CLAIRE\n          Since when?\n\nSomething about this response frightens him.  Claire yanks\nNorman's belt open.  He steps back, tripping over his\ncastered desk chair.  She's on top of him in a flash, sitting\nastride him.  She speaks in a forceful, sexy whisper.\n\n                     NORMAN\n          I don't like this, this...\n\n                     CLAIRE\n               (pinning his hands above his\n                head)\n          Why don't you shut up and fuck me,\n          Professor.\n\nShe grinds up against him.  Suddenly, something pulls her eye\nto the hallway.\n\nPOV - The COAT RACK MIRROR, now from inside the study.  In\nit's reflection:  ANOTHER CLAIRE, shorter hair, stunned\nexpression.  Where she's standing...it's DAYTIME.\n\nClaire leans over him until they're nose-to-nose.\n\n                     CLAIRE\n               (tense whisper)\n          I think she's starting to suspect\n          something.\n\n                     NORMAN\n               (through clenched teeth)\n          Who?\n\n                     CLAIRE\n               (leaning down)\n          Your wife...\n\n                     NORMAN\n          STOP IT!\n\nNorman shoves her off of him onto the floor.  He stands,\nbreathless.\n\n                     NORMAN\n          What the hell are you doing?!\n\nIn a moment, it's Claire again, stunned and trembling against\nthe wall.\n\n                     CLAIRE\n               (to herself, remembering)\n          \"You know...\"\n\n                     NORMAN\n               (rattled)\n          What?\n\nShe looks up.\n\n                     CLAIRE\n          I was there.\n\n                     NORMAN\n          Claire--\n\n                     CLAIRE\n               (flooding back to her)\n          I came to work in the garden and I saw\n          you with her...in my house.\n\n                     NORMAN\n          Oh God...\n\n                     CLAIRE\n          I snuck back to my car, trying to\n          convince myself it never happened.  And\n          when I woke up in the hospital...somehow\n          it hadn't.  Until now.\n\nHe just stares at her, his face anguished.\n\n                     NORMAN\n          It was last year.  We were having\n          troubles.\n\n                     CLAIRE\n          So you fucked a student?!\n\n                     NORMAN\n               (reaching for her)\n          That's not what I'm sayi--\n\n                     CLAIRE\n               (pulling back)\n          DON'T touch me.  Just get away from me.\n          Go!\n\nHe's frozen.\n\n                     CLAIRE\n          I SAID GET OUT!\n\nNorman doesn't move.  He's never seen her like this.\n\n                     CLAIRE\n          Fine...\n\nShe bolts toward the living room.  He follows her.\n\nINT.  LIVING ROOM - NIGHT\n\nShe grabs her coat.\n\n                     NORMAN\n               (welling up)\n          Claire, please don't...\n\n                     CLAIRE\n          What did you think I would do?  Jesus\n          Christ!  I gave up my life and my music...\n\n                     NORMAN\n          I never asked you to quit!\n\n                     CLAIRE\n          ...Oh BULLSHIT.  You had to topple perfect\n          Daddy and that meant perfect wife,\n          perfect family...\n\nHe follows her as she searches for her purse and keys.\n\n                     NORMAN\n          THAT'S NOT TRUE!  You wanted to quit!  And\n          then when you did, you hated me for it...\n          so you gave it all to her.\n\n                     CLAIRE\n          Who?\n\n                     NORMAN\n          To Caitlin!!\n\nShe wheels on him with fury.\n\n                     CLAIRE\n          Leave her out of this!\n\n                     NORMAN\n          And then out of nowhere, some bright\n          young woman found me attractive...\n\n                     CLAIRE\n          Stop...\n\n                     NORMAN\n          ...would do anything just to be around\n          me.  And I slipped.  God help me, I\n          slipped.\n\n                     CLAIRE\n          I'm not going to listen to this.\n\nClaire goes to leave, Norman blocks her path.\n\n                     NORMAN\n          I tried to break it off!\n\n                     CLAIRE\n          You should have tried harder.\n\n                     NORMAN\n          Claire...\n\n                     CLAIRE\n               (seething)\n          Get out of my way.\n\nShe brushes past him.\n\nINT.  FOYER - NIGHT\n\nHe catches up, beside himself.\n\n                     NORMAN\n          PLEASE DON'T GO!\n\nClaire's nearly disarmed by this rare emotional outburst.\nShe turns at the door and looks back.\n\n                     CLAIRE\n          You made it impossible for me to be\n          someone you could be in love with.\n\nShe leaves.\n\nINT.  LIVING ROOM - MORNING\n\nNorman, rumpled and unshaven, is passed out on the couch, a\nhalf empty whiskey bottle beside him on the coffee table.  He\nawakens to find Claire sitting across from him.\n\n                     CLAIRE\n          I want you to answer one question.\n\nHe waits.\n\n                     CLAIRE\n          Did you have anything to do with her\n          disappearance?\n\nBeat.\n\n                     NORMAN\n          Yes.\n\nClaire goes pale.\n\n                     NORMAN\n          She was damaged and unstable.  The more I\n          tried to distance myself, the more\n          desperate she became.  Finally, she showed\n          up at the new house...\n\n                     CLAIRE\n          How did she know where it was?\n\nHe stares off.  The reality sinks in for Claire.\n\n                     CLAIRE\n               (softly)\n          Our dream house.\n\nNorman can hardly look at her.\n\n                     NORMAN\n          She was out of control.  She said she was\n          going to kill herself...or you.  I never\n          thought she'd go through with any of it,\n          but then she was gone...\n\nHe trails off.\n\n                     CLAIRE\n          She did it.\n\n                     NORMAN\n          We don't know that for sure.\n\n                     CLAIRE\n          Of course she did, Norman.  What else\n          could it be?\n\nThe enormity of this hits Norman.  His head drops into his\nhands.\n\n                     NORMAN\n          Oh God, what have I done?  How could I\n          have let this into our lives?\n\nHe looks up at her, teary.\n\n                     CLAIRE\n          I don't know.\n\nShe gets up and walks out of the room.\n\nEXT.  JODY'S STUDIO - DAY\n\nAn old industrial loft filled with finished and half-finished\noil paintings.  Jody brings Claire some tea.\n\n                     CLAIRE\n          ...and everything I have, everything I\n          thought my life was...Christ when I think\n          of all the lies...\n\nJody looks down.\n\n                     CLAIRE\n          What?\n               (beat)\n          Jody what?\n\nJody looks up, tears in her eyes.\n\n                     CLAIRE\n          Oh God...you knew.\n\n                     JODY\n          I was down in Adamant...\n\n                     CLAIRE\n          Adamant?\n\n                     JODY\n          Artsy little village down seven.  There's\n          a guy there who sells my work.  I had just\n          dropped off some paintings and as I got\n          in my car...I saw Norman sitting at this\n          little cafe.\n\nClaire waits for her to continue.\n\n                     JODY\n          I started to walk over...but he wasn't\n          alone.  A blond.  I only caught a glimpse.\n          She was young.\n               (beat)\n          I should have said something right away.\n          But I didn't.\n\n                     CLAIRE\n          Why?\n\n                     JODY\n          Partly because I didn't want to hurt\n          you...but partly...partly because I was\n          relieved.\n\n                     CLAIRE\n          Relieved?\n\n                     JODY\n          I had just been left by Richard.  I was\n          bitter and miserable and for some fucked\n          up reason, it made me feel better that\n          your life wasn't as perfect as it seemed.\n\nClaire nods.\n\n                     JODY\n          By the time I finally got up the nerve to\n          tell you, Stan called from the hospital\n          and it was too late.\n\n                     CLAIRE\n          Too late?  Jody, it was an accident.\n\n                     JODY\n          Alone?  On a two lane road?  With a ton of\n          Valium in your system?\n\nClaire walks over to a window.\n\n                     JODY\n          I got there first.  Stan covered up the\n          pills and I had it out with Norman.  He\n          seemed desperate not to lose you.  He\n          promised to handle it.  And we all let it\n          drop away.\n\n                     CLAIRE\n          All of us.\n\nBeat.\n\n                     JODY\n          I'm a terrible friend.\n\n                     CLAIRE\n          No.\n\nClaire turns.\n\n                     CLAIRE\n          How could I expect you to tell me\n          something that I wouldn't even tell\n          myself?\n\n                     JODY\n          What are you going to do?\n\n                     CLAIRE\n          I don't know.\n\n                     JODY\n          If she was dangerous before--\n\n                     CLAIRE\n          She could have hurt me if she wanted to.\n\n                     JODY\n          You don't know that.\n               (beat)\n          If it's your belief that gives her form,\n          then you've got to shut her out.  Somehow\n          you have to break the connection.\n\n                     CLAIRE\n          No.  She wanted me to know the truth.  Now\n          that I do...I think she's at peace.\n\nJody isn't as sure.\n\nINT.  KITCHEN - DAY\n\nClaire walks in.  She notices the clock on the range is dark.\nShe flips on a light.  Nothing happens.  Worried, she heads\nupstairs.\n\nINT.  NORMAN AND CLAIRE'S ROOM - MORNING\n\nClaire enters.  The bed is empty.  The shower is running in\nthe bathroom.\n\n                     CLAIRE\n          Norman?\n\nINT.  BATHROOM - MORNING\n\nANGLE - CLAIRE...her face a mask of terror.\n\n                     CLAIRE\n          Oh God...\n\nCLAIRE'S POV\n\nThe BATHTUB, with the shower curtain drawn around it, the\nwater blasting.  Norman's limp hand pokes through the\ncurtain.  AN ELECTRIC CORD leads from the mirror socket into\nthe tub.\n\nClaire races over and rips the plug from the wall.  She tears\nthe SHOWER CURTAIN AWAY to find A BLUISH NORMAN lying,\nunconscious in the tub.\n\n                     CLAIRE\n          No, no.  Please no...\n\nShe hugs her face to his chest until she picks up a\nheartbeat.\n\n                     CLAIRE\n          Norman!!  Wake up!  Please!\n\nClaire shakes him to no effect.\n\n                     CLAIRE\n          Oh God...NORMAN!\n\nShe slaps him on the face...once, then twice.  He suddenly\nsucks in a gulp of air, begins struggling and dazedly returns\nto life.\n\n                     CLAIRE\n          It's me...it's me...\n\nSobbing, she shuts off the squeaky faucets and struggles to\npull him upright.  She discovered HER BLOWDRYER in the tub\nand hurls it across the room.\n\nINT.  BEDROOM - DAY\n\nClaire sits beside Norman on the bed as two E.M.T.'s, an OLD\nGUY and a HEAVY WOMAN pack up.  Stan's on the phone, Jody off\nto one side.\n\n                     HEAVY WOMAN\n          Vitals are good.  I'd take it easy for a\n          couple of days.\n\n                     NORMAN\n          Thanks.\n\nThe E.M.T.'s leave as Stan hangs up.\n\n                     STAN\n          They'll take you for a CAT scan tomorrow\n          if you're feeling dizzy at all.\n\n                     NORMAN\n          That won't be necessary.   \n\nHe glances at Claire as he walks Stan out.\n\n                     NORMAN\n          Not unless there's a miracle drug for\n          clumsiness.\n\nThey leave.\n\n                     CLAIRE\n          Jody, she tried to kill him.\n\n                     JODY\n          I know.\n\n                     CLAIRE\n          I can't believe this is happening.\n\n                     JODY\n          We need help.  Please let me call the\n          medium.\n\n                     CLAIRE\n          That could take days.  I need to do\n          something now.  Don't you see?  She wants\n          us dead.\n\nJody thinks for a moment.\n\n                     JODY\n          Alight, alright.  Stay calm.  You opened\n          this door.  There's got to be a way that\n          you can close it.\n\n                     CLAIRE\n          Like what?\n\n                     JODY\n          I have an idea.  But, I mean, I'm just\n          making this up...\n\n                     CLAIRE\n          What is it?\n\n                                                      CUT TO:\n\nMADISON'S SMILING FACE\n\nEXT.  DOCK - DAY\n\nClaire's staring down at the PRINTOUT.  She's kneeling at the\nedge of the dock.  From her pocket she produces THE BLOND\nBRAID and a piece of TWINE.  She wraps the braid up in the\nprintout with a rock and secures it with the twine.\n\n                     CLAIRE\n          Sorry.  Better or worse, he's mine.\n\nShe tosses the little parcel into the dark water.  Bubbles\nstream up.  In the bubbles, Claire sees...THE PALE SHAPE,\nwhich slowly becomes THE DROWNED GIRL, staring up from\nbeneath the dark water.\n\nClaire wants to pull away, but she's transfixed.  Madison\nreaches up toward the surface.  As the bubble diminish, she\nseems to be FADING AWAY.  When she's gone, Claire reaches out\ntoward the water.  When her finger touches the surface...\n\nWHOOSH!  She's sucked down into the water.\n\nINT.  UPSTAIRS SITTING ROOM - DAY\n\nNorman glances out of the window in time to see a splash off\nthe dock.  He races out of the room.\n\nEXT.  UNDERWATER - DAY\n\nClaire struggles furiously as the unseen attacker drags her\ndeeper into the murky depths.\n\nEXT.  DOCK - DAY\n\nNorman sprints toward the dock.\n\nEXT.  UNDERWATER - DAY\n\nAs he oxygen begins to run out, Claire screams desperately as\nher hand plunges into the muddy bottom.\n\nSuddenly, she's released.  She yanks her hand free, the silt\nswirls revealing...a COPPER COLORED GLINT in the mud.\n\nNORMAN'S HAND grasps Claire's ankle and pulls her upwards.\n\nEXT.  DOCK - DAY\n\nNorman helps Claire, coughing, onto the dock.  They hold each\nother.\n\n                     NORMAN\n          Are you okay?\n\nShe nods, catching her breath.\n\n                     NORMAN\n          We have to get out of here.\n\n                     CLAIRE\n          It's alright.\n\n                     NORMAN\n          Can't you see, she's trying to kill us.\n\n                     CLAIRE\n          She's gone.\n\n                     NORMAN\n          What?\n\n                     CLAIRE\n          She can't be here without me.\n\n                     NORMAN\n          How can you be sure?\n\n                     CLAIRE\n          I don't know, but I am.  She was there and\n          then she was gone.  I felt it.\n\n                     NORMAN\n          Claire...\n\nShe stares into the still water.\n\n                     CLAIRE\n          It's over.\n\nINT.  BEDROOM - NIGHT\n\nClaire in bed with a blanket wrapped around her.  Norman\nwalks in with some steaming mulled cider.  He stokes the\nblazing fire.  He sits on the edge of the bed.\n\n                     NORMAN\n          I know it's going to take awhile before\n          things are back...until they're better\n          than before.  But you've given us a chance\n          to make a fresh start.  And I'm going to\n          spend the rest of my life making you glad\n          that you did.\n\nThe gaze at each other.  Tentatively, she places a hand on\nhis.\n\nEXT.  GARDEN - DAY\n\nClaire, dressed in a warm sweater, finishes wrapping her\nrosebushes for the winter.  She picks up a basket of clipped\nflowers and heads inside.\n\nEXT.  PORCH - DAY\n\nShe turns the doorknob and listens for the whispering.  All\nis quiet.\n\nINT.  FOYER - DAY\n\nShe looks into the mirror and sees only the study and the\nlake behind it.\n\nINT.  NORMAN'S STUDY - DAY\n\nClaire places the roses in a vase on Norman's desk, and in\ndoing so, accidentally knocks it over.\n\nWith a towel she mops up the water which has dripped onto the\nwooden floor.  The stream has flowed over to the knot and\ndripped into the crack.  Claire stares down at THE STRANGE\nCOPPER COIN.\n\nShe grabs a letter opener from Norman's desk and pries the\ncoin out.  It's actually a SMALL BRASS KEY, the head of which\nis THREE INTERLOCKING CIRCLES.  She stares at it for a\nmoment, then places it in her pocket.\n\nEXT.  SAILBOAT - DUSK\n\nClaire stands toward the bow watching the sunset.  The leaves\non the surrounding hills are stunning.  Norman appears beside\nher.\n\n                     NORMAN\n          Last sail of the year.\n\nShe gazes out.\n\n                     CLAIRE\n          The leaves...\n\n                     NORMAN\n          Incredible.  We should take a drive before\n          they're gone.  Spend the night at some\n          cozy little bed and breakfast.\n\n                     CLAIRE\n          Look for antiques...\n\n                     NORMAN\n          Yep.  There's some great places nearby.\n\n                     CLAIRE\n               (a reflex)\n          Adamant.\n\n                     NORMAN\n          What?\n\n                     CLAIRE\n          Little village down seven.  Supposed to be\n          charming.\n\n                     NORMAN\n          Huh.\n\n                     CLAIRE\n          Do you know it?\n\n                     NORMAN\n          Don't think so.\n\n                     CLAIRE\n          Maybe we can stop there for lunch.\n\nHe wraps an arm around her.\n\n                     NORMAN\n          Whatever you'd like.\n\nShe leans against him, staring out.\n\nEXT.  DRIVEWAY - DAY\n\nJody and Claire return from a walk.  Norman has the boat on\nthe trailer and is securing a tarp over it.  They stop under\na tree.\n\n                     CLAIRE\n          But he acted like he'd never heard of it.\n\n                     JODY\n          Did he say that?\n\n                     CLAIRE\n          Jody he was lying.\n\n                     JODY\n          What if he was?  Do you think he wanted to\n          bring that up again just when you're\n          trying to make a new start?\n\n                     CLAIRE\n          I guess not.\n\n                     JODY\n          He's trying to put it behind him, Claire.\n          You should too.\n\nNorman smiles and waves.  They wave back as they arrive at\nthe Karman-Ghia.\n\n                     JODY\n          You've got a beautiful life.  And even\n          with this, it's always been clear that he\n          loves you.\n               (beat)\n          I've come to think that's all that really\n          matters.\n\n                     CLAIRE\n          I don't know...\n\n                     JODY\n          Trust me, Claire.  You hear something...\n          change the subject.  You find something...\n          get rid of it, throw it in the lake.\n               (beat)\n          You know what happened.  The rest is only\n          details.  And no one's ever glad they got\n          a hold of those.  If you want to put this\n          back together...just let it go.\n\nJody drives off.  Claire walks over to Norman.  She hugs him\ntightly.\n\n                     NORMAN\n          What's that for?\n\n                     CLAIRE\n          Nothing.\n\n                     NORMAN\n          I'm cooking you dinner.\n\n                     CLAIRE\n          You don't have to do that.\n\n                     NORMAN\n          I know.\n\n                     CLAIRE\n          Fine.  I'll do the shopping.\n\nThey kiss.  She heads to the Volvo.\n\nINT.  VOLVO - DAY\n\nClaire is approaching a country market.  She spots a little\nsign with an arrow:\n\n                     ADAMANT - 11 mi.\n\nShe hesitates for a moment, then take the turn.\n\nEXT.  ADAMANT - DAY\n\nClaire stands on a street in the quaint little village.  She\nlooks around, spots a little cafe with outdoor tables.  A\nfriendly old HIPPIE WOMAN walks out of a store.  She watches\nClaire gazing around.\n\n                     HIPPIE WOMAN\n          What are you looking for?\n\n                     CLAIRE\n          I don't really know.\n\n                     HIPPIE WOMAN\n          Know what you mean.\n\nShe ambles off across the street.  Claire watches her go.\nThen notices a sign hung out above a little shop.  THREE\nINTERLOCKED CIRCLES.  She walks toward it.\n\nEXT.  SHOP - DAY\n\nClaire stands in front of the store window.  A sign in the\nwindow identifies it as \"The Sleeping Dog - Hand wrought\njewelry and gifts.\"  Claire tries to open the door, but sees\na closed sign.\n\nShe steps back out to the window and looks in.  On display\nare a selection of handcrafted jewelry and curios.\n\nSuddenly her eye stops on a small silver bracelet with an\nintricate ROSEBUD.\n\nHer eye travels up and behind it to the back of the display\nwhere she spots, a small ORNATE COPPER CHEST.  Protruding\nfrom its lock...THE INTERLOCKED CIRCLES.  Claire looks like\nshe's been punched.\n\nINT.  NORMAN AND CLAIRE'S ROOM - NIGHT\n\nClaire glances over at the soundly sleeping Norman.  She\ngingerly slides out of bed.\n\nINT.  BASEMENT - NIGHT\n\nClaire sits among the boxes, leafing through the photo album,\ntracking the years of their life.  Her hands tremble.\nFinally she reaches the picture of their wedding, reaches\nbehind the photo and produces...THE KEY.\n\nEXT.  DOCK - NIGHT\n\nClaire in her nightgown and a jacket, walks slowly down the\ndock.  An expensive looking flashlight illuminates her path.\nShe stops and stares out at the moonlit lake.\n\nShe holds out a fist.  Her fingers unfold and in her palm\nlies THE KEY.  She holds the key out over the water and\nstands there, frozen.  The lighthouse beam sweeps past her\nonce...then again.\n\nClaire pulls her hand back and holds the key to her chest,\nthen carefully places it on the dock.  She very deliberately\ntakes off her jacket and slippers, steps to the edge of the\ndock, shines the flashlight on the dark water...then steps\noff the dock.\n\n                                                      CUT TO:\n\nINT.  BEDROOM - NIGHT\n\nAN ANGUISHED CRY from downstairs.  Norman bolts upright in\nbed.\n\nINT.  NORMAN'S STUDY - NIGHT\n\nNorman walks through the darkened house into the moonlit\nroom.  He pulls up short when he sees the strongbox sitting\nclosed on his desk.  He looks around, sees the room is empty\nand walks over to it.\n\nThe mud and silt has been wiped from the top, on which is\nengraved:  To N.C.S. with love always, M.E.F.\n\nHe pulls open the lid and tentatively peers inside.\n\nTHE LIGHTS SWITCH ON.\n\nClaire stands in the doorway, holding out the SILVER ROSEBUD\nNECKLACE.\n\n                     CLAIRE\n          Looking for this?\n\nNorman stares at her dumbly.\n\n                     CLAIRE\n          She's out there isn't she?  She's in the\n          lake.\n\n                     NORMAN\n          Okay.  Don't...you don't understand what\n          this is.\n\n                     CLAIRE\n          Don't I, Norman?  YOU KEPT THE FUCKING\n          NECKLACE.  Of a woman you killed!\n\n                     NORMAN\n               (nearly hysterical)\n          I did NOT!  I did not kill anyone.  Jesus.\n          Claire, listen to me.  I walked in and she\n          was lying there dead.  I swear to you.  On\n          my life!  She took pills and she killed\n          herself in our house to destroy me!  To\n          destroy us!  If I hadn't stopped by here\n          before school, the painters would have--\n\n                     CLAIRE\n          I don't believe you.\n\n                     NORMAN\n          IT'S TRUE.  That's...you have to believe\n          me!  Oh God, I'm telling you the truth!\n               (beat, fighting tears)\n          I did what I had to, Claire.  She was\n          gone.  There was nothing I could do for\n          her.  I did...I put her in the lake.  I\n          rolled the car in...and I watched it sink.\n               (beat)\n          And I've lived with that image ever since.\n               (beat)\n          I couldn't just stand there while\n          everything-- my career, us,\n          everything, just washed away.  Don't you\n          see, Claire?  She's doing this!  This is\n          exactly what she wants you to think!\n\nClaire's lip is quivering with confusion.\n\n                     CLAIRE\n          I don't know what's true anymore.\n               (beat)\n          But that girl must be brought up.  Now do\n          you want to call the police?  Or should I?\n\nNorman stares at the phone.  He's a wreck.\n\n                     NORMAN\n          Fine.  I can't live with it anymore.\n\nHe takes the phone, punches in three numbers, waits.\n\n                     NORMAN\n          This is Dr. Norman Spencer.  No, it's not\n          an emergency.\n\nHe looks at Claire.\n\n                     NORMAN\n          I have some information about a missing\n          girl, Madison Frank...Yes.  Could you send\n          an officer?  Fifteen Willoughby, about a\n          mile before the bridge...Thank you.\n\nHe hangs up.  Long silence.  They look at each other.\n\n                     NORMAN\n          You did the right thing.\n               (beat)\n          I'm going to get cleaned up.\n\nHe walks out.  Claire walks over and stands before the box.\n\nINT.  BEDROOM - NIGHT\n\nClaire walks into the bedroom.  The shower can be heard\nthrough the bathroom door, which is partially ajar.  Steam\ndrifts out through the crack.\n\nShe stands in her dressing room and catches sight of her\nweary, distraught countenance in the mirror.  She glances\ndown.\n\nCLAIRE'S POV\n\nThe necklace still in her hand.\n\nShe looks up again into the mirror.  Her face goes strangely\nblank and, almost mechanically, she clasps the necklace onto\nher neck.\n\nSuddenly, she stares over at the CORDLESS PHONE lying on the\nbed for a long moment.  She walks over, picks up the phone\nand looks at it.\n\nCLAIRE'S POV\n\nThe redial button.\n\nShe stares at the bathroom door, then hits the button.  Two\nrings, then:\n\n                     VOICE\n               (on phone)\n          Directory assistance...\n\nClaire's eyes widen in terror.  She clicks off the phone,\nand, taking it with her, starts moving toward the door to the\nhall.  She keeps a steady eye trained on the bathroom.  She\nquietly pulls open the hallway door.\n\nSuddenly, A HAND WITH A WASHCLOTH IS THRUST OVER HER FACE.\n\nClaire shoves Norman's hand away and runs past him down the\nhall.\n\nINT.  HALLWAY - NIGHT\n\nShe's nearly at the top of the stairs when her body starts to\nfalter.  She tumbles over, dropping the phone, which clatters\ndown the stairs before her.\n\nClaire is pulling herself down the stairs, moaning in terror.\nNorman can be seen calmly following her, waiting for the\nHalothane to take its full effect.  Finally, she freezes.\nNorman picks up the phone and stands over her.\n\n                     NORMAN\n          God, how did we come to this?\n\nHe picks her gently up in his arms and starts carrying her\nslowly up the stairs.\n\n                     NORMAN\n          The ghost stuff, that was impressive.\n\nCLAIRE'S POV\n\nCeiling, shapes...\n\n                     NORMAN\n          I figure you saw her that day in the\n          house and just gradually intuited the\n          whole damn thing.  That would be pretty\n          astonishing.  A passive-aggressive\n          masterpiece.\n\nINT.  BATHROOM - NIGHT\n\nAnd into the bathroom.\n\n                     NORMAN\n          Wasn't until the shower that I realized\n          you actually believed it.  Nearly froze to\n          death waiting for you.  Thought the\n          circuit breaker would kick back over and\n          I'd be toast.\n\n...then she's lowered into the tub.\n\n                     NORMAN\n          The crazy thing is...I have never for one\n          moment stopped loving you.\n\nHe actually wipes a tear from his eye.  He kisses her lips.\nWe can feel her revulsion.  His face over her.\n\n                     NORMAN\n          Don't worry about Caitlin.  I'm sure in\n          some tragic way this'll bring us closer\n          together.\n\nHe turns on the faucets, then moves out of her line of\nvision.  Sound of a number being dialed.\n\n                     NORMAN (O.S.)\n          Hey, it's Norman.  Listen, we had a huge\n          blowout, so I'm going down to sleep at\n          the lab.  I guess you're out, but...\n          maybe...if you wouldn't mind stopping by\n          to check on her in the morning?\n\nShe glances down and sees on the edge of the tub...a\nprescription bottle of VALIUM with her name on the label.\nHer eyes go wide.\n\n                     NORMAN (O.S.)\n          It's just...Jody, it's bad.  I've never\n          seen her like this...\n               (he trails off, choking up)\n          I don't really know what to do anymore.\n\nNorman, lit periodically by the sweep of the light house\nbeacon, squats with the phone and gazes down at her.\n\n                     NORMAN\n          If anything ever happened to her, I'd...\n               (beat)\n          Anyway, thanks.\n\nClaire, mute, glances frantically around.  One of her fingers\nbegins to flutter.\n\n                     NORMAN\n               (tearfully)\n          I'm so sorry.\n\nThe tub is rapidly filling.  He checks his watch, then\nreaches for the Valium.  As much from will as the drug\nbeginning to fade, Claire lets out a garbled cry.\n\n                     CLAIRE\n               (sloppy, guttural)\n          Mmmuh...\n\n                     NORMAN\n          Shhhh.\n\n                     CLAIRE\n               (slurry)\n          Mauduh...\n\nNorman stops.\n\n                     NORMAN\n          What?\n\n                     CLAIRE\n          MADISON!\n\nNorman seems unnerved that she's still clinging to her belief\nin the ghost.\n\n                     NORMAN\n          That's a little much, don't you think?\n\nHe sees the necklace on her neck.\n\n                     NORMAN\n          Oops.  Can't have that.\n\nHe puts down the bottle of Valium, then reaches around\nClaire's neck to remove the necklace.  When his hands close\non the clasp, his face suddenly goes slack.\n\nNORMAN'S POV\n\nHis arms around MADISON'S BEAUTIFUL CORPSE.\n\nNorman explodes backwards, slamming his head into the BRASS\nSHOWER NOZZLE.  He staggers out of the bathroom before\ncollapsing with a thud.  The water finally rises above\nClaire's nostrils.\n\nClaire somehow manages to work a toe into the plug chain and\nyank it free.  The water slowly descends.\n\nWhen it seems that her lungs must burst, her mouth finally\nclears the descending water.  She chokes in great gulps of\nair.\n\nThe drug is finally wearing off.  Claire sits up.  Norman's\nunconscious feet can be seen outside of the doorway.  She\nturns off the water and stands unsteadily.\n\nShe looks around for the phone and finally spots the little\nantenna protruding from under Norman.  She delicately pulls\nthe phone out of his back pocket, only to discover that it's\nbeen broken by his fall.  She drops it and walks quietly out\nof the room.\n\nINT.  STAIRWAY - NIGHT\n\nClaire stumbles as fast as she can down the stairs.\n\nINT.  FOYER - NIGHT\n\nShe fumbles for some KEYS in a basket by the door, then looks\nat the cell phone's recharging cradle.  It's empty.\n\nShe spots Norman's coat hanging on the coat rack and rifles\nthrough the pockets.  She finds the phone, and flips it open\nto see if it's working.  A drop of something splats on the\nphone.  Then another.  It's blood.\n\nShe looks up and sees Norman, his forehead gashed, glaring\ndown from the landing.\n\nShe reaches for the door knob, but the keys and cell phone in\nher hand make it difficult to open.  Norman hurls himself\nover the banister.  THUD!\n\nA BLOODY HAND yanks her backwards.  Claire slams into the\ncorner by the armoir.  Norman advances on her.  At the last\nmoment, she throws her shoulder into the armoir which tumbles\nover on Norman.\n\nEXT.  DRIVEWAY - NIGHT\n\nClaire races over to the Volvo, which is blocked by NORMAN'S\nPICKUP, the dark hulk of THE SAILBOAT on a trailer behind it.\n\nShe starts to get into the pickup, then remembers to look in\nthe bed...nobody there.\n\nINT.  PICKUP - NIGHT\n\nThe truck is cold and doesn't want to turn over.  She stares\nat the door for signs of Norman.\n\n                     CLAIRE\n          Come on...come on...\n\n...and VROOM, the truck roars to life.  Claire spews gravel\nas she barrels the cumbersome rig out of the driveway,\nconstantly watching the door.\n\nWhen she veers to the right out of the driveway, she looks\ninto the rear view mirror.  The boat momentarily blocks the\nopen door, then clears.  Still nothing.\n\nEXT.  DIRT ROAD - NIGHT\n\nClaire wheels the truck and trailer out onto a two-lane road.\n\nINT.  PICKUP - NIGHT\n\nShivering with cold and adrenalin, she tries to work the\nancient heater.  She turns onto THE BRIDGE.\n\nEXT.  BRIDGE - NIGHT\n\nThe PICKUP and BOAT race across the deserted bridge.\n\nINT.  PICKUP - NIGHT\n\nANGLE\n\nClaire through the windshield.  Her face striped by the\nreflection of the bridge lights which whip one-by-one across\nthe windshield.  She flips open the cell phone and punches in\n911.  It blinks:  \"NO SERVICE.\"\n\n                     CLAIRE\n          Shit.\n\nShe glances into the rear view mirror.\n\nCLAIRE'S POV\n\nA stern section of the boat's COVERING TARP untied, flapping\nin the breeze.\n\nClaire desperately punches the \"talk\" button again...\"NO\nSERVICE.\"  She's past the center of the bridge.  She looks\nagain:  \"ROAM.\"  Claire punches the talk button again.\n\nSMASH!\n\nA TRAILER CRANK punches through the window.  Norman's arm\nfollows, coiling like a python around Claire's neck, his grim\nvisage pressed against the glass.\n\nShe squashes down the accelerator.\n\nEXT.  BRIDGE - NIGHT\n\nThe trailer starts to weave from side to side, swerving the\npickup.  Claire chokes, then blacks out.\n\nEXT.  BRIDGE - NIGHT\n\nThe Pickup and trailer smash through the railing, barreling\nover bumpy terrain straight toward the BOAT RAMP.\n\nThe truck hits the water at fifty and Norman is hurtled\nthrough the rear window and into the passenger side\ndashboard.\n\nINT.  PICKUP - MOMENTS LATER\n\nClaire is unconscious in the driver's seat, a trickle of\nblood runs from her nose.  Norman stirs briefly as Claire\ngroggily comes to.  She hears the hissing of the smashed\nradiator, then sees Norman, a shattered bloody mess on the\nfloor of the cab.\n\nShe leans over to see if he's dead, hears a squeak and\nrealizes that the pickup, with the BATTERED SAILBOAT AND\nTRAILER miraculously still attached, is rolling deeper into\nthe water.\n\nBefore she can get the door open, the truck is half\nsubmerged.  She frantically manages to lower her window\nhalfway and starts to pull herself out.\n\nHer ribs have just cleared the glass when a bloody fist locks\nonto her ankle and yanks her inside.  Norman pulls her down\nuntil they're face to face.\n\n                     CLAIRE\n          Norman...NO...\n\nShe yanks the emergency brake, but it's too late...the\nsubmerged wheels lock and slide slowly down the mossy ramp.\nThe truck is nearly submerged.\n\n                     CLAIRE\n               (desperately)\n          Norman, please...\n\nThe water is up to the windows.  Norman shakes his head\nslowly as he blinks away blood from his eyes.\n\n                     CLAIRE\n          Think of Caitlin...\n\nWater sprays in through the hole in the rear window and\nmomentarily blinds Norman.  Claire jerks free and scrambles\nout of the driver's side window as the truck sinks.\n\nJust as she's free of the window, she jerks to a stop.  She\nlooks down and sees Norman, half out of the window, one hand\nclamped onto her ankle.\n\nThere is a wrenching metallic creak.  The truck lurches\ndownward...then silence.  IT DOESN'T SINK.  The boat buoys it\nlike a fishing cork as it drifts out into the lake.\n\nThe headlights pierce the darkness of the steep underwater\ndrop off.  Claire tries to swim free, but Norman's not\nletting go.\n\nSuddenly metal snaps and the truck pops free of the trailer.\nIt hurtles downwards and the still-glowing headlights\nreveal...\n\nMADISON'S SUBMERGED MUSTANG\n\nSMASH!\n\nWhen the front of the pickup lands on the hood of the car,\nthe Mustang's windshield shatters.  A PALE SHAPE FLOATS\nUPWARD.\n\nNorman is suddenly entangled by something.  He tries to brush\nit free but comes face-to-face with MADISON'S GHASTLY,\nDECOMPOSED FACE.  The last of his air bellows out of him in a\nscream as he releases Claire's ankle.\n\nHis dead staring face separates from Madison's as the truck\nslowly tilts back and sinks to the bottom.\n\nEXT.  LAKE - DAWN\n\nClaire breaks the surface with a huge intake of air.\n\n                                                      CUT TO:\n\nUNDERWATER - DAWN\n\nThe sound of a furious cello solo.\n\nCOLD STARING EYES\n\nNorman, half out of the truck, arms floating.\n\nFollow his eyes to THE PALE CORPSE, drifting above, tethered\nto the Mustang by an old seat belt around her ankle.\n\nMove through the murky water toward the corpse's clothed\nback.  As she twists into view...\n\nMORPHS INTO:  MADISON'S PALE BEAUTIFUL FACE...at peace.\n\nCamera drifts, moves upward and breaks the surface as the\ndistant lights of EMERGENCY VEHICLES approach.\n\n                                                      CUT TO:\n\nFINGERS\n\n...filled with moist earth.  A hand tosses the clump of dirt\nonto...\n\nEXT.  CEMETERY - DAY\n\nA CASKET\n\nWiden to reveal Claire, dressed in black, stepping away from\nthe grave.  A tiny arm snakes around her waist.  She glances\ndown to see Caitlin, her eyes shining, clasping her mother\ntightly.  Claire takes a last look into the grave.\n\n                     CLAIRE\n          Rest in peace.\n\nTHE GRAVESTONE - MADISON ELIZABETH FRANK\n\nMother and daughter turn and step back.  Next to them, also\nin black, is MRS. FRANK.\n\n                                                      CUT TO:\n\nFINGERS\n\nRacing across the neck of a cello.  The solo continues and\nnow reaches the difficult transition that had stumped Claire\nbefore.\n\nWIDEN TO REVEAL\n\nINT.  A LIVING ROOM - NIGHT\n\nClaire, her hair short and sexy, eyes tightly shut, brow\nbeaded with sweat.  The piece builds to a dark, passionate\ncrescendo.\n\nHer eyes remain shut for a moment, then flutter open.\n\nCLAIRE'S POV\n\nA New York apartment, the glimmering skyline visible through\na large window.  Cooper gazes up attentively.\n\nClaire sips a glass of wine, her face unsmiling, but serene.\n\n                                                    FADE OUT.\n\n                           THE END\n\n\n\n\n\n\nWhat Lies Beneath\nWriters :   Sarah Kernochan  Clark Gregg\nGenres :   Horror.Mystery  Thriller  Drama\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:17.245799"}