{"title": "While She Was Out", "film_link": "/Movie Scripts/While She Was Out Script.html", "script_link": "/scripts/While-She-Was-Out.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>While She Was Out Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/While-She-Was-Out.jpg\" title=\"While She Was Out Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Susan Montford\" title=\"Scripts by Susan Montford\">Susan Montford</a><br/>  <a href=\"/writer.php?w=Edward Bryant\" title=\"Scripts by Edward Bryant\">Edward Bryant</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/>\n<b>Script Date</b> : December 2006<br/>\n<b>Movie Release Date</b> : December 2008<br/>\n<br/>\n<a href=\"/scripts/While-She-Was-Out.html\">Read \"While She Was Out\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                         WHILE SHE WAS OUT\n</b>\n\n<b> \n</b>                            Written by\n\n                          Susan Montford\n\n\n                     Based on a short story by\n\n                          Edward Bryant\n\n\n                                                       5th draft\n                                               December 20, 2006\n\n\n\n<b>    MAP GRIDS\n</b>\n    From the pages of a Thomas guide converge, overlap and re-\n    configure across the screen. The endlessly ironic names of\n    American suburbs parade before us, their violet territories\n    marching forward like a bruise into dark green patches of\n    forest and wilderness.\n\n    Closer in on one last map grid which fades into a\n    transparency of itself overlaid across the actual location of\n    the suburb. The name of this housing development is \"Pleasant\n    Valley\". The transparency fades out to reveal:\n\n<b>1                                                                 1\n</b><b>    EXT.   PLEASANT VALLEY BOULEVARD - EVENING\n</b>\n    From a sign reading \"Pleasant Valley Dream Homes\", a picture\n    postcard boulevard of mini mansions curves into infinity.\n\n    Each home is brand new. Each has the same size lawn, the same\n    shrubs, the same satellite dish. Each has an\n    indistinguishable car parked in the driveway.\n\n    All the homes have Christmas decorations, Christmas trees\n    with baubles, lights and Christmas stars sitting proudly at\n    the top. The doors have Christmas wreaths.\n\n    The sheen of a recent rainfall makes all the surfaces glimmer\n    in the lights.\n\n    We halt outside one house.\n\n<b>2                                                                 2\n</b><b>    EXT.   DELLAS'S HOUSE - EVENING\n</b>\n    This home too seems perfect until we notice the Christmas\n    star has fallen from the top of the tree and lies reflecting\n    itself in a puddle on the wet lawn.\n\n    Suddenly we hear the sound of wings fluttering and see an owl\n    among the branches of the Christmas tree. It rises from the\n    tree then swoops down to the lawn where it sweeps a mouse\n    from the grass. The owl then soars off, casting a magnified\n    shadow of her wings across the house, and disappears with\n    it's prey into the woods behind.\n\n    Curtains part at a downstairs window. The silhouette of a man\n    appears bathed in the blue glow of a computer screen. He\n    draws the curtains once again and disappears.\n\n<b>3                                                                 3\n</b><b>    INT. DELLA'S HOUSE/ KENNETH'S MEDIA ROOM - EVENING\n</b>\n    We sneak between curtain and window ledge into a home office\n    fitted out with a flat screen TV and a computer.\n<b>\n</b>                                                Scene 3 Page 2\n<b>       \n</b>\n        KENNETH, a forty something ex-jock with a once handsome face,\n        pours a beer into a crystal brandy glass. Kenneth's eyes are\n        glued to the computer screen where stock numbers scroll\n        endlessly down. He highlights a set of numbers and stands up\n        abruptly from his chair elated.\n\n<b>                            KENNETH\n</b>                  Yes!\n\n        Steps back onto a A CHILD'S DOLL, crushing it underfoot. His\n        ebullient mood changes quickly.\n\n<b>                            KENNETH (CONT'D)\n</b>                  Damn! DELLA!\n\n        The sound of footsteps are followed by the door opening.\n        DELLA peers into the room. She's a diminutive blonde in her\n        thirties with fine features and a fading Southern accent.\n        She's pulling a coat on over a white shirt and jeans.\n\n        She sees the broken doll.\n\n<b>                            DELLA\n</b>                  SHOOT, KENNETH! That's Tammi's\n                  favorite doll.\n\n        She walks in, picks up the doll and tries to fix its squashed\n        face. He turns back to the computer guiltily, takes a sip of\n        beer.\n\n<b>                            KENNETH\n</b>                  You should just swear properly and\n                  get it over with. Do you think the\n                  kids don't know what you mean?\n\n        Close up, his face is ruddy - the face of someone who drinks\n        too much. He turns back towards her. She ignores him,\n        continues to try fix the doll. His eyes linger on her coat.\n\n<b>                            KENNETH (CONT'D)\n</b>                  Going out again? What is it\n                  tonight? Auto Mechanics for\n                  Dummies? The bored housewives'\n                  reading group?\n\n        He averts his eyes back to the screen then turns back to look\n        at her once more.\n\n<b>                            KENNETH (CONT'D)\n</b>                  I got a new one for you.\n\n        He smiles sardonically.\n<b>\n</b>                                                Scene 3 Page 3\n<b>       \n</b>\n\n<b>                            KENNETH (CONT'D)\n</b>                  Group therapy for women who always\n                  have the curse. There's a Tuesday\n                  night class at the Pleasant Valley\n                  Episcopalian.\n\n        Kenneth clearly thinks he's funny. Della glares a warning at\n        him and bites her lip to stop a vitriolic response escaping\n        from her mouth.\n\n<b>                            DELLA\n</b>                  I'm going to the mall for wrapping\n                  paper.\n\n        A trail of kids mess in the hallway behind Della catches\n        Kenneth's eye.\n\n<b>                            KENNETH\n</b>                  What do you do all day, Della\n                  honey? Cause it sure isn't keeping\n                  house. This place is an eyesore.\n                  I'm mortgaged up to the eyeballs\n                  for this?\n\n        His sad eyes meet hers in confrontation. Della, determined\n        not to engage, averts hers. Kenneth, unable to contain\n        himself, faces her.\n\n<b>                            KENNETH (CONT'D)\n</b>                  I mean it's not like you're at some\n                  salon fancying up your hair or\n                  nails like the other men's wives.\n\n        He lifts a strand of her limp fair hair and lets it drop,\n        looks right in her tired face.\n\n<b>                            KENNETH (CONT'D)\n</b>                  The last time I saw you wearing\n                  something sexy was our engagement\n                  party. God, Della, you used to be\n                  hot!\n\n        She bites her lip again, but this time to try stop the tears.\n        He turns away, in an attempt to conceal his own sadness.\n\n        She walks away clutching the doll.\n\n<b>                            DELLA\n</b>                  Put the twins to bed by eight. Give\n                  them a chocolate cookie with their\n                  milk.\n<b>\n</b>                                                Scene 3 Page 4\n<b>       \n</b>\n\n<b>                            KENNETH\n</b>                  Jesus, Della. Della honey, I'm\n                  sorry.\n\n        But she's already left the room. He watches her pick up a set\n        of car keys from a dresser in the dimly lit hallway. Her\n        knuckles are white as she clenches her fingers around them.\n\n        Kenneth turns back to his computer.\n\n<b>4                                                                     4\n</b><b>        INT. STAIRS - EVENING\n</b>\n        Della climbs the stairs. Framed photographs on the wall tell\n        the public story of her life. The engagement to Kenneth,\n        their wedding, the birth of the twins, Kenneth's graduation,\n        Kenneth as a sixth grade football star, Della on the farm in\n        Ohio with her horse, a really young Della playing baseball\n        with her father. We linger on a photo of a very pretty twenty\n        something Della in a little black dress.\n\n<b>5                                                                     5\n</b><b>        INT. THE TWINS BEDROOM - EVENING\n</b>\n        TERRI and TAMMI are seven year old twins with the delicate\n        blue eyed blonde looks of their Mother.\n\n        Della stands in the doorway and watches them.\n\n        Tammi is lying on her girlish bed drawing with crayons.\n        Terri's toy dinosaurs are destroying Tammi's heirloom dolls\n        house, starting with the furniture.\n\n        She steps into the room.\n\n<b>                            TAMMI\n</b>                  Mommy can I get an American Girl\n                  for Christmas?\n\n<b>                            TERRI\n</b>                  I want a raptor dinosaur, Mommy.\n\n<b>                            DELLA\n</b>                  You better leave Santa a note. It's\n                  only three days until Christmas.\n\n        She gives them each a kiss, breathing in their scent she\n        loves so much.\n\n<b>                            TAMMI\n</b>                  Where are you going, Mommy?\n<b>\n</b>                                        Scene 5 Page 5\n<b>       \n</b>\n\n<b>                             DELLA\n</b>                   The Mall. One chocolate cookie each\n                   and then Daddy will read you a\n                   bedtime story.\n\n<b>                             TAMMI\n</b>                   Daddy's stories are lame. I want\n                   you to read us a story.\n\n<b>                             TERRI\n</b>                   Yeah Mommy, the one about the\n                   pirates.\n\n<b>                             TAMMI\n</b>                   No, the cowgirls. Diamond Lil and\n                   Slingshot Kitty.\n\n<b>                             DELLA\n</b>                   Tomorrow night I'll read you the\n                   best bedtime story in the whole\n                   world. I promise.\n\n        Della gives them a little wave and turns to leave.\n\n<b>                              DELLA (CONT'D)\n</b>                   I'll check in on you both when I\n                   get back.\n                       (beat)\n                   To make sure you're sleeping.\n\n        She smiles. Terri's already turned back to his dinosaurs.\n        Tammi runs toward her and gives her the drawing she's been\n        working on. It's a drawing of a stick figure family holding\n        hands. The words \"Mommy, we love you\" are written across a\n        cloudy night sky like big stars.\n\n<b>                             DELLA (CONT'D)\n</b>                   Thank you, Tammi, it's wonderful.\n\n        Della doesn't have time to look at it properly so she folds\n        the drawing up and puts it in her pocket. She kisses Tammi\n        again and turns to leave. Tammi's eyes follow her mother as\n        she walks away.\n\n<b>6                                                                     6\n</b><b>        INT.   STAIRWAY - EVENING\n</b>\n        Della checks her watch and hurries down the stairs.\n\n<b>7                                                                     7\n</b><b>        INT.   HALLWAY - EVENING\n</b>\n        She sits on the bottom stair to pull on a pair of boots. The\n        boots are well worn but polished to a gleam.\n<b>\n</b>                                                  Scene 7 Page 6\n<b>       \n</b>\n        Behind her, an antique grandfather clock strikes seven p.m.\n        The sound of gun shots fades in from the TV in Kenneth's\n        office.\n\n<b>8                                                                     8\n</b><b>        INT. KITCHEN - EVENING\n</b>\n        Della collects a packet of cookies from a cabinet. She looks\n        at the pile of dirty dinner dishes in the sink then looks\n        away.\n\n<b>9                                                                     9\n</b><b>        INT. STAIRWAY - EVENING\n</b>\n        Della leaves the cookies at the bottom of the stairs and\n        opens the front door. The TV blares out some action flick\n        from Kenneth's ajar door.\n\n\n<b>        TITLE     ---   \"WHILE SHE WAS OUT\"\n</b>\n<b>10                                                                   10\n</b><b>        EXT.    DELLA'S HOUSE - EVENING\n</b>\n        Della is met by a blast of cold evening air and the eerie\n        silence of the suburbs. She closes the door softly behind her\n        and rushes along the path to the driveway where the family's\n        black Ford Explorer is parked.\n\n        She CHIRPS the remote and quickly climbs in.\n\n<b>11                                                                   11\n</b><b>        INT.    FORD EXPLORER - EVENING\n</b>\n        Della inserts the key and turns it in the lock.    The car\n        sputters in defiance against the cold night.\n\n<b>                               DELLA\n</b>                    Frick!\n\n        The car sputters again.\n\n<b>                               DELLA (CONT'D)\n</b><b>                    C'MON...\n</b>\n        With a massive exertion, the car engine turns over and the\n        vehicle starts. She sighs with relief.\n\n        She turns the heat up high and warms her hands at the vent,\n        pauses to look at her home through the car window. For a\n        second, in an upstairs window, she sees a reflection of\n        Tammi.\n\n        She smiles, then looks at the house and lawn and the\n        Christmas tree. She notices the fallen star, is about to get\n        out of the car to retrieve it, but decides it's too cold.\n<b>\n</b>                                                Scene 11Page 7\n<b>        \n</b>\n\n      A shadow creeps across her face as she pulls the stick into\n      reverse and backs up.\n\n<b>12                                                                 12\n</b><b>      EXT. PLEASANT VALLEY BOULEVARD - EVENING\n</b>\n      We follow her as she backs up, pushes into drive and heads\n      slowly down the boulevard.\n\n      The road is empty. All the cars are neatly tucked away in\n      their driveways and it looks like no one's out tonight. She\n      makes a right turn onto.\n\n<b>13                                                                 13\n</b><b>      EXT. PLEASANT VALLEY CRESCENT - EVENING\n</b>\n      She follows the road as it curves around a long row of\n      endlessly monotonous houses. In the distance, we can see the\n      gates of Pleasant valley gated community.\n\n<b>14                                                                 14\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      She slows down, rolls down her window and swipes a chub card\n      against the security panel. The gates slowly open. She drives\n      through. The gates close behind her. She rolls the window up\n      and makes a left turn onto.\n\n<b>15                                                                 15\n</b><b>      EXT. PLEASANT VALLEY DRIVE - EVENING\n</b>\n      The road is wider and framed on either side by the high walls\n      of gated communities. A Ford Explorer just like hers passes\n      in the opposite direction.\n\n<b>16                                                                 16\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Della smiles mysteriously, reaches into the glove compartment\n      with her free hand. She pushes aside a bunch of car papers, a\n      flare, pulls out a check wallet hidden underneath - her\n      secret hiding place for:\n\n      A nice pack of Marlboros. She smiles again - the smile of the\n      secret smoker. She presses the cigarette lighter into the\n      dashboard.\n\n      The lighter pops out. She tips out a cigarette, sees a\n      sticky note attached to the interior foil. Scrawled in messy\n      handwriting are the words - YOU ARE SUPPOSED TO BE QUITTING\n<b>      DELLA HONEY. XOXO KENNETH.\n</b>\n<b>                          DELLA\n</b>                I'll get right on that Kenneth\n                honey. AFTER you stop drinking.\n<b>\n</b>                                         Scene 16Page 8\n<b>        \n</b>\n\n      She rips the note off, stuffs it in her purse, lights the\n      cigarette.\n\n      She inhales deeply.     We see the pleasure written across her\n      face.\n\n<b>17                                                                 17\n</b><b>      EXT. PLEASANT VALLEY DRIVE - EVENING\n</b>\n      A few cars pass Della in the night. Their lights are like\n      torches in the suburban wilderness.\n\n<b>18                                                                 18\n</b><b>      INT. FORD EXPLORER/ EXT. PLEASANT VALLEY DRIVE - EVENING\n</b>\n      There is the familiar ring of a cellular phone. Della has\n      programmed one of those \"oh so cute\" recognizable tunes into\n      it, like the \"William Tell overture\".\n\n      Della holds the wheel with one hand and fumbles through her\n      purse with the other. She eventually locates the phone.\n\n<b>                              DELLA\n</b>                  Hello?\n\n<b>                            MARY (V.O.)\n</b>                  Della, it's Mary Messina.\n\n      Della rolls her eyes.     This is not a welcome call.\n\n<b>                              DELLA\n</b>                  Oh, hey.\n\n<b>                            MARY (V.O.)\n</b>                  You okay sweetie?\n\n<b>                            DELLA\n</b>                  Sure. How are you?\n\n<b>                              MARY (V.O.)\n</b>                  I'm well.\n\n<b>                            DELLA\n</b>                  How'd you get my cell number?\n\n      Della balances the phone while she drags on her cigarette.\n\n<b>                            MARY (V.O.)\n</b>                  I called Kenneth at the house.\n\n      Oh great.   She exhales sharply.\n<b>\n</b>                                         Scene 18Page 9\n<b>       \n</b>\n\n<b>                         DELLA\n</b>               And how'd that go? Did he give you\n               an earful for disturbing his ninety\n               ninth viewing of Lethal Weapon\n               Four?\n\n     Mary giggles.\n\n<b>                         MARY (V.O.)\n</b>               Oh Della. Kenneth is always\n               charming. At least to me.\n\n     The car flashes past the decorated sign for a local school.\n     Before Della can stop herself, the words are out.\n\n<b>                         DELLA\n</b>               Well, with the way you flaunt your\n               double D boob job at the free fun\n               PTA events that's hardly a\n               surprise.\n\n     Fortunately for her the phone happens to make a deep metallic\n     distortion at that moment.\n\n<b>                         MARY (V.O.)\n</b>               What was that?\n\n<b>                         DELLA\n</b>               Oh nothing, Mary.\n\n<b>                         MARY (V.O.)\n</b>               You got lucky with that one.\n               Patricia Ellis says he's the best\n               looking guy in Pleasant Valley.\n\n<b>                         DELLA\n</b>               Well that wouldn't be hard.\n               Mary, do you need something? Cause\n               I gotta go.\n\n<b>                         MARY (V.O.)\n</b>               Yes, are you going to Tool School\n               tomorrow?\n\n     Mary giggles at her own joke.\n\n     Della sighs.    THIS is why she is having her serenity\n     interrupted?\n<b>\n</b>                                      Scene 18Page 10\n<b>       \n</b>\n\n<b>                          DELLA\n</b>                TOOL SCHOOL?, Ouch, Mary. Do It\n                Yourself Mechanics is without a\n                doubt the most interesting thing in\n                my life right now.\n                    (Smiles)\n                I carry my beloved toolbox in the\n                trunk at all times.\n\n      The desolate road disappears behind Della.    She passes a\n      roadside memorial.\n\n<b>                          MARY (V.O.)\n</b>                I'm just joking, Della. You know\n                me. I pre-paid ten classes and only\n                made it to two. If you are going I\n                could use a ride. I'd hate to miss\n                another class.\n\n      If Della was going before, she's not now.\n\n<b>                          DELLA\n</b>                Sorry, Mary, I'm skipping this\n                week. Kenneth's parents are coming\n                to stay for Christmas. You know how\n                it is.\n\n      A red light looms ahead. Della slows.\n\n<b>                          MARY (V.O.)\n</b>                Oh that's too bad. Maybe Patricia\n                Ellis will be going.\n\n<b>                          DELLA\n</b>                You check with her, Mary.\n\n<b>                          MARY (V.O.)\n</b>                Merry Christmas. God bless you and\n                your family.\n\n      Christmas lights outline a few distant houses.\n\n<b>                          DELLA\n</b>                You too.\n                    (Under her breath)\n                Bah Humbug.\n\n<b>                             MARY (V.O.)\n</b>                Pardon?\n\n<b>                             DELLA\n</b>                Bye, Mary.\n<b>\n</b>                                                Scene 18Page 11\n<b>       \n</b>\n\n      Della stops at the red light. She clicks off the phone and\n      lets it lay on her lap.\n\n      She rakes about among a bunch of kids stuff in the back seat,\n      casts aside, an anorak, mittens, a sock.\n\n      She finds what she's looking for, a bottle of water, caught\n      on the bar under the passenger seat. It's only a third full\n      but she takes a sip, recoils from its coldness.\n\n      The light changes.   She throws the bottle into the back seat.\n\n<b>19                                                                 19\n</b><b>      EXT.   PLEASANT VALLEY DRIVE - EVENING\n</b>\n      Christmas lights: reindeer, stars, even the American flag dot\n      the black night.\n\n<b>20                                                                 20\n</b><b>      INT.   FORD EXPLORER - EVENING/ EXT CROSSROADS\n</b>\n      Della picks up the phone and pushes a few keys. She has not\n      dialed enough to make a full phone call when we hear the\n      phone RING on the other side.\n\n<b>                           OPERATOR (V.O.)\n</b>                 Cellular 411 connect. How may I\n                 direct your call?\n\n<b>                           DELLA\n</b>                 The Learning Academy. Spring\n                 Street.\n\n<b>                           OPERATOR (V.O.)\n</b>                 Please hold for that number.\n\n      Della slows down for another red light.\n\n      She's at a wide crossroads where the housing development\n      abruptly ends and a wasteland of deforestation begins.\n\n      A billboard for another new housing development announces:\n      \"GREEN STREET DREAM HOMES - Investment Opportunities\".\n\n      Waiting for the light at the opposite side of the road from\n      Della is a car with an animal cadaver strapped to the roof.\n\n      Della tries not to look at it.\n\n      A recording breaks into the moment just as the light ahead\n      changes to green.\n<b>\n</b>                                      Scene 20Page 12\n<b>       \n</b>\n\n<b>                          OPERATOR (V.O.) (CONT'D)\n</b>                    (recording)\n                Press your pound key now to connect\n                with your request.\n\n      Della presses the pound key and drives straight ahead.\n\n<b>                          MEGHAN (V.O.)\n</b>                Learning Academy, this is Meghan.\n\n<b>                             DELLA\n</b>                Hi Meghan.     It's Della Myers.\n\n<b>                          MEGHAN (V.O.)\n</b>                Oh hey. You calling about Spanish\n                for Beginners? You know that Tom\n                cancelled 'cause of New Year's.\n\n<b>                          DELLA\n</b>                Yes I knew.\n\n<b>                          MEGHAN (V.O.)\n</b>                Can you hold, I have another call?\n\n<b>                             DELLA\n</b>                Okay.\n\n      Frustrated, Della turns on the radio.    It is some innocuous\n      local ad.\n\n<b>                          LOCAL AD\n</b>                Pleasant Valley Dream Homes. The\n                lowest crime rate in the US. Call 1-\n<b>                800-SAFE.\n</b>\n      Della switches stations trying to find something she likes.\n      She gives up and waits for Meghan to return. The car flashes\n      past construction road signs.\n\n<b>                          MEGHAN (V.O.)\n</b>                Sorry Della ...\n\n<b>                          DELLA\n</b>                Can you leave word for Mike. I'm\n                going to miss tomorrow's Mechanic's\n                class. It's just the one time.\n\n<b>                          MEGHAN (V.O.)\n</b>                Everyone misses that class at least\n                once.\n<b>\n</b>                                      Scene 20Page 13\n<b>       \n</b>\n\n<b>                          DELLA\n</b>                I guess some people find it boring.\n\n<b>                          MEGHAN (V.O.)\n</b>                We'll see you the first week in\n                January then?\n\n<b>                          DELLA\n</b>                Yes you will...unless I run off and\n                become an outlaw or something.\n\n      Meghan giggles. We hear the familiar beep of another call\n      coming in.\n\n<b>                          DELLA (CONT'D)\n</b>                I have to go.\n\n<b>                          MEGHAN\n</b>                Merry Christmas\n\n<b>                           DELLA\n</b>                You too.\n\n      Della clicks the phone over to the incoming call.\n\n<b>                           DELLA (CONT'D)\n</b>                Hello?\n\n<b>                          CASSIE (V.O.)\n</b>                Hi Della... it's Cassie.\n\n      Cassie's voice is almost lost in the din of her surroundings.\n\n<b>                          DELLA\n</b>                Where are you? Grand Central\n                Station?\n\n<b>                          CASSIE\n</b>                Hold on, I'll take the phone\n                outside.\n\n      A loud noise appears out of nowhere.\n\n<b>21                                                                21\n</b><b>      INT. FORD EXPLORER/EXT. RAILWAY CROSSING - EVENING\n</b>\n      The car SCREECHES to a halt. Della almost didn't see it. She\n      is at a railroad crossing, the third car in line, and she\n      almost rear-ended the car in front of her.\n\n<b>                           DELLA\n</b><b>                FRICK!\n</b><b>\n</b>                                                Scene 21Page 14\n<b>       \n</b>\n\n<b>                          CASSIE (V.O.)\n</b>                Just a minute, Della.\n\n<b>                          DELLA\n</b>                I almost rear-ended a car. Cassie?\n\n      The phone cuts out. The train starts to go laboriously past.\n      Carriage after carriage of brand name building materials for\n      new housing developments.\n\n      Della lights another cigarette.\n\n      She turns on the radio again, finds a station playing \"The\n      Sound of Silence\".\n\n      The crossing gates go up.   The cars ahead of her start.\n      Della shifts into drive.\n\n      The phone rings its special tune again.   Della turns the\n      volume of the radio down.\n\n<b>                          DELLA (CONT'D)\n</b>                What's up, Cassie?\n\n<b>                          CASSIE (V.O.)\n</b>                I'm over at Southeast Plaza. What\n                was it we need to get for Pilates?\n\n<b>                          DELLA\n</b>                Huh? One of those rubber balls, I\n                think. I'm headed over there now.\n                Ran out of Christmas wrapping\n                paper. Would you believe it?\n\n<b>                          CASSIE (V.O.)\n</b>                It's hell here tonight. Everyone\n                and their uncle is at the mall.\n\n      Della's phone makes a loud, distorted noise.\n\n<b>                          DELLA\n</b>                Aw shoot. My cell battery's dying.\n\n      She rifles about in the passenger seat, leans over to the\n      back, and rifles about there among the kids toys, gives up.\n\n<b>                          DELLA (CONT'D)\n</b>                Damn, I must have left the charger\n                in the other car.\n<b>\n</b>                                      Scene 21Page 15\n<b>       \n</b>\n\n<b>                          CASSIE (V.O.)\n</b>                You want me to pick up something\n                for you while I'm here?\n\n      Cassie's kind offer almost reduces Della to tears.\n\n<b>                          DELLA\n</b>                No....I'm just. I mean I'm. Oh\n                nothing.\n\n      The phone beeps again.\n\n<b>                           CASSIE (V.O.)\n</b>                Your phone's breaking up Della. I'm\n                not joking when I say it's packed\n                over here.\n\n<b>                          DELLA\n</b>                It can't be that bad?\n\n      The light up ahead turns amber then red.    Della stops.\n\n<b>                          DELLA (CONT'D)\n</b>                Why don't we meet somewhere for a\n                drink?\n\n<b>                          CASSIE (V.O.)\n</b>                Sure, but a latte's about the best\n                they can do in this mall.\n\n<b>                          DELLA\n</b>                A latte's fine. Let's meet at the\n                fountain opposite Victoria's\n                Secret.\n\n      The light changes and Della drives up and over a hill.\n\n<b>                          CASSIE (V.O.)\n</b>                Sounds good.\n\n      The phone beeps again.\n\n<b>                          DELLA\n</b>                My battery's going. I'm a block\n                away. See you in five minutes.\n\n<b>                          CASSIE (V.O.)\n</b>                Okay but I won't be able to wait\n                very ....\n\n      The phone beeps again.   It's over.\n<b>\n</b>                                                Scene 21Page 16\n<b>       \n</b>\n\n      Della lets it drop onto her lap. She opens the window and\n      flicks out the remains of her cigarette. She waves her hands\n      to fan away the smoke. She closes the window again.\n\n      She's about to hide her cigarettes again when she changes her\n      mind and stuffs them directly into her purse.\n\n      As the car approaches the cusp of the hill she slows down to\n      stare ahead.\n\n<b>22                                                                 22\n</b><b>      EXT. MALL PARKING LOT ENTRANCE - EVENING\n</b>\n      Southeast Plaza.   The day before Christmas Eve. Hell on\n      Earth.\n\n      A large, sprawling parking lot full of cars.   Nothing but\n      cars. A sea of cars.\n\n<b>23                                                                 23\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      For a second, Della contemplates turning around and leaving.\n\n      The guy in the SUV behind her beeps. She steps on the gas.\n\n<b>                          DELLA\n</b>                Okay, okay!\n\n      Her car careens slowly down hill to the lot.\n\n<b>24                                                                 24\n</b><b>      EXT. MALL PARKING LOT/INT. FORD - EVENING\n</b>\n      The road spits her out in front of the Mall entrance where\n      revellers and shoppers are entering and exiting.\n\n      Della follows several cars down the first long row of parked\n      cars.\n\n      The asphalt is wet from the recent rainfall. Puddles gather\n      in its dents and hollows.\n\n      She passes car after densely parked car. There isn't a space\n      in sight. She reaches the end of the row and indicates left,\n      turns down the next row, ploughs through a rain puddle which\n      splashes up onto a MOTHER who's walking her little GIRL and\n      BOY back to their car. The woman shouts at Della.\n\n<b>                          MOTHER\n</b>                Watch where you're going!\n\n      Della rolls down her window.\n<b>\n</b>                                      Scene 24Page 17\n<b>       \n</b>\n\n<b>                          DELLA\n</b>                Sorry!\n\n      The Mother's weighed down with shopping bags. She glares at\n      Della and drags her kids across the aisle in front of her.\n\n      Della sighs, drives down the second aisle.\n\n      An Escape midway down the row blocks traffic. It's waiting\n      for a Subaru to pull out so it can take the spot.\n\n<b>25                                                                 25\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n<b>                          DELLA\n</b>                Lucky son of a .....\n\n      The Subaru exits the spot slowly. Della taps her impatient\n      fingers against the steering wheel.\n\n<b>26                                                                 26\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      The Subaru pulls away and the Escape snaps into the empty\n      space.\n\n      Della continues her journey down to the end of the row. There\n      are no spaces.\n\n<b>27                                                                 27\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      It dawns on her that parking up close to the entrance just\n      isn't going to happen. She takes the last puff from the\n      cigarette burning out in the ashtray.\n\n<b>28                                                                 28\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      Using the side aisle she scoots past row three and four as\n      they all flow one way.\n\n      At the end of this row a confrontation is brewing. Several\n      cars block each other. Horns blast. An angry DRIVER screams\n      at another.\n\n<b>                          ANGRY DRIVER\n</b>                If you think you're gonna steal my\n                spot, think again, asshole!\n\n<b>29                                                                 29\n</b><b>      INT. FORD EXPLORER/EXT. MALL PARKING LOT - EVENING\n</b>\n      Della looks on for a moment at the confrontation. She grinds\n      out the stub of her cigarette into the ashtray, slams it\n      closed.\n<b>\n</b>                                                Scene 29Page 18\n<b>       \n</b>\n\n      Della shakes her head and turns left into row five. Jesus!\n      Are there really this many cars in Pleasant Valley? It's a\n      brand new Mall and the only one around for miles but this is\n      ridiculous.\n\n      Della reaches the end of row five quickly. She guessed there\n      wouldn't be a spot so she's driving faster.\n\n      She notices a portly middle aged RENT-A-COP directing traffic\n      ahead. She lowers her window.\n\n<b>                          DELLA\n</b>                Hello?\n\n      The Rent-a-Cop stops directing and approaches the car.\n\n<b>                          RENT-A-COP\n</b>                Can I help you?\n\n<b>                          DELLA\n</b>                Do you know where I can definitely\n                find parking?\n\n<b>                          RENT-A-COP\n</b>                There's nothing close by. Even the\n                valet's backed up. You might want\n                to try further out.\n\n      He points off into the distance through the sea of cars.\n\n<b>                          RENT-A-COP (CONT'D)\n</b>                But be willing to walk.\n\n      A car waiting behind Della honks its horn loudly and the Rent-\n      A-Cop saunters away. Della guns the Ford down row eight.\n\n<b>30                                                               30\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      At the end of this row, Della decides to take the Rent-A-\n      Cop's advice. She makes another left at the aisle and skips\n      several more rows. She heads down to the third from last row.\n\n<b>31                                                               31\n</b><b>      INT. FORD EXPLORER/EXT MALL PARKING LOT - EVENING\n</b>\n      Cars... cars... If she never sees another car it will be too\n      soon.\n\n      Della spies a spot, halfway down the row.\n\n<b>                          DELLA\n</b>                Yes!\n<b>\n</b>                                               Scene 31Page 19\n<b>       \n</b>\n\n      She guns the engine, gets ready to pull in and is DENIED.\n\n      Somebody has parked an enormous old gold Plymouth so badly\n      it's taking up TWO spaces.\n\n<b>                          DELLA (CONT'D)\n</b>                Unbelievable!\n\n      She brakes in the nick of time and sighs deeply. She's\n      starting to lose her patience now.\n\n<b>32                                                                 32\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      With no options left, Della heads down to the very last row.\n      More cars fill the spaces. And then - two spots. The last\n      two spots in the car park. They overlook undeveloped land\n      just beyond the mall. Small concrete bumps signify the end of\n      each space.\n\n<b>33                                                                 33\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Della whips the car into the first one. She sighs with\n      relief as she straightens the car up into the spot. She sits\n      for a second trying to calm herself down but it isn't\n      working. She reaches for another cigarette, then, talks\n      herself out of it.\n\n      She fastens her coat, grabs her purse and opens the door.\n\n<b>34                                                                 34\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      Steps down from the Ford right into a puddle. The dirty water\n      splashes up onto her pants.\n\n<b>                          DELLA\n</b><b>                GREAT!\n</b>\n      She shakes the boot off and looks over at the mall. It's at\n      least a half mile away, glimmering in the distance.\n\n      She sets off marching across the lot, taking what seems to be\n      the most direct route. Maybe she can shake off this mood by\n      the time she gets inside.\n\n      She passes the Plymouth, turns, stares back at it. The car is\n      dirty gold and riddled with rust holes with a vinyl roof\n      that's almost peeled away. She walks up close, tries to\n      decipher the plate, but it's caked with mud.\n\n      Annoyance rises like bile in her throat.\n<b>\n</b>                                               Scene 34Page 20\n<b>       \n</b>\n\n      She finds herself reaching into her purse, rummaging for a\n      small notebook, then a sharpie. She leans on the car as she\n      writes.\n\n\n<b>      DEAR JERK, IT'S GREAT YOU COULD USE UP TWO PARKING SPACES ON\n</b><b>      A NIGHT LIKE THIS. EVER HEAR OF THE JOY OF SHARING? SIGNED,\n</b><b>      A CONCERNED FRIEND.\n</b>\n      She scans her words.    Pretty good!\n\n      Della rips the piece of paper from the notebook, folds the\n      note several times and slides it under the Plymouth's\n      windshield wipers. The driver can't miss it.\n\n      She smiles. That felt good!\n\n      Head held high she marches on towards the Mall.\n\n      The CAMERA pulls up so we can see the mall, see Della\n      marching across the lot, see the crowds of shoppers entering\n      and exiting the mall, and get the feeling that maybe somebody\n      just saw her.\n\n<b>35                                                                 35\n</b><b>      EXT. MALL ENTRANCE - EVENING\n</b>\n      Shoppers are buying freshly felled Christmas trees from a\n      vendor. Della squeezes past and pushes through the mall\n      doors.\n\n<b>36                                                                 36\n</b><b>      INT.   MALL - EVENING\n</b>\n      A wave of heat and Christmas lights hits Della. A wave of\n      nausea follows as she is swallowed by the crowd of last\n      minute shoppers. Distorted muzak versions of Christmas songs\n      seep from invisible speakers.\n\n      Della gets caught up in a line of children waiting to see\n      Santa in his grotto. She squeezes through and makes her way\n      towards the fountain outside of Victoria's Secret.\n\n      En route she is stopped by a perfume sales lady who sprays\n      her wrist with perfume before she has time to protest.\n\n<b>                           PERFUME SALES LADY\n</b>                 It's a classic revival of Chanel\n                 No.5. We have a wonderful Christmas\n                 Special on offer at Macy's.\n\n      She hands Della a sample and flyer.\n<b>\n</b>                                               Scene 36Page 21\n<b>       \n</b>\n\n<b>                            DELLA\n</b>                 Thanks.\n\n      Della arrives at the fountain. A piddling jet of dirty water\n      gurgles from the mouth of a bored mermaid and streams down\n      into the shallow pool full of nickels and dimes. She scans\n      the crowd but there's no sign of Cassie.\n\n      Della sits at the edge of the fountain. She checks her watch\n      then checks out the people milling around in front of\n      Victoria's Secret, where mannequins in skimpy festive\n      underwear are propped seductively in the window displays.\n\n      Still no sign of Cassie. She's about to make a wish and throw\n      a quarter into the fountain when a Red Cross worker shakes\n      her \"Save the Children\" tin at her. Della sticks the quarter\n      into the tin instead.\n\n<b>37                                                                 37\n</b><b>      INT.   VICTORIA'S SECRET - EVENING\n</b>\n      Della wanders the aisles of festive colored undies watching\n      men pick out slinky lingerie for their partners and women\n      examine slim fit underpants and padded bras.\n\n      She notices a pure silk black teddy, very classic, no frills.\n      She lifts it from the rail and holds it against herself in\n      front of the mirror, tries to imagine herself in it.\n\n      A young SALES ASSISTANT approaches.\n\n\n<b>                           VS SALES ASSISTANT\n</b>                 It's pure silk, the last one in our\n                 classic black label collection.\n                 Would you like me to fix you a\n                 changing room?\n\n      Della checks the size tag. It reads 36C, two sizes too big.\n      And the price tag next to it. Ouch! It's expensive for\n      Victoria's Secret.\n\n<b>                           DELLA\n</b>                 No thanks. Not my size.\n\n      She gestures to her small boobs, smiles and hands the teddy\n      to the sales assistant. She quickly leaves the shop.\n\n<b>38                                                                 38\n</b><b>      INT. MALL - EVENING\n</b>\n      Della checks one last time at the fountain for Cassie. She\n      tries to dodge the crowd as she makes her way toward a\n      generic coffee shop. Maybe Cassie will be there.\n<b>\n</b>                                               Scene 39Page 22\n<b>       \n</b>\n\n<b>39                                                                 39\n</b><b>      INT. COFFEE SHOP - EVENING\n</b>\n      Harried women and a few men, clutching bags full of gifts and\n      impatient children, stand on line for their favorite drug.\n\n      Della squeezes past them to look for Cassie. Every seat at\n      every booth is full but there's no sign of her friend.\n\n      Della joins the line. She finds herself biting at her nails,\n      a bad habit since childhood.\n\n      A woman in front of her places an order then moves on to the\n      pick up area. Della moves up to the counter to where an\n      OVERWEIGHT SALES ASSISTANT waits on her.\n\n<b>                          DELLA\n</b>                A latte please?\n\n      She notices some chocolate covered biscotti on the counter.\n\n<b>                          DELLA (CONT'D)\n</b>                And a chocolate biscotti.\n\n      She catches sight of herself in the mirror behind the\n      counter. Kenneth's right about one thing, she looks awful.\n\n<b>                          OVERWEIGHT SALES ASSISTANT\n</b>                Bitter or Milk chocolate?\n\n      Seeing herself in the mirror changes her mind about the\n      biscotti.\n\n<b>                          DELLA\n</b>                Forget it, just the coffee.\n\n<b>                          OVERWEIGHT SALES ASSISTANT\n</b>                Name?\n\n<b>                          DELLA\n</b>                Della, two L's.\n\n<b>                          OVERWEIGHT SALES ASSISTANT\n</b>                Four dollars and seventy nine\n                cents.\n\n      Della pushes the money towards her and waits for her coffee.\n      When it finally shows up her name is spelled DELA. She sighs\n      and checks the line for Cassie as she leaves the shop.\n<b>\n</b>                                               Scene 40Page 23\n<b>       \n</b>\n\n<b>40                                                                 40\n</b><b>      INT. MALL - EVENING\n</b>\n      She passes a hair salon and presses her face to the steamy\n      windows. Inside, women are getting their hair styled and\n      their nails manicured at the same time.\n\n      Della looks down at her bitten nails but just can't bring\n      herself to go inside.\n\n<b>                          LYNN (O.S.)\n</b>                Della, is that you?\n\n      She turns around to see LYNN MONROE, a pretty, well groomed\n      redhead about her age.\n\n<b>                          DELLA\n</b>                Lynn Monroe!\n\n<b>                          LYNN\n</b>                I knew it was you, Della. I haven't\n                seen you since college. You left to\n                marry some handsome jock and we\n                never heard from you again.\n\n<b>                          DELLA\n</b>                Something like that. Do you live\n                around here now?\n\n<b>                          LYNN\n</b>                David and I just bought this divine\n                house in Pleasant Valley. Do you\n                know it? Great for the kids.\n\n      Della nods but Lynn keeps speaking. Della sips on her latte.\n\n<b>                          LYNN (CONT'D)\n</b>                It's the first time I've left the\n                doors unlocked since I was a child\n                growing up in the Midwest. David's\n                been promoted to VP of United\n                Motors so it's all happening for\n                us. But enough of me. How are you?\n\n<b>                           DELLA\n</b>                Oh, we have two kids. Twins, Tammi\n                and Terri.\n\n      Lynn becomes distracted, focusing on her perfect reflection\n      in the steamy glass.\n<b>\n</b>                                               Scene 40Page 24\n<b>       \n</b>\n\n<b>                           LYNN\n</b>                 Why that's fantastic. Listen Della,\n                 it's been great talking to you but\n                 I have to go get my hair done!\n                 David and I are going out tomorrow\n                 night for a romantic dinner. I just\n                 bought this gorgeous teddy from\n                 Victoria's Secret.\n\n      She opens the bag and Della sees it's the black teddy she\n      eyed earlier. Della smiles.\n\n<b>                           LYNN (CONT'D)\n</b>                 Hope we bump into each other again\n                 soon, sweetie. Merry Christmas\n\n      She gives Della a fake kiss and rushes into the salon.\n\n      Della chucks her half finished coffee into a nearby trash can\n      and walks on through the Mall.\n\n<b>41                                                                41\n</b><b>      INT.   PHARMACY - EVENING\n</b>\n      Della enters a pharmacy. She locates the wrapping paper\n      aisle. She sweeps up a bunch of rolls at three for ninety\n      nine cents. She feels the texture of the paper, it's thin and\n      looks gaudy so she puts them all back. Instead she selects\n      some expensive gold paper with silver embossed stars and\n      matching silver ribbon. She then finds some jolly children's\n      wrapping with Christmas tree designs and a great big red bow.\n\n      She browses through the aisles of cards. She sees some cute\n      cards for the twins and then arrives at the \"To my Darling\n      Husband at Christmas\" section. She opens some of the cards\n      and recoils from the sentiments contained inside.\n\n      She catches a groomed BLONDE HOUSEWIFE staring at her and\n      corrects her facial expression from one of revulsion to a\n      complicit Stepford smile.\n\n<b>                           DELLA\n</b>                 It's a pity they don't have any \"To\n                 a bastard at Christmas\" cards.\n\n      The woman looks at Della like she's a lunatic. Della chuckles\n      to herself.\n\n      She finds the feminine hygiene aisle and picks up a pack of\n      regular tampax.\n\n      She gathers her stuff and carries it to the checkout where a\n      TIRED MAN and his TWO KIDS wait before her on the line.\n<b>\n</b>                                                  Scene 41Page 25\n<b>       \n</b>\n      The man tries to remove a snow globe, with a tiny house and\n      Christmas tree inside, from the clutches of his young son.\n      The child starts bawling. The man ends up buying the snow\n      globe to placate the child.\n\n      It's Della's turn.\n\n      The PHARMACY SALES ASSISTANT smiles.\n\n<b>                             PH SALES ASSISTANT\n</b>                   Perfect timing!\n\n<b>                             DELLA\n</b>                   God planned it for Christmas Day\n                   just to tick me off.\n\n<b>                             PH SALES ASSISTANT\n</b>                   Thirty dollars and sixty nine cents\n\n      She packs Della's stuff into paper bags. Della hands her visa\n      card over.\n\n<b>                             DELLA\n</b>                   Thanks.\n\n<b>                             PH SALES ASSISTANT\n</b>                   Merry Christmas.\n\n<b>42                                                                 42\n</b><b>      INT. MALL - EVENING\n</b>\n      It's a lot less crowded now. The melancholy \"Home for\n      Christmas\" plays. She follows the ladies sign to the entrance\n      to the bathroom, only to find an \"Out of Order\" sign on the\n      door. She sees a cleaning lady in the corridor.\n\n<b>                             DELLA\n</b>                   How come the ladies' bathroom is\n                   out of order on a night like this?\n\n<b>                             CLEANING LADY\n</b>                   The one at the other side of the\n                   mall is open, Ma'am.\n\n      The    cleaning lady disappears through the bathroom door with\n      her    cart of cleaning utensils. Della looks down the length of\n      the    huge mall and decides she's not even going to try to find\n      the    other bathroom. She can wait until she gets home.\n\n      She makes her way towards the exit, pulls her coat in tight\n      and braces herself for the cold front outside.\n<b>\n</b>                                       Scene 43Page 26\n<b>       \n</b>\n\n<b>43                                                                 43\n</b><b>      EXT. MALL ENTRANCE - EVENING\n</b>\n      A group of CAROL SINGERS sing \"Silent Night\".\n\n<b>                          CAROL SINGERS\n</b>                Silent Night. Holy Night. All is\n                calm. All is bright.\n\n      Della listens for a moment. Their voices are clear and\n      bright.\n\n      Behind them she can see the Christmas tree vendor bag up the\n      left over trees.\n\n      Della's hands start to pinch with the cold.\n\n      She gathers her bags of wrapping paper and sets off across\n      the emptying lot. The last of the shoppers rush across the\n      car park to find their cars. It's pretty dark between the dim\n      pole lamps and the car lights.\n\n      She slows down at the second aisle for a car to pass, then\n      another. Marches on.\n\n      A man and his little girl walk past. He nods. Della's eyes\n      linger on the little girl. She really wants to get home to\n      the kids.\n\n      The singers' voices echo faintly through the night.\n\n<b>                          CAROL SINGERS (O.S.) (CONT'D)\n</b>                Holy infant so tender and mild.\n\n      She walks faster, almost at a dash.\n\n      Where is her car? Even further out than she remembered,\n      that's for sure.\n\n      A car alarm goes off in the distance.\n\n      The alarm stops at last as Della approaches the outer section\n      of the parking lot.\n\n<b>                          CAROL SINGERS (O.S.) (CONT'D)\n</b>                Shepherds quake at the sight.\n                Glories beam from heaven afar.\n\n      She cuts between some of the cars in row eight. Zigzags\n      across aisle nine. Notices the Plymouth still parked ahead.\n\n      She stops for a split second. Then approaches. Glances at the\n      windshield. The note is gone.\n<b>\n</b>                                                 Scene 43Page 27\n<b>       \n</b>\n\n      Maybe it fell off. She checks the ground around the car. No\n      sign of it. She shrugs, who cares anyway?\n\n      She cuts across the next aisle. It's almost empty. And the\n      one after that. Her Explorer is sandwiched between two cars\n      in this otherwise empty row.\n\n<b>                           CAROL SINGERS (O.S.) (CONT'D)\n</b>                 Silent Night. Holy Night\n\n      She chirps the remote twice and pops the trunk, places the\n      bags inside. She slams the trunk closed and hurries to the\n      drivers' side, climbs in, pulling the door closed behind her.\n\n<b>44                                                                 44\n</b><b>      INT.   FORD EXPLORER   - EVENING\n</b>\n      Della turns the key in the ignition and presses in the\n      lighter. She lights a cigarette and inhales as she lets the\n      car warm up for 30 seconds.\n\n      She rests the cigarette in the ashtray while she releases the\n      hand brake and slips the gear into reverse. The interior of\n      her car is suddenly flooded with light from another car's\n      headlights. She glances in the rear view mirror. A car is\n      blocking her.\n\n<b>                           DELLA\n</b>                 Good Lord! What now?\n\n      She steps on the brake and waits for the car to move.\n\n      But it doesn't. Its headlights flick to full beam blinding\n      her view in her car mirrors. She honks her horn. The car\n      still doesn't move.\n\n      Della's really angry now. She slips the gearshift into park\n      and steps out of her car.\n\n<b>45                                                                 45\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      Della squints in the blinding headlights. The front of the\n      car looks familiar. It's the gold Plymouth!\n\n      Two unseen car doors click open and clunk shut again.\n\n      The lights abruptly go out. Della blinks, her eyes try to\n      adjust to the dim mercury illumination from a pole lamp a few\n      car lengths away.\n\n      She uneasily turns back to her car.\n<b>\n</b>                                       Scene 45Page 28\n<b>       \n</b>\n\n<b>                          CHUCKIE (O.S.)\n</b>                I got a gun.\n\n      It's a young male voice. The statement stops Della dead in\n      her tracks.\n\n<b>                          CHUCKIE (O.S.) (CONT'D)\n</b>                How's about I aim it at your pussy\n                first?\n\n      The words are emphasized by another boy's shrill giggling.\n      Della freezes. This can't be happening!\n\n      Her eyes are adjusting. The glare phantoms drift out to the\n      limit of her peripheral vision and vanish.\n\n      She sees three boys in front of her, then a fourth, but she\n      doesn't see any gun.\n\n<b>                          DELLA\n</b>                What the hell are you playing at?\n\n<b>                          HUEY\n</b>                Trust the nigga, we not playin'.\n\n      HUEY is a sweet-faced African-American decked out in a hip\n      hop style. He's small and skinny and can't be more than\n      eighteen. He's playing to CHUCKIE who's twenty-one and looks\n      like a marine gone AWOL. Bracketing them is VINH, a nineteen\n      year old Asian punk and TOMAS, twenty, a Latino runaway in an\n      American Idol T-shirt.\n\n      Della's eyes drift across the group. She suppresses a\n      hysterical giggle but can't resist smarting off.\n\n<b>                          DELLA\n</b>                What are you? The world's first\n                homeless United Nations Boy Band?\n\n<b>                          HUEY\n</b>                Hell, yeah. We just wanna do shows\n                and bone hoes.\n\n      Huey messes with his zipper.\n\n<b>                          HUEY (CONT'D)\n</b>                We got a song fo' yo. It's called\n                \"shut up bitch and eat a dick\".\n\n      Huey and Tomas snigger. Vinh stares at the asphalt.\n<b>\n</b>                                       Scene 45Page 29\n<b>       \n</b>\n\n<b>                          TOMAS\n</b>                And when yo done eating we gonna\n                staple that bitch mouth closed.\n\n      Chuckie nudges Huey and Tomas, steps towards Della.\n\n<b>                          CHUCKIE\n</b>                Now, now, my little brothers.\n\n      The boys fall silent.   Vinh lights a cigarette. Huey shivers.\n\n<b>                          HUEY\n</b>                It gitting cold, Chuckie. Game's\n                not worth the dime.\n\n<b>                          DELLA\n</b>                    (incredulous)\n                Chuckie? At least your parents have\n                a sense of humor.\n\n<b>                          CHUCKIE\n</b>                Parents? I ain't got no parents. I\n                named myself.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                    (to Huey)\n                Grab my parka from the back seat.\n\n      He pinches Huey's cheeks.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                And smile, playa. The dopes game\n                and the game's dope.\n\n      Chuckie leads Huey a few steps to the Plymouth. Huey ducks\n      into the back seat. Chuckie keeps his eyes fixed on Della.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                You got a beef with us, Mrs.\n                Podunk?\n\n      Della looks defiantly back without answering. Chuckie runs\n      his fingers along the hood of the rusty gold Plymouth.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                First you put yo hands on my ride!\n                Now, I don't know how you was\n                raised but, in my world, laying\n                your hands on someone else's shit\n                is crossing their line!\n                Then, you go slipping an incendiary\n                note up under my windscreen wipers.\n<b>                          (MORE)\n</b><b>\n</b>                                                Scene 45Page 30\n<b>       \n</b>\n                Well, that'd UCKIE(CONT'D)\n                          CH be an invitation to\n                war to me and my ghetto soldiers.\n\n<b>                          DELLA\n</b>                What? If you hadn't parked like an\n                asshole, we wouldn't be arguing\n                about it right now.\n\n      Vinh inhales sharply from his cigarette.\n\n<b>                          VINH\n</b>                Whoah Lady!\n\n<b>                          TOMAS\n</b>                Keep right on talking that gang a\n                shit, chinga. Yo crimes against the\n                click are digging yo grave deep.\n\n      Della's eyes quickly scan the group for sign of the gun. She\n      can't see one so she gambles they're just mouthing off and\n      makes her move.\n\n<b>                          DELLA.\n</b>                Go to hell!\n\n      Della turns towards her car. Huey steps out of the shadows\n      wearing Chuckie's parka hood up covering his face, startles\n      Della.\n\n<b>                          HUEY\n</b>                We already in hell.\n\n      Della sidesteps him, reaches the back of her car.\n\n<b>                          RENT-A-COP (O.S.)\n</b>                Any trouble here, ma'am?\n\n      Everyone turns to see a Rent-a-Cop, puffed up like a pigeon\n      in his fur trimmed jacket and Russian style cap. It's the\n      same guy Della approached earlier when she was looking for\n      spaces except this time his hand is laying casually across\n      the unsnapped holster flap at his hip.\n\n<b>                          DELLA\n</b>                Not if these delinquents move their\n                barge so I can back up.\n\n<b>                          RENT-A-COP\n</b>                How about it, boys?\n\n      Chuckie smiles and nudges Tomas who starts dancing in a real\n      mocking manner imitating the Rent-a-Cop.\n<b>\n</b>                                               Scene 45Page 31\n<b>       \n</b>\n      Chuckie pulls a gun from deep in his army jacket pocket and\n      points it straight at the Rent-a-Cop's face.\n\n<b>                          CHUCKIE\n</b>                Nah. We not in the mood.\n\n      Chuckie looks at his friends for approval. Huey laughs again,\n      shrill. Tomas grins. Vinh hunches and looks around.\n\n      The Rent-a-Cop backs away.\n\n<b>                          RENT-A-COP\n</b>                For Jesus' sake.\n\n      Tomas takes off a small crucifix from around his neck and\n      dangles it in front of the Rent-a-Cop.\n\n<b>                          TOMAS\n</b>                Say yo prayers old man.\n\n      Chuckie grins at Della while keeping the gun pointed straight\n      at the Rent-a-Cop.\n\n<b>                          CHUCKIE\n</b>                These Rent-a-Pig companies are too\n                lame to give their foot soldiers\n                any ammo. Liability laws and all\n                that. Tough shit!\n\n      The Rent-a-Cop goes for his pistol anyway.\n\n      Chuckie shoots him in the face.\n\n<b>      THIS MOMENT CHANGES EVERYTHING.\n</b>\n      We thought Della was in trouble but now we know she is.\n\n      The bullet hits the Rent-A-Cop in the forehead. Blood spurts\n      from the exit wound. He slumps to the asphalt like a\n      marionette whose strings have just been cut. Bullet smoke\n      hangs in the air where he once stood. Smoke too blackens the\n      bullets entry wound. Blood puddles out from the back of his\n      head.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                Fuck!\n\n      It's clear that Chuckie's been acting harder than he is. The\n      hand that holds the gun is trembling. The color drains from\n      his face.\n\n      All stand riveted in shock.\n<b>\n</b>                                               Scene 45Page 32\n<b>       \n</b>\n\n      A deathly silence follows. The carol singers can be heard in\n      the distance faintly finishing up Silent Night.\n\n<b>                          CAROL SINGERS (O.S.)\n</b>                Sleep in heavenly peace. Sleep in\n                heavenly peace.\n\n      Chuckie looks to his friends for support but none is\n      forthcoming.\n\n      The Rent-A-Cop's body twitches.\n\n      Chuckie hesitates then raises the gun. He aims and fires. The\n      shot shatters the top of the Rent-A-Cop's head. Chuckie\n      flinches, closes his own eyes in reflex.\n\n      Della swallows. If she started screaming now, she may never\n      stop. She spins instead and makes for her car door. She's\n      dead if she doesn't get out of here and she knows it.\n\n<b>                          VINH\n</b>                She's busting a move!\n\n      Chuckie opens his eyes. Vinh points to Della.\n\n      Chuckie looks over and sees Della disappear through the door\n      of her Explorer. Agitation overwhelms him.\n\n<b>                          CHUCKIE\n</b>                She ain't going nowhere. We got her\n                Ford blocked in, right?\n\n      He looks at Vinh who nods then at Huey.\n\n<b>                          HUEY\n</b>                I don't know nothing.\n\n      Chuckie looks back at Vinh then over at Tomas.\n\n<b>                          TOMAS\n</b>                (muttering)\n                Dar candela por el culo!\n\n<b>                          CHUCKIE\n</b>                I can just put one through her\n                windshield, right?\n\n      No one answers. Chuckie turns once more to the Rent-a-Cop\n      whose body still twitches in some final death throe.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                Will you just DIE ?!\n<b>\n</b>                                                 Scene 45Page 33\n<b>       \n</b>\n\n      He raises the gun.\n\n      Another shot explodes into the night.\n\n<b>46                                                                 46\n</b><b>      INT.   FORD EXPLORER   - EVENING\n</b>\n      Della flinches but no   bullet tears through the back of her\n      skull. She slams into   the driver's seat and punches the door\n      lock switch. She hits   the four wheel drive button and presses\n      the accelerator pedal   to the metal.\n\n      The Explorer barely protests as its front tires claw and\n      bounce over the six inch concrete row barrier. The barrier\n      screeches along the underside of the frame. There is a loud\n      SCRAAAAAPE noise as the car heaves over the barrier. Then,\n      the rear wheels bounce and claw over. The car fishtails\n      momentarily.\n\n<b>                           DELLA\n</b>                 Please God. Don't overcorrect.\n\n      She releases the pressure on the accelerator. The Explorer\n      straightens.\n\n<b>47                                                                 47\n</b><b>      EXT. MALL PARKING LOT - EVENING\n</b>\n      Tomas screams at Chuckie.\n\n<b>                           TOMAS\n</b>                 Chinga tu madre. She making her\n                 getaway.\n\n      All except Chuckie turn to look as Della accelerates across\n      the unfinished outskirts of the car park behind them.\n\n      Vinh tugs at Chuckie's sleeve.\n\n<b>                             VINH\n</b>                 Chuckie!\n\n      But Chuckie's staring at the bloody mess he made, with a\n      faraway look in his eyes, like he's disassociating.\n\n      Vinh throws down the stub of his cigarette, follows Tomas\n      into the Plymouth. Tomas guns the engine.\n\n<b>                           HUEY\n</b>                 She on her cell right now calling\n                 the pigs.\n\n      Huey's almost hysterical.\n<b>\n</b>                                               Scene 47Page 34\n<b>       \n</b>\n\n<b>                           HUEY (CONT'D)\n</b>                 We going down for this!\n\n      Chuckie turns on him.\n\n<b>                           CHUCKIE\n</b>                 You gone buck wild, nigga? We ain't\n                 going down for shit.\n\n<b>                           HUEY\n</b>                 You ain't earned the right to call\n                 me a nigga. And that goes for all\n                 you haters.\n\n      Behind him Della's car turns onto the mall's outer perimeter\n      service road in the distance.\n\n<b>                           CHUCKIE\n</b>                 Easy my G. Easy.\n\n      Chuckie cajoles Huey.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 The world is our bitch, right?\n\n      Huey calms down.\n\n      Chuckie gently pushes him into the Plymouth back seat beside\n      Vinh.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Get in my fallen soldier.\n\n      Chuckie opens the driver door.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Shove over Tomas. You know I front\n                 the ride.\n\n      Tomas shuffles over to the passenger seat. Chuckie climbs\n      into driver side. Doors slam. The Plymouth screeches across\n      the parking lot and exits onto the service road.\n\n<b>48                                                              48\n</b><b>      EXT.   SERVICE ROAD - EVENING\n</b>\n      Della speeds down the long dark empty service road which\n      skims the deserted warehouses at the back of the Mall.\n      Between the warehouses are dark patches of undeveloped land -\n      No Mans land.\n\n      Not a car nor a person in sight.\n<b>\n</b>                                               Scene 48Page 35\n<b>       \n</b>\n\n      It starts to rain.\n\n<b>49                                                                 49\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      She shakes the cell phone trying to revive its dead battery.\n      Types 911 in anyway. No connection. No response. She shakes\n      it some more. Gives up.\n\n      She relentlessly checks the rearview and side mirrors as she\n      races into the rainy night.\n\n      The driving conditions are not good, poor visibility ahead.\n      Too bad. She speeds anyway.\n\n      The road has to connect to a main road soon!\n\n      Another glance in the rearview. Nothing. Side mirror. Still\n      clear. Once more in the rearview. Headlights!\n\n<b>                           DELLA\n</b>                No!\n\n      Side mirror. It's the Plymouth.\n\n      She presses the accelerator down harder. The engine revs.\n\n      In the rearview there's a sudden flash above her rear left\n      headlight. And another.\n\n<b>                           DELLA (CONT'D)\n</b>                Jesus!\n\n      They're shooting at her!\n\n      Della steps the accelerator to the floor praying the Explorer\n      won't skid out. The engine struggles, catches up.\n\n      The sudden speed causes a small silver love heart, hanging on\n      a silver chain necklace from the rearview mirror, to crash\n      against the window. The catch bursts open to reveal two tiny\n      photos of the twins inside. The necklace flies back and forth\n      against the window as the Explorer races onwards.\n\n<b>50                                                                 50\n</b><b>      EXT. SERVICE ROAD - EVENING\n</b>\n      The Plymouth accelerates behind blasting rap. Its thick tires\n      plow along the wet asphalt, gripping to the road below in\n      steady pursuit. Its windows are all steamed up. The front\n      passenger window is open, a hand and a gun muzzle stick\n      through.\n<b>\n</b>                                       Scene 51Page 36\n<b>       \n</b>\n\n<b>51                                                                  51\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Another flash and Della's left side mirror shatters.\n\n      She swerves in panic. Her car almost hits the ditch.\n\n      This can't be happening. Not to her.\n\n      She reclaims the steering wheel.   Straightens up. Hits the\n      accelerator again.\n\n<b>52                                                                  52\n</b><b>      EXT. SERVICE ROAD - EVENING\n</b>\n      The Plymouth swerves behind on the skid that Della created,\n      corrects itself just before the ditch.\n\n      Della gains speed. The Plymouth lags.\n\n      A stop sign appears ahead. The road's ending.\n\n<b>53                                                                  53\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Right or left, Della? Make a choice.\n\n<b>54                                                                  54\n</b><b>      EXT. SERVICE ROAD - EVENING\n</b>\n      There is no choice. A barrier blocks the left hand turn. A\n      big sign reads \"LOT FULL\".\n\n<b>55                                                                  55\n</b><b>      EXT. EMPTY HOUSING ESTATE ROAD - EVENING\n</b>\n      Della swings right instead.\n\n      The streetlights recede behind her.\n\n<b>56                                                                  56\n</b><b>      EXT. EMPTY HOUSING ESTATE - EVENING\n</b>\n      Nothing but the darkness of a housing complex under\n      construction ahead.\n\n      But she seems to have shaken off her pursuers.\n\n      She speeds down the road, looking intently for any sign of\n      life. But there's nothing but half-built houses, empty\n      houses, houses just like hers.\n\n<b>57                                                                  57\n</b><b>      EXT. SEVEN ELEVEN MINI MALL - EVENING\n</b>\n      A Seven Eleven sign appears. She slows down. But it may as\n      well be a mirage, it's an unfinished building with only the\n      sign, in an unfinished mini-mall.\n<b>\n</b>                                      Scene 58Page 37\n<b>       \n</b>\n\n<b>58                                                                 58\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Close to screaming now she speeds up.\n\n<b>59                                                                 59\n</b><b>      EXT. EMPTY HOUSING ESTATE - EVENING\n</b>\n      More empty houses in varying stages of construction. No sign\n      of life.\n\n<b>60                                                                 60\n</b><b>      EXT. FILLING STATION - EVENING\n</b>\n      Then, what looks like a filling station, one light on in the\n      kiosk.\n\n<b>61                                                                 61\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Hope. She pulls in and dims her lights, drives right up to\n      the kiosk door.\n\n      Hope dashed.\n\n<b>62                                                                 62\n</b><b>      EXT. FILLING STATION - EVENING\n</b>\n      It's in its final stages of installation but definitely not\n      functioning. And there's no one there.\n\n<b>63                                                                 63\n</b><b>      EXT. EMPTY HOUSING ESTATE - EVENING\n</b>\n      Back onto the road and she sees far behind her, car\n      headlights that can only belong to the Plymouth, following\n      her through the darkness.\n\n      She dims her lights to just the side lights. Hurtles along\n      the dark road which is getting rougher and rougher. Potholes\n      filled with mud and rain water splash against the car.\n\n<b>64                                                                 64\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Her wipers struggle to cope. She can hardly see through the\n      front window.\n\n<b>65                                                                 65\n</b><b>      EXT. ROUGH ROAD - EVENING\n</b>\n      The potholes yawn deeper. The asphalt ends. Gravel\n      deteriorates to dirt.\n\n<b>66                                                                 66\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      She steers the Ford blindly.\n<b>\n</b>                                               Scene 67Page 38\n<b>       \n</b>\n\n<b>67                                                                67\n</b><b>      EXT. ROUGH ROAD - EVENING\n</b>\n      A wooden barrier with reflective stripes looms suddenly\n      ahead.\n\n<b>68                                                                68\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      She guns the engine and ducks sideways as her car PLOWS into\n      the barrier.\n\n      There's a sickening crack as shattered windshield sprays\n      around her.\n\n<b>69                                                                69\n</b><b>      EXT. EDGE OF WOODS - EVENING\n</b>\n      The Explorer SLAMS through and VEERS towards a clump of\n      trees.\n\n<b>70                                                                70\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      Della tries to sit upright but the auto's spinning too fast.\n\n<b>71                                                                71\n</b><b>      EXT. EDGE OF WOODS - EVENING\n</b>\n      The car swings, then CRASHES right into a Pine tree.\n\n<b>72                                                                72\n</b><b>      INT. FORD EXPLORER - EVENING\n</b>\n      The Car stalls out. SILENCE. A prolonged moment.\n\n      Then Della crawls out from under the dashboard, sweeping pine\n      needles and glass from her hair. She reaches up and hits the\n      light switch.\n\n      Pine branches protrude through the broken windshield.\n\n      Using the sleeve of her coat she sweeps broken glass from the\n      driver's seat and sits down.\n\n      She slides the gear into park, turns the key. The engine\n      groans like a dying animal, then gives up.\n\n      She takes a deep breath.\n\n      She tries again. The engine groans again, another death\n      rattle. It just won't catch.\n\n      She switches off the interior light and pushes the driver\n      door open. She steps out of the car.\n<b>\n</b>                                               Scene 73Page 39\n<b>       \n</b>\n\n<b>73                                                                 73\n</b><b>      EXT. EDGE OF WOODS - EVENING\n</b>\n      She closes the door behind her so's not to trigger the light\n      switch. Finds her legs are giddy. Holds onto the door frame\n      for a moment to steady herself.\n\n      It looks like she's crashed at the very end of the housing\n      development - where it cuts like a knife edge into an old\n      forest.\n\n      The dirt road stretches ahead beyond the barrier, into the\n      midst of the forest. Behind her, shrouded in darkness, houses\n      in different stages of development dot the deforested\n      landscape. Land moving trucks sit on recently flattened\n      land, waiting to tear into the next layer of forest.\n\n      Patches of leftover snow and puddles of rain catch the light\n      from the moon which hides in an overcast sky.\n\n      Jesus! She's driven all the way from the Mall only to find\n      herself in the middle of nowhere with a bunch of psychopaths\n      on her tail.\n\n      This must be some sick joke.\n\n      Speaking of which, where are these little bastards? Her eyes\n      scan the darkness for a sign. Nothing. That doesn't mean\n      they're not close by.\n\n      She checks out the damage to the car by feel. The driver's\n      side is scratched and dented. The front is wedged into the\n      tree.\n\n      The only way out is for her to back up the car.\n\n      She climbs back in for another try.\n\n<b>74                                                                 74\n</b><b>      INT.   FORD EXPLORER   - EVENING\n</b>\n      Della turns the key. It barely even groans this time. Just a\n      faint gurgle. Then gone.\n\n      She rifles in the glove compartment and pulls out the flare,\n      sticks it in her pocket.\n\n      She leans under the dash and manually pops the trunk.\n\n<b>75                                                                 75\n</b><b>      EXT.   EDGE OF WOODS - EVENING\n</b>\n      Della runs outside to the back of the car and feels about in\n      the trunk.\n<b>\n</b>                                               Scene 75Page 40\n<b>       \n</b>\n\n      She throws carrier bags full of wrapping paper to the side as\n      she searches. Pulls out a lug wrench from underneath and then\n      a small tool box.\n\n      She hears the screech of a car's wheels spinning in mud.\n\n<b>76                                                                76\n</b><b>      EXT. ROUGH ROAD - EVENING\n</b>\n      Della turns to see headlights in the distance on the road\n      behind, pointing upwards.\n\n<b>                            DELLA\n</b>                Huh!\n\n      The Plymouth must have skidded and got stuck in the mud.\n\n<b>77                                                                77\n</b><b>      EXT. EDGE OF WOODS - EVENING\n</b>\n      She closes the trunk softly then runs to the front of the\n      car, clutching the toolbox and the wrench. She reaches back\n      into the car and unlatches the hood from underneath the dash.\n      Pop. She softly closes the door again. Punches her way\n      through the branches. Slides her fingers under the hood,\n      pries up the lever. It pops up only a few inches.\n\n<b>                            DELLA\n</b>                Damn!\n\n      She tries to manually lift it. But it's heavy with the weight\n      of pine branches.\n\n      Voices drift towards her.\n\n<b>                          TOMAS (O.S.)\n</b>                Keep hitting on the gas and you\n                gonna dig them wheels into a dirt\n                grave.\n\n<b>                          CHUCKIE (O.S.)\n</b>                Save yo talk and get out and push.\n\n      The sound of car doors opening, feet squishing into the mud\n      and cussing. The boys materialize in the light from the\n      headlights.\n\n<b>                            TOMAS\n</b>                Hell, no.\n\n<b>                            HUEY\n</b>                Shit!\n<b>\n</b>                                               Scene 77Page 41\n<b>       \n</b>\n\n<b>                          CHUCKIE (O.S.)\n</b>                What's aggravating you now?\n\n<b>                          HUEY\n</b>                Our new sneakers are stuck up in\n                the dirt like they was last years.\n\n      Doors slam and two sets of footsteps join the others.\n\n<b>                          CHUCKIE\n</b>                Soon as we taken care o' Mrs.\n                Podunk you and the Spanish dancer\n                can hit the next mall. But first\n                you fakers best haul this rider out\n                of the filth.\n\n<b>                          VINH\n</b>                Stupid ass car got nowhere else to\n                go. There's nothing but trees up\n                ahead.\n\n<b>                          TOMAS\n</b>                Screw the car, Chuckie. Case you\n                forgot we got a witness on the\n                loose! I ain't want to end up in\n                the clink as some chimp's prison\n                pillow.\n\n<b>                           CHUCKIE\n</b>                Trust me dog, hoe's going down\n                execution style before we see the\n                other side o' them bars.\n\n      Della drops the hood. It makes a faint squeak but doesn't\n      slam down, seems it's stuck open these last few inches.\n\n<b>                          TOMAS\n</b>                Yo talk a real mob threat, Chuckie.\n                But what if she gone already?\n\n      Chuckie's eyes scan the housing estate.\n\n<b>                          CHUCKIE\n</b>                She ain't gone.\n\n      Della frantically sweeps pine branches and cones from the\n      hood. But some larger branches are jammed, wedged by the\n      broken tree.\n\n      When she looks back over for the boys she sees the car\n      headlights are off and there's no sign of them.\n<b>\n</b>                                                Scene 77Page 42\n<b>       \n</b>\n      She stands stock still, listening, scanning the landscape for\n      a sign of them.\n\n      The sound of glass shattering breaks the silence.\n\n      Della jumps out of her skin, spins around. Her eyes settle on\n      a light in the distance.\n\n<b>78                                                              78\n</b><b>      EXT. ROUGH ROAD - EVENING\n</b>\n      The light illuminates the small cabin of an earth moving\n      truck. The cabin glows like a box in the darkness. There's a\n      figure inside: it's Chuckie. He's inspecting a powerful\n      construction flashlight. He switches settings from broad\n      light to concentrated beam. He points the beam through the\n      broken glass window onto Tomas, who's standing on a truck\n      tyre knocking out the rest of the glass with his elbow.\n      Chuckie leaps down through the broken window, pleased with\n      his find.\n\n      He switches it to broad beam, whistles.\n\n<b>                          CHUCKIE\n</b>                Won't be long before we find her\n                now. This baby could spot a needle\n                in a haystack!\n\n      The light dances around illuminating each of their faces for\n      seconds at a time. Eerie distorted glimpses. They're\n      traipsing along the rough road, through the mud, towards\n      Della. Their voices grow louder.\n\n<b>                          HUEY\n</b>                We caught up in this bitch's life\n                like a soap opera. We could just\n                bail, blast out of town like we was\n                never here.\n\n<b>                          CHUCKIE\n</b>                This boy loves weed so much he\n                tried to marry Juana.\n\n<b>                          HUEY\n</b>                Ain't no one cares about the Rent-a-\n                Pig. He just collateral damage to\n                the peeps at the mall.\n\n      Chuckie pushes Huey half playfully, half annoyed.\n\n<b>                          CHUCKIE\n</b>                Listen up skippy: SHE THE ONLY\n<b>                WITNESS.\n</b><b>\n</b>                                               Scene 78Page 43\n<b>       \n</b>\n\n<b>                          HUEY\n</b>                But if we hit the road now we'll be\n                five hundred miles away before they\n                find him....we could be drinking\n                cold beer and swimmin' in the\n                Atlantic....just like you promised.\n\n      Huey stares off into space like he's having a vision.\n\n<b>                          CHUCKIE\n</b>                We gotta take care of her. When she\n                gone. The problem gone. Right?\n                We'll head off then, Huey, just\n                like I said.\n\n      Huey shakes his head in disbelief.\n\n<b>                            HUEY\n</b>                We ain't   gonna make it, are we\n                Chuckie?   I ain't never gonna see\n                it. It's   over for that, isn't it\n                Chuckie?   Just say it.\n\n      Chuckie is taken aback by what Huey is saying. He walks away,\n      turns his concentration back to the flashlight. Huey calls\n      after him.\n\n<b>                          HUEY (CONT'D)\n</b>                She was just some stupid housewife\n                mouthin' off.\n\n<b>                          CHUCKIE\n</b>                GET REAL Huey! And shut the fuck up\n                about the stupid ocean.\n\n      Chuckie gets right up in Huey's face.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                I ever break a promise to you? I\n                ever let you down?\n\n      Huey takes his time to answer.\n\n<b>                          HUEY\n</b>                No Chuckie, you ain't.\n\n      Chuckie puts his hand on Hueys shoulder and gently pushes him\n      along the road.\n\n<b>79                                                              79\n</b><b>      EXT. EDGE OF WOODS - EVENING\n</b>\n      Della tries once more to lift the hood. It still won't budge.\n<b>\n</b>                                               Scene 79Page 44\n<b>       \n</b>\n\n      When she looks up the flashlight is dancing towards her.\n\n      Vinh sees the car.\n\n<b>                          VINH (O.S.)\n</b>                There's her Ford.\n\n      Della grabs the lug wrench and toolbox and ducks behind the\n      trees.\n\n      Della sees them approach her car.\n\n<b>                          VINH (CONT'D)\n</b>                There's broken glass everywhere.\n\n      Huey, now resigned to their mission, comments sadly.\n\n<b>                          HUEY\n</b>                Someone call her mama tell her to\n                lay out her black dress.\n\n      Della creeps softly along the edge of the trees. She holds\n      her breath. If she makes a sound, she's dead.\n\n<b>                          TOMAS\n</b>                Is she dead already?\n\n      The boys kick around the Explorer.\n\n<b>                          VINH\n</b>                Musta gone been thrown through the\n                windshield.\n\n      Della skims the trees, constantly checking behind her, to\n      where her antagonists check out the Ford wreck.\n\n      Chuckie points to some footprints.\n\n<b>                          CHUCKIE\n</b>                She ain't dead. Look! Her\n                footprints are all around.\n\n      When there's enough distance between them and her, she darts\n      from the forest's edge into the development and hides behind\n      a half finished house.\n\n<b>80                                                                 80\n</b><b>      EXT. UNFINISHED HOUSE 1 - EVENING\n</b>\n      She leans against a recently bricked wall, finally takes a\n      breath. The smell of fresh cement and putty fills her\n      nostrils.\n<b>\n</b>                                               Scene 80Page 45\n<b>       \n</b>\n\n      Rain gathers and drips from a nearby ledge\n\n      She peers around the side of the house.\n\n<b>81                                                                81\n</b><b>      EXT. EDGE OF WOODS/CONSTRUCTION SITE - EVENING\n</b>\n      Beyond the rows of plots of land with their sold signs, she\n      sees the boys still pacing and debating beside her Ford,\n      illuminated by the sweeping light rays of their flashlight.\n\n      Her eyes drift across the landscape of house foundations and\n      structures to the distant neon lights of the shopping mall.\n\n      When she looks back over for the boys, she sees that the\n      flashlight and the boys are gone.\n\n      She strains her eyes. Guesses that must mean they're off\n      looking for her in another direction.\n\n      She clutches the tool box and silently creeps between the\n      houses.\n\n      If she could just track along the edge of the development she\n      could maybe make it back to the Shopping Mall, to the twins.\n\n      An owl hoots from the trees behind. She freezes, eyes\n      sweeping the immediate area for danger.\n\n      She waits a moment, silence, then makes her way once more\n      between the edge of the development and the edge of the\n      trees.\n\n      She's trying desperately not to make a sound, praying to be\n      invisible, eyes darting around, evaluating every shape and\n      form.\n\n      On one side the dense wood of trees, predominantly pine, with\n      thick ancient trunks and tangled branches. On the other,\n      plots and structures of homes to be.\n\n      She keeps trudging on, skirting the edge of the trees,\n      following the lights in the distance.\n\n      She hears a loud thudding noise. Stops. Stops breathing.\n\n<b>82                                                                82\n</b><b>      EXT. PLANKS IN TARP - EVENING\n</b>\n      Ahead, piles of planks wrapped in black tarp block her view.\n\n      She braces herself, peers cautiously around, sees nothing.\n      She clutches the lug wrench and toolbox and steps forwards.\n<b>\n</b>                                                Scene 82Page 46\n<b>       \n</b>\n      Rain water from the branches of a nearby tree is dripping\n      down and collecting in a puddle in the middle of the tarp\n      causing the sound.\n\n      She breathes a sigh of relief.\n\n<b>83                                                                 83\n</b><b>      EXT. CEMENT PILES - EVENING\n</b>\n      Heaps of damp shingle and cement cause her to back up and\n      around past them and a cement mixer. She loses sight of the\n      neon mall lights. She panics.\n\n<b>84                                                                 84\n</b><b>      EXT. CONSTRUCTION SITE - EVENING\n</b>\n      She runs between the foundations of two houses.\n\n      She stops suddenly when she sees a giant shadow looming\n      across her path.\n\n      She ducks down the side of a half finished house.\n\n      Sees that it is the shadow of an earth moving truck.\n\n      She keeps going, between the houses, looking for a sign of\n      the mall lights.\n\n      She stops.\n\n      Just ahead, a flurry of footprints.\n\n      They're her footprints!\n\n<b>85                                                                 85\n</b><b>      EXT. UNFINISHED HOUSE 1 - EVENING\n</b>\n      She finds herself back where she started, at the same house.\n\n      The mall lights flicker in the distance as far away as they\n      always were. The Ford's still there ahead.\n\n      And then she sees the flashlight sweeping towards her.\n\n<b>                              DELLA\n</b>                       (under her breath)\n<b>                   NO! OH NO.\n</b>\n      She bites back a sob.\n\n<b>86                                                                 86\n</b><b>      EXT. CONSTRUCTION SITE - EVENING\n</b>\n      Della shrinks backwards between the houses. She ducks into\n      an unfinished doorway and watches the boys pass ahead.\n<b>\n</b>                                                Scene 86Page 47\n<b>       \n</b>\n\n      She runs into the house and out through the far side. Skirts\n      a row of plots of land. Then, she hears Chuckie's mocking\n      voice, echoing through the building site.\n\n<b>                            CHUCKIE (O.S.)\n</b><b>                DELLA!\n</b>\n      Della recoils. Did she just hallucinate?\n\n      How the hell do they know her name?\n\n      Can they see her? Or is he just shouting her name randomly\n      into the night?\n\n      Her eyes dart right then left then back again.   Nothing.\n\n      She runs down a row of house foundations.\n\n<b>                            CHUCKIE (CONT'D)\n</b>                Della!\n\n<b>87                                                                 87\n</b><b>      INT. UNFINISHED HOUSE 2 - EVENING\n</b>\n      Della dives into an unfinished house, hides behind a space\n      where a window will eventually be, looks out across the\n      building site. All is dark outside. And then she sees the\n      light several rows down, weaving between the houses.\n\n      She makes for another window at the opposite end of the\n      house. She sees the mall lights and decides to head once more\n      towards them.\n\n<b>88                                                                 88\n</b><b>      EXT. CONSTRUCTION SITE -EVENING\n</b>\n      She creeps out of the house and crosses several rows of\n      houses, then several more, heading towards the neon lights in\n      the distance.\n\n<b>89                                                                 89\n</b><b>      EXT. FENCE -EVENING\n</b>\n      She stops dead in her tracks. Straight ahead, a truly\n      chilling sight - her kids stuff from the car : Terri's little\n      anorak, Tammi's socks, mittens, strung along a short stretch\n      of wire fence.\n\n      Her feet start to sink into wet mud. She covers her mouth to\n      stop herself crying out.\n\n<b>90                                                                 90\n</b><b>      EXT. CONSTRUCTION SITE -EVENING\n</b>\n      Suddenly the development is illuminated by a huge\n      construction light.\n<b>\n</b>                                               Scene 91Page 48\n<b>       \n</b>\n\n<b>91                                                                 91\n</b><b>      EXT. MUD -EVENING\n</b>\n      Della ducks down, tries to run. The mud cloys at her feet.\n\n<b>92                                                                 92\n</b><b>      EXT. PLANK BETWEEN TWO HOUSES -EVENING\n</b>\n      She steps up onto a plank that stretches between the first\n      floors of two houses. She starts to cross when she sees their\n      silhouettes.\n\n<b>93                                                                 93\n</b><b>      EXT./INT. UNFINISHED HOUSE 3 -EVENING\n</b>\n      They're searching the house next door.\n\n<b>                          TOMAS\n</b>                Where'd little red riding hood git\n                to?\n\n<b>                          VINH\n</b>                She ain't leaving any bread crumbs\n                that's for sure.\n\n<b>                          HUEY\n</b>                When a nigga hungry, Imma wolf.\n\n<b>94                                                                 94\n</b><b>      EXT. PLANK BETWEEN TWO HOUSES - EVENING\n</b>\n      She backs up, slips, slides off the plank, falls into the\n      mud, catches herself on some barbed wire.\n\n<b>                          CHUCKIE (O.S.)\n</b>                What was that?\n\n      The wire drives through her coat and into her right shoulder.\n\n      She jerks away but the length of loose barbed wire follows.\n      She bites her lip to prevent a pained response.\n\n      She's caught in its spiral like a trapped animal. She spins\n      around and physically pulls the wire from her back, tearing\n      her coat.\n\n      She casts the wire away from her. Winces.\n\n<b>95                                                                 95\n</b><b>      INT. UNFINISHED HOUSE 4 (FOUNDATION) -EVENING\n</b>\n      She crawls into the foundations of a nearby house, underneath\n      the floorboards which are lain roughly across to form a first\n      floor. She huddles in a dark corner. It's very quiet and\n      cramped. She tries not to move, not to breathe. The smell of\n      the wet earth underneath makes her feel nauseous. A moment\n      passes. It feels like an infinity.\n<b>\n</b>                                               Scene 95Page 49\n<b>       \n</b>\n\n      She starts to creep along towards a gap in the planks to see\n      if she can see anything above. Just as she approaches the gap\n      she hears.\n\n      The sound of footsteps above her.\n\n      She freezes.\n\n      The footsteps make erratic rhythms across the planks.\n\n      She silently undoes the catch of the toolbox. Her hands are\n      shaking. She lifts the lid. She rakes around inside for\n      tools, comes across several kids toys instead! In shock, she\n      rakes around some more, trying to find something else,\n      something more dangerous, anything. To her surprise the only\n      tools inside are a pathetic little screwdriver and a small\n      crescent wrench. The kids must have borrowed the other tools\n      replacing them with the toys. She gives up, closes over the\n      lid.\n\n      Then suddenly:\n\n<b>      BOOM\n</b>\n<b>96                                                               96\n</b><b>      INT. UNFINISHED HOUSE 4 -EVENING\n</b>\n      The whole house is illuminated. She looks up to see four\n      faces looking down at her. Chuckie points the gaze of a\n      powerful flashlight directly into her eyes.\n\n      The beam almost blinds her. She tries to look away but\n      Chuckie focuses it right in her eyes.\n\n<b>                          CHUCKIE\n</b>                Peek a boo!\n\n      She shrinks back towards the wall. Her mouth feels dry, so\n      dry. Tomas lifts several planks up and casts them away so\n      they can see her. She's cornered.\n\n      Chuckie then lowers the flashlights direction and sweeps it\n      voyeuristically down across her body.\n\n      The light lingers on her breasts. Huey whistles\n      appreciatively, picks the game back up from the parking lot.\n\n<b>                          HUEY\n</b>                Yo left without yo goodbye kiss.\n\n      The light sweeps past Huey's hips. The sound of a zipper. The\n      light sweeps back up onto Della.\n<b>\n</b>                                               Scene 96Page 50\n<b>       \n</b>\n\n<b>                          CHUCKIE\n</b>                You a window shopper little\n                brother. You ain't never even done\n                the old in and out before.\n\n      Waves of pain spasm through Della's shoulder.\n\n      The boys snigger.\n\n<b>                          HUEY\n</b>                Imma just a young playa tryin' to\n                put my bid in.\n\n      Tomas leans down towards Della. Chuckie moves the flashlight\n      to illuminate them both. Tomas drains the last dregs from a\n      bottle of Bud, tosses the empty bottle down into the\n      foundations. It rolls into the darkness.\n\n      Della shudders. She clutches the lug wrench against her coat\n      behind the tool box and tries to disappear into the wall.\n\n<b>                          TOMAS\n</b>                Don't worry, when we done wit you\n                we send yo back in yo trunk to Mr.\n                Podunk.\n\n      Tomas reaches down and pulls Della up to standing by the coat\n      collar. He then yanks the coat down over her shoulder. The\n      white shirt she wears underneath is damp with sweat making\n      the form of her breasts very clear.\n\n      Chuckie keeps the light focused right on her.\n\n      Tomas slides his index finger down across Della's neck\n      towards her breasts.\n\n      Della claws at Tomas' face with the nails of her free hand.\n      He staggers to the side holding his cheek and cursing. Her\n      chewed nails haven't left any dents, but she stunned him.\n\n      The others laugh.\n\n      She shrugs the coat back over her shoulders and pulls it\n      tight across herself, once again clasping the toolbox close\n      to her side.\n\n<b>                          TOMAS (CONT'D)\n</b>                Don't want to play nice? Puta!\n\n      He moves towards her, face twisted with hate, arm raised.\n<b>\n</b>                                               Scene 96Page 51\n<b>       \n</b>\n\n<b>                          CHUCKIE\n</b>                Back off five minutes, my Ghetto\n                brother.\n\n      Tomas glares at Della, then lowers his arm. Spits on the\n      ground instead. Turns back to the boys. Chuckie moves\n      forwards and focuses on Della's box?\n\n<b>                          CHUCKIE (CONT'D)\n</b>                What's with the man size crast?\n\n      Della doesn't answer.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                You running with the family jewels?\n\n      Della still doesn't answer.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                You rob a bank this morning, Della?\n\n      Della remains determinedly mute.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                Least yo learned something tonight\n                Della honey?\n\n<b>                          VINH\n</b>                Yeah, like how to quit mouthing if\n                you wanna avoid drama.\n\n<b>                          CHUCKIE\n</b>                You must be wondering how we come\n                to know your name.\n\n      Chuckie giggles. Della shivers.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                You screwed up Della Myers. Left\n                your purse in the Ford.\n\n      Chuckie holds up her driving licence and examines it.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                What a shitty photo!\n\n      Chuckie nods to Vinh. Vinh passes his lighter to Chuckie.\n      Chuckie lights the licence on fire. The plastic burns black\n      and toxic. The flame annihilates Della's name, her date of\n      birth, her face. Pieces of plastic unfurl and drift up\n      through the empty windows and doors of the unfinished house.\n<b>\n</b>                                                Scene 96Page 52\n<b>       \n</b>\n\n<b>                          CHUCKIE (CONT'D)\n</b>                Guess you won't be needing it no\n                more.\n\n      Della stares defiantly, fighting back the internal nausea\n      caused by this symbolically brutal act.\n\n      Chuckie maneuvers the light back in her eyes then right back\n      on his own menacing face. Then, back again on her face. She\n      becomes disoriented.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                So what's in the box?\n\n      Della remains mute, looks away from the beam.\n\n<b>                          HUEY\n</b>                Yo think she carrying the big\n                notes, maybe some ice?\n\n<b>                          CHUCKIE\n</b>                Nah, it ain't about to rain\n                diamonds, Huey. But maybe she\n                cashed in her life savings. Planned\n                to take off, start a new life.\n\n      Della tries to swallow but her throat is too dry.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                That right Della?\n\n<b>                          TOMAS\n</b>                You got enough scratch in there to\n                grease us up with?\n\n      She knows there is nothing that would buy them off and the\n      knowledge sinks like a stone deep into her gut.\n\n      Chuckie follows her face with the beam. She tries to dodge\n      its glare in her eyes. But he maneuvers it like a\n      surveillance camera.\n\n      His voice takes on a meanness that makes the back of her neck\n      tingle.\n\n<b>                           CHUCKIE\n</b>                Open it.\n\n      They crowd closer toward her.\n\n      Dark forms with eyes glinting. Their voices echoing.\n<b>\n</b>                                               Scene 96Page 53\n<b>       \n</b>\n\n<b>                          VINH\n</b>                Open the box else we put you in\n                trauma.\n\n<b>                             CHUCKIE\n</b><b>                OPEN IT!\n</b>\n      Della all but screams.\n\n<b>                          DELLA\n</b>                Okay!\n                I'll open it.\n\n      Della's brain races.\n\n      Her hands move slowly.\n\n      She rests the lug wrench in her left palm under the base of\n      the tool box and with her right hand unsnaps the catch.\n\n      She holds the far end of the lid up to shield her right hand\n      from the beam as she slips it inside the box.\n\n      A prayer plays silently across her lips as her fingers feel\n      the cool steel and shape of the small crescent wrench.\n\n      She curls them around its handle and grips tight. A surge of\n      nervous energy courses through her veins.\n\n<b>                          TOMAS\n</b>                She ain't got nuthin'. Let's just\n                take that pussy and git going.\n\n      He moves towards her.\n\n      In a flash, she withdraws the crescent wrench. She cocks her\n      wrist back and hurls the tool, snaps it just like her daddy\n      taught her to play baseball.\n\n      The wrench flies up and across the house.\n\n      With a CRUNCH, it catches Chuckie right in the collar bone,\n      right side.\n\n      He screams. Drops the flashlight. Drops to his knees holding\n      his throat.\n\n      Della snaps the tool box shut and makes a run for it. She\n      throws herself up onto the first floor and darts between\n      Tomas and Huey.\n<b>\n</b>                                               Scene 96Page 54\n<b>       \n</b>\n\n      Huey lunges for her but trips over a loose plank, lands with\n      his face down, biting on the plank's edge.\n\n      Della catches a peripheral glimpse of Tomas leaping towards\n      her, but his leading foot slams down instead onto the back of\n      Huey's neck. Grinds Huey's face into the plank with a hideous\n      THUD. Huey's neck SNAPS back smiley style. Huey's scream\n      gurgles into the night. Huey's body falls through the space\n      in the floorboards landing with a thud in the foundations\n      below.\n\n      Tomas falls away, cursing in horror.\n\n<b>                            TOMAS (CONT'D)\n</b>                Maricon!\n\n      Della makes a run for the doorway. She jumps down onto the\n      muddy lot and heads off across the development. The darkness\n      quickly swallows her.\n\n      Behind her, Vinh slumps through the house.\n\n<b>                          VINH\n</b>                What the fuck, niggaz?\n\n<b>                            CHUCKIE\n</b>                Shut up.\n\n<b>                            VINH\n</b>                You hurt?\n\n<b>                          CHUCKIE\n</b><b>                SHUT THE FUCK UP.\n</b>\n      Chuckie slides down to be beside Huey in the foundations.\n\n<b>                          CHUCKIE (CONT'D)\n</b>                And don't be using the N word. You\n                ain't representing. GOT IT. That\n                right Huey? HUEY. Get up Huey. HUEY\n<b>                GET UP!\n</b>\n      Tomas staggers up to standing.\n\n<b>                          TOMAS\n</b>                Jesus hijo de maria el virgene.\n\n<b>                            VINH\n</b>                What?\n\n      Vinh moves towards Chuckie who is crouched over Huey.\n<b>\n</b>                                               Scene 96Page 55\n<b>       \n</b>\n\n<b>                           CHUCKIE\n</b>                 My little brother.\n\n      Tomas approaches.\n\n      He pushes Chuckie gently out of the way so he can see.\n\n      He stares down at Huey's bloody meshed face. Tomas staggers\n      backwards and crosses himself.\n\n<b>                           TOMAS\n</b>                 Mamacita! Madre de Dios!\n\n      Chuckie punches Tomas' leg.\n\n<b>                           CHUCKIE\n</b>                 You tread on my boy's face. YOU\n<b>                 KILLED HIM.\n</b>\n<b>                           TOMAS\n</b>                 I didn't kill him. I didn't kill no\n                 one.\n\n      Tomas pushes Chuckie backwards.\n\n<b>                           TOMAS (CONT'D)\n</b>                 She did it. She killed him.\n\n      Chuckie and Tomas stare at each other.\n\n<b>                           TOMAS (CONT'D)\n</b>                 I'm gonna cross that bitch out.\n\n<b>97                                                              97\n</b><b>      EXT.   WOODS - EVENING\n</b>\n      Della runs for her life. She makes straight for the cover of\n      the trees. She hesitates for just a moment after the first\n      layer of Pines. It's pitch black beyond. Then she steps in.\n\n      She follows her breath into the icy blackness.\n\n      Branches and foliage scratch against her face.\n\n      She grapples about, looking for hiding places between the\n      dark shapes and forms. Steps between tree roots and shrubs.\n\n      Her eyes begin to adjust. She can now make out the\n      difference between the clumps of darkness and tell, looking\n      back, where the edge of the woods begins. A construction\n      light shines behind like a distant moon.\n<b>\n</b>                                      Scene 97Page 56\n<b>       \n</b>\n\n      She pushes between the branches of indistinguishable trees,\n      some thick and knotted, others slight and brittle. Only the\n      evergreens still have their foliage.\n\n      Looking back constantly to the edge of the trees for a sign\n      of the boys.\n\n      Fear drives her further into the woods towards where the\n      trees grow even more densely together. Where there just may\n      be the right place to hide.\n\n      She stops for a second to catch her breath.\n\n      The handle of the toolbox has chaffed her right palm. She\n      changes hands.\n\n      God, that boy Huey! He really died back there. She heard the\n      sound of it. The horrific sound of him dying a stupid\n      pointless death.\n\n      It could have been her.\n\n      There has to be some way out of this nightmare.\n\n      Ahead, a dead tree with spectral branches blocks her path.\n      She steps around its huge trunk and tangle of roots.\n\n<b>                          CHUCKIE\n</b><b>                DELLA!\n</b>\n      Chuckie's voice drifts towards her.   She ducks down among the\n      roots.\n\n      Her eyes scan the darkness.\n\n      No moving shapes nor forms. No sound. No flashlight. Just\n      shadowy clumps of trees.\n\n      Should she stay put or should she run?\n\n      Then she sees it. The flashlight weaving through the pines\n      ahead.\n\n      She pushes further in among the roots, tries to make herself\n      invisible.\n\n      The flashlight beam sweeps across the forest floor towards\n      her. One set of footsteps crunches through the foilage.\n\n      She holds still, terrified.\n\n      The flashlight pauses on the dead tree, the roots.\n<b>\n</b>                                       Scene 97Page 57\n<b>       \n</b>\n\n      Della stops breathing.\n\n      Then, the light sweeps past and on into the woods.\n\n      She waits until it disappears before stepping out of her\n      hiding place.\n\n      She creeps back in the opposite direction, figuring if\n      they're in the woods now she should get out.\n\n      Her eyes search for the construction light, which indicates\n      the edge of the wood.\n\n      She heads in the direction of the light, painfully aware that\n      one noisy footfall could alert her pursuers. She steps\n      between leaves and roots as delicately as a ballet dancer.\n\n      The construction light grows closer.\n\n      The light abruptly goes out.\n\n      She stops, eyes desperately searching the trees.\n\n      She resumes in the direction she was headed. Tries to keep\n      calm.\n\n      But the woods are impenetrable. Layers of trees and shrubs,\n      and then more trees. Deep in the cold dark places there are\n      patches of left over snow. She's losing her bearings.\n\n<b>98                                                                 98\n</b><b>      EXT. X'D TREES - EVENING\n</b>\n      Ahead, the chilling sight of four luminous Xs glowing in the\n      dark forest almost makes her heart stop. She realizes the\n      crosses are painted on the trunks of several trees, marking\n      them for death. She shivers.\n\n<b>99                                                                 99\n</b><b>      EXT. WOODS -EVENING\n</b>\n      She backs up, starts off in the opposite direction.\n\n      And there it is again. The flashlight sweeping through the\n      trees in the distance.\n\n      She stops, close to screaming, then when the flashlight\n      disappears, runs off in yet another direction.\n\n      She slows to take a breath, notices the butts of several\n      cigarettes still smoking in the dirt close to her feet.\n<b>\n</b>                                       Scene 99Page 58\n<b>       \n</b>\n\n<b>                             DELLA\n</b>                   (muttering to herself)\n                   Shit! Oh Shit!\n\n      She trudges on, pushing between the branches, no clue where\n      she is headed.\n\n      The further she treads, the quieter it becomes. So quiet she\n      can hear her own footfalls and the sound of the trees\n      breathing.\n\n      Then, she spots the light again, in the distance, shining out\n      over the forest.\n\n      Thank God!\n\n      She trudges up a slope ahead, clinging onto branches and\n      shrubs to help pull herself up.\n\n<b>100                                                              100\n</b><b>      EXT. LEDGE - EVENING\n</b>\n      The light grows closer. She climbs up onto a ledge.\n\n      A loud noise startles her. It's music. Rap music. Blasting.\n\n      Della pushes her way through to the edge of the trees.\n      Sees....\n\n<b>101                                                              101\n</b><b>      EXT.   CLEARING - EVENING\n</b>\n      The woodland ahead slopes down into a clearing, where a huge\n      ghetto blaster sits on a pile of felled trees. Young pines\n      about to become Christmas trees. It's blasting out a hip hop\n      anthem for a dead homie. A construction light illuminates the\n      clearing.\n\n      A ghostly Vinh, head hung low, moves to the music, bottle of\n      beer in hand.\n\n      Propped up against a tree stump sits the body of Huey, arms\n      crossed over his torso, hood pulled up to cover his face.\n\n      The scene is so surreal that Della is drawn closer. She\n      creeps along the edge of the trees.\n\n      As she moves, she kicks back on some dirt. It tumbles\n      downhill into the gulch. She freezes.\n\n      But nobody notices.\n\n      She slips invisibly between the trees and watches as Tomas\n      enters the clearing.\n<b>\n</b>                                               Scene 101Page 59\n<b>       \n</b>\n\n       Tomas stops and watches Vinh.\n\n       Vinh continues to get into the music in his solemn Japanese\n       punk style. The juxtaposition between the hard core rap music\n       and the serious vibe that Vinh is sending out shows us that\n       this is really important music to him.\n\n       It's a theatrical tableau -\n\n       Della overhead, looking down on the clearing.\n\n       Vinh transfixed by the music.\n\n       Tomas stone silent, watching Vinh.\n\n       It plays out for a poignant moment. Like they're all part of\n       some spiritual rite about to be consummated.\n\n       Vinh pours some beer onto the ground at Huey's feet. A small\n       tear runs down his stoic face.\n\n       Then CLICK. The blaster is abruptly turned off by Chuckie who\n       appears out of the shadows behind it.\n\n       He stares a beat at Vinh like he can't believe what he's been\n       seeing.\n\n       Vinh keeps on moving like he's in a trance.\n\n<b>                           CHUCKIE\n</b>                 What the fuck you doing?\n\n       Vinh doesn't reply. Stares down at the ground, keeps on with\n       his weird dance. Chuckie moves towards him. Tomas grabs\n       Chuckie, tries to stop him from going for Vinh, but Chuckie\n       shrugs him off.\n\n       Chuckie reaches out and shakes Vinh. No response. He shakes\n       him again.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I asked you what your deal is, sand\n                 dancer?\n\n       The second shake sort of breaks Vinh out of his trance. He\n       shivers.\n\n<b>                           VINH\n</b>                 It's a tribute. A gesture.\n\n<b>                           CHUCKIE\n</b>                 A what?\n<b>\n</b>                                               Scene 101Page 60\n<b>       \n</b>\n\n       Vinh stares down at the dirt at his feet.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Your brain even smaller than 'em\n                 slits for eyes?\n\n       Vinh slouches defiantly over to the blaster and presses track\n       8 replay.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Keep on banging out that ghetto ass\n                 shit and you'll alert every cop in\n                 Podunk county.\n\n<b>                           VINH\n</b>                 It's for Huey. Our dead homie.\n\n       The song starts again. Chuckie looks at him incredulously,\n       shouts above the music.\n\n<b>                           CHUCKIE\n</b>                 You checked out, right?\n\n<b>                           VINH\n</b>                 He loved that track.\n\n       Vinh snorts back a sob. He hugs himself into a hunch and\n       starts dancing again.\n\n       Chuckie loses it. He slaps Vinh.\n\n<b>                           CHUCKIE\n</b>                 Get a grip, skippy.\n\n       Vinh rubs his face. He's getting a grip all right. Chuckie\n       slams off the blaster.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Huey's DEAD. And ain't no requiem\n                 gonna resurrect his ass. He down\n                 under the ground now with the real\n                 men of respect.\n\n       The three boys stand somberly in silence, each paying\n       internal homage to their dead friend. Chuckie hardens his\n       heart against the tears that threaten to flow. Tomas\n       trembles, mumbles.\n\n<b>                           TOMAS\n</b>                 I didn't mean it. I didn't do it. I\n                 didn't mean to kill him.\n<b>\n</b>                                               Scene 101Page 61\n<b>       \n</b>\n\n       This breaks the moment. Chuckie snaps back.\n\n<b>                           CHUCKIE\n</b>                 Well he dead. That's it for him.\n                 OVER. But we still here. Hell,\n                 yeah. Payback's gonna be a real\n                 bitch for a real bitch.\n\n       Vinh wipes away his tears.\n\n<b>                           VINH\n</b>                 She probably gone by now.\n\n<b>                           CHUCKIE\n</b>                 You best hope not, genius. She\n                 gone, we gone.\n\n       Chuckie paces around the circumference of the clearing.\n\n<b>                              CHUCKIE (CONT'D)\n</b><b>                 DELLA!\n</b>\n<b>102                                                              102\n</b><b>       EXT. LEDGE - EVENING\n</b>\n       Della's been watching the scene unfold, a captive audience,\n       attentive and terrified.\n\n       Slowly she tears her eyes away from the boys. She backs away\n       from the edge and right into the sharp branch of a big old\n       tree. The branch digs into that point in her shoulder she\n       hurt earlier on the barbed wire.\n\n       She reaches up to feel it and pulls her hand away bloody. She\n       reaches into her coat pockets for a tissue. Nothing. Feels\n       something in her pants pocket.\n\n       She pulls out not a tissue but a sheet of folded paper.\n\n       She unfolds it. It's Tammi's drawing. The one from the\n       beginning.\n\n       The stick figure family holding hands and \"Mommy - We love\n       you\" written in stars.\n\n       Della's lost in the drawing. Her eyes drink in every mark and\n       color and word. She sees that the male figure is slightly\n       separate. That the children stick figures have frightened\n       eyes and cling to the female. That the sky is turbulent. The\n       stars clear and bright. The words...\n\n       A tear escapes from underneath her eyelid. Then another. A\n       sob.\n<b>\n</b>                                               Scene 102Page 62\n<b>       \n</b>\n\n       She might never see her kids again.\n\n       Another sob. She heaves with the release of emotion.\n\n       More tears escape. Another sob. She tries to bite it back.\n       Wills herself to stop.\n\n       Finds that rage takes sorrow's place. Rage and self\n       recrimination.\n\n       Goddamit! She's gonna be raped and killed because of some\n       stupid note! And God knows what will become of the kids.\n\n       Kenneth always told her she had a temper. That she reacts\n       without thinking of the consequences. This time the bastard\n       was right.\n\n       She looks again at the picture.\n\n       Chuckie's voice booms out into the night.\n\n<b>                           CHUCKIE (O.S.)\n</b><b>                 D-E-L-L-A, H-O-N-E-Y.\n</b>\n       She folds the picture up carefully and puts it back in her\n       pocket.\n\n       Della edges further into the trees and disappears into the\n       darkness.\n\n       There's rustling in the darkness. Tomas pushes through the\n       edge of the trees, making animal calls with his right hand\n       curled around his mouth. The flashlight illuminates him from\n       behind.\n\n       Chuckie follows him operating the light in a mockery of\n       classic noir style. Vinh slouches behind them.\n\n       Tomas heads along the ledge, straight past the spot where\n       Della stood only moments before. Tomas doubles back.\n\n       Thomas stops, sniffs.\n\n<b>                           TOMAS\n</b>                 I can smell her Bulgari.\n\n       Chuckie's behind him surveying the area with the flashlight.\n       He finds several footprints by the tree.\n\n<b>                           CHUCKIE\n</b>                 She was right here. Must a saw your\n                 dumb ass tribute and everything.\n<b>\n</b>                                               Scene 102Page 63\n<b>       \n</b>\n\n       Vinh glares at Chuckie. Chuckie grins at Tomas.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Bulgari? She looks more like she\n                 rocks that number five shit.\n\n<b>                           TOMAS\n</b>                 It Bulgari, dude. My Dad's bitch\n                 bathes in it.\n\n       Chuckie points the flashlight towards where the ledge ends\n       and a steep incline begins.\n\n<b>103                                                               103\n</b><b>       EXT. STEEP INCLINE - EVENING\n</b>\n       The flashlight illuminates a set of prints descending down\n       the incline.\n\n<b>                           CHUCKIE\n</b>                 There more of her footprints.\n\n       Tomas and Vinh just stand like zombies.\n\n       Chuckie pushes Vinh.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 What you waiting on? Jackie Chan?\n\n       Vinh plods clumsily down the incline, followed by Tomas.\n\n       Chuckie sweeps the flashlight across the gulch looking for a\n       sign of Della.\n\n       Chuckie shifts his focus to climb down the steep slope. As\n       the light sweeps back across the gulch we catch a glimpse of\n       Della between some rocks at the far side. But the boys' eyes\n       are elsewhere, focused on the steep incline ahead of them.\n\n       Della quickly ducks, draws her toolbox in tight and crouches\n       low between the rocks. She watches the boys carefully as they\n       climb down the gulch.\n\n       There's the sound of a stumble followed by a splash.\n\n<b>                              VINH (O.S.)\n</b><b>                 SHIT!\n</b>\n<b>                           TOMAS (O.S.)\n</b>                 What now, cabron?\n\n<b>                           VINH (O.S.)\n</b>                 Fell in a frozen ass stream.\n<b>\n</b>                                               Scene 103Page 64\n<b>       \n</b>\n\n       Chuckie sweeps the flashlight towards them. Della sees Vinh\n       trudging out of the stream, Tomas descending the last few\n       feet of the other side of the gulch and Chuckie midway up.\n\n       Vinh jumps up and down trying to kick the water out of his\n       sneakers.\n\n<b>                           CHUCKIE\n</b>                 Zipperhead!\n\n<b>                           VINH\n</b>                 Kon'aro Kusotare.\n\n<b>                           CHUCKIE\n</b>                 You know we don't speak the Chinky.\n\n<b>                           VINH\n</b>                 What's your game, Chuckie? We left\n                 stumbling around in the dark while\n                 you hog the flashlight.\n\n<b>                           CHUCKIE\n</b>                 I stole it. I get to use it. That's\n                 how it works. That right Tomas?\n\n<b>                           TOMAS\n</b>                 Right on, dog.\n\n       Chuckie jumps down from the last rock and joins Vinh and\n       Tomas at the edge of the stream.\n\n<b>                           VINH\n</b>                 What if I steal it from you?\n\n<b>                           CHUCKIE\n</b>                 There you go, bro.\n\n       He hands the flashlight over to Vinh. Vinh reaches for it.\n       Chuckie pulls it away.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 April Fool. Naw, wait a minute, it\n                 ain't April. Must be Christmas\n                 fool.\n\n       Tomas smirks. Vinh hangs his head down. They search for more\n       prints, can't find any in the immediate area. Chuckie shines\n       the flashlight at the foot of a big rock.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Her footprints disappear at the big\n                 rock.\n<b>\n</b>                                               Scene 103Page 65\n<b>       \n</b>\n\n       A beat. Della clutches the lug wrench in her right hand.\n\n       Vinh shivers violently.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Head on up and search the slope.\n                 I'll guide your way with the\n                 flashlight.\n\n       Chuckie sweeps the flashlight across the gulch. Della ducks.\n\n       Della needs to get out of there and fast.\n\n       They begin to ascend the rocks. Chuckie keeps the flashlight\n       slightly ahead of them.\n\n       Della crawls stealthily between and behind the rocks, keeping\n       as low as she can. Dodging the approaching light.\n\n       The boys crawl across and up and between the rocks with the\n       dexterity of animals. Della's so low she's scraping her knees\n       and hands to shreds.\n\n       She can see ahead where the rocks end and the trees begin.\n       What was she thinking hiding here? It was too exposed.\n\n<b>                           TOMAS\n</b>                 We gonna put yo ass on ice, bitch!\n\n       God please help her make it back into the cover of the trees.\n\n       Della almost vomits.\n\n       Her hand grasps the last rock at the top of the gulch. She\n       pushes the toolbox up on the ledge. Her strength is ebbing\n       but she tries to hoist herself up. The flashlight sweeps by.\n       She lets go of the ledge and ducks. The flashlight sweeps by\n       again.\n\n       She huddles in behind a rock. Waits a beat.\n\n<b>                           TOMAS (CONT'D)\n</b>                 You going home in a casket tonight.\n\n       Oh shit, they're approaching fast. She tries again to hoist\n       herself up. She's almost up when the flashlight sweeps by\n       again.\n\n       This time, it catches her.\n\n<b>                           CHUCKIE\n</b><b>                 THERE SHE IS, TOP OF THE GULCH!\n</b><b>\n</b>                                               Scene 103Page 66\n<b>       \n</b>\n\n       She practically throws herself over the ledge. Tomas scurries\n       to the top faster than lightening, catches her leg as she\n       crawls from the edge.\n\n       THUD. She kicks him in the face.\n\n       Della grabs the toolbox. Makes a run for it.\n\n<b>                           TOMAS\n</b><b>                 AHHHHHEEEEEEHHHHH!\n</b>\n       Tomas falls back from the gulch-side, loosening several\n       rocks. The rocks tumble downhill, hit Vinh.\n\n<b>                              VINH\n</b><b>                 AHHHHHHH!\n</b>\n       Chuckie scales the gulch behind them. Vinh rubs his head.\n       Sees something between the trees. Thinks it's Huey.\n\n<b>                              VINH (CONT'D)\n</b>                 Huey?\n\n       He starts towards the brush.\n\n<b>                           VINH (CONT'D)\n</b>                 Is that you, homie?\n\n       Chuckie catches up with Vinh, breathless from climbing fast.\n       Vinh points into the brush.\n\n<b>                           VINH (CONT'D)\n</b>                 I saw Huey, there in the brush.\n\n<b>                              CHUCKIE\n</b>                 What?\n\n       Chuckie looks around, hoping against hope that Vinh may be\n       right, that Huey may just be alive. Vinh becomes perplexed.\n\n<b>                              VINH\n</b>                 I saw him.\n\n<b>                           CHUCKIE\n</b>                 Sure you did, bro.\n\n       Chuckie puts his arm around Vinh and helps him up the rock\n       side. Vinh is shivering so hard he's almost sobbing.\n\n       Just ahead Tomas pulls himself up and over the ledge.\n<b>\n</b>                                                 Scene 104Page 67\n<b>       \n</b>\n\n<b>104                                                              104\n</b><b>       EXT.   WOODS - EVENING\n</b>\n       Tomas catches up with Della, chases her into the trees.\n       Behind him Vinh hoists himself up over the ledge, then\n       Chuckie.\n\n       Della runs. Faster than she's ever run before. Practically\n       flies through the trees.\n\n       Her breath comes hard. His too, just behind her. Their\n       footfalls crash into the foliage.\n\n       It's dark, so dark. She's running blindly.\n\n       And they're right behind her. Tomas swipes at her. He just\n       misses. He swipes again.\n\n       A twisted shape looms ahead, almost blocks her path.\n\n       She runs right up to it then darts left at the last moment,\n       setting up Thomas who's right behind her.\n\n       Tomas runs into the stump of a big old tree trunk, hits\n       himself at groin level. He doubles over in pain.\n\n<b>                            TOMAS\n</b><b>                  CONEJO! AIN'T NUTHIN' CAN SAVE YO\n</b><b>                  ASS NOW.\n</b>\n       Della races on.\n\n       Thomas gathers himself together, picks up the chase.\n\n       But that moment's delay has bought her some time.\n\n       Her adrenaline pumps hard. Eyes darting for a hiding place\n       among the dark shapes and planes of the woods.\n\n<b>105                                                              105\n</b><b>       EXT. DEADWOOD PILE - EVENING\n</b>\n       There it is, a deadwood pile.\n\n       She throws herself down into its midst. The dried branches\n       jag and tear at her hands and face. She burrows down low, so\n       low she's right in the dirt. She peers between the branches.\n\n       Tomas's feet run by and disappear. She hears him circle the\n       area then turn back towards her.\n\n       A moment passes. She picks the next. Rises slowly and softly\n       from between the jagged branches clutching the lug wrench.\n<b>\n</b>                                       Scene 105Page 68\n<b>       \n</b>\n\n       And then there he is. Diving out of the trees towards her.\n\n       Della raises the lug wrench.\n\n       In the clouded moonlight it's an almost biblical image: a\n       woman rising from the brush wielding an iron black cross.\n\n       Tomas crashes towards her.\n\n       Della swings the lug wrench, hard, intensely, directly at\n       Tomas's face.\n\n       There is a THUD as the sharp arm of the lug wrench catches\n       him up under the chin. It sends him reeling.\n\n       He goes down face first.\n\n       Della gasps in horror, watches as:\n\n       Tomas pulls himself up onto his feet, comes towards her once\n       more.\n\n       Della swings the lug wrench back and strikes him across the\n       head.\n\n       He spins, clutches at his head, then reaches towards her\n<b>       AGAIN.\n</b>\n       She loses it. She swings the lug wrench towards him.    All the\n       years of pent up rage finally find their release.\n\n       The wrench catches up under his nose with a sickening CRUNCH.\n       It drives the cartilage up and into his face.\n\n       Blood spurts from the wound. He staggers backwards.\n\n       A shocked scream escapes from Della's mouth.\n\n<b>                            DELLA\n</b>                 Awwwrgh!\n\n       As she staggers backwards in the opposite direction.\n\n       Tomas tries to cry out but can only utter in pain.\n\n<b>                           TOMAS\n</b>                 Unnh! Unnh! Unnh!\n\n       He tries to pull the lug wrench out of his face. Spins.\n       Stumbles.\n\n       The flashlight beam travels past them.\n<b>\n</b>                                               Scene 105Page 69\n<b>       \n</b>\n\n<b>                           TOMAS (CONT'D)\n</b>                 Unnh!\n\n       Tomas crashes back into a tree. He loses consciousness. His\n       body slumps slowly down the tree trunk to the dirt. Blood\n       gushes from where the wrench meets his face. He looks like\n       he's dressed for Halloween.\n\n       Della just stares. Stares at Tomas, at what she did, what she\n       had to do.\n\n       Tomas' eyes are wide open, staring too, at nothing, dead.\n\n       The horror of having killed someone overwhelms Della. She\n       starts shaking with shock.\n\n       Vinh cries out for Tomas\n\n<b>                           VINH (O.S.)\n</b><b>                 TOMAS!\n</b>\n       The sound of footfalls crashing through the brush follows.\n\n<b>                           CHUCKIE (O.S.)\n</b>                 Curb the squealing. You a gangsta\n                 or a boy scout?\n\n       Vinhs voice is breathless and jittery.\n\n<b>                           VINH (O.S.)\n</b>                 Tomas's gone, Chuckie. I can feel\n                 it.\n\n       Della tears herself away from Tomas's body and staggers into\n       the deadwood to collect the toolbox. It glints, even in the\n       darkness.\n\n       She grabs it and runs for cover behind a tree.\n\n       Behind her in the near distance the chaotic sweeps of the\n       flashlight illuminates Vinh and Chuckie as they march through\n       the woods searching for Tomas.\n\n<b>                           CHUCKIE\n</b>                 Tomas is one hard son of a bitch.\n                 He got her strung up from a tree by\n                 now and you know it.\n\n       But Chuckie doesn't look so sure. Vinh charges ahead into the\n       darkness.\n<b>\n</b>                                               Scene 105Page 70\n<b>       \n</b>\n\n       Della flashes briefly into shot, running between the trees.\n       The flashlight sweeps by.\n\n<b>                           VINH\n</b>                 There's something over here.\n\n       Chuckie walks towards Vinh. Vinh takes the flashlight from\n       Chuckie and shines it towards a thick shape between three\n       trees.\n\n<b>                           VINH (CONT'D)\n</b>                 It looks like a body.\n\n       They close in on a muddle of shapes, bush and spidery tree\n       trunks. The flashlight illuminates a tree trunk long and\n       thick as a body.\n\n<b>                           CHUCKIE\n</b>                 It's a big old tree trunk, you\n                 paranoid gook.\n\n       Chuckie tries to take the flashlight back from Vinh but Vinh\n       won't give it. Chuckie doesn't persist. Vinh keeps going,\n       shivering and blustering.\n\n       Vinh senses something. He shines the flashlight behind the\n       tree trunk. Still nothing. Sweeps back.\n\n       Della darts between the evergreens behind them. She conceals\n       herself in between the trunks and branches. Braces herself,\n       waits for the right moments, the ones when they're not\n       looking, to run between the trees. Cognizant enough to know\n       they just want to find Tomas right now. She seems to be on\n       autopilot, becoming numb as the minutes stretch on.\n\n       She watches Vinh plod forward and through the brush. He hits\n       every inch of it with the flashlight. Sighs. Doubles back to\n       follow Chuckie.\n\n       Then, the flashlight catches a glimpse of something. Sweeps\n       back, illuminates Tomas's dead body, splayed out on the mud\n       at the foot of the tree, eyes staring wide, bloody, ghastly.\n\n       Tomas's Catholic cross pendant glimmers in the flashlight.\n\n       Silence until Vinh falls to his knees in front of Tomas,\n       tries to speak but only a whisper comes out.\n\n<b>                           VINH\n</b>                 Tomas.....IYAH!\n<b>\n</b>                                               Scene 105Page 71\n<b>       \n</b>\n\n       Chuckie realizes from Vinh's demeanor that something really\n       is wrong. He hesitates a moment, then rushes over to Vinh,\n       stares too at Tomas's body, gulps back the desire to scream.\n\n       He punches his fist hard into the tree behind Tomas' body\n       instead. A shower of pine needles rains down on them.\n\n       Chuckie grabs the flashlight and sweeps it away from the\n       body, grabs Vinh's arm, grounding him.\n\n       Vinh sobs and shakes.\n\n<b>                           VINH (CONT'D)\n</b>                 She gonna kill you and me next.\n                 We're all gonna die here. God knows\n                 what other tools she got in that\n                 box.\n\n<b>                           CHUCKIE\n</b>                 It was a stupid ass accident killed\n                 Huey. You know that. And Tomas....\n\n       Chuckie chokes up despite himself.\n\n       He stands up, brushes the pine needles off his tee shirt.\n\n       He paces back and forth.\n\n       He pulls the gun out from deep in his jeans.\n\n       Della creeps between the trees behind them. She appears for a\n       second or two, like a ghost, behind the next tree.\n\n       Chuckie defiantly fights back tears.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I promise you this.\n\n       He kisses the gun.\n\n<b>                            CHUCKIE (CONT'D)\n</b>                 This baby's gonna cancel her\n                 Christmas.\n\n       Della darts between the trees, faster now. Their voices\n       follow her.\n\n<b>                           VINH (O.S.)\n</b>                 Ain't no gun can kill a ghost gone\n                 bad.\n<b>\n</b>                                                 Scene 105Page 72\n<b>       \n</b>\n\n       She staggers deeper and deeper into the forest, into the\n       darkness.\n\n<b>                            CHUCKIE (O.S.)\n</b>                  You in America now, dude, where the\n                  ghosts bleed.\n\n       She hears a faint gurgle.\n\n       She slows, listens. It's the burble of a stream..\n\n       She listens hard. Traces the sound. Treads towards it.\n\n       There it is. Glistening, even in the dark.\n\n<b>106                                                               106\n</b><b>       EXT.   STREAM THROUGH WOODS - EVENING\n</b>\n       She steps between rocks, walks straight into the stream\n       below.\n\n       She stands ankle deep in the icy water with her eyes closed\n       clutching the toolbox.\n\n       The water gurgles faintly below her, so cold it almost sounds\n       like glass breaking.\n\n       The ghastly images of what just happened play out behind her\n       eyes like an inerasable movie of the psyche to be remembered\n       for all time.\n\n         She's talking to herself in a whisper.\n\n<b>                               DELLA\n</b>                  I'm sorry.\n\n       All she knows is that she just killed a boy. It may have been\n       in self defense but she killed him.\n\n<b>                            DELLA (CONT'D)\n</b>                  I'm so sorry!\n\n       The grief overcomes her silently. Her face crumples. Her\n       stomach muscles spasm and wrack through her body. A grief so\n       deep tears would be a relief.\n\n<b>                            DELLA (CONT'D)\n</b>                  Where are you, God?\n\n       She falls to her knees in the stream. Holding herself and\n       rocking. The freezing water seeps up into her clothes, her\n       hair.\n<b>\n</b>                                       Scene 106Page 73\n<b>       \n</b>\n\n<b>                           DELLA (CONT'D)\n</b>                 Please, I just want to see my\n                 babies again.\n\n       Her rocking slows until it stops. There's a loud crunch close\n       by. She rises reflexively from the stream. Raises the\n       toolbox. She looks around. A branch has broken from a tree\n       and drags down into the stream behind her.\n\n       This seems to bring her back to herself. She realizes it's\n       only a matter of time before they come looking for her. She\n       needs to get moving.\n\n       She sets off downstream. She trudges through the shallow\n       water. Her wet coat drags heavily.\n\n       The stream must end somewhere, likely at the other edge of\n       the woods.\n\n       She trudges onwards, sweeping aside the branches of stooping\n       trees, stepping around rocky obstacles in the stream.\n\n       Forging ahead.\n\n       She now needs to pee. GREAT. Her temper surges up.\n\n       She looks for the right place to do it, realizes it's\n       probably best to pee in the stream, so all trace of it will\n       be dispersed.\n\n       A leafless willow trails its dried up branches into the\n       stream. She makes her way toward it.\n\n       She lays the toolbox down and disappears between the\n       branches. We see glimpses of her lifting her coat, pulling\n       down her pants, pushing the crotch of her underpants to the\n       side. We hear her shiver and the faint tinkle of water\n       meeting the stream.\n\n       More glimpses of her pulling up her underpants and pants,\n       smoothing down her coat.\n\n       She hoists her coat up again around her waist and picks up\n       the toolbox.\n\n       She plows down stream once more. Longing to see the light\n       that will tell her she's at the edge of the woods, closer to\n       the mall lights, closer to home.\n\n       She swallows another wave of grief.\n<b>\n</b>                                               Scene 106Page 74\n<b>       \n</b>\n\n       The stream loops around ahead then splits into two. She\n       follows it, picks the left fork.\n\n       And then she hears it, the terrible sound of feet thundering\n       down into the stream behind her.\n\n       She doesn't even turn to see them. Just runs. Runs for her\n       life.\n\n       The glare of the flashlight blasts against her back. Freezing\n       water splashes up her legs, soaking through her pants. Her\n       feet slip and slide over wet rocks. But she keeps running.\n\n       Vinh's behind her. She can feel his breath, the swipe of his\n       hands as he grabs for her and misses. She runs even faster.\n\n       She leaps over tree trunks that cross the stream. They leap\n       behind her.\n\n       She pushes through the hanging branches of several trees.\n       Pushes them forward hard then lets them go as she passes,\n       right into Vinh's face.\n\n       He tries to duck but they hit him right in the eyes. He cries\n       out, covers his eyes.\n\n<b>                             VINH\n</b>                 Aaaarrhh.\n\n       This buys her a moment or two to get ahead. The stream bends\n       right ahead. She opts to stay in it. Chuckie leaps out, runs\n       along the banks, hoping to outrun and trap her.\n\n       But the stream then bends left, giving her an advantage. He\n       leaps back across the stream to the other side. But she's\n       outrunning him. He charges back into the stream behind her.\n\n       Della keeps on running through the stream, somehow trusting\n       its direction.\n\n       Vinh catches up with Chuckie. The boys are maybe twenty-five\n       feet behind her.\n\n       A SHOT rings out. Then a bullet races past her ear. Lodges in\n       a tree just ahead of her. She almost loses her footing. She'd\n       forgotten for just a moment, that they had a gun.\n\n       Another shot blasts off into the night, skims her shoulder,\n       hits the muddy bank of the stream. She flinches, braces\n       herself, keeps going, adrenalin pumping harder than ever.\n<b>\n</b>                                               Scene 106Page 75\n<b>       \n</b>\n\n       The stream winds around a bunch of rocks ahead. For just a\n       moment she's invisible to them. She uses it. When she reaches\n       the rocks, she dives out, ducking below the glare of\n       Chuckie's flashlight, down behind the rocks.\n\n<b>107                                                               107\n</b><b>       EXT.   EMBANKMENT - EVENING\n</b>\n       She creeps up the muddy embankment hiding deep in the shadows\n       of some wiry shrubs, as close to the mud as her back will\n       allow.\n\n       The boys stop by the rocks. Chuckie sweeps the flashlight up\n       the muddy embankment, looking for a footprint, a sign of her.\n\n       She tries to creep through the midst of the brush to avoid\n       leaving prints. Tries to stay quiet as a mouse. Stops when\n       she sees the flashlight sweep by.\n\n       If she can get to the top, she can make another run for it.\n\n       All of a sudden, it grows dark. The boys must have switched\n       the flashlight off or maybe the battery's dead. She listens\n       hard for their footfalls. Nothing.\n\n<b>108                                                               108\n</b><b>       EXT. PINE TREE - EVENING\n</b>\n       She sees that she is in the shadows of a big old Pine tree.\n\n       She creeps behind its massive gnarled trunk and silently\n       slides open the toolbox, fumbles around for the screwdriver.\n       She removes it from the box and grasps it tight.\n\n       Della rises slowly, remaining concealed behind the tree. She\n       reaches up and softly places the toolbox deep in the junction\n       of the first sturdy branch and the tree trunk. She pulls\n       herself up onto the branch and edges in close to the trunk.\n       She peeks between the branches.\n\n       No sign of the boys. She pulls herself further up into the\n       tree, branch by branch.\n\n       The thin stiff outer branches, fringed with sharp little\n       needles, fall like a jagged veil around her.\n\n       She waits.\n\n       She's high enough up to have a clear view of the landscape\n       below despite the darkness.\n\n       She makes out the faint echo of voices, strains to hear.\n<b>\n</b>                                      Scene 109Page 76\n<b>       \n</b>\n\n<b>109                                                                109\n</b><b>       EXT. STREAM THROUGH WOODS - EVENING\n</b>\n       Vinh and Chuckie are arguing in whispers. Vinh's pale and\n       shivering hard.\n\n<b>                           VINH\n</b>                 I don't feel good, Chuckie. You\n                 think I got the hypothermia?\n\n<b>                           CHUCKIE\n</b>                 Nah, yo got the yellow fever.\n\n       Vinh sulks.\n\n<b>                           VINH\n</b>                 I'm telling you, it ain't natural\n                 how she gets away every time.\n\n       Chuckie clicks the flashlight back on. Sweeps it up, across\n       and back down the embankment to the stream, illuminating the\n       banks.\n\n<b>                           CHUCKIE\n</b>                 She got to be hiding up on the\n                 slope? You head up first and I'll\n                 follow with the flashlight.\n\n       The light sweeps past her. Della shrinks further into the\n       branches of the tree. She crunches her foot against a branch.\n<b>       SHIT!\n</b>\n       The boys freeze, then resume talking in whispers.\n\n\n<b>                           VINH\n</b>                 I ain't going up there without the\n                 gun. End of story.\n\n<b>                           CHUCKIE\n</b>                 Never would've pegged you as a\n                 pussy, Vinh. Even when Huey and\n                 Tomas called it, I always defended\n                 your ass.\n\n<b>                           VINH\n</b>                 Ain't no one never said I was a\n                 pussy.\n\n<b>                           CHUCKIE\n</b>                 She a skinny ass bitch, too. Can't\n                 be weighing in at more than one\n                 twenty.\n<b>\n</b>                                       Scene 109Page 77\n<b>       \n</b>\n\n<b>                           VINH\n</b>                 Tomas an Huey never called me a\n                 pussy.\n\n<b>                           CHUCKIE\n</b>                 I ain't speaking ill o' the dead.\n\n<b>                           VINH\n</b>                 You already did.\n\n       Vinh's shivering so hard his teeth are knocking.\n\n<b>                           CHUCKIE\n</b>                 Anyways, when you ever shot a gun?\n                 Probably miss and shoot yourself in\n                 the foot.\n\n       Vinh paces, braces himself to head up after Della.\n\n<b>110                                                               110\n</b><b>       EXT. EMBANKMENT - EVENING\n</b>\n       Vinh starts to ascend the embankment.\n\n<b>                           CHUCKIE\n</b>                 That's the spirit gangsta. Holler\n                 if you see her and I'll shoot.\n\n       Vinh glares back at Chuckie.\n\n<b>                           VINH\n</b>                 Faito!\n\n       Della watches Vinh plough through the brush.\n\n       The flashlight sweeps and darts with his movements, up ahead\n       of him, up the embankment.\n\n       Vinh pushes through several trees, slips, regains his\n       footing. He plods past the tree. She slips the screwdriver up\n       her sleeve. Prays he won't stop.\n\n       She pulls herself further up the tree.\n\n       A sudden commotion of swaying branches startles her, followed\n       by a shower of pine needles.\n\n       Her heart stops.\n\n       A moment later the sound of fluttering wings is followed by\n       the squawking of angry birds.\n\n       She's disturbed a bird's nest.\n<b>\n</b>                                      Scene 110Page 78\n<b>       \n</b>\n\n       She sees the silhouette of four large crows as they burst\n       through the branches above and up into the patch of sky\n       between.\n\n       The crows circle the patch of sky above, like a Greek chorus.\n\n       She looks back down for a sign of Vingh. Sees nothing. Inches\n       along a branch to see better.\n\n       The light sweeps back and up through the trees into her eye\n       line, disorienting her.\n\n       She hears footfalls so close by they must be under the tree.\n\n       Her eyes have barely readjusted when she sees him: Vinh\n       standing under the tree scanning the area for a sign of her.\n       She stares down at him, frozen, holding her breath.\n\n       The flashlight illuminates the whole tree, then sweeps away\n       up the embankment.\n\n       But Vinh's seen something. He makes out her footprints under\n       the tree. He leans down to check, then rises, looks up\n       through the branches.\n\n       Their eyes meet. He opens his mouth to shout for Chuckie.\n\n       She LEAPS down through the branches. Lands THUD on his back.\n\n<b>                           VINH (CONT'D)\n</b><b>                 CHUUUCCKKKKIEEE!\n</b>\n       She silences his yell with a choke hold. Wraps her legs\n       around his torso. He bites her arm but she holds tight.\n\n<b>                           CHUCKIE (O.S.)\n</b>                 Vinh?\n\n       Panic has crept into Chuckie's voice.\n\n<b>                           CHUCKIE (O.S.) (CONT'D)\n</b><b>                 VINH?\n</b>\n       Vinh topples to the mud, dragging Della with him.\n\n       They roll as he desperately tries to disengage her.\n\n       The flashlight frantically searches the area for them.\n\n       Della frees the screwdriver she'd stuffed up her sleeve.\n\n       She DRIVES the screw driver up into the base of Vinh's skull.\n<b>\n</b>                                                Scene 110Page 79\n<b>       \n</b>\n\n       Vinh screams.\n\n       She thrusts and twists the tool.\n\n       All the while she's tightly wound around him, intertwined,\n       intimate as a lover.\n\n       She drives the screw driver deeper in until she feels her\n       knuckles dig into his stiff hair.\n\n       Vinh's scream becomes a high keening wail.\n\n       The screwdriver pierces the base of Vinh's skull. It\n       protrudes through his mouth, knocking several teeth out in a\n       stream of blood.\n\n       His scream cracks into a death rattle as hers begins.\n\n       They roll downstream.\n\n       His arms are wrapped in a death grip around her.\n\n       They roll until they crash full into a tree about two thirds\n       of the way down.\n\n       She feels his grip loosen and his body slump over hers. He\n       becomes so heavy he almost crushes her underneath as he dies\n       right there on top of her.\n\n       She's trapped, suffocating underneath him, until she finds\n       the strength to push him off.\n\n       She crawls out from under his body.\n\n       Pushing him away, sets him off rolling again.\n\n         She tries to stand up but her legs are unsteady. Her head\n       hurts so bad it's about to burst.\n\n       The world around her shifts into a migraine zone. Trails\n       follow trees, rocks, brush. The desire to close her eyes, to\n       close it all out almost overwhelms her.\n\n       Her shoulder aches too and there's a new pain in her arm\n       where Vinh bit her. She sees blood has matted her sleeve, and\n       rolls it up to find a nasty bite mark.\n\n       There's a loud crash. Della freezes and moves only her eyes,\n       looks around.\n\n       It's Vinh's body hitting the stream below.\n<b>\n</b>                                                Scene 110Page 80\n<b>       \n</b>\n\n       Where was the light at the edge of the woods? Nowhere to be\n       seen now that's for sure.\n\n       She staggers along the slope, clutching onto tree trunks and\n       roots as she goes.\n\n       Della grabs for a shrub to help her cross a patch of muddy\n       slope. Pulls it clean out by the roots. Loses her footing,\n       reaches for the roots of an old tree. She pulls herself up.\n\n       Plods once more along the slope, heading upwards in a\n       diagonal through the darkness.\n\n       She arrives at the top of the slope only to be met by more\n       darkness. But there's a strange calm about her now. Like\n       she's reached the eye of a terrible storm.\n\n<b>                              CHUCKIE (O.S.) (CONT'D)\n</b>                  Della?\n\n       When she hears his voice drifting faintly towards her, she\n       almost smiles.\n\n       She knows he's coming for her and there's nothing she can do\n       about it.\n\n       Della shivers as she sees a surreal tableau ahead: four huge\n       felled trees wrapped in white plastic. Their sad stumps are\n       only feet away. It's the funeral parlour of the forest.\n\n<b>                              CHUCKIE (CONT'D)\n</b>                  Delllaaa?\n\n\n<b>111                                                             111\n</b><b>       EXT.   FELLED TREES WRAPPED IN PLASTIC - EVENING\n</b>\n       Della sinks down behind the large trunk of a plastic wrapped\n       tree. She listens hard, tries to fathom which direction he's\n       coming from.\n\n       His voice drifts in and out of proximity like he's pacing\n       around in circles. His voice has changed - he's dropped the\n       gangster schtick.\n\n<b>                            CHUCKIE\n</b>                  There's only you and me, now.\n\n       Maybe, if he wanders into the right position, she can sneak\n       up on him from behind. She rakes about in the dirt looking\n       for a rock or a stick. Then she remembers something, sticks\n       her hand in her pocket, half smiles.\n<b>\n</b>                                               Scene 111Page 81\n<b>       \n</b>\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I saw a little trail of your blood\n                 back there. You must be hurt.\n\n       Della checks out the bite mark on her arm to find it's still\n       bleeding.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I'm hurting too. I think you busted\n                 up my collarbone.\n\n       His black silhouette appears ahead between the gray trees.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I know you can hear me, Della.\n\n       Chuckie sniffs.\n\n<b>                           CHUCKIE?\n</b>                 I can smell your blood, your sweat.\n                 I know you're close.\n\n       Chuckie's eyes glint in the darkness.\n\n<b>                           CHUCKIE\n</b>                 After what went down tonight, we\n                 got a special bond.\n\n       Della listens, transfixed.\n\n       His dark shape beckons to her.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 May as well come out now, Della.\n\n       She doesn't move.\n\n       She watches him pace around trying to work out where she is.\n\n       He pulls out a pack of cigarettes, taps one out, lights it.\n       Inhales. Exhales.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I'll save one for you, for when you\n                 decide to come out.\n\n       He inhales again, exhales.\n\n       He laughs admiringly.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 You're one tough bitch.\n<b>\n</b>                                               Scene 111Page 82\n<b>       \n</b>\n\n       The tone of his voice begins to change.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 And that's hot, hell yeah.\n\n       Frustration breaks through his voice. She can see his shadowy\n       form moving through the darkness towards her. He stops.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 And they're really cute.\n\n       Chuckie clicks on the flashlight, shines it straight ahead -\n       right in between the plastic wrapped trees.\n\n       Della freezes.   They?\n\n       Chuckie's eyes penetrate the darkness.\n\n<b>                              CHUCKIE (CONT'D)\n</b>                 Twins huh?     Terri and Tammi.\n\n       Della doesn't move. Terrified.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I bet you could use that cigarette\n                 now Della honey?\n                     (he chuckles)\n                 A woman's purse can tell her whole\n                 life story!\n\n       Della stares petrified as he unfolds her purse from deep in\n       his jacket. He empties the contents out onto the dirt.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Now I know where they are living,\n                 I'm thinking I may stop by after\n                 and say hello.\n\n       Della wants to run at him so bad she almost hyperventilates.\n       But she also knows that's what he wants and she refuses to\n       give him the satisfaction.\n\n       We move in closer on Chuckie. He's looking right at where\n       she's hiding, pure malevolence hardening his face to a mask.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 They wouldn't know a damn thing\n                 about what happened to Mommy while\n                 she was out, would they, Della?\n<b>\n</b>                                                Scene 111Page 83\n<b>       \n</b>\n\n       We move in on Della. Her knuckles are blue white and her eyes\n       are blazing. Rage explodes in her. She doesn't even realize\n       that she is shouting till she's done.\n\n<b>                           DELLA\n</b><b>                 I'M GOING TO KILL YOU.\n</b>\n       Chuckie waltzes towards her hiding place.\n\n<b>                           CHUCKIE\n</b>                 I figured that would help you find\n                 your voice!\n\n       Della crouches further in behind the felled trees. Why the\n       hell did she shout? She could have been hiding anywhere. Now\n       he must know for sure where she is.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Don't worry. I would never touch\n                 them. It's wrong to hurt kids!\n                 Right, Della?\n\n       She clamps her mouth closed. Chuckie continues waltzing\n       toward her, stops about twelve feet away. He stares in\n       between the felled trees like he has x-ray vision.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 The game's over.\n\n       Chuckie laughs.\n\n<b>                            CHUCKIE (CONT'D)\n</b>                 You won!\n\n       Sadness creeps into his voice.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 You took him from me...He was only\n                 seventeen years old. And all he\n                 ever wanted to do was see the\n                 ocean. And he never saw it. No, he\n                 never got to go.\n\n       Chuckie's grief sits like a stone in his throat.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 They're all gone now.\n\n       Chuckie coughs, a dry laboured cough. He hocks long and\n       deeply in his throat. But whatever it is he can't spit it\n       out. He rubs his throat and collarbone gingerly.\n<b>\n</b>                                               Scene 111Page 84\n<b>       \n</b>\n\n<b>                             CHUCKIE (CONT'D)\n</b>                   You know the movie \"Clockwork\n                   Orange\"?\n\n       Della looks puzzled.   Yeah, and?\n\n<b>                             CHUCKIE (CONT'D)\n</b>                   Well, they were my droogies, Della.\n\n       Chuckie sighs.\n\n<b>                             CHUCKIE (CONT'D)\n</b>                   Chances are they would of turned on\n                   me anyway, just like in the movie.\n\n       Chuckie paces around, deep in thought.\n\n<b>                             CHUCKIE (CONT'D)\n</b>                   None of them was real ass outlaw.\n                   No, not in the way you are.\n                   You're the real deal, lady.\n\n       He stops.\n\n<b>                             CHUCKIE (CONT'D)\n</b>                   I was already thinking about\n                   cutting some of em loose, getting a\n                   new style posse together.\n\n       Della's head is spinning.\n\n<b>                             CHUCKIE (CONT'D)\n</b>                   How's about it, you and me?\n\n       This can't be real. Has he lost his mind? She utters under\n       her breath.\n\n<b>                             DELLA\n</b>                   Give me a break.\n\n       Chuckie reaches down, retrieves her diary from the dirt. She\n       cringes.\n\n<b>                             CHUCKIE\n</b>                   Monday night mechanics. Tuesday\n                   Pilates. Wednesday Spanish.\n                   Thursday, I wish....\n\n       He closes the diary.\n<b>\n</b>                                               Scene 111Page 85\n<b>       \n</b>\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Face it, Della. You ain't no\n                 suburban housewife.\n\n       Chuckie's eyes dart around in the darkness.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 So you bought into the big lie,\n                 even tried to live it. Who could\n                 blame you? Husband, kids, security,\n                 every woman's dream, but not yours,\n                 Della. You know there ain't no such\n                 thing as security.\n\n       He coughs some more.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 But I'm betting you didn't really\n                 know who you were until tonight. I\n                 reckon I know what you've been\n                 dreaming about though, what you've\n                 been aching for, through all these\n                 lonely, wasted years. Blasting out\n                 of Podunk without never looking\n                 back. Feeling the wind in your hair\n                 and the dirt of life between your\n                 fingers. Doing all the things they\n                 told you you ain't supposed to do.\n                 Taking what YOU want from life. And\n                 wasting anyone who stands in your\n                 way. Right, Della?\n\n       She closes her eyes like she's seeing it all behind them.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Don't say you ain't thought about\n                 it. If it's in your blood, it's in\n                 your blood for all time.\n\n       A longing sigh sneaks out.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 You had yourself fooled, Della.\n\n       A single tear runs down her cheek.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Shit, lady, you took my whole crew\n                 out with nothing but a bunch of\n                 them tools.\n\n       She opens her eyes.\n<b>\n</b>                                         Scene 111Page 86\n<b>       \n</b>\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 You can't go back to your old life.\n                 No way. It's all over for that.\n                 Kaboom.\n\n       She doesn't know what to say.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 Hooking up with me's about the best\n                 chance you got.\n\n       He sounds deadly serious, seductive even. She's lost in some\n       kind of trance, looking like she just might believe him.\n\n       Can she possibly be believing this?\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I bet you're on the outs with your\n                 old man.\n\n       She inhales sharply.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 When we pick up your kids, we can\n                 waste him if you like.\n\n       She holds the breath in.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 I can do it. Or you can if you're\n                 ready.\n\n       Della exhales, responds.       She seems lost to us.\n\n<b>                              DELLA\n</b>                 I want...\n\n       But she doesn't finish the sentence. She rises slowly from\n       between the plastic wrapped trees.\n\n       A momentary grimace of pain crosses her face. Then, their\n       eyes meet, like for the first time. It catches them both by\n       surprise. He smiles.\n\n<b>                           CHUCKIE\n</b>                 Leave the tools.\n\n<b>                           DELLA\n</b>                 I already did.\n\n       He shines the flashlight on her path so that she can see\n       where she is walking.\n<b>\n</b>                                      Scene 111Page 87\n<b>       \n</b>\n\n       Della steps around the plastic wrapped trees and between the\n       stumps. She heads towards him, slowly, deliberately.\n\n       Chuckie's hands are by his sides. She stops a few feet away\n       from him.\n\n       She can see him up close. The clearest view of him yet. They\n       both look like they've been to hell.\n\n<b>                           CHUCKIE\n</b>                 Hell of a night, huh?\n\n       He lays the flashlight on the ground and turns the lens to\n       point up through the trees and into the sky between them.\n\n<b>                           DELLA\n</b>                 I was only going to the mall for\n                 some Christmas wrapping paper.\n\n       Chuckie smiles.\n\n<b>                           CHUCKIE\n</b>                 Shit happens.\n\n       They stare at one another, all alone in the night. A knowing\n       moment stretches between them.\n\n       She notices the gash of matted blood and bruising on his\n       collarbone.\n\n<b>                              DELLA\n</b>                 What now?\n\n       Chuckie smiles, brings his teeth back into a scary, feral\n       grin.\n\n<b>                           CHUCKIE\n</b>                 I wanted to look you in the eye\n                 before I kill you.\n\n       Della doesn't react.    He brings up his hand, gun clutched,\n       pointed and ready.\n\n       Della surprises him and us.\n\n<b>                           DELLA\n</b>                 That's what I figured.\n\n       She nods her head, points her chin over his shoulder.\n\n<b>                           DELLA (CONT'D)\n</b>                 Huey there, going to help?\n<b>\n</b>                                      Scene 111Page 88\n<b>       \n</b>\n\n       Chuckie is puzzled.\n\n<b>                            CHUCKIE\n</b>                 Huey?   Huey's ....\n\n       He glances to the side for a split second, turns the gun as\n       he turns his head. It's enough. Della slips the flare out of\n       her pocket and opens it in his face.\n\n       Before he even has time to react she LEAPS at him with all\n       the spring left in her legs. Her fingers close around the\n       wrist with the gun.\n\n       The flare falls aside casting its fiery glow across them.\n\n       She crashes her good shoulder into the spongy place where his\n       collar bone is broken. It makes the ugly noise of sinew\n       tearing.\n\n<b>                             CHUCKIE (CONT'D)\n</b><b>                 CHRIST!\n</b>\n       She tumbles him down to the December ground and wraps her\n       legs tight around him. Tight like a lover.\n\n       She grinds her chin deep and forcefully into the area of his\n       broken collarbone, exacerbating the wound.\n\n       He cries out, thrashes about. She keeps her body melded to\n       his, grinding her chin even deeper.\n\n       He wraps his arms tightly around her and pulls her even\n       closer, wrenches her chin up and away from his collarbone.\n\n       They roll across the dirt.   He whispers, low and close to\n       her.\n\n<b>                           CHUCKIE (CONT'D)\n</b>                 You're even better than I thought.\n\n       He pushes his mouth hard up against hers to stop her chin\n       returning to the wound. She tries to pull away but he only\n       presses harder.\n\n       Neither can break away.\n\n       It's unclear who's got the gun.\n\n       They roll until she suddenly pulls away, sits up.\n\n       But he has her and she has him in a fatal leg lock.\n<b>\n</b>                                      Scene 111Page 89\n<b>       \n</b>\n\n       And she has the gun.\n\n       They look at each other. He smiles.\n\n       He makes for the gun.\n\n       She fires into his chest, just once, it's enough.\n\n       His legs release. He slumps back.   Blood darkens his shirt.\n\n       Gun smoke coils from the dark bullet wound. Blood seeps\n       below him from the exit wound, spreading out in a dark\n       puddle.\n\n       His body surrenders to death.\n\n       She stares down at him. A queasy silent moment passes. She\n       stares at the gun in her hands. It feels so heavy, so unreal.\n\n       His dead eyes stare. She reaches over and closes them gently.\n\n       And she's light-headed, so light-headed she could just float\n       away. Somehow she stands up.\n\n       She looks back down at the body, not quite believing he could\n       be dead. She sees her silver locket lying beside him in the\n       pool of blood.\n\n       She retrieves it. Uses her sleeve to wipe the blood away from\n       its exterior. Inside the photos of her kids are still there;\n       tiny photos of Tammis little thoughtful face and Terri's\n       mischievous one look back at her. She snaps the locket\n       closed.\n\n       She searches the area for the rest of her belongings, finds\n       her wallet, her purse, her diary, her lighter, her tampax\n       box, a lipstick in the dirt. She sticks everything in her\n       purse. She almost misses her pack of cigarettes. We see them\n       half buried under the dirt. She scans the area once more\n       finds them. The pack is empty but she takes it anyway.\n\n       It's time to go home.\n\n<b>112                                                              112\n</b><b>       EXT. WOODS - EVENING\n</b>\n       Without really thinking about it, Della slips the gun into\n       her pocket and starts running.\n\n       Tree after tree disappears behind her until she sees the\n       light ahead. That place where the rest of the world meets the\n       woods.\n<b>\n</b>                                               Scene 112Page 90\n<b>       \n</b>\n\n       She peers through the last layer of trees like she would a\n       curtain to her other reality, the one she almost left behind.\n\n       The housing development is still there and not more than a\n       hundred feet away is her car.\n\n       She hears the sound of distant sirens.\n\n<b>113                                                              113\n</b><b>       EXT. PERIPHERAL WOODS - EVENING\n</b>\n       She hurries across the clearing towards her car. Sees the\n       trunk is open. Sees sheets of wrapping paper blowing about.\n       Sees the big red bow tangled around a pine.\n\n       She quickly gathers them, stuffs them in her purse.\n\n       A moment of trepidation as she reaches her car. What if it's\n       locked? What if the keys are gone?\n\n       She presses the Ford's driver door handle and much to her\n       relief, it opens. She sees the keys still dangling from the\n       ignition.\n\n<b>114                                                              114\n</b><b>       INT. EXPLORER- EVENING\n</b>\n       She climbs into the driver's seat and turns the key. No\n       connection. No surprises there!\n\n<b>115                                                              115\n</b><b>       EXT. PERIPHERAL WOODS - EVENING\n</b>\n       She steps back out of the car and looks nervously around like\n       nothing good could ever possibly happen to her again.\n\n       The hood is still ajar by a few inches, the weight of pine\n       branches still pressing upon it. She uses the last of her\n       strength to try push them away. A few smaller branches give\n       way but the bigger one won't budge.\n\n       She reaches under the hood for the bar and pulls hard. It\n       scrapes along the inner surface of the hood as she forces it\n       to prop the hood open to its maximum, about fifteen inches.\n       The hood buckles but there's enough room for her to reach in.\n\n       She fumbles about and finds the positive wire has come loose\n       from its attachment to the battery. She re-attaches the wire\n       and, Presto, the car lights up and the keys start to ping.\n\n       She almost smiles as she forces the bar back down. The hood\n       slams down after it.\n<b>\n</b>                                               Scene 116Page 91\n<b>       \n</b>\n\n<b>116                                                               116\n</b><b>       INT. FORD - EVENING\n</b>\n       She quickly climbs back into the car and turns the keys. The\n       engine sputters but doesn't fully catch. She turns the keys\n       again - another wimpy sputter. Again, this time the sputter\n       gathers momentum, catches for a second, gives up. She tries\n       again, the sputter gathers momentum and catches for real.\n\n       Della looks over her shoulder and backs up, pulls out of the\n       tree, up and past the broken barrier and onto the road. She\n       makes a tight U-Turn, sticks the car into four wheel drive\n       and plows down the rough gravely road.\n\n<b>117                                                               117\n</b><b>       EXT. ROUGH ROAD - EVENING\n</b>\n       She passes the Plymouth on her way. Sees its wheels lodged\n       deep in the mud. Keeps going.\n\n<b>118                                                               118\n</b><b>       EXT. EMPTY HOUSING ESTATE - EVENING\n</b>\n       She drives right on through the ghostly housing estate,\n       slowing only to change back into drive as the road improves.\n       Empty houses flash past like a movie in rewind.\n\n       The lights of the mall grow closer.\n\n<b>119                                                               119\n</b><b>       INT. FORD EXPLORER- EVENING\n</b>\n       She passes that stop sign, sighs. The barrier is open and the\n       road up to the mall stretches freely ahead. She slowly inches\n       out on to the road and commits to her return to\n       \"civilization\".\n\n<b>120                                                               120\n</b><b>       EXT. MALL ROAD - EVENING\n</b>\n       The road's empty.\n\n<b>121                                                               121\n</b><b>       INT. FORD EXPLORER - EVENING\n</b>\n       She punches the accelerator, drives just over the speed\n       limit.\n\n<b>122                                                               122\n</b><b>       EXT. MALL ROAD - EVENING\n</b>\n       The concrete blocks of the mall rise from the wastelands\n       ahead on her left.\n\n       She slows, ahead there's a small traffic jam at the entrance\n       to the Mall road.\n<b>\n</b>                                      Scene 123Page 92\n<b>       \n</b>\n\n<b>123                                                                123\n</b><b>       INT. FORD EXPLORER - EVENING\n</b>\n       She hears the siren before she sees the police car.\n\n       God, she hopes they don't notice her smashed up windscreen,\n       the fucked up side of the Ford.\n\n<b>124                                                                124\n</b><b>       EXT. MALL ROAD - EVENING\n</b>\n       She edges slowly up to meet the line of cars. Watches as the\n       police car circumvents the traffic and pulls into the Mall\n       road, to join a police car that already has the Mall entrance\n       road blocked off.\n\n<b>125                                                                125\n</b><b>       INT. FORD EXPLORER - EVENING\n</b>\n       Of course.    How long has it been? That poor security guard.\n\n       She checks the car clock. It's only 85 minutes since she left\n       the house! Hard to believe. Feels like another lifetime.\n\n       Another cop car whizzes past the line. How long before they\n       come for her? She's got to get back to the kids.\n\n       Della adjusts the rearview mirror. Her gaunt bloody face\n       looks back.\n\n<b>                             DELLA\n</b>                    Oh my.\n\n       She looks at her hands, they're ingrained with mud and blood.\n       And her clothes!\n\n       While waiting for the traffic to start moving again she\n       fumbles on the passenger seat, finds some kleenex.\n\n       She wipes her hands, her face, using the rearview mirror,\n       some Kleenex and the rest of the water. She looks only\n       slightly better.\n\n       The line starts moving. Della follows. She passes the police\n       cars, steals a cursory glance.\n\n       She keeps checking her face in the mirror. The cars soon\n       start to disperse in different directions. The Mall\n       disappears behind her. She turns left onto an almost empty\n       road.\n\n       She can't wait to see her babies, make sure they're okay. How\n       could anyone expect her to go the speed limit at a time like\n       this.\n<b>\n</b>                                               Scene 125Page 93\n<b>       \n</b>\n\n       She hits forty, forty-five, fifty. Takes it all the way up to\n       sixty. Runs a light.\n\n<b>126                                                                126\n</b><b>       EXT. RAILWAY ROAD - EVENING\n</b>\n       As long as the roads empty she's gonna own it.\n\n<b>127                                                                127\n</b><b>       INT. FORD EXPLORER - EVENING\n</b>\n       At sixty-five she races across the railway track. She slows\n       down to just above speed limit when she sees a car ahead on\n       the adjoining road.\n\n       With one hand guiding the wheel she grabs the lipstick from\n       her purse.\n\n       She carefully applies it in the rearview but her mouth is so\n       parched it just cakes into her chapped lips. She wipes it\n       away.\n\n<b>128                                                                128\n</b><b>       EXT. CROSSROADS - EVENING\n</b>\n       She drives through the crossroads.\n\n<b>129                                                                129\n</b><b>       INT. FORD EXPLORER - EVENING\n</b>\n       She applies some lipstick to her cheeks to give her some\n       color. But she just looks odd. She ends up wiping it away\n       with the back of her hand.\n\n       Gosh, this car in front is really taking its sweet time. She\n       decides to overtake. She accelerates to sixty. As she passes\n       the driver stares at her car.\n\n       She slows down so as not to arouse any more suspicion. She\n       passes the familiar sign for \"Pleasant Valley Drive\". The\n       road's empty ahead so she guns it to sixty-five.\n\n       The closer she gets to home, the faster she wants to go. She\n       tries to resist but can't. The speedometer hits seventy.\n\n       The car hurtles into the night. Oh No, a red light ahead. And\n       a car waiting to go in the opposite direction. She decides to\n       slow for this one. Barely makes it - screeches to a halt. The\n       driver in the forward facing car checks her out. She attempts\n       to smile and look like a normal housewife.\n\n<b>130                                                                130\n</b><b>       EXT. PLEASANT DRIVE - EVENING\n</b>\n       She waits for the car to pass, then hits the accelerator\n       again. She signals right, turns abruptly into meet the gates\n       of Pleasant valley Dream Homes.\n<b>\n</b>                                               Scene 130Page 94\n<b>       \n</b>\n       She rakes about in her purse for her chub card, can't find\n       it. She presses the intercom. No one answers. She presses\n       again. Still no answer. She backs out hard onto Pleasant\n       Valley Drive. Luckily for her, the car she overtook a few\n       minutes earlier pulls in. She tails the car tightly through\n       the gates which scrape shut against her back bumpers. But\n       she's in.\n\n       She guns it along Pleasant Valley Crescent and slows as she\n       approaches the sign for Pleasant Valley Boulevard. Checks\n       herself in the mirror. Pulls into the boulevard.\n\n       When she sees her house ahead a huge sob engulfs her. She\n       snorts it back. Not yet. Her face hurts so bad with repressed\n       emotion that it feels like it's made of stone.\n\n       She pulls into the driveway. Smooths her coat.\n\n       She glances at the gun, which lies on the passenger seat.\n\n       She turns off the ignition.\n\n       She looks back at the gun. She removes the car keys from the\n       ignition.\n\n       She glances at the gun.\n\n       She looks at the house; it all looks normal.\n\n       She takes a deep breath.\n\n       She moves to get out of the car.\n\n       She leans over, grabs the gun and sticks it in her purse. She\n       finds her chub card inside. She sighs.\n\n<b>131                                                                131\n</b><b>       EXT. DELLA'S HOUSE - EVENING\n</b>\n       She remembers her shoulder hurts when she climbs out of the\n       car. That her arm hurts when she pushes the car door closed\n       behind her. That her heart hurts when she sees the star of\n       the tree still lying there in the snow.\n\n       The whole side of the car is scratched to hell and the\n       windshield is shattered. She makes her way down the path to\n       the front door. She kicks off her wrecked muddy boots on the\n       front step. Turns the adjoining key, on the car key chain, in\n       the front door lock. Pushes open the door.\n\n<b>132                                                                132\n</b><b>       INT.   DELLAS'S HOUSE - EVENING\n</b>\n<b>                            KENNETH\n</b>                  Where the hell have you been?\n<b>\n</b>                                       Scene 132Page 95\n<b>       \n</b>\n\n       Kenneth's voice meets her as she steps into the house. Nice\n       welcome.\n\n       She doesn't respond. Closes the door behind her. Walks into\n       the house.\n\n       There he is ahead, leaning against the office door. Beer in\n       one hand, remote in the other. The TV blaring behind him.\n\n<b>                              KENNETH (CONT'D)\n</b>                 I said....\n\n       He's about to begin shouting again when he notices\n       something's not right about her.\n\n<b>                              KENNETH (CONT'D)\n</b>                 Della?\n\n       He switches the TV volume down using the remote.\n\n<b>                           KENNETH (CONT'D)\n</b>                 Della honey are you all right?\n\n       She stares back at him coldly.\n\n<b>                           DELLA\n</b>                 Please don't call me that. Don't\n                 ever call me that again.\n\n<b>                              KENNETH\n</b>                 What?\n\n       She steps slowly towards him. Sees a violent adventure flick\n       wrapping up behind him on TV. The end credits scroll down the\n       screen.\n\n<b>                           DELLA\n</b>                 I just wanted to get home to my\n                 babies.\n\n       Kenneth cannot understand her garbled words. He sees the\n       dried blood on her chin, matted mud on her coat.\n\n<b>                           KENNETH\n</b>                 What happened to you?\n\n       She just stares.\n\n<b>                           KENNETH (CONT'D)\n</b>                 Was there an accident?\n<b>\n</b>                                      Scene 132Page 96\n<b>       \n</b>\n\n       She keeps staring, looks at him with a cold odd expression.\n       She needs to be held like a child but he doesn't even move\n       towards her. Just stands there like a jerk, unsure of what\n       to do, so he takes a swig of beer.\n\n<b>                           KENNETH (CONT'D)\n</b>                 Are you hurt?\n\n       That swig of beer turns what was left of her love for him to\n       stone.\n\n       A beat.\n\n<b>                           DELLA\n</b>                 Are they okay?\n\n       Without waiting for an answer.\n\n<b>133                                                                133\n</b><b>       INT. STAIRWAY - EVENING\n</b>\n       She turns and races up the stairs.\n\n<b>134                                                                134\n</b><b>       INT. THE TWINS BEDROOM - EVENING\n</b>\n       She opens the door softly. The night light casts a pale glow\n       out low across the carpet. There they are, all tucked up in\n       their quilts, breathing gently, little faces flushed with\n       sleep.\n\n       She sighs, closes her eyes with relief, softly closes the\n       door behind her.\n\n<b>135                                                                135\n</b><b>       INT. STAIRWAY - EVENING\n</b>\n       Walks back downstairs.\n\n<b>136                                                                136\n</b><b>       INT. KITCHEN - EVENING\n</b>\n       Kenneth is pacing about the kitchen, opening another beer.\n\n<b>                           KENNETH\n</b>                 Sound asleep, huh?\n\n       Kenneth, unsure what to do, tries to make a joke.\n\n<b>                           KENNETH (CONT'D)\n</b>                 So. What'd you bring me from the\n                 mall?\n\n       Della sighs, calmly pulls out the gun from her pocket, looks\n       him right in the eye, points the barrel at his face.\n<b>\n</b>                                      Scene 136Page 97\n<b>       \n</b>\n\n       He shrinks back, silent for once, blind panic playing across\n       his face.\n\n       But not hers. She's cold, cold as the icy night.\n\n       She pulls the trigger at point blank range. CLICK\n\n       He recoils.\n\n       But no bullet disengages from the barrel. Nothing. She knew\n       there were no bullets left.\n\n       But the click echoes throughout the silent house.\n\n<b>                             DELLA\n</b>                  Nothing.\n\n\n\n<b>                              THE END\n</b>\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/While-She-Was-Out.jpg\"/>\n</td><td><h1>While She Was Out</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Susan Montford\" title=\"Scripts by Susan Montford\">Susan Montford</a>  <a href=\"/writer.php?w=Edward Bryant\" title=\"Scripts by Edward Bryant\">Edward Bryant</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Crime\" title=\"Crime Scripts\">Crime</a>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a>  <a href=\"/genre/Thriller\" title=\"Thriller Scripts\">Thriller</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/While She Was Out Script.html#comments\" title=\"While She Was Out comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:20:11.861330"}