{"title": "White Ribbon, The", "film_link": "/Movie Scripts/White Ribbon, The Script.html", "script_link": "/scripts/White-Ribbon,-The.html", "info_raw": "\n\nWhite Ribbon, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (6.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Michael Haneke\nGenres  Crime  Drama  Mystery\nMovie Release Date : December 2009\n\nRead \"White Ribbon, The\" Script\n\n\n", "script": "\n\n\n\n                          THE WHITE RIBBON\n\n\n\n                              Written by\n\n                            Michael Haneke\n\n\n\n\n1. COVERED RIDING SCHOOL OF THE MANORIAL ESTATE INT/DAY\nMONTAGE OF CLOSE-SHOTS:\n\n                                                                1\n\nA man is riding a dressage horse. We can't see his face.\nOnly his boots, spurs, whip, the taut reins, the horse's\nfoamy mouth, the movements that steer the animal.\nWe watch him for a while and hear the SNORTS of the\nhorse, the dull SOUND of THE HOOVES on the ground, the\nfast-uttered COMMANDS of the rider. Then we start to\nhear a gentle voice:\n\n       NARRATOR (o.s.):I don't know if the story that I\n       want to tell you, reflects the truth in every\n       detail. Much of it I only know by hearsay, and a\n       lot of it remains obscure to me even today, and\n       I must leave it in darkness. Many of these\n       questions remain without answer. But I believe I\n       must tell of the strange events that occurred in\n       our village, because they may cast a new light\n       on some of the goings-on in this country...\n\nLONG SHOT OF THE RIDING STABLES.\nThe rider is the village doctor, a gaunt, intellectual-\nlooking man of around 60, who has finished his dressage\nsession, and now rides toward the open gate beside the\nCAMERA, goes through it and into the landscape. We see\nhim in the avenue, now visible behind him, and watch him\ngrow smaller until he vanishes.\n\n\n\n       NARRATOR (o.s. continuing):...Everything began,\n       if I remember correctly, with the doctor's\n       riding accident. After his dressage session in\n       the manor's riding school, he was first headed\n       for his home...\n\n\n                            \n\n\n\n2.   THE DOCTOR'S PROPERTY EXT/DAY\n\nThe garden opens up on the meadows and fields of the\nflat countryside.\n\nThe doctor lies beside his wounded horse. His arm is\nstrangely twisted, his broken collarbone has made a bump\nin the blood-drenched jacket. He yells with pain.\n\nAfter a few moments Xenia, the doctor's 12-year old\ndaughter, comes running out of the house. She rushes up\nto her father and looks at him, horrified, then at the\ntwitching horse, screams with horror. Her father shouts\nsomething to her, she bends over him and tries to raise\nhim to his feet. He screams at her as he's in such pain.\n\nShe staggers back helplessly, he shouts something to her\nagain, whereupon she runs off. We hear all this from far\naway, because during the whole scene the narrator has\ncontinued his tale:\n                                                           2\n\n       NARRATOR: ...to see if any of his patients had\n       arrived. As it entered the property, the horse\n       had tripped over a hardly visible, taut wire\n       that had been strung between two trees.\n       The doctor's fourteen-year old daughter had\n       watched the accident from the window of the\n       house, and was able to inform the woman who was\n       their neighbor, who in turn got the message to\n       the manor house, so that the agonizing doctor\n       could be transported to the hospital of the\n       district capital that was over 30 kilometers\n       away...\n\n                            \n\n\n\n3.   VILLAGE-STREET AND SCHOOL EXT/DAY\n\nTRACKING SHOT:\nEmilie Wagner, a skinny, modestly dressed woman in her\nlate thirties hurries along the village street.\n\n       NARRATOR: ...The neighbor, a single woman of\n       around 40, was the village midwife, who had\n       filled the invaluable position of housekeeper\n       and receptionist for the doctor since the death\n       of his wife in childbirth.\n       After tending to the doctor's two children, she\n       had gone to the school to fetch her own son,\n       Hans. Since she didn't like leaving him alone,\n       she asked me - in return for a small fee - to\n       keep him at the school with me every day, after\n       the other children had finished their lessons.\n       But on the day of the riding accident there was\n       choir practice in the afternoon, so that most of\n       the children were still present.\n\nA few children pass Emilie and greet her. Then she\nreaches the school. The door is open. The schoolchildren\nstream out.\n\nWe see the schoolteacher, a slight man, hardly 30 years\nold, talking inside to some of the older students.\nMartin, a tall gangly boy of around 12, whose elegant\nclothes make him stand out among the other children\ncoming out of the school, turns to the midwife:\n\n        MARTIN: Were you at Xenia's place?\nHe's interrupted by Marie, a delicate, pretty and polite\ngirl of around 13 who has the odd characteristic of\nalready behaving like an adult.\n        MARIE: Can't you say hello? Good afternoon, Mrs.\n        Wagner, excuse me.\n       MIDWIFE: Hello, Marie.\n                                                           3\n\n        MARIE: We're so worried, you know. That's why\n        Martin forgot his manners.\n        MIDWIFE: That's all right.\n        MARIE: How is the Doctor?\n        MIDWIFE: Not very well.\n        MARIE: Will he have to stay in the hospital?\n        MIDWIFE: I don't know.\n\n\nThe midwife is tired of Marie's precocious and endless\nquestions. She peers over the heads of children\nsurrounding them, looking for someone in the classroom.\n\n        MARIE: We'll take care of Xenia. Maybe, we can\n        help her somehow.\n        MIDWIFE (distracted): Good idea. It'll cheer her\n        up.\nShe has seen her son, who's coming out of the door: he\nis a mongoloid boy of 8. His name is Hans. He hesitates,\nas he sees his mother surrounded by the others. The\nmidwife leaves the group and goes over to him.\n        MIDWIFE: Well, did you enjoy the singing?\n        HANS (nods eagerly): It was great!\nThe schoolteacher comes in.\n        SCHOOLTEACHER: Show your mother what you've been\n        singing.\nHans looks doubtfully, first at the schoolteacher, then\nat his mother, who nods at him encouragingly. After\nhesitating for a second, he starts to SING:\n\n\n        HANS: La... La... lalala...\nMARIE turns to leave.\n\n\n        MARIE: Good-bye, Sir. Good-bye, Mrs. Wagner.\nHer saying good-bye acts as an invitation to the other\nchildren: they also SAY GOOD-BYE, though some less\ndistinctively, and follow the girl.\nTRACKING SHOT with the children. After a short distance,\nGeorg, a strong boy of around 13, shouts, encouraging\nthe others:\n\n        GEORG: Last one is a rotten egg!\n\n\n                                                           4\n\nThen he sprints off. Most of the children follow him.\nBut Marie and some of the other kids merely walk off at\na brisk pace.\nThe CAMERA, that stopped when Georg ran off, now FOLLOWS\nMarie, so that, after a while, the others can be seen\nagain at the far end of the street.\n\n\n                            \n\n\n\n4.   THE DOCTOR'S HOUSE INT/DAY\nXenia, who is herself in a pitiful condition, holds her\nfour-year-old brother Rudolph on her knees. She rocks\nhim and herself back and forth. As his head is bowed, we\ncan only guess that he's crying. After a while\n\n        XENIA (quietly): If you want, I can cut out some\n        animals for you, as I did last week?\nNo reaction.\n        Would you like that?!\nRudolph shakes his head faintly.\n        We could color them together, no?\nNo reaction.\n        Or we could cut them from the lovely colored\n        paper? The golden one, do you remember? The one\n        I got for Easter?\nNo reaction. Xenia ends up pressing her head helplessly\nagainst her little brother's head and mutters:\n        Come on, come on.\nThey remain that way for a while. Finally Xenia raises\nRudolph high enough so she can stand up:\n\n       All right! Now I'm going to make us something to\n       eat. Mrs. Wagner has prepared everything, I...\n       RUDOLPH (interrupts her softly, his head still\n       bowed): What if he never comes back?\n        XENIA (as if she hasn't understood): What?\nRudolph merely shakes his bowed head. Xenia kneels down\nin front of her brother and tries to look into his eyes,\nbut the boy bows his head even deeper.\n\n        XENIA (tenderly): Come on! Don't be stupid! It\n        goes away just like the flu. Remember last\n        winter? You were very sick, weren't you? And\n        then, two weeks later...\nA NOISE makes her cock her ear: it's as if something had\nhit the window in the next room.\n                                                           5\n\nXenia stands up and listens. SILENCE. And then, after\nlistening for a while, once again the same noise.\n        XENIA: Hush!\nShe goes into the OTHER ROOM and, hiding behind the\ncurtain, looks out.\nOutside, the group of children are gathered around\nMarie. They look up at the house. They're waiting for\nsomething.\nAfter a while, Georg, the boy who earlier had urged them\nto race, throws another stone at the window. Xenia is\nstartled. She hesitates. Finally, she opens the window.\n        GEORG: Hi, Xeni!\nXenia doesn't answer. After a while\n        MARIE(quietly): How are you? Can we help you?\n\n\n                            \n\n5.   MANOR EXT/NIGHT\nThe steward of the estate, a heavy set rustic man in his\nmid fifties, is talking with the landowner (who's about\nthe same age). They are standing beside a team of\ncarthorses. With a torch the steward lights up a dead\nhorse that lies on the ground after being towed in by\nthe carthorses.\n        STEWARD: ...its tendons were almost severed. It\n        never would have recovered.\nThe landowner bends down and examines the wounds on the\npasterns of the dead animal's front legs.\n        LANDOWNER: How did that thing get there? Didn't\n        the Doctor say anything?\n       STEWARD (with a snicker): He was in no mood to\n       talk, with his collarbone sticking out of his\n       throat. I asked his daughter. She has no idea.\n       He always rides through those trees.\n       LANDOWNER: Did you look at the wire?\n       STEWARD: Of course. It's thin, but strong. You\n       can hardly see it, if you don't look closely.\n       LANDOWNER: But why was it tied there?\n       STEWARD (shrugging): And at knee height! I don't\n       know... Maybe so the kids could jump over it. No\n       idea. I don't think the doctor himself was\n       stupid enough to tie that thing there.\n       LANDOWNER: Meaning?\n\n\n\n                                                           6\n\n       STEWARD: Meaning: I don't know. Anyway it was\n       definitely put there intentionally and looks\n       damn...\n\n\n                            \n\n6.   MANOR. LIVING ROOM ON THE TOP FLOOR. INT/NIGHT\nSigi, the 9-year old son of the landowner stands at the\nwindow, and watches his father and the steward standing\nin the torchlight beside the dead horse.\nIn the background MUSIC (Piano/violin).\nAfter a short while the two men down in the courtyard\nseparate: the landowner heads to the manor, the steward\nwith the team of carthorses to a farm building.\nSigi turns away from the window and looks into the room.\nThere his mother Beatrix, a beautiful, nervous woman in\nher late thirties, is sitting at a baby grand piano.\nBeside her stands the tutor, holding a violin tucked\nunder his chin. He looks as if he's in his late\ntwenties, plump and slightly greasy, and obviously\ninfatuated with his beautiful employer, who has just\ninterrupted her playing with an annoyed sigh.\n        TUTOR: I'm sorry, Madame. You're just playing\n        too well for me.\n       BEATRIX:   Stop  apologizing   and  concentrate.\n       That'll be more helpful for both of us.\n        TUTOR: To tell the truth: You're just playing\n        too fast for me. I'm not Paganini.\nBeatrix looks up at him with a quick amused smile, then\nturns back the pages of her sheet music.\n        BEATRIX: Well, let's start all over again at the\n        letter D.\nThe tutor does the same, they glance at each other and\nstart again.\nSigi watches them from the window, then he saunters in,\nstops some distance away and watches. Then he saunters\naway again.\nSuddenly, Beatrix stops playing again.\n        BEATRIX: Listen, darling. If you like the music,\n        then sit down beside me and turn the pages of\n        the sheet music. But if you're bored, go up to\n        your room and at least stay out of my sight. It\n        makes me nervous if you're constantly sauntering\n        around in front of me.\nSigi bows his head ashamed, but doesn't move.\n        BEATRIX (turning to the tutor): By the way, what\n        time is it? Where is the girl?\nThe tutor pulls out his pocket watch.\n\n                                                           7\n\n       TUTOR: She's with the twins, I presume. Twenty\n       to nine.\n       BEATRIX: Twenty to nine?! (turning to Sigi): You\n       should have been in bed long ago. (to the\n       tutor): Has he done his homework?\n       TUTOR: Of course, Madame.\n        BEATRIX: All right. (to Sigi): Well, do you want\n        to turn the pages for me or not?\nSigi nods.\n        BEATRIX: Then come here!\nWith a little caustic smile, she taps beside her on the\npiano bench. Sigi comes over sits down beside her and\nlooks at the sheet music. Beatrix turns the pages back.\n        BEATRIX (to the tutor): All right, here we go\n        again: the letter D. Try to play a bit faster.\n        Or else I might as well play with the village\n        schoolteacher.\nThey PLAY again. Sigi reads the music with her, then\nturns the page.\n\n\n                            \n\n\n\n7.   RECTORY. DINING ROOM. INT/NIGHT\nMarie and Martin come through the door and stand in\nfront of it.\nAt the dinner table, the pastor (in his mid-forties)\nsits with his back to the door. In front of him, at the\nother end of the table, sits his wife Anna, a woman in\nher late forties. On the sides of the table sit the\nchildren:\nAnton (11), Magdalena (10), Katharina (9) and Florian\n(7). Two other places are empty.\nThe table is set for 8 people, but the plates are empty.\nSILENCE.\n         MARIE (quietly): Please forgive us.\n        MARTIN (following her lead): Please forgive us.\nSILENCE. Then the pastor speaks very quietly, without\nturning to the two children:\n\n       PASTOR: There's no question of forgiving. You\n       haven't offended me. It's your mother and your\n       brothers and sisters that you have frightened\n       away and offended. Ask them for forgiveness.\n       You amaze me. I didn't know that the two oldest\n       and therefore most reasonable of my children\n       wouldn't mind frightening their mother and\n       brothers and sisters to death.\n                                                           8\n\nHe turns around toward the two children:\n        Are you now grown up enough to live on your own?\n        Are you? Do you want to leave home and start a\n        life of your own? So you can come and go as you\n        please, and nobody gets in your way. Is that\n        what you want?\nThe two remain silent, their heads bowed. The pastor\nturns his back to them again, and faces the table.\n\n       Nobody at this table has eaten tonight. When it\n       grew dark, and you hadn't returned, your mother\n       went all over the village in tears, looking for\n       you. Do you really think we could've enjoyed our\n       meal, if we feared something had happened to\n       you?\n       Do you think we can enjoy our meal now, when\n       you've come back and dish up lies as an excuse?\n       I don't know what's worse: your absence or your\n       coming back. (PAUSE).\n       Tonight we shall all go to bed hungry.\n\nHe stands up, followed by the mother and the children\nwho were sitting at the table. Again he turns to the two\nwrongdoers:\n        PASTOR: You probably agree with me, that I\n        cannot leave your offense unpunished, if we want\n        keep living in mutual respect. So, tomorrow\n        evening at this hour, I shall give each of you\n        10 strokes of the cane. Until then, you have\n        time to ponder over your offense. Do you agree\n        with me?\n       MARIE and MARTIN: Yes, Father.\n        PASTOR: All right then. Go to bed now, all of\n        you.\nThe children who were sitting at the table go first to\ntheir mother, then to their father. They kiss their\nhands and leave the room. As Marie and Martin want to do\nthe same, the father says\n        PASTOR: I refuse to be touched by you. Your\n        mother and I will sleep poorly because we know I\n        have to hurt you tomorrow, and because it will\n        more painful to us than the strokes will be\n        painful to you. Leave us alone and go to bed.\nAs the two children are about to leave the room, he says\n        PASTOR: When you were small, your mother once in\n        a while would tie a ribbon in your hair or\n        around your arm. Its white color was to remind\n        you of innocence and purity. I thought that at\n        your age you were well-mannered enough to get by\n        without such reminders. I was wrong. Tomorrow,\n        once you've been purified by your punishment,\n                                                           9\n\n        your mother will tie such a ribbon on you again,\n        and you'll wear it until your behavior shows us\n        that we can trust you again.\n\n\n                               \n\n\n\n8.    THE DOCTOR'S PROPERTY EXT/DAY\nCLOSE ANGLE: one of the trees to which the wire was tied\nthat tripped up the doctor's horse. A policeman is\nlooking for clues.\nWith him are Xenia, Rudolph, the midwife and her son\nHans.\nThe    two  boys   don't  show   much  interest  in   the\ninvestigation. They run after each other in the garden\nand the neighboring fields. Hans especially seems enjoy\nthis, and is shrieking with delight.\n         POLICEMAN: Where is the wire now?\nThe midwife looks at Xenia, who shrugs her shoulders.\n         POLICEMAN: Then who took it away?\n        XENIA: I don't know.\n        POLICEMAN: You weren't here?\n\nXenia, uncertain, looks at the midwife.\n\n        POLICEMAN:   Did   you   accompany   your   father?   To\n        town?\n        XENIA: No.\n        POLICEMAN: That means you were here.\n        XENIA: I was in school. Today.\n        POLICEMAN: And when you left for school, the\n        wire was still here?\n        XENIA: I didn't check.\n\n\nThe policeman turns to the midwife:\n\n        POLICEMAN: And when did you come?\n        MIDWIFE: At noon. I make lunch for the Doctor\n        and the kids. Since the death of the Doctor's\n        wife, I've been helping him out.\n        POLICEMAN: Since when?\n\n\n                                                                   10\n\n        MIDWIFE: It's been 4 years. Since the birth of\n        little Rudolph. I'm the midwife here. We often\n        work together.\n        POLICEMAN: But you didn't see anything?\n        MIDWIFE: No.\n        POLICEMAN: Do you have any idea how long the\n        wire had been there?\n        MIDWIFE: I'd never seen it before.\n         POLICEMAN (angrily): Let me get this straight:\n         Nobody saw the thing before, nobody saw it\n         afterwards. It wound itself around the two trees\n         all alone, and made itself vanish after the\n         doctor's fall. Right?\nNeither the midwife nor Xenia know what to answer. At\nthat moment Hans comes running in from the field,\nexcited:\n         HANS: Mother! ... Look! ...Look... come!\n        MIDWIFE (reluctantly): What's happening?\n        HANS: People! ...Lots of people. Come!!\n        MIDWIFE (to the policeman): Sorry...\nIndeed, as the midwife sets outs for the field, a group\nof people hurry along the path bordering the doctor's\nproperty, and cross our POV. They carry a body on a\nmakeshift stretcher. The policeman and Xenia follow the\nmidwife. The group vanishes as quickly as it appeared\nbehind the surrounding bushes.\nAs the group was approaching, we have been hearing\n        NARRATOR: The day following the doctor's riding\n        accident not only brought no solution to the\n        question of who'd done it, but a second, far\n        more tragic incident almost made people forget\n        the misfortune of the previous day: the wife of\n        a tenant farmer died in a work-accident.\n\n\n                            \n\n\n\n9.   FARM INT/DAY\nIt's very dark in the low-ceilinged room. Small windows.\nA couple of women in peasant dresses take care of the\ndead woman, who's been laid out on the bed. The women\nremove her clothes and wash her.\n        NARRATOR: The woman, who because of an injured\n        arm could only do light work, had been dispensed\n\n                                                            11\n\n         by the steward from harvesting chores, and was\n         assigned to easier work in the sawmill.\nEverything happens very silently. An elderly woman, a\nmidwife specialized in bathing, takes care of the\nproceedings.\nEvery time the door is opened, one hears the mutterings\nof the people waiting outside. Soiled water is carried\nout, new underwear brought in, and the women start to\nclothe the naked corpse again.\nOutside, the sounds of excited VOICES are getting\nlouder. Then the door opens and the farmer (around\nfifty) enters the room. The old midwife turns around\nangrily:\n         BATHING-MIDWIFE: You stay outside! I haven't\n         yet...\n        FARMER (quietly): Get out!\nReluctantly, the old midwife abandons her half completed\nwork, not without having spread the dress she had draped\nover the still half-naked body of the dead woman. The\nother women follow her, embarrassed.\nOnce the door has closed behind them, the farmer just\nstands there. Only after a long while does he move\nforward and sit beside his dead wife. He remains seated,\nmotionless. For a very long time. He only tugs once at\nthe dress draped over the half-naked body, as if he\nwanted to cover a patch of nudity. Then he just sits\nthere again in the dark room, and only his halting\nbreath lets us know that any moment he may cry.\n\n\n                            \n\n\n\n10. A RIVER AND MEADOW WITH BRIDGE EXT/DAY\nWith his net and his fishing rod the schoolteacher is\nlanding a fish.\n        NARRATOR: On the same day, I had a strange\n        encounter: the weather was beautiful and hot, so\n        I decided to try and improve my meager menu with\n        some brown trout, which are plentiful in the\n        river. The landowner apparently liked me, and\n        allowed me to fish.\nSuddenly, the schoolteacher stops dead: like a tightrope\nwalker Martin is walking along on the top of the wall of\nthe bridge, thirty feet above the riverbed.\n        SCHOOLTEACHER (shouts, fearful): Martin!\nThe boy doesn't seem to hear him and keeps up his\nbalancing act.\n        SCHOOLTEACHER (louder): Martin!!\nThe boy keeps at it.\n\n                                                           12\n\nThe schoolteacher quickly wades ashore, throws his\nfishing rod and the net and the wriggling fish on the\ngravel beside the river and climbs up the river bank.\nWhen he gets on top, he sees the boy balancing himself\nat the other end of the bridge.\n        SCHOOLTEACHER: Martin, be careful!\nThe boy takes a few more steps, then reaches the end of\nthe wall and jumps down onto the bridge. Hesitatingly,\nhe turns to the schoolteacher, who comes toward him.\n        SCHOOLTEACHER: Are you completely insane? ! Do\n        you want to break your neck? !\n        MARTIN (his head bowed): Hello, sir.\nThe schoolteacher has reached him.\n        SCHOOLTEACHER: What's happening? Are you mad? !\n        Don't you know how high that is?\nThe boy remains silent, keeping his head bent down.\n        SCHOOLTEACHER: Didn't you hear me? I shouted to\n        you.\n         MARTIN (after a short silence): Yes, I did.\n        SCHOOLTEACHER: Well?\nThe boy remains silent.\n        SCHOOLTEACHER: Well?!!\nKeeping his head bowed, the boy shrugs a little. The\nschoolteacher, realizing that this won't get him any\nfurther, tries again, talking in a gentle voice:\n        SCHOOLTEACHER: You saw me down there and wanted\n        to impress me?\nThe boy shakes his head.\n        SCHOOLTEACHER: Well, why didn't you...\n         MARTIN   (interrupting  him) I  gave  God  an\n         opportunity to kill me. He didn't do it. That\n         means, he's pleased with me.\n         SCHOOLTEACHER (staggered): What are you saying?\n         MARTIN: He doesn't want me to die.\n         SCHOOLTEACHER (bewildered):   Who?   Who   doesn't\n         want you to die?\n         MARTIN: God.\nPause.\n        SCHOOLTEACHER: Why would God want you to die?\nThe boy stops answering, his head bowed again. The\nschoolteacher remains silent and looks at him for a\nwhile. Then, he adds softly:\n\n                                                              13\n\n        Promise me never to do such nonsense again. All\n        right? Look at me.\nMartin looks up reluctantly.\n        Promise it to me.\nMartin remains silent. He doesn't dare look down, and\ninstead looks past the schoolteacher.\n        You don't trust me, don't you?\n        MARTIN (polite, emotionless): Yes, I do, Sir.\nThe schoolteacher realizes that there's no use in\ntalking any further.\n        SCHOOLTEACHER (concluding): All right. Go home\n        now. I'll be coming tomorrow for the piano\n        lesson. I'll talk to your father then.\nMartin turns and faces the schoolteacher, and says in\nsuch a pleading voice that it startles him:\n        MARTIN: Please, don't tell him! Please, sir,\n        don't!\n        SCHOOLTEACHER: Why?\nMartin just looks pleadingly at the schoolteacher and\nshakes his head, as if to stress his request.\n\n                            \n\n\n11. SAWMILL INT/DAY\nFranz, the farmer eldest son, is searching for evidence\nof his mother's accident. He is accompanied by the\nneighbor's son Matti, a slight boy of around 16.\nThe sawmill is a ramshackle wooden building beside the\nriver.\nMatti, who obviously was there when the accident\nhappened, shows Franz the place.\n        MATTI: There. Be careful. Everything's rotten\n        here.\nFranz moves slowly forward. He looks down at the lower\nfloor. Immediately below: the saw. Franz steps back\ncarefully and turns to Matti:\n        FRANZ: Who made her climb up here?\n       MATTI: I haven't a clue. They told us to collect\n       all the lose ends. She just climbed up there.\n       FRANZ: She could never stand heights. It made\n       her dizzy.\n       Who assigned you to this job?\n       MATTI (uneasy): You know how it works. The\n       sawmill needed to be cleaned up, and the foremen\n       pick the weaker harvesters\n                                                          14\n\n        FRANZ: Who picked her?\n\n\n                               \n\n12. STREET AT THE END OF THE VILLAGE EXT/DAY\n.\nThe schoolteacher with his fishing gear and several fish\nthat he caught.\n        NARRATOR: It was on my way home after the\n        strange encounter with Martin that I met Eva for\n        the first time.\nEva (18), a redhead, somewhat chubby, but pretty girl,\ncrosses him way on her bicycle. A big bag is strapped to\nthe baggage carrier.\n        SCHOOLTEACHER: Hello.\n        EVA (passing by): Hello.\nThe schoolteacher stops, turns to the girl:\n        SCHOOLTEACHER (hesitantly): Excuse me!\n        EVA (Off): Yes?\n        SCHOOLTEACHER   (embarrassed):  Excuse   me   for\n        accosting you this way. You're the new nanny of\n        the Baron's children, aren't you?\nWe hear the bicycle stopping.\n        EVA (o.s.): Why?\nThe schoolteacher has turned around and now moves toward\nthe girl.\n        SCHOOLTEACHER: They say you're from Oberdorf.\n        EVA: Who says that?\n        SCHOOLTEACHER: Folks around here.\n        EVA: Oh. So what?\n        SCHOOLTEACHER: Nothing. I don't know. Sorry. I'm\n        the schoolteacher here. I just thought I... I\n        don't know (he laughs embarrassed): when I saw\n        you, I thought... I'm from Grundbach... I'm the\n        tailor's son...\n        EVA: I know.\n        SCHOOLTEACHER (confused): What?\n        EVA: The Baroness already told me.\n        SCHOOLTEACHER: What did she tell you?\n\n\n                                                            15\n\n       EVA: That the schoolteacher is from the village\n       next to mine.\n       SCHOOLTEACHER (laughs): Oh, I see! Yes. Well...\n       I thought... (he points at the bag on the\n       baggage carrier): You look as if you're going\n       there...\n       EVA: Where?\n       SCHOOLTEACHER: Back home. To Oberdorf.\n       EVA (doesn't understand what he's referring to):\n       Yes?\n       SCHOOLTEACHER: Are you going there?\n       EVA: Yes, I am.\n        SCHOOLTEACHER (doesn't know what to say): Well,\n        I thought... since you'll cycle through our\n        village... you might perhaps...(he's thinking,\n        looks down and sees the fish): ... say hello to\n        my father and (laughing at his own idea, he\n        holds up a fish) bring him one of the fishes.\n        They're fresh. I just caught them.\nNow Eva laughs too.\n        EVA: What?!\n        SCHOOLTEACHER (smiling as if to apologize):\n        Well. I'm sure he'd be delighted. Especially as\n        it's the start of the weekend.\nShe nods at the fish. The absurdity of the suggestion\namuses her. At the same time she doesn't really know how\nto behave.\n        EVA: Well, how...\nThe schoolteacher holds up the fish, laughs, as if he\nhimself doesn't how he got this idea.\n        SCHOOLTEACHER:    I     don't    know    either.\n        Unfortunately, I have nothing to wrap them in.\nThe both laugh. Pause. Then the girl points at the bag\non the baggage carrier of her bicycle and says\nregretfully:\n        EVA: Neither have I. Unfortunately.\nThe schoolteacher has a new \"idea \":\n        SCHOOLTEACHER (\"amused\"): I could give you some\n        fishing line, to tie them up.\n        EVA (equally amused): There on the bicycle?!\nThe schoolteacher shrugs his shoulders with a smile\n(\"why not\").\n        EVA: I don't think that's a very good idea.\n\n                                                           16\n\n         SCHOOLTEACHER:    You're   right.   It   was   just   an\n         idea.\n        EVA: Yes.\nEmbarrassed pause. Then\n        SCHOOLTEACHER: Is that your bicycle?\n         EVA (\"What an idea!\"): No! It belongs to the\n         estate.\n         SCHOOLTEACHER: I see.\nPause.\n         SCHOOLTEACHER: Is this your first day off?\n         EVA (rather suspicious because all this is too\n         intimate for her): Yes.\n         SCHOOLTEACHER: Well, you're         probably   looking\n         forward to being at home.\n         EVA: Yes, I am.\n        SCHOOLTEACHER: I can imagine.\nPause. Then\n        EVA says (putting the pedals and handlebar in a\n        \"ready to leave\" position): Well. I've still a\n        long way to go.\n         SCHOOLTEACHER (stepping back): Of course. Well,\n         good-bye.\n        EVA: Good-bye.\nShe's about to ride off.\n        SCHOOLTEACHER (with a smile): If you cycle\n        through Grundbach and see my father, at least\n        say hello to him from me.\n         EVA: I don't know your father.\n        SCHOOLTEACHER: That's true.\nThey look at each other for a while and then Eva rides\noff. The CAMERA FOLLOWS her. Eva and the bicycle are\ntottering a bit. The girl looks around and shouts,\nlaughing:\n        EVA: I only learned to ride a bicycle today!\n         SCHOOLTEACHER (now o.s., also shouting): Well,\n         you're doing fine! But be careful!\n         As she picks up speed, Eva rides better and soon\n         is just a speck on the dusty country road.\n                              \n\n\n                                                                    17\n\n13. THE DOCTOR'S HOUSE INT/DUSK\nIt's still too early to switch on the light.\nXenia and little Rudolph are sitting in the kitchen,\neating. For quite a while. Suddenly\n        RUDOLPH: The woman today. What was wrong with\n        her?\n        XENIA (eating): Which woman? Oh, I see. She was\n        dead.\nPause. Then\n        RUDOLPH: What's that?\n        XENIA: What?\n        RUDOLPH: Dead.\nXenia looks up from her meal.\n        XENIA: What's dead? My God, that's when someone\n        doesn't live anymore. When he's stopped living.\nSILENCE. Then\n        RUDOLPH: When does one stop living?\nXenia looks up from her meal again. Now she tries to\ntalk more seriously to her brother because she\nunderstands that these questions matter to him. But\nshe's also feeling uneasy and put on.\n        XENIA: When you're too old or very ill.\n        RUDOLPH: And the woman?\n        XENIA: She had an accident.\n        RUDOLPH: An accident?\n        XENIA: Yes. That's when you hurt yourself very\n        badly.\n        RUDOLPH: Like Dad?\n        XENIA: Yes, but much worse than that. So bad,\n        that your body can't take it anymore.\n        Another SILENCE: Then\n        RUDOLPH: And then you're dead?\n        XENIA: Yes.      But   most   people   don't   have   an\n        accident.\n        RUDOLPH: That means they don't need to die?\n        XENIA: No, they die much later.\n        RUDOLPH: When?\n        XENIA: Later, when they're very old.\nLong PAUSE.\n                                                                   18\n\n       RUDOLPH: Do all people die?\n       XENIA: Yes.\n       RUDOLPH: All of them, really?\n       XENIA: Yes, everyone dies.\n       RUDOLPH: But not you, Xeni?\n       XENIA: Me too. Everyone.\n       RUDOLPH: But not Dad?\n       XENIA: Dad too.\n       RUDOLPH: Me too?\n       XENIA: You too. But not before a very very long\n       time. All of us, only in a very long time.\n       RUDOLPH: And you can't do anything against it?\n       It has to happen?\n        XENIA: It has to happen. But not now, not for a\n        very long time.\nLong PAUSE. Then\n        RUDOLPH: And Mom? She didn't go on a trip?\nPAUSE.\n        RUDOLPH: Is she dead too?\nPAUSE.\n        XENIA: Yes. She's dead too. But that was a long\n        time ago.\nBoth remain SILENT. In the meantime it has grown dark in\nthe kitchen.\nSuddenly, Rudolph brushes away his plate off the table\nwith an angry movement, and turns away from Xenia. The\nplate shatters on the floor.\nAt first Xenia is stunned, paralyzed. Then she starts to\nsob, but tries to hide it from her brother.\n\n                             \n\n14. RECTORY. DINING ROOM. INT/NIGHT\nWhile we hear the SOUNDS of the punishment and the\nchildren being beaten, COUNTING the strokes with\nincreasing MOANS and stifled WHINING, we see (CLOSE\nANGLES) the faces of the other brothers and sisters.\nSome have turned away their faces, and others start to\ncry with pity and fear.\nFinally both have received their 10 strokes.\nCLOSE ANGLE: The pastor. He is breathless and beads of\nsweat on his forehead.\n        PASTOR: There.\n\n                                                           19\n\nHe hands Martin the cane. CLOSE ANGLE: Martin.\n        Here, take the cane and put it back in its\n        place.\nAs Martin is about to go, his father goes on:\n        But first you can thank me for trying to protect\n        you from any further misconduct.\n        CLOSE ANGLE: Marie.\n        You know how much I love you and how much it\n        hurts me to inflict such pain on you. Today was\n        a very sad day in my life, and I hope for all of\n        us that it doesn't happen again.\n        CLOSE ANGLE: Both kiss their father's hand.\n        CLOSE ANGLE: The pastor.\n        PASTOR (smiles): And now hug me. There's nothing\n        we have to forgive each other anymore. I love\n        you with all my heart.\nHe first hugs Marie who, her face still wet with tears,\ntries a forced smile and then Martin. Then, the pastor\nturns to his wife:\n        PASTOR: Now the ribbon, Anna.\nAnna goes toward the two children, tying a white ribbon\naround Martin's upper arm and another in Marie's hair.\n        PASTOR: This will remain on you until we're all\n        sure you have learned how to fight bad thoughts\n        and manners. You're well aware, this year you\n        will receive Christ's body in the form of bread\n        and wine. Until then, strive to be free of\n        sinful thoughts. Now let's eat.\nMartin carries the cane out of the room. The pastor and\nthe other children sit around the table. Marie leaves\nthe room with her mother. After all the others have sat\ndown and put their plates back where they were before\nthe punishment, the two come back with two soup bowls\nand put them on the table. Martin has also come back and\nsits down at his place beside his father.\nThe pastor folds his hands in prayer, the others follow\nsuit.\n        PASTOR (very friendly): Marie, would you say\n        grace today?\n        MARIE (smiling eagerly): With pleasure, father.\nShe bows her head, so do the others.\n        MARIE: Come Lord Jesus and be our guest\n        And bless what you've given to us.\n        PASTOR: Amen. Blessed be this meal.\n        THE OTHERS: Blessed be this meal.\n                                                           20\n\nThe mother and Marie open the soup tureens and hand out\nthe soup. Then they eat.\n\n                               \n\n15. FARM INT/NIGHT\nThe body of the farmer's wife has been laid out. The\ncandles to its left and right are almost burnt out.\nIts very quiet.\nLittle five-year old Sepp sneaks into the room, bare-\nfoot and wearing a shirt. He hesitates. Then, slowly and\ncarefully, he comes over to his dead mother. He ends up\nstanding beside the bed. The face of the dead woman is\ncovered with a white handkerchief.\nSepp is very frightened. He makes several attempts\nbefore he dares to lift the handkerchief. Then he\nwatches her, breathless, his eyes and mouth wide open.\nSuddenly, startled by a noise, he jerks back. He turns\naround: his 14-year old brother Paul is sitting on a\nbench against the wall. He too only wears a shirt.\n        SEPP (surprised, with a whispering voice):\n        Pauli?!\nPaul doesn't say a word. Sepp doesn't know what to do.\nHe looks at his mother again, then again at his brother.\nHe goes over to him and sits beside him on the bench.\nLike birds in a cage, they remain seated in the dark.\nVery close together.\n\n                               \n\n16. ESTATE. THE STEWARD'S HOUSE. LIVING ROOM. BEDROOM.\nINT/NIGHT\nThe steward and his children Liesl (15), Georg and\nFerdinand (10)] are waiting for something. Then the door\nopens and the midwife comes out. She tells them to come\ninto the other room.\n        NARRATOR: That night, the wife of the steward\n        gave birth to her fourth and last child at the\n        age of 42.\nThe children want to follow their father. At least\nLiesl, a chubby and good-natured teenager, rather plain,\ncan't wait to go in. But the midwife tells them to be\npatient, and only the father is let through.\n        LIESL (burning with curiosity): What is it?\n       MIDWIFE (smiling): Well, what do you think?\n       LIESL(shakes   her   head   impatiently):   I   don't\n       know.\n       MIDWIFE: It's a boy.\n       FERDINAND: Oh God!\n\n\n                                                               21\n\n       MIDWIFE: What do you mean?! Don't you want a\n       brother?\n       FERDINAND: Pff!\n        MIDWIFE: You're lucky your father can't hear\n        you.\nInstead of the father, Georg hits his brother on the\nback of the head. They quarrel.\n        MIDWIFE: Stop that!\nShe steps in and distributes a few smacks. Liesl runs\nout of the room howling.\n        MIDWIFE: You should be ashamed.\n        FERDINAND (Suddenly, as if he'd become another\n        person): Sorry.\nThe midwife looks at him, confused.\n\n                            \n\n\n17. TRACK NEAR THE FARM EXT/DAWN\nThe farmer, Franz and Paul leave the farm, they go to\nwork. The two oldest carry scythes.\nIn the background vast fields of crops.\nThe three walk hurriedly. After a while\n        FRANZ (hesitantly): Father, I have to tell you\n        something.\n       FARMER: What is it?\n        FRANZ: I went to the sawmill.\nThe farmer keeps on walking as if he hasn't heard. Franz\nlooks at him from the side. For a long moment he remains\nsilent, while all three keep walking. Then, Franz goes\non softly:\n        The floor, on the first level, where mother\n        worked, was totally rotten.\nThey keep on walking.\n        The steward, who sent her there, must have known\n        it. And the landowner too.\nThe farmer remains silent. They keep walking.\n        Father?!\n       FARMER (hostile): What do you want?\n        FRANZ (doesn't understand his father's refusal):\n        They sent her there knowing it was dangerous.\nThe farmer stops, turns to Franz:\n        FARMER (aggressive): What are you getting at?\n       FRANZ (doesn't understand): But...\n                                                           22\n\n         FARMER (furious, but with forced calm): Do you\n         want me to sue the Baron? Or kill the steward?\n         FRANZ: I...\n        FARMER: Go and cut off his head of with your\n        scythe. Sure, that'll bring your mother back to\n        life.\nHe turns away from Franz and keeps on walking. The\nothers follow. After a few steps\n        FRANZ (softly): I think our father loved our\n        mother.\nSuddenly the farmer stops and screams, almost crying\nwith fury and despair:\n        FARMER: Shut up!\nCLOSE ANGLE: Paul. He was listening carefully the whole\ntime. He looks at the father. Then, lowers his eyes.\n        NARRATOR: After these two days in July, life in\n        the village returned to what it had always\n        been...\n\n\n                             \n\n\n18. MONTAGE EXT/INS./DAY/NIGHT\na) Harvesting. Even teenagers and children are used to\ntie the sheaves and to do other easier jobs.\n        NARRATOR: ... The daily harvesting drove the\n        people almost to exhaustion. Most of the\n        children were busy helping their parents.\n\nb) The midwife is doing housework in the Doctor's house.\nA quarrel between her retarded son and the 4-year old\nRudolph (that we barely can follow due to the Narrator's\nvoice, o.s.) is settled by the midwife in favor of her\nson.\n        For the time being, the doctor remained in the\n        hospital. In the meantime the midwife catered\n        the basic needs of Xenia and Rudolph, his two\n        children. After the burial of the farmer's wife,\n        that was attended by the whole village, the two\n        accidents were soon forgotten...\n\n\n                             \n\n19.   MANOR EXT/DAY\n         NARRATOR: ... until the harvest festival at the\n         end of the summer brought the whole village\n\n                                                           23\n\n        together again, first in a festive hustle and\n        bustle, and then in horror and perplexity.\n\nThe courtyard is full of people, dressed in their Sunday\nbest:   Farmers,  seasonal-workers,   people  from   the\nvillage, children and teenagers.\nA dance hall has been set up. On it we see the\nlandowner, the steward and the pastor with their\nfamilies.\nA couple of younger women, a delegation of the\nharvesters, goes over to present the harvest crown to\nthe landowner.\n\n        HARVESTER: ...with our songs and our prayers\n        We've gathered the rye\n        and given that crown to your lordship.\n        It is not big, it is not small,\n        But pretty, nice and fine.\n        Not with thistles or thorns is it made,\n        but with pure grain.\n        Had our lordship sowed more,\n        The men would've scythed more\n        And we girls gathered more.\n        We girls have gathered the grain,\n        Over mountains and valleys,\n        Over thistles and thorn,\n        Over the fields of our lordship.\n        I wish our lordship a happy life,\n        As many years as there's sand on the beach\n        As many years as there are drops in the rain\n        So much may our lordship be blessed.\n        And as a reward to be of good cheer\n        We'd like for our folks a barrel of beer,\n        And if we could have a fried goose perchance\n        Then we'll all be ready to dance.\nDuring the poem, the camera has shown all those we have\nmet until now. They have all ( except for the Doctor,\nthe farmer and his two eldest sons) come to the feast.\nWhile all the folks present LAUGH and SHOUT, the maid,\nwith a clumsy curtsy, hands over the harvest crown to\nthe Baron. The village band plays a fanfare.\nAs soon as the hullabaloo has died down\n        BARON(answering): My thanks to all of you. Thank\n        you very much. You have worked well and the\n        heavens were merciful, and now the barns are\n        full.\n         Therefore there's more than enough beer, and you\n         won't starve today.\nHe points to the open barn, where food and beer are\nwaiting. In front of the barn are tables with long\nbenches.\n         BARON: Enjoy your meal!! Eat and drink as much\n         as you wish. You deserve it.\n                                                            24\n\nAgain the people YELL and CHEER. Then, the MUSIC starts\nand the feast is off and running.\n\n                            \n\n\n20. VEGETABLE GARDEN OF THE MANOR EXT/DAY\nThe vegetable garden is at the back of the manor house.\nIn the distance we hear the MUSIC from the feast.\nFranz, in working clothes, comes over, opens a gate in\nthe fence, then goes to a large field with the cabbages\nand slices them all off with his scythe. The whole scene\nlooks like a mass execution.\n\n                            \n\n\n21. ESTATE EXT/DAY\nThe party is in full swing: people dance and shout,\nchildren run around, young men quarrel and show off in\nfront of the young girls. Older women are stand around\nin groups, gossiping. Some farmers are gathered around\nthe landowner ­ he is friendly with them, but we don't\nunderstand what they're talking about.\nHis wife, with her nervous frailty, looks out of place\nin this crowd. She's talking to the schoolteacher.\n        BEATRIX: ...didn't you promise us a little\n        chorale sung by your protégés.\n       SCHOOLTEACHER: You have to talk to the pastor,\n       Baroness. We're still busy studying the choir\n       pieces for the confirmation feast.\n       BEATRIX (amused): But that's in spring, my dear.\n       This is the start of autumn.\n       SCHOOLTEACHER (smiles, embarrassed): I know, but\n       unfortunately not all of our little singers are\n       very musical. I'm sorry if...\n\n\n                            \n\n\n22. ESTATE. UNDER THE LIME TREE . EXT/DAY\nA quieter part of the estate.\nUnder a big shadowy tree, we see the two strollers of\nthe landowner's family, a small table and a few chairs.\nEva is sitting beside the twins and watches the colorful\nbustle. Sitting beside her, turning her back to the\nmanor, is Emma, the steward's wife who is breastfeeding\nher baby.\nThe steward separates from a group of men and comes over\nto the two women. As he comes over, he shouts to them:\n\n\n                                                           25\n\n        STEWARD: Well, you two \"mothers\"? Don't you want\n        to be part of the festivities?\nEva looks at the steward's wife, not knowing, how to\nreact to the \"mother joke\". But the slightly naive wife\nof the steward is basically fond of any jokes her\nhusband cracks. She turns halfway to him and says:\n        EMMA: It's so nice here in the shade.\nIn the meantime the steward has come over. He's smoking\na pipe.\n        STEWARD (in excellent mood): Well, our son seems\n        to be enjoying that, right?!\n       EMMA: Yes.\n       STEWARD: I can imagine. Who wouldn't like that.\n       EMMA (rebuking him gently): Georg!\n       STEWARD (to Eva): What about you? Don't you get\n       bored taking care of other people's children,\n       with all the young lads over there?\n        EVA (uneasy, with forced sweetness): No Sir, I\n        love to be with the children.\nHe gives his wife a short glance, then sits on a chair\nbeside Eva:\n        How old are you anyway?\n       EVA: Eighteen, Sir.\n       STEWARD: Eighteen! And you want me to believe\n       you'd rather hold the Baroness's baby in your\n       arms than your true love?\n       EMMA (good-naturedly): Come on, Georg, leave her\n       alone.\n       STEWARD: I'm not doing her any harm. Can you get\n       us something to eat, Emma?\n       EVA (stands up, to Emma): If you mind the\n       children for a moment, I'll get us something.\n       STEWARD (stands up too): Don't worry, princess,\n       I'm going. Not to panic.\n\n\n                            \n\n23. ESTATE. THE PATH LEADING TO THE VEGETABLE GARDEN.\nEXT/DAY\nA bunch of children between 5 and 15, dressed up in\ntheir Sunday best, among them Marie and Martin, both\nwearing  their  white  ribbons,  the  pastor's  other\n                                                           26\n\nchildren, Xenia, Rudolph as well as Hans, Liesl, Georg,\nFerdinand and Sigi. They leave the manor and head toward\nthe fields. As they pass by the vegetable garden, they\nnotice the sliced off cabbages and stop. Some laugh at\nit, others are unsettled. Most of the children keep run\non out into the open fields.\n\n                            \n\n\n24. ESTATE. OUTSIDE THE BARN. EXT/DAY\nFarmhands and tenant farmers are eating at the tables.\nOne of them tells a story, that we only partially\nunderstand because of all the noise:\n        FIRST TENANT FARMER: ...so the guy really tried\n        to steal the rooster from the steeple. He was\n        already completely pickled, but even then they\n        couldn't stop him. A huge, massive guy, you see.\n        So they just let him go, saying to themselves:\n        if he falls down, he falls down, that's it. But\n        he didn't get much farther than the first\n        window, that's where the trellis ends, see. And\n        even with all his strength, he couldn't hoist\n        himself up on the lightning rod. So the guy\n        stands up there in the window. And what do you\n        think that idiot does: he starts to crow! He\n        crows, shouting: I'm the rooster on the steeple.\n        You'll never catch me! He made such a commotion\n        that little by little the people in the\n        neighborhood started to wake up...\nAt the same time someone else starts to shout, causing\nthe others to join in:\n\n       FARMHANDS and FARMERS:\n       More beer, more beer, or I'll fall down, hurray!\n       More beer, more beer, or I'll fall down.\n       Has the landlord hung himself,\n       that he doesn't serve me any beer?\n       More beer, more beer, or I'll fall down!\n\nLaughter. Leni, Franz's sister, and another farmgirl do\ntheir best to cater to the drinker's thirst as fast as\npossible. The two young women try to keep their spirits\nup, but the guest's indelicate jokes and rude gestures\ndon't make it easy.\n\n       LENI: I'm coming. I haven't got a magic wand.\n       FIRST FARMHAND (with a grin): Shall I help you,\n       Leni? I'd love to help you.\n        SECOND FARMHAND (also grinning): What do you\n        want to help her with?!\nLAUGHTER.\n        FIRST FARMHAND: All over. Front and backside.\n                                                           27\n\nMore LAUGHTER.\n        THIRD FARMHAND (to Leni): Are you as slow with\n        the Baron?\n         SECOND TENANT FARMER: Come on, leave her alone\n         SECOND FARMHAND: You like her that much? Go and\n         help her.\n        FOURTH FARMHAND (sitting beside the second,\n        almost in a whisper): Don't you know: it was her\n        mother who had that accident?...\nAt the same time a boy of ten comes over to the first\nfarmer and butts in to his story:\n        BOY: Father, they cut off the Baron's cabbages.\n         FIRST TENANT FARMER: What's that?\n        BOY (grin): They cut off the Baron's cabbages.\nLeni, who's just putting some glasses with beer on the\ntable, glares at the boy, flabbergasted.\n\n                             \n\n\n\n25.   ESTATE. DANCE FLOOR. EXT/DAY\n\nOn the dance floor, Eva and the schoolteacher try to\ndance. Neither is very talented. Eva keeps looking at\nher feet and smiles, embarrassed.\n        EVA: I never learned it.\n        SCHOOLTEACHER (also with a smile): Neither did\n        I. You just have to count out loud. One. Two.\n        Three. One. Two. Three. One...\nTheir steps are far too big. They look clumsy and\nembarrassed, but happy. After a few spins\n        EVA: Aren't you afraid your students might laugh\n        at you, when they see you dancing with me that\n        way, sir.\n        SCHOOLTEACHER (laughs): They'd better not! And\n        stop being so formal with me. I'm not that old,\n        am I?\nEva laughs, embarrassed and looks down.\n        EVA: One. Two. Three. One. Two. Three. One. Two.\n        Three. One. Two. Three.\n         SCHOOLTEACHER: You see: we're getting better.\n         EVA: Well.\n         SCHOOLTEACHER: Stop looking at your feet.\n                                                           28\n\nShe lifts her head, looks at him and... stumbles. They\nlaugh and start again.\n\n                            \n\n\n26. VEGETABLE GARDEN EXT/DAY\nMUSIC of the village band can be heard coming from the\nmanor.\nThe Baroness reaches the vegetable garden, followed by\nthe pastor's wife, the tutor and some \"ladies\" from the\nvillage. Behind the fence, among the \"beheaded\" cabbages\nare the Baron, the steward and some farmers. A couple of\ncurious onlookers have gathered by the fence. Mutters,\nand now and then laughter.\nThe Baron turns to his wife and, with a snicker, points\nto the \"heads\" lying around him.\n        BARON: Quite a job, isn't it?!\nThe Baroness looks at the extent of the disaster. Then\nsays, revolted:\n        BARONESS: This is disgusting.\nThe steward comes over to them and, with a little grin,\ncomments on the sensitivity of his masters:\n        STEWARD: It used to be an old custom (he\n        quotes):\n        \"Now that the harvesting's done,\n        \"It's time to pay us, every one,\n        \"Any miser who leaves us in a rut,\n        \"He shall have his cabbage cut.\n\nThe Baroness, who doesn't think the symbolic character\nof the deed is funny at all, looks briefly at him and\nthen back again at the cabbage cemetery. Suddenly, she\nturns away and leaves the scene headed toward the manor.\nShe makes her way through the bystanders, who step aside\nto let her through.\n\n                            \n\n\n27. RECTORY. STUDY. INT/DUSK\nThe pastor works at his desk. Suddenly a KNOCK on the\ndoor\n        PASTOR (looking up): Come in\nFlorian comes hesitantly through the door.\n        PASTOR: What do you want?\n       FLORIAN (shy, almost frightened): I'd like to\n       ask you something, Father.\n       PASTOR: Yes?\n\n\n                                                           29\n\nThe boy comes over to the desk, opens a few buttons of\nhis shirt and then seizes something inside. In the open\nshirt we see the head of a little bird.\n        PASTOR: So what?\n        FLORIAN: I have found it. It's wounded.\nShort PAUSE.\n        PASTOR: What do you want?\n         FLORIAN (pleadingly): May I keep it?\nShort pause. The pastor is moved by the request of his\nyoungest    son,  but   manages  to   hide   his emotion\nskillfully.\n         PASTOR: How do you plan to do that?\n       FLORIAN: We'll heal it.\n        PASTOR (softly): And when it's healed?\nFlorian looks at him with round eyes, he doesn't know\nwhat to answer. The pastor continues:\n        Don't you think, you'll be attached to it then?\n        Will you let it fly away?\nFlorian thinks, then nods toward a cage behind the desk.\n        FLORIAN: \"Pipsi\" also lives in a cage.\nThe pastor looks at the cage shortly, hides a smile and\nturns to Florian again:\n\n        PASTOR: Yes, but Pipsi grew up in captivity.\n        (nodding at Florian's bird): This one is used to\n        living in freedom.\nFlorian doesn't know what to answer. So he merely looks\nat his father with pleading eyes.\n        PASTOR (repeats): Will you set him free, as soon\n        he's healed?\nFlorian, looks down and nods with a heavy heart.\n        PASTOR: Have you already asked Mother?\nFlorian nods eagerly.\n        PASTOR: And? What did she say?\n       FLORIAN: She said, it was for Father to decide.\n        PASTOR (smiling faintly): That's what she said?\nFlorian nods eagerly and looks at his father with eyes\nthat are pleading with expectation.\n        PASTOR: You'll really to take care of it? That's\n        a heavy responsibility. You know that, don't\n        you?\nSensing that his father is not quite against it, Florian\nnods eagerly.\n                                                           30\n\n        PASTOR: Well. You're its father and mother now.\nFlorian nods yet more eagerly, if that's possible. The\npastor finds it difficult not to smile:\n        We'll have to find a cage for your patient.\nFlorian can hardly believe it. He'd like to fling his\narms around his father's neck, but doesn't dare. So he\njust keeps standing there, beaming.\n        FLORIAN: Thanks, Father!\n\n                            \n\n\n\n28. TRACK TO THE FARM EXT/DUSK\nLeni comes along the track, excited. She`s almost\nrunning. She reaches the farm and disappears inside.\n\n                            \n\n29. FARM. ROOM. INT/DUSK\nThe family is eating. They're in working clothes, since\nthey didn't attend the Thanksgiving feast. Only Leni,\nwho visibly just came into the room, is still wearing\nthe clothes she wore at the feast. She's out of breath\nand very excited. The farmer looks very concerned.\n        FARMER (to Franz): Is that true?\n       FRANZ (hostile, keeps on eating): I don't know\n       nothing.\n       FARMER (threatening): Is ­ that - true?!\n       FRANZ (looks at him, aggressively): Nothing is\n       true! And even if it was true, so what?! Serves\n       him right, that miser!\n        FARMER (trying to control himself): Did you do\n        it, or did you not do it?\nFranz doesn't answer and keeps on eating.\n        LENI: It seems somebody saw you.\nFor a moment Franz remains calm, then he bursts out:\n        FRANZ (to Leni): So what? They should be glad\n        that they still have their own heads.(to the\n        farmer) And I want you to know this, Father: I'm\n        proud of it!\nThe father responds to this by slapping his face hard.\nFranz jumps up.\n        FARMER (orders Franz without looking at him):\n        Sit down!\nFor a moment, we don't know how Franz will behave.\nSitting on the corner bench, he's jammed between his\n                                                           31\n\nfather and his brothers and sisters, who stare at the\ntable, embarrassed. Only Paul, who sits opposite his\nbrother, looks up at him.\nFranz finally sits down again. SILENCE. The farmer\nstares at his plate, tries to speak softly, which is\nobviously difficult for him, to judge by the sound of\nhis voice.\n        FARMER: What did you intend to do?\nAs Franz doesn't answer, he looks up, right into Franz's\nface, who avoids his father's eyes.\n        FARMER: Well?\n        FARMER: Tell me.\nFranz keeps on glaring straight ahead. The farmer adopts\na gentler tone.\n        Come on. Tell me:\n       FRANZ (who   can   hardly   speak):   You   know   why,\n       Father.\n        FARMER (after a pause): Because of your mother?\n        Because you feel they're responsible for her\n        death? Is that it? What do you think? That I'm\n        not man enough to settle this? It's that what\n        you think?\nFranz keeps on glaring, remaining silent. The father\ntries to stay calm, staring straight ahead. He takes a\nspoon and eats twice from the milk soup. He puts down\nthe spoon, and looks at Franz again.\n\n\n       Did you ever think of what your behavior can\n       mean for the whole family? If Leni loses her\n       job, which enables us to keep our heads above\n       water for the whole year? What if we can't work\n       there anymore during the summer?\n\nFranz makes an impatient movement, takes raises            his\nspoon and wants to go on eating. The farmer grabs          his\narm and slams it down. The two stare at each other.        For\na moment, we don't know what will happen. Then             the\nfarmer goes on:\n\n\n       You want to marry and take over the farm in two\n       years? Yes? And how will you feed them all (he\n       points with his head at the other children)\n       without the help of the manor, tell me?\n\nFranz turns his head away. He disagrees, but does not\nknow what to answer. The farmer goes on:\n\n\n                                                                 32\n\n        And how do you know they're responsible?\n\nFranz turns to him abruptly:\n        FRANZ: And how do you know they're innocent?\nThe farmer looks at Franz with round eyes. A long PAUSE\nfollows. Then the\n\n        FARMER says (quietly): I don't know.\n\nAnd after another PAUSE.\n\n        FARMER: But I don't know the opposite either.\n                                \n\n\n\n30. MANOR. STAIRWELL. INT/NIGHT\nThe Baron stands at the bottom and shouts up at the\ntutor who's standing on the stairs:\n        BARON:...What do you mean \"not there\"?\n        TUTOR   (sheepish):   He...  disappeared.    I`ve\n        already looked everywhere. I can't find him.\n        BARON: Nonsense. He can't have vanished     into\n        thin air. When did you see him last?\n        TUTOR (as above): Around 2 o'clock.\n        BARON (his anger mounting): Around two? Do you\n        know what time it is?!\n        TUTOR (guiltily): I know, Sir.\nFurious, the landowner turns away from the nincompoop,\npensive. Then he turns to the TUTOR again:\n        BARON: What does my wife say, doesn't she have\n        any clue?\n        TUTOR: Madame sent me to you,     Baron. She is\n        beside herself with fear.\n        BARON (wryly): I can imagine.(looks up to the\n        tutor): You're an idiot, Huber. Why do you think\n        you're here? To take care of a single child! Is\n        that such a hard task?\n        TUTOR (softly): I'm awfully sorry, Baron.\n        BARON: You're even too stupid for that.\nThe Baron turns away and heads for the door. Then he\nturns around again and asks:\n\n\n                                                            33\n\n       BARON: Where did you see my son for the last\n       time?\n       TUTOR: Outside, in the courtyard. He said, he\n       was going to play with the other children.\n       BARON: Where?\n       TUTOR: That he didn't say.\n       BARON: And      my   wife   didn't   notice   anything\n       either?\n       TUTOR: After that business with the cabbage\n       heads, Madame retired to her room. She was\n       indisposed.\n       BARON (sarcastically): Indisposed?!\n       TUTOR: Yes. She had a terrible migraine attack.\n        BARON (almost to himself): My God, this place is\n        a zoo!\nHe turns away and goes out into the courtyard. The tutor\nfollow him with his eyes. He feels he's being badly\ntreated and hates the Baron for his insults. Finally he\ngoes back up the stairs.\n\n                               \n\n\n\n31. MANOR. EXT/NIGHT\nBACK TO THE SCENE.\nThe torches of the feast have almost burned out. Here\nand there we see some lanterns, put there to facilitate\nthe cleaning up.\nComing from the front door, the Baron crosses the vast\ncourtyard. Half way across he screams:\n        BARON: Bräker!!\nThe steward is overseeing a dozen farmhands, who are\nputting the tables and the benches of the feast back the\nbarn. He walks toward the Baron.\n        BARON. Have you seen my son?\n       STEWARD (surprised): No.\n       BARON (quietly): Could you please ask your boys.\n       Apparently, Sigi has disappeared with a whole\n       bunch of kids.\n       STEWARD:    Immediately.   (shouting    to   the\n       farmhands): When you're finished with the\n       cleaning up, wait for me. There's still a job to\n       do. Get some fresh torches and lanterns!\n       BARON: In the meantime I'll go round up the men.\n                                                                34\n\nThe steward goes to his house, the Baron         to   the\noutbuildings. There, he switches on the SIREN.\n\n        NARRATOR: The steward's children said, they had\n        seen Sigi only for a short time, that he had\n        gone off with other kids, and that they didn't\n        pay much attention to it...\n                                \n\n\n32. MONTAGE EXT/INT/NIGHT\nIN THE COURTYARD.\nMany men of different ages with lanterns and torches.\nThe Baron makes a short speech and the steward assigns\nthe areas to be searched. Most of this is drowned out by\nthe narrator's voice.\n\n        NARRATOR: ...The search began shortly after\n        midnight. Before, the Baron had ridden to the\n        Rectory. But there he found out nothing new from\n        the children who had been specially woken up.\n\n\nSTABLE AND OUTBUILDINGS OF THE ESTATE.\nVARIOUS LANDSCAPES: FOREST, FIELD, RIVER MEADOWS.\nThe search.\n        The searchers, who were tired and some of whom\n        were still drunk, were divided into two groups:\n        one group started to search all the buildings on\n        the estate, one by one, while the others combed\n        the surrounding areas.\n        It was around half past two, when some members\n        of the search party had already preferred to lie\n        down   somewhere   and   to   sleep  off   their\n        drunkenness, that the siren suddenly sounded\n        again, calling the men back to the courtyard...\nIN THE COURTYARD.\nThe men come in with a stretcher.\n        ...They had found Sigi. He had been tied up in\n        the old sawmill, upside down. His trousers had\n        been pulled down and his buttocks were bleeding\n        from cane strokes. He seemed to be in a state of\n        shock, was unable to walk and had to be brought\n        back to the manor on a makeshift stretcher,\n        lying on his belly.\n                                \n\n\n33. CHURCH INT/DAY\nThe room is packed. The whole village is gathered.\n                                                            35\n\n        NARRATOR: The next Sunday, the Baron, at the end\n        of the service, asked the pastor if he could say\n        a few words:\n\n        BARON: You all know now what was done to my son\n        Siegmund. Policemen from the district town were\n        here this week. They questioned many of you. But\n        to no avail. First I thought that the people who\n        tortured my child were the same people who cut\n        off my family's \"cabbage heads\"...\n\nUnrest in the attendance.\n\n\n        ...because they wanted to \"get even\". Get even\n        for what? Because their mother had died while\n        she was working in the sawmill, and it was\n        supposedly  my  fault,   which  is  an  absurd\n        assertion.\n\nThe farmer, Leni and the other children are there, with\nthe exception of Franz.\n\nThe unrest grows.\n\n\n        At least, that's what Franz Felder gave as the\n        motive for his \"mowing prowess\", when the\n        policemen arrested him. I have always supported\n        the farmer Felder and his family, but one can't\n        always expect people to be grateful. That's a\n        matter of character.\n\nThe farmer wants to leave the church.\n\n        BARON: Don't run away, Felder. It's your honor I\n        want to salvage.\n        It has turned out that the valiant Franz Felder\n        has been boasting of his feat in front of his\n        fiancée. Then the coward that he is, hid among\n        his family, and so he didn't have time to\n        torture my son. And there's one thing I know for\n        sure: the senior Felder would rather bite off\n        his tongue, than cover for his wayward son. May\n        I remind you something what most of you have\n        already forgotten. Almost two months ago, the\n        doctor had a riding accident and he has still\n        not returned from the hospital. This accident\n        was caused by a wire that had been strung in his\n        garden with the explicit intent of bringing him\n        down. And in that case too, nobody knows\n        anything, saw anything or heard anything.\n\n                                                           36\n\nDisconcerted MUTTER among the attendance.\n\n\n        We all know that the people responsible for the\n        terrible injuries suffered by my son, and those\n        suffered by the doctor are sitting here among\n        us, in this room. I won't tolerate that crimes\n        of this nature go unpunished. I don't wish\n        something similar to happen to any of your\n        children. That's why I call upon you all to help\n        me find the culprit or the culprits. Ask\n        questions, keep your ears open, be watchful. If\n        we fail to find out the truth, the peace within\n        our community will be gone. Thank you, pastor.\n\nThe pastor says a few last words which we don't grasp,\nthat the narrator's voice drowns out. The people file\nout of the church, quietly and slowly, but talking\nworriedly to each other.\n\n        NARRATOR: The landowner's speech frightened the\n        people. Most knew about the incident at the\n        Thanksgiving feast. But the majority didn't know\n        exactly what had happened, and in the end they\n        didn't care. The Baron was not really popular\n        among the people, but he was respected as a\n        powerful social figure, as well as the employer\n        of nearly the whole village.\n                                \n\n34. IN FRONT OF THE CHURCH EXT/DAY\nBACK TO THE SCENE.\nThe people are leaving the church, groups are forming.\nAs the farmer Felder and his children come out, they're\nshunned.\nGauntlet down the village street. The CAMERA follows.\n         NARRATOR: ...His threat about loosing the peace\n         of the community couldn't mean anything good.\n        At the same time the mysterious character of\n        what were obviously criminal deeds fed the\n        mistrust of the farmers, deeply rooted since\n        time immemorial.\n                            \n\n35. SCHOOL. INT/NIGHT\nThe empty classroom. On the harmonium: a petroleum lamp.\nThe schoolteacher is PLAYING.\nAfter a while, someone knocks at the door. The\nschoolteacher stops.\n        SCHOOLTEACHER (surprised): Come in!\n                                                           37\n\nThe door opens hesitantly. In the dark: Eva (hardly\nrecognizable because she's so far from the lamp).\n\n        SCHOOLTEACHER (surprised and glad): Eva!\n        EVA (hardly understandable): May I come in?\nThe Schoolteacher stands up, goes toward and, laughing\nwith surprise, says to her.\n\n        SCHOOLTEACHER: What a question. Of course. Come\n        in. What happened.\n\n\nEva enters the room and closes the door behind her.\nShe's carrying a suitcase. Shyly she looks around and\ndoesn't say a word.\n\n        SCHOOLTEACHER:   Come   over   here.   It's   so   dark.\n        Come on.\n\nHe moves toward the lamp and waits half-way because she\ndoesn't follow.\n\n        SCHOOLTEACHER: What's going on?\n\n        EVA: They fired me.\n\n        SCHOOLTEACHER (startled): What do you mean?\n\nShe shrugs her shoulders.\n\n        EVA: Nothing. They just threw me out (pause,\n        then) The tutor has also been fired.\n\n\nSuddenly, in the middle of a sentence, she bursts into\nfloods of tears. At the same time she turns away from\nthe schoolteacher. He goes over to her, and stops in\nfront of her, but is too shy to touch her. Suddenly she\nturns to him again and says, sobbing:\n\n        I don't know where to go. I can't go back home\n        in the middle of the night. I'm afraid to walk\n        on the road all alone.\n\n        SCHOOLTEACHER (calming her down): Don't worry.\n        Try to calm down. There's nothing to worry\n        about.\n\n\n                                                                   38\n\n        EVA (sobbing, childish): There is.\n\n\n        SCHOOLTEACHER (with a calming smile): Come here\n        and sit down. Please calm down and then tell me\n        what happened. All right?\n\nShe's sits down on the school bench beside her. The\nschoolteacher sits on his haunches in front of her:\n\n        Well?!\n\nIt takes her time to calm down.\n\n        What happened?\n\n\nSlowly she manages to calm down, breathes deeply a few\ntimes. The schoolteacher is visibly charmed by her\nchildish despair.\n\n        EVA: The son of the Baron isn't at all well. His\n        parents are angry and desperate. Now they say\n        that it's the tutor's and my fault, because we\n        didn't pay enough attention to him. But I'm only\n        there for the twins.\n\nShe starts to sob again:\n\n        I've always taken care of them very well. When\n        you and I were dancing, the Baroness had given\n        me permission. I haven't done anything wrong,\n        really.\n\n\n        SCHOOLTEACHER: I know, come on. Stop crying!\n\n        EVA: Where shall I go now? We need the money I\n        was earning here.\n\n        SCHOOLTEACHER:   You'll  find   something  else.\n        Besides, you know very well that the Baron is\n        quick-tempered. With him, nothing is ever as bad\n        as it seems.\n\n        EVA (fiercely shaking her head):No, no, that's\n        all over now, I know it. The Baroness doesn't\n        want to see anyone. She wants to take the\n        children with her to town or to her parent's\n        estate ­ I don't know exactly.\n                                                           39\n\n        SCHOOLTEACHER: (after a pause): I'll try to talk\n        to her. A while back, we played music together.\n        (with a smile): Unfortunately, I wasn't very\n        good. Now she's got the tutor, he plays better.\n        As far as I know, he's been studying music in\n        town.\n\n\n        EVA (forgetting her grief a bit): He doesn't\n        play that well.\n\n        SCHOOLTEACHER: That's true.\n\n        EVA (after a pause, serious again): Who could\n        have done such things?\n\n        SCHOOLTEACHER: What?\n\n        EVA: To beat a child that way.\n\n\n        SCHOOLTEACHER: I don't know.\n\nLong PAUSE. Then she says softly:\n\n        EVA: Can I stay here tonight?         Don't send me\n        away, sir, please.\n\n        SCHOOLTEACHER: How can you think something like\n        that?\n\n        EVA: I'll just wait for the daylight to come.\n        Here in the classroom. Then I'll leave.\n\n\nSuddenly she starts to cry again:\n\n        They won't understand this,      at   home.   They'll\n        think I did something wrong.\n\nPAUSE. Then the\n\n        SCHOOLTEACHER: Do you want me to come with you.\n\nShe stops crying and looks at him, surprised.\n\n                                                                40\n\n        EVA: What did you say?\n\n        SCHOOLTEACHER    (cheerful):   Tomorrow,   after\n        school? I can try to find us a carriage. I'll be\n        back by evening.\n\n        EVA: And why should you do that, Sir.\n\n\n        SCHOOLTEACHER: Stop being so formal.\n\n\n        EVA (after a break): Why should you do this?\n\n\nPAUSE. Then the schoolteacher stands up and says:\n\n        SCHOOLTEACHER: Come here, I'll play something\n        for you. If you'd like that.\n\nShe thinks for a moment, then she nods eagerly. She\nfollows him, as he goes and settles in front of the\nharmonium. She sits on a bench nearby. He starts to\nPLAY.\n\n                                      \n\n36. FARM. PIGSTY. INT/EXT/DAY\nThe farmer and Paul are cleaning the pigsty which is not\nvery big. The pigs grunt excitedly because of the\ndisturbance.\nSuddenly, Franz enters.\n         FRANZ: Good morning, Father.\nThe farmer looks up, keeps on working as if nobody had\ncome in.\nPaul greets Franz with a nod, remaining silent.\nAfter a while, they've done their work. Ignoring Franz,\nthe farmer goes outside.\nFranz, who has stepped aside to let his father by, says\nto him as he goes out:\n         FRANZ: I'm back again. They set me free.\nAt this, the farmer stops and turns around. He looks\nFranz right into the eyes:\n         FARMER: I can see that. So what?\nFranz bows his head. Paul, who has followed his father,\nout of the pigsty, glances surreptitiously at his\nbrother. The farmer goes over to the fountain and washes\nhimself. Franz follows him slowly and stops beside his\nfather, who keeps ignoring him. After a while\n\n                                                           41\n\n        FRANZ says (softly): Can't you forgive me,\n        Father?\nThe farmer stops washing and turns to Franz:\n        FARMER: What do you want me to forgive for? That\n        the estate won't give me any work now? That Leni\n        has been fired in disgrace? That your brothers\n        and sisters soon won't have anything to eat. Is\n        that what you mean? Or is it something else?\n\n\n                            \n\n37. COUNTRY ROAD AND DOCTOR'S PROPERTY EXT/DAY\nThe CAMERA follows the carriage in which are Eva and the\nschoolteacher.\n        NARRATOR: The next day, after school, I went to\n        the estate to inquire about Sigi's health and to\n        intercede for Eva's reinstatement. We were told\n        the Baroness had left that morning with her\n        children. Reluctantly, the steward lent me a\n        carriage to take Eva home.\nAn open carriage with the Doctor inside comes from the\nopposite direction. The passengers of the two carriages\ngreet each other. The CAMERA follows the Doctor and\nlooses Eva and the schoolteacher.\nThe doctor has one arm in a sling.\nThe Doctor's carriage ends up turning into his property.\nThe driver helps the doctor get out. Xenia comes running\nout of the house and greets her father. The driver\nunloads the luggage. The doctor and Xenia go into the\nhouse.\n\n       Just as we were leaving the village, we met the\n       doctor.\n       A few days after the Thanksgiving feast,\n       Rudolph, his four year old son, had suddenly\n       disappeared. Of course, everybody was terribly\n       upset in view of all the previous occurrences.\n       Finally, he was found walking down the road,\n       scantily dressed for a trip, headed eagerly\n       toward the town. When he was asked where he was\n       going, he said he wanted to visit his father.\n       Seems he fought tooth and nail against being\n       taken home.\n       Somebody must have told this to the Doctor.\n       Since he was scheduled to be released from\n       medical care anyway, he had prematurely put an\n       end to his stay at the hospital.\n\n                            \n\n\n                                                           42\n\n38. THE DOCTOR'S HOUSE INT/DAY\nBACK TO THE SCENE.\nSTAIRWELL.\n        DOCTOR (calls several times): Rudi?\nHe throws an ironical inquiring look at Xenia. Xenia\nshrugs her shoulders, clueless:\n\n        XENIA: He was in the living room a short time\n        ago.\n\nJust as they're about to go to the living room, the\ndriver comes in with the luggage. The Doctor thanks him\nand pays him. The driver leaves. Xenia has been waiting\nin the doorway. Now they go together into the\n\nLIVING ROOM\nThere's nobody. They go into the kitchen\nKITCHEN. Nobody. The look under the kitchen table, in\nthe pantry. Nobody.\n\n         DOCTOR: Rudi? Where are you?\nAgain the\nSTAIRWELL. The doctor doesn't know whether to be angry\nor to laugh about the whole matter. He goes to his\nwardrobe to take his off his jacket. Because of the\nsling, Xenia has to help him. That's when she notices\nthe toilet. She tells her father with a smile. As Xenia\nhangs up the doctor's jacket, he goes to the toilet door\nand tries to open it. It's locked. The Doctor stops in\nfront of it.\n         DOCTOR (quiet): Hello, Rudi. Don't you want to\n         say hello to your father? No?\nPAUSE:\n         I heard you even wanted to visit me at the\n         hospital. And now you lock yourself in?\nPAUSE. The doctor looks shortly at Xenia who's carrying\nthe luggage upstairs. Then he keeps on talking to\nRudolph:\n         All right. Then, I don't want to see you either.\n         I'm going away now. You can stay in the toilet,\n         if you want.\nHe goes down the few steps to the entrance, waits a\nmoment and then leaves the house.\n\n\n                                \n\n\n\n39. PROPERTY THE DOCTOR'S EXT/DAY\nBACK TO THE scene.\n                                                            43\n\nThe doctor steps out of the door, and wanders through\nthe garden. He goes over to the trees, where the wire\nhad been strung. He examines the traces of the wire on\nthe bark. He lights a cigar, then looks out at the mowed\nfields.\nAfter a while Xenia comes over to him. He glances at\nher, then again at the fields. Both remain silent. After\na while\n        XENIA   says:  Everything  is   ready  in   your\n        practice.   Mrs.   Wagner  prepared   everything\n        yesterday.\n\nPAUSE then\n\n        DOCTOR: Why do you tell me that?\n\nXenia looks at him, surprised, shrugs her shoulders.\n        XENIA: I don't know. I just thought you might\n        want to know.\nPAUSE.\n        DOCTOR: Has she taken good care of you?\n        XENIA: Yes.\nPAUSE. The doctor turns to Xenia:\n        DOCTOR: How old are you now?\n        XENIA: Fourteen.\nThe doctor looks at her, laughs silently and shakes his\nhead. Again he looks out on the fields. After a while he\nsays:\n        DOCTOR: It's amazing how much you look like your\n        mother.\nXenia remains silent. Suddenly she whispers:\n\n        XENIA: Dad.\n\nThe doctor turns to her. She nods toward the house. The\ndoctor follows her look. Indeed Rudolph, who from here\nlooks even smaller than he really is, has stepped\ngingerly out of the door. Unsure and undecided, torn\nbetween defiance and longing, he's kept one hand on the\ndoor handle that he can barely reach.\n\n\n                            \n\n40. RECTORY. STUDY. INT/NIGHT\nThe pastor cleans the cage of the small bird behind the\ndesk and feeds the animal. As he does it, he talks to\n\n                                                           44\n\nMartin, who, the white ribbon still tied around his\nupper arm, stands in front of the desk.\n        PASTOR: Your mother and I are deeply worried\n        about you. Think about it. Are you sleeping\n        badly? Are you overtired?\n       MARTIN   (as   if   he   didn't   understand   the\n       question): No.\n       PASTOR: Do you have problems in school that I\n       don't know?\n        MARTIN (as above): No, Father.\nThe pastor turns shortly around to his son, looks at\nhim, then turns again to the bird.\n\n       PASTOR: You probably don't understand why we\n       worry. It comes from a sad experience I want to\n       tell you briefly about:\n       As you know, I'm also acting as pastor for the\n       communities of Birkenbrunn and Hebern. In the\n       latter place, some years ago, a mother came to\n       see me. She had noticed that her son, who was\n       about the same age as you, and had the same\n       symptoms that you've been showing for some time.\n       Although until then the boy had been healthy and\n       active,   suddenly   he  showed   a   noticeable\n       weariness, he had dark rings under the eyes,\n       seemed depressed and joyless. The boy had also\n       changed emotionally: before he had been funny,\n       frank, almost naughty, but now he became\n       withdrawn. He tried not to look his parents in\n       the eye, and was caught telling small and even\n       big lies.\n\nThe pastor has finished the cleaning and feeding, and\nnow sits down behind his desk, Martin opposite him:\n        That lasted approximately half a year. Then\n        everything went very fast: he lost his appetite,\n        couldn't sleep any more, his whole face took on\n        the brownish color of the rings under his eyes,\n        his hands began to shake, his memory stated to\n        fail him, he was covered with numerous small\n        pustules, first on his face, then on his whole\n        body and finally he died. The body, which I\n        blessed, looked like the body of an old man.\nThe pastor watches Martin:\n        PASTOR: Do you understand now why I'm worried?\nMartin reacts with a timid nod of his head.\n        PASTOR: So, according to you: what caused these\n        changes that led to the miserable end of this\n        boy?\n       MARTIN (hardly able to speak): I don't know.\n                                                            45\n\n        PASTOR: I think you know well.\nMartin doesn't know what to say, he looks down. The\npastor watches him for a long moment, then he gets up,\nwalks around the desk and sits down on its edge, in\nfront of the boy, so that their heads are facing each\nother.\n\n        Won't you tell me? No?\n        Then I'll tell you what the cause was: The boy\n        had learned from someone, who had harmed the\n        finest nerves of his body, in the area where\n        God's will has erected sacred barriers. The boy\n        imitated this action. He couldn't stop doing it,\n        so that at the end he destroyed all the nerves\n        in his body, and so much that he died of it.\n\nMartin seems very affected. He has bowed his head,\nswallows several times, and hardly dares to breath.\n        Look at me, Martin.\nMartin looks up fearfully, then immediately looks away\nagain.\n        I just want to help you. I love you with all my\n        heart. Look at me.\nMartin looks his father in the eyes.\n        Be sincere, Martin. Why did you blush and become\n        so nervous when I told you the story of the poor\n        boy.\n        MARTIN: Blushed? I don't know... I felt sorry\n        for him.\n        PASTOR: Is that all?\n        No, Martin, there has to be another reason. It's\n        written on your face.\n        Be sincere, Martin. Sincerity brings you closer\n        to God, our beloved Father, and to all human\n        beings.\n        MARTIN (starts to cry): Oh, my God!\nHe cries in a such pitiful way that even the pastor has\ntears in his eyes. He embraces the boy. The latter\nseizes the hand of his father and kisses it intensely.\n        PASTOR: Well, Martin, why are you crying? Shall\n        I spare you that confession? You too have done\n        what that wretched boy did, haven't you?\n        MARTIN (crying): Oh my God! Yes.\nTHE SCREEN GOES BLACK.\n                            \n\n\n\n\n                                                           46\n\n41. THE MIDWIFE'S HOUSE. LIVING ROOM. INT/NIGHT\nIntercourse between the midwife and the doctor. She\nholds on to the sideboard, as he penetrates her from\nbehind. Both are fully dressed, she has just lifted her\nskirt.\nWhen he is ready, she turns around and puts her arms\naround him. He lets her do it, with a patronizing smile\nand pulls gently away from her.\n        DOCTOR: Careful, my arm.\nShe tries to hide her frustration, sits down again with\nhim at the table, on which are the leftovers of their\nmeal. With a little ironic smile, the doctor raises his\nglass to her. She takes her glass and clinks it with\nhis. She drinks. An embarrassed silence follows.\nFinally, she says\n        MIDWIFE: It's great that you're back. It was\n        about time.\n         DOCTOR: You can say that. Yes.\nPAUSE.\n         MIDWIFE: It was   difficult    with    the    children,\n         without you.\n         DOCTOR: I know.\n         MIDWIFE: He doesn't like me.\n         DOCTOR: Who?\n         MIDWIFE: Rudi.\n         DOCTOR (after a pause): He's at a difficult age.\n        MIDWIFE: Actually not.\nPAUSE. Then:\n        They're always at a difficult age.\n        DOCTOR (more to himself, with a faint smile):\n        Yes.\nLONG PAUSE.\n        MIDWIFE: You didn't miss me.\n         DOCTOR: Come on. What are you saying?!\n         MIDWIFE: Nothing. I said it because it's the\n         truth.\nPAUSE.\n         DOCTOR: There's   nothing   like   a   nice    dose   of\n         self-hate.\n         MIDWIFE: What?\n         DOCTOR: Nothing. Forget it.\n\n                                                                    47\n\nAfter a pause, she reaches over the table, takes his\nhand, puts her cheek against it. He lets her do it, then\ntakes his hand from under her head and strokes her hair.\n\n                            \n\n\n\n42. CHURCH EXT/DAY\nIt's snowing. From the inside of the church, we hear the\nchildren's choir:\nCHILDREN (singing in harmony):\n\n        ...us free from all misery,\n        That has hit us now.\n        That old evil enemy,\n        Is serious about it,\n        Great power and much deceit\n        Are his cruel armor,\n        No one on earth resembles him...*\n\nOver this:\n\n        NARRATOR: Winter came early that year. At the\n        Reformation feast on the first Sunday of\n        November, a deep blanket of snow covered the\n        village.\n        The Baron, who had come back without his family,\n        didn't attend, which was very unusual for him...\n\n                            \n\n\n\n43. CHURCH INT/DAY\nIMMEDIATE BACK TO THE scene.\nThe community celebrates the Reformation Feast.\nThe schoolteacher conducts the children's choir. The\nchildren sing enthusiastically. Marie and Martin wear\nthe white ribbon on their arm.\n\n        NARRATOR: ...The villagers took that as a sign\n        of his anger. Indeed, no evidence had been found\n        as to the possible author of the crime, although\n        the Baron's appeal had led to a flood of mutual\n        suspicions,   even    to   some    attempts   of\n        denunciation that had all turned out to be\n        untenable.\n\n\n                                \n\n\n\n\n                                                           48\n\n44. THE STEWARD'S HOUSE. INT/NIGHT\nThe doctor examines the steward's baby that is crying.\nFinally, he turns to the parents.\n        DOCTOR: Well, it's not pneumonia. But you must\n        be careful. If his temperature rises, call me\n        again. For the time being you must give these\n        drops every two hours. And hang some wet sheets\n        over the oven. That facilitates breathing.\nWhile the mother puts the child back in the cradle, the\ndoctor and the father go down the STAIRWAY to the LIVING\nROOM.\n        How long has the window been open?\n       STEWARD: Difficult to say. My wife nursed him at\n       about one o'clock. When she came back, it was\n       around half past two. At that time it was icy\n       cold in this room.\n       DOCTOR: And the baby didn't cry?\n        STEWARD: No. The children were upstairs and\n        didn't hear anything either.\nThey have reached the living room where Liesl, Georg and\nFerdinand get up as he comes in.\n        DOCTOR (to the children): He's doing all right,\n        considering the circumstances. We have to wait.\nThe children seem worried. To calm them the doctor adds:\n        For now we'll have to wait.\nThe steward has gone to the sideboard.\n        STEWARD: Can I offer you something to warm you\n        up?\n       DOCTOR: No, thanks. I'm overloaded with work.\n       When one has been away for so long...\n        STEWARD: Georg!\nAt a sign of the father, Georg jumps up and gets the\ndoctor's coat and hat from outside. In the meantime, the\nfather keeps on chatting with the doctor:\n        And how is your arm doing?\n       DOCTOR: It's all right. Everything will be fine\n       in two or three weeks.\n        STEWARD: That must be terrible, I imagine. You\n        probably feel like half a man when you can't use\n        your arm properly.\nGeorg has come back with the hat and the coat, and hands\nthem to the doctor,\n        DOCTOR: Thank you.\nThe steward helps him with his coat because of his bad\narm.\n                                                           49\n\n         DOCTOR (laughs): Quod erat demonstrandum. Thank\n         you. Well, good night, children.\n         CHILDREN: Good night, Doctor.\n        DOCTOR (to the steward who holds the door open):\n        Thank you. If your wife thinks that the baby...\nThe steward closes the door to the stairwell, so that we\ncan't grasp the rest of their conversation.\nThe children are alone. They remain silent. Then\n        FERDINAND: Well...\n         GEORG: What do you mean \"well\"?\n         FERDINAND (\"dumb question,      it's   obvious\"):   I\n         mean! That's fine.\nPAUSE.\n         LIESL (to Ferdinand): When did you go down to\n         see Father? Down in his office.\n         FERDINAND: Why?\n         LIESL: Just asking.\n\n\n                              \n\n\n\n45. SNOW-COVERED COUNTRY ROAD EXT/DAY\nThe schoolteacher, a rucksack on his back, walks through\nthe snow which is only furrowed by some carriage tracks.\n\n         NARRATOR: In mid-December, I finally got a\n         letter from Eva. Her father had found her a new\n         job in the district capital, which she would\n         start at the beginning of the New Year.\n         Since that night, where she had come looking for\n         shelter in the school and we had tried to tell\n         each other the story of our short lives until\n         the wee hours of the morning, I could no longer\n         banish from my thoughts her pale face, her shy\n         but frank personality and her shining hair red.\n         The school holidays lasted until the morning\n         after New Year's Day, but already the second day\n         after Christmas ­ the weather was cold but sunny\n         ­ I went on my way to Obersdorf in order to\n         visit Eva and her parents.\n\n\n                              \n\n\n                                                                 50\n\n46. THE HORSE-TRADER'S LIVING-ROOM INT/DAY\nA lower middle-class room.\nThe schoolteacher sits in front of Eva and her siblings,\n6 children between 14 and 6, mostly red-haired like Eva.\nEmbarrassed silence. The younger children whisper and\ngiggle. The conversation is slow. After a long pause\n        EVA says: And Sigi?\n        SCHOOLTEACHER: I don't know. The Baroness isn't\n        back yet.\n        EVA: And the Baron?\n        SCHOOLTEACHER (shrugs): We hardly see him. He\n        talks to nobody. I don't know. Some say they've\n        gone to the south. To Italy.\n        EVA: To Italy? Really.\nPAUSE.   The   children    giggle,   amused   over    the\nembarrassment of the two people.\nThe schoolteacher and Eva look at each other, but Eva\nsoon averts her eyes.\n        SCHOOLTEACHER: They now want to tear down the\n        sawmill for good. That's what the steward says.\n        Because it isn't worthwhile to...\nAt that moment the door opens and Eva's parents come in.\nObviously, the mother went to fetch the father. She is\nplump, in her late forties and only wears a woolen shawl\nover her shoulders. The father wears a hat and overcoat.\nHe's a sturdy man in his early fifties, of peasant\nstock. He probably came straight from a tavern, and\nappears to be slightly drunk. The schoolteacher, Eva and\nthe children stand up. The schoolteacher bows deeply:\n        SCHOOLTEACHER: Good morning.\n        FATHER: Good morning, young man.\nThey shake hands.\n        FATHER: Please be seated. We're not very formal\n        here.\nWith a short movement of his hand the father invites him\nto sit down.\n        FATHER (to the children): Scram!\nThe children, rather sheepish since the arrival of their\nfather, leave the room. The father unbuttons his over\ncoat, throws the hat on the sofa and sits down. The\nmother has removed her shawl and asks the schoolteacher:\n        MOTHER: Would you like something to drink?\n        SCHOOLTEACHER: No, thank you. Very kind.\n        MOTHER: Really?\n        SCHOOLTEACHER: Really. Thank you very much.\n                                                            51\n\nThe father sits      down beside Eva and looks at the\nschoolteacher. Eva    appears to be awkward, and stares at\nthe table in front   of her.\n        FATHER: So   you're a schoolteacher.\n         SCHOOLTEACHER: Yes.\n        FATHER: Can you afford to have a wife?\nShort embarrassed PAUSE.\n        SCHOOLTEACHER: My father works as a tailor in\n        Grundbach. I have an apprentice's diploma. So I\n        earn quite a bit on the side\n         FATHER: You should have taken over your father's\n         business, that would have been smarter.\nPAUSE.\n         Well. And why are you so focused on that girl?\n         She's almost still a child. You could almost be\n         her father.\n         SCHOOLTEACHER (smiles): I'm thirty-one.\n         FATHER (grinning): Well, you can still handle\n         what matters.\n        MOTHER (embarrassed): Father!\nEva and the schoolteacher don't know where to look.\n        FATHER: Let's be serious: do you know whether\n        she's willing to get married. She's still a\n        child. She hasn't seen anything of the world.\n        To Eva: Say something. Do you want him?\nEva wishes the earth would engulf her.\n        FATHER: Come on. Don't make such a fuss. He\n        walked all the way over through the fresh snow.\n         MOTHER: Why don't you leave her alone.         Of\n         course, she wants him. Can't you feel that?!\n        FATHER: How can I? If she keeps her mouth shut!\nEva jumps up and runs out, so as not to burst into tears\nout of shame.\nThe mother follows her, shaking her head disapprovingly\nat the father. The schoolteacher stands up, as Eva ran\nout. He'd rather follow her, but has to remain polite\ntoward the father. The father says calmly:\n\n         FATHER: Just sit down. That's how women are. A\n         bit hysterical, the whole lot of them. Listen.\n         I'm not a big talker. On one hand, it suits me\n         for the girl to leave the house. We have a lot\n         of mouths to feed, as you can see.\n\n\n                                                             52\n\n         On the other hand, it's all moving a bit too\n         fast for me. I don't know you. It's not that I\n         don't like you, but I need to get some\n         information about you first. Besides, the town\n         hairdresser has agreed to take her on as an\n         apprentice.\n         That way she'll get to meet people and she can\n         make up he mind whether she really wants this or\n         not. And if in a year's time she has stuck to\n         this idea, we can l talk about it again. And you\n         can make up your mind too, all right?\n         SCHOOLTEACHER: I actually thought I...\n         FATHER (interrupts him): I know, I know. But\n         it's either that or nothing. You get it?\n         SCHOOLTEACHER (after a short pause) steps back:\n         If you insist...\n        FATHER: Yes, I do.\nHe holds out his hand to the schoolteacher, who accepts\nit after a brief hesitation.\n        FATHER: That's it. I'm pleased. Well, business\n        is waiting. Even on holidays. I'll send the girl\n        back in so that you can say good-bye. A year\n        goes by fast. The world won't collapse. And\n        during your holidays you can come and visit her.\n        Good-bye.\nHe leaves the room. The schoolteacher is thrown off\nbalance by all this. He stands up and takes a few steps.\nHe sits down again and thinks.\nFinally, the door opens and Eva enters. She doesn't\nreally know what to do. Neither does the schoolteacher.\nAs she comes in he stands up again. Finally Eva goes\nover to the table and sits down. The schoolteacher also\nsits down. They exchange a short glance and an equally\nbrief smile.\nPAUSE.\n        SCHOOLTEACHER says: Did your father tell...?\n         EVA: Yes.\nPAUSE.\n         SCHOOLTEACHER: Is that all right with you?\nPAUSE.\n         EVA: Is that all right with you, sir?\n        SCHOOLTEACHER (smiles): Don't be so formal with\n        me.\nEva looks up. Their eyes meet. Then she takes his hand\nin her hand. They remain seated without saying a word.\n\n                             \n                                                            53\n\n47. RECTORY. THE BOYS' BEDROOM. INT/NIGHT\nIt is dark. Martin, Anton and Florian, whom we don't\nrecognize at first glance, are lying in their beds.\nThrough the window, a red glow, slowly getting stronger.\nSuddenly\n         MARTIN'S VOICE: Toni! Are you awake?\n       Toni!!\n       ANTON'S VOICE (half asleep): What is it?\n       MARTIN VOICE: Look.\n       ANTON'S VOICE: What's happening?\n        MARTIN VOICE: Look! Look what's happening out\n        there!!\nNow, Anton sits up slowly, rubs his eyes.\n        ANTON'S VOICE: My God, what do you want?\n        MARTIN VOICE: Over there!! Have a look out of\n        the window!!\nAnton turns to the window and looks at the red glow.\nThen he slips out of the bed and goes to the window.\nSuddenly, he is wide-awake:\n        ANTON: Something is burning! Over there at the\n        estate!\n         MARTIN: Untie me!\nAnton turns around to Martin, hesitates.\n         MARTIN: Come on, untie me!\nAnton doesn't really know what to do. He turns to the\nwindow again, then again to Martin. The latter screams\nangrily:\n         I told you to untie me!!\n       ANTON: I don't know...\n        MARTIN: I'll beat you black and blue, if you\n        don't untie me!\nThe loud dispute has now also awakened Florian, who says\nin a drowsy voice:\n        FLORIAN: What's happening? Why can't you be\n        quiet.\n       MARTIN: Flori, come over and untie me!\n       FLORIAN: What's going on?\n       MARTIN (yells): Untie me, dammit!! You idiots!\n       It's burning!!\n                                                           54\n\n        FLORIAN: It's burning?\nFlorian gets up himself and patters to the window. He\nlooks out and then says, amazed and enthusiastic:\n        It's burning!\n        MARTIN (imitates him angrily): OK, it's burning!\n        Now untie me, godammit!\nFlorian looks at Anton with questioning eyes and then\nsays to Martin:\n        FLORIAN: But Father hasn't allowed it...\nReverse angle POV of the two boys at the window toward\nMartin, who we see for the first from the front. His\nwrists are tied to the left and the right side of the\nbed. Trying sit up, he pulls furiously at his ties.\n        MARTIN (furious): But if there's an emergency,\n        you idiot. Somebody must warn them! (he yells\n        loudly: Faaaather!! Mooooother!! Father!\nFrightened by his screams, Anton now goes over to him\nand undoes his ties.\n        ANTON: Stop shouting. I'll untie you.\n        FLORIAN: Shall I call Mother?\nWe already hear hurried STEPS in the corridor. The door\nopens and the mother enters, dressed in a nightgown.\n        MOTHER: What's going on here?\nMartin has just been untied.\n        MARTIN: It's burning!\n        MOTHER: I know. Your father has already gone.\nIn the door, the girls appear after their mother. They\nhave left their room attracted by the noise. The mother\nturns to them:\n        MOTHER: What are you doing here? (to everyone):\n        You all go to bed now. It's nothing. There's a\n        fire on the estate. You don't need to be afraid.\n        Go to bed and sleep. Come on, Marie, take your\n        sisters with you and go to your room. Otherwise\n        you'll catch a cold.\nThe girls disappear again. The mother turns to Martin:\n        Why did you make so much noise? You woke us all\n        up!\nMartin doesn't know what to answer. Then he says\napologetically:\n        MARTIN: I thought it was dangerous.\n       ANTON (apologizing): I had to untie his hands.\n       MOTHER (calming them down): Now, everything's\n       all right again. Tomorrow, Father will tell you\n       what happened with the fire. All right? Now you\n                                                           55\n\n        all got back to bed. I'll wait till you're back\n        in bed. It's freezing cold outside.\nThe three boys go back to bed. But first Anton ties up\nMartin's hands again. He pulls a blanket over his\nbrother. Then they all disappear under their blankets.\n\n       MOTHER: Good night then. Sleep well.\n        MARTIN, ANTON, FLORIAN: Good night, Mom!\nThe mother closes the door. Coming from outside, we can\nsee the glow of the fire.\n\n                              \n\n48. ESTATE EXT/NIGHT\nESTABLISHING SHOT.\nA big barn is blazing   fiercely. SOUNDS of the FIRE.\nAgainst it we see,       as silhouettes, the Baron, the\nsteward and his wife,   the pastor, and all those, who are\nvainly trying to save   thing.\n\n                              \n\n\n49. THE STEWARD'S HOUSE INT/NIGHT\nIn the children's bedroom, lit by the reflection from\nthe nearby flames: Liesl, Georg and Ferdinand. They\nstand at the window and stare into the flames.\n\n\n                              \n\n50. FARM BUILDINGS /EXT/DAY\nPaul discovers his dead father in the pigsty. The farmer\nhas hung himself up from a hook in the wall. The\nknocked-over stool still lies beneath his dangling feet.\nPaul runs from the stable out to the\ncourtyard. He stops.\nThen he tiptoes toward the stable door. As he touches\nthe stable door, he lacks the strength to go inside\nagain. Slowly he heads for the living room. The\nchildren, who are gathered, pay no attention to him.\nLeni, who's cooking, has looked up from her work\nbriefly. Paul sits down on the bench against the wall.\nIt is quite dark in there.\n\n                              \n\n\n51. THE DOCTOR'S HOUSE. OFFICE. INT/DAY\nThe doctor sits at his desk, the midwife sits on the\nvisitor's chair opposite him. She tries to masturbate\nhim.\n\n                                                             56\n\nThis time, too, both are fully dressed. Over his\nclothes, the doctor wears an unbuttoned white coat.\nHe watches the woman for a while in her activity, then\nhe says coldly:\n        DOCTOR: Wouldn't it be better if you stopped\n        doing that?\nIt's like a slap in the face. She looks dumbfounded.\n\n       DOCTOR: Why all the effort? Don't look at me so\n       dumbfounded.\n       It's not that you lack talent... It's just that\n       I can't do it with you any more, that's all.\n       To tell you the truth: you disgust me.\n\nHe gets up and buttons up his pants. She feels as if the\nworld had collapsed around her.\n        Please finish your work now? I don't want to\n        spend all night here.\nThe midwife remains seated, her head bowed, as if struck\nby a lightning\n        MIDWIFE (quietly): What did I do to you?\n        DOCTOR (irritated): My God, you haven't done\n        anything at all. You're ugly, you're messy,\n        you're flabby and you have bad breath. Isn't\n        that enough?\nPAUSE. He points at the examination couch on the other\nside of the small room, saying casually:\n        The upholstery has to be sterilized with boiling\n        water\nShe remains immobile, and shoots a quick mechanical\nglance at the examination couch. He looks at her.\n        Stop sitting there as if you were carrying all\n        the world's woes on your shoulders. The world\n        won't collapse down. Not on you, or on me.\n       (explains):I just want it to stop, that's all.\n       I've been trying, but it's just disgusting. I\n       try to think of another woman when I'm making\n       love to you, a woman who smells good, who's\n       young one, one who's less flabby than you, but\n       my imagination can't handle it. In the end, it's\n       you again and then I just feel like throwing up\n       and am embarrassed at myself. So what's the\n       point?!\n       MIDWIFE: Are you through?\n        DOCTOR:(contemptuously)): Yes, I have been for\n        ages.\nHe turns away. The midwife hardly moves. She's still\nsitting on the visitor's chair. It takes her a lot of\n\n                                                           57\n\nstrength not to faint ­ at the same time she speaks out\ncalmly.\n\n         MIDWIFE: You must be very unhappy to be so mean.\n         DOCTOR: Oh God! Please, not that routine!\n         MIDWIFE: I know that I'm not much to look at. My\n         bad breath comes from my stomach, you know that\n         very well. But it didn't bother you in the past\n         when we got together. I already had my ulcer\n         when your wife was still alive.\n         DOCTOR: Please spare me these sordid details.\n         But let me reassure you: it has always disgusted\n         me. I accepted it, because I wanted to ease my\n         pain after Erika's death and I didn't care with\n         whom. I could have screwed a cow. Whores are\n         unfortunately too far from here and regrettably\n         once every two months isn't enough for me, even\n         though I'm getting older. So skip your damn\n         martyrdom routine and get out.\n\n\nPAUSE.\n         MIDWIFE (keeps on speaking softly): Why did this\n         only occur to you now?\n         DOCTOR: According to you: when should it have\n         occurred to me?\n         At the hospital, I had forgotten how tiresome\n         you were. One grows sentimental when one's in\n         pain.\nPAUSE.\n         DOCTOR (tired): Get out. Why don't you get out.\n         Don't you have any pride?\n         MIDWIFE (equally tired): There's no room for any\n         with you.\n         DOCTOR: That's true.\n         MIDWIFE: Aren't    you   afraid   that   I   might   do\n         something silly?\n         DOCTOR (laughs with disdain): Go ahead. At least\n         that would surprise me. But be careful: it might\n         be painful.\n         MIDWIFE: I know. I'm ridiculous. You wouldn't\n         care anyway.\n        DOCTOR: Well...\nShe looks at him.\n\n\n\n                                                                   58\n\n        MIDWIFE: Why do you despise me? For helping to\n        raise the boy? For watching you fingering your\n        little daughter and not saying a word?\n\nThe doctor goes over and slaps her. Tears start to run\ndown her face, but after a short pause she keeps on\nspeaking, \"unmoved\":\n\n        For helping you to deceive yourself? For\n        listening to you claim how unique your love for\n        Erika was, though the whole village knew, how\n        badly you treated her?\n        For loving you, although I know you can't stand\n        being loved?\n\nThe doctor snorts with disdain.\n\n        DOCTOR: That's it. Now leave me alone. I've got\n        work to do.\n\nShe gets up and makes room for him. He sits down at the\ndesk and \"works\". She looks down at him:\n\n        MIDWIFE: You can't afford to get rid of me. Who\n        would do the dirty work for you, who would help\n        you with the children, and here in you practice?\n        You're not speaking seriously. You just want to\n        see how far you can go, don't you: will she\n        still put up with it or can I drag her even\n        lower through the mud?\n\nPAUSE. The doctor \"works\", as if he hadn't heard. She\nkeeps watching him for a while, and then says softly:\n        I'm tired too. I've got two retarded children:\n        Hans and you. You're the one that gives me most\n        trouble.\nHe looks up at her. After a pause, he says:\n        DOCTOR: My God, why don't you just die?!\n\n\n                                \n\n\n\n\n52. FARM. EXT/DAY\nRays of cold winter sun.\nThe men carry the coffin out of the house. Some people\nare already waiting outside. All wear mourning clothes.\nThe coffin is shouldered, the funeral procession forms,\nwith the pallbearers and in the lead. The others who had\ngathered in the house follow. Paul comes out with Sepp,\nwhom he tries to calm. Finally Leni comes out and, in\n                                                           59\n\nwords that we can't hear, asks the old midwife to look\nafter the farm for a short while. She gathers her\nsisters and with them gets in the funeral procession\nright behind the coffin.\nThe procession starts to move off. As it comes around\nthe corner of the farm to go down the path leading to\nthe village, Franz comes toward them. Muttering is heard\nfrom the villagers. They don't know how to react. The\nprocession slows down. Franz comes over. For a while he\nstands in front of the coffin, head bowed. Then he joins\nhis brothers and sisters. He and Leni exchange a glance,\nthen he takes his place beside her. After he has\nmotioned to the coffin bearers, the procession starts to\nmove off again slowly, despite of the continued\nmuttering. Paul, who is still carrying Sepp, looks\nexpectantly toward his older brother who squeezes his\nhand. Paul smiles shyly. Then Franz takes over little\nSepp, in the most natural way. For a long moment it\nalmost looks as if, despite of all the gloom, these\npeople weren't desperate.\n                             \n\n\n\n53. VILLAGE AND SURROUNDING LANDSCAPE EXT/DAY\nVarious long shots of the snow-covered landscape.\n\n        NARRATOR: The year was coming to an end with\n        fine weather. The sun made the snowy landscape\n        sparkle so brightly that it hurt the eyes.\n        None of us suspected that it would be the last\n        time a year moved on to the next in an era of\n        peace, and that that same year a radical change\n        would take place of which no one had the\n        faintest inkling...\n                                \n\n\n54. RECTORY. LIVING ROOM. INT/DAY\nThe decorated Christmas tree. Outside bright sunlight.\nThe pastor is taking the white ribbon off Marie's head\nand Martin's arm. The rest of the family witnesses this\nalmost solemn act.\n        NARRATOR: ...Despite of the strange events, that\n        had unsettled the village, we thought of\n        ourselves as united in the belief that the life\n        in our community was God's will and worth\n        living.\n        PASTOR: ... I take of this ribbon from you, in\n        the belief that from now on you'll no longer\n        need it.\n        You, Marie, will be accepted this year as a full\n        member of the church community. You will receive\n                                                           60\n\n        Christ's body as bread and as wine. May the time\n        of preparation for the confirmation feast be one\n        of happiness and enrichment.\n        And you, Martin: from now on you shall not only\n        be free of that ribbon, but also from those\n        nightly ties that were intended to save you from\n        yielding to the temptations of your young body.\n        For in a house full of festive expectation, you\n        too, on your own, shall make your contribution\n        to mental and physical purity.\n        I trust in you, my beloved children, and wish\n        you a profitable and happy new year.\nHe strokes the children's heads. They kiss his hand. The\nmother embraces them heartily.\n\n                            \n\n55. ESTATE EXT/DAY\nSpringtime.\nThe Baroness, Sigi and a new, a forty-ish nanny with the\ntwins are get out of a carriage in front of the manor.\n\n        NARRATOR: Shortly after Easter, in the last week\n        of April, the Baroness came back with the\n        children. She was accompanied by a new nurse.\n        Thus my secret hope that Eva would be able to\n        come back here, had definitely been dashed.\n        The nurse was a chubby, middle-aged Italian who\n        came, as everybody soon learned, from the town\n        on the Mediterranean coast where the Baroness\n        had spent the winter.\n\nA maid hurries out of the house with reinforcements, the\nBaroness is being welcomed respectfully and the luggage\nis being unloaded. The nurse gives instructions in\nItalian, which leads to some confusion. Then the nanny\ntalks to Sigi who translates to the servants, laughing.\nBesides, the boy looks transformed: instead of his\nformer pale skin color, his face now has a nice tan, his\nfair hair has been further bleached by the sun, he has\ngrown taller and looks altogether stronger and happier.\nThe Baroness too seems more relaxed and restored.\nShe and Sigi are about to go straight into the house\nwhen we hear, coming from the other side of the\ncourtyard\n        FERDINAND'S VOICE: Sigi!\nSigi turns around. Ferdinand has seen him from the\nwindow and called. Sigi waves back:\n        SIGI: Hi, Ferdinand!\n        FERDINAND: Wait! I'm coming down!\nSigi wants to run over to the steward's house.\n\n                                                           61\n\n       BARONESS:   Stay   here,   Sigi,   you   can   see   him\n       later.\n       NURSE (in Italian): Let him go, Signora! He's so\n       happy to be home again.\n        BARONESS (muses, then smiles): All right, you\n        can go. But don't stay too long.\nSigi hurries off. The Baroness and the nurse look at\neach other in agreement. The Baroness smiles faintly.\nThen they go through the door into the house.\nFor a moment we only see the open door with the dark\nstairwell behind it.\nThen we hear the STEPS of the Baron, first on the gravel\nin the yard. Then Baron comes into frame, and goes\nthrough the door into the house. He vanishes into the\ndarkness of the stairwell. From there we hear his voice:\n        BARON (calling): Beatrix? Beatrix, where are\n        you?\nThe nurse comes out after a while again\n        NURSE (calls in Italian): Sigi. Don't you want\n        to come say hello to your father?\nBut Sigi is talking intensely to Ferdinand on the other\nside of the courtyard and doesn't answer.\n\n\n                             \n\n\n\n56. SCHOOL. INT/DAY\nCLASSROOMS.\nThe children are going wild. Brawling, sponge and chalk\nare flying through the air. Some are packing up their\nbelongings, preparing to leave the classroom. In short,\nthe way children behave once the lesson is over.\nMarie stands at the classroom door. She watches her\nclassmates. The she looks through the door into the\nCORRIDOR.\nIt's empty. She comes back to the CLASSROOM, but stays\nat the door so that she can still keep an eye on the\ncorridor. Apparently, she has been posted there as a\nlookout to warn against the possible arrival of a\nteacher.\nThe shouting, laughter and brawling goes on. Suddenly,\nMarie sees the schoolteacher in the CORRIDOR\nwith her father. The two are having an animated\nconversation. Marie bursts into the CLASSROOM and closes\nthe door to muffle the noise, then she shouts to her\nclassmates:\n         MARIE: Watch out, he's coming!\nBut with all the shouting and laughter, her voice isn't\nheard by all of the pupils. The noise dies down, some of\nthem stop misbehaving. Somebody picks up the sponge, and\n                                                                  62\n\nthe blackboard is quickly cleaned up of the traces of\nthe fight. But a small group who had started to chase\neach other around, doesn't hear and keeps at it. Marie\nshouts to them again, this time louder:\n        Be quiet! For God's sake! Be quiet!!\nBut as the wild chase goes on and some over-exited\nchildren even make fun of her, and she yells at the top\nof her voice:\n        QUIET!!!!\nAt that moment, the door opens and the pastor comes in\nwith the schoolteacher.\nAlmost instantly, the room becomes QUIET. Without saying\na word, the pastor goes over to Marie, grabs her by the\near and drags her through the whole classroom to the\nstove, where he makes her stand, face to the wall. The\npupils remain silent, embarrassed.\nWhile the pastor goes back to the black board, putting\nhis briefcase on the desk without saying a word, the\nschoolteacher, who feels slightly responsible for the\nlack of discipline of his classroom, says:\n        SCHOOLTEACHER: What's going on here? Why are you\n        still here? You know that there's a confirmation\n        class now! Get out!\nThe children disappear quickly. To the first child who\ntries to sneak out the schoolteacher says:\n        How about saying good-bye?\nImmediately all the CHILDREN rushing out say:\n         Good-bye, Sir! Good-bye, Pastor!\nFinally, all the children have left the classroom,\nexcept eight candidates for confirmation, among them\nPaul, Xenia and Marie with her face still turned to the\nwall.\nThe schoolteacher turns to the pastor:\n        SCHOOLTEACHER: I'm sorry, Pastor. It won't\n        happen again.\nThe pastor answers with a reserved nod. In an icy\nsilence, he has waited for the all the younger pupils to\nleave. As the schoolteacher notices that there will be\nno further reaction from the pastor, he bows slightly to\nhim and says:\n        Good-bye, Pastor.\n        PASTOR: Good-bye.\nThe schoolteacher leaves the room. The pastor turns to\nthe candidates for confirmation:\n        Let us pray.\nThey say the LORD'S PRAYER together. Then the pastor\nsays:\n        Sit down.\n\n                                                           63\n\nThe students sit down. Marie keeps standing facing the\nwall. The pastor stops too. After a while he begins to\ntalk.\n        This is a very sad day for me.\n        In a few weeks, we all want to celebrate the\n        confirmation feast together.\n        For many months I have tried to bring God's word\n        closer to you, and to make responsible human\n        beings out of you in His spirit.\n        And what do I face today? A horde of yelling\n        monkeys,   without  any   discipline   or   human\n        dignity, as childish as the seven-year olds,\n        with whom you're sharing this classroom.\n        But what makes me even sadder is the fact that\n        my own daughter is playing the leading role in\n        this pitiful display.\n        Last year I bound a white ribbon in her hair.\n        Well, you all know that white is the color of\n        innocence. The ribbon was meant to help Marie to\n        avoid sin, selfishness, envy, indecency, lies\n        and sloth.\n        Well, at the start of the year, I was naive\n        enough to believe, that now, in the year of her\n        confirmation, she'd become mature enough, and\n        that she wouldn't need that ribbon any more\n        I believed that she felt responsible, being the\n        daughter of the spiritual leader of a Christian\n        communi...\n\nMarie, who all this time has been waiting beside the\nstove, faints and collapses to the floor.\n\n\n                            \n\n\n57. THE DOCTOR'S HOUSE. INT/NIGHT\nSTAIRWELL.\nThe only light comes in from the living room. Rudolph\ncomes down the stairs, wearing a nightshirt.\n        RUDOLPH (softly): Xeni?\nHe goes into the LIVING ROOM.\nIt's empty.\n        RUDOLPH (as above, anxiously): Xeni? Where are\n        you?\nHe goes into the KITCHEN.\nIt's also empty. Rudolph is desperate. He starts to cry.\nFinally, he goes back to the STAIRWELL and goes up the\nstairs to his room.\nOn the stairway, he notices light coming from under the\ndoor of the practice. He goes back down the stairs down\nagain and opens the door of the PRACTICE.\nIn the bright light, sitting in front of each other, are\nthe doctor and Xenia. The doctor has his back to\nRudolph, so that we see Xenia's face first. She sits on\n                                                            64\n\nthe visitor's chair. He has placed his chair in front of\nhers, and his legs are closed around her legs. She's\ncrying.\nThe situation is ambiguous, we don't know what has\nhappened.\nThe noise at the door startles Xenia, she looks at\nRudolph:\n         XENIA (startled, her face tearstained): Rudi?!\nThe doctor spins around, and looks stunned to his young\nson. Both look as if they have been caught red-handed.\n         XENIA: What are you doing here? Why aren't you\n         in bed?\nRudolph doesn't really know, what to think of all this,\nbut   being    the  good   child   he   is,  he   answers\nautomatically:\n         RUDOLPH: I can't get to sleep.\n        XENIA: That's why you're wandering around like a\n        ghost in the middle of the night?\n        RUDOLPH: I woke up and you weren't there.\nShort PAUSE. Xenia wipes the tears from her face.\n        XENIA (trying to smile): Dad has pierced      my\n        earlobes.\n        RUDOLPH: Does it hurt?\n        XENIA: Yes, a bit.\n        RUDOLPH: That's why you're crying?\n        XENIA (tries to smile): I'm not crying any more.\n        DOCTOR (trying to joke): Beauty has to suffer.\n        That's what they say. At least for girls...\nHe gets up and goes, still seen from behind, to a\ncloset, and puts something into it that we can't\nrecognize. He's straightens his clothes. Then he goes\nover to Rudolph:\n        DOCTOR: Now go to bed again. You too, Xeni.\n        XENIA: Yes.\nAs Rudolph hesitates and looks at her dubiously, she\nexplains, almost eagerly:\n        I haven't worn earrings for a long time, that's\n        why my earlobes grew back again.\nTo show him, she grasps one of her ears.\n        For Whitsun feast, when we all want to look our\n        best make ourselves look beautiful, I'm getting\n        new earrings. The ones that Mom had, with\n        garnets...\n\n\n                                                            65\n\nRudolph looks at her. He doesn't think she's telling the\ntruth.\n\n                            \n\n\n58. RECTORY. THE PASTOR'S STUDY. INT/DAY\nMarie comes in. She's wearing a nightshirt, her hair is\ndamp and sticks to her head. She looks sick and\nfeverish.\nShe closes the door quietly, then goes to her father's\ndesk and opens a few drawers. She ends up finding the\nletter-opener. It has a hilt and looks like a small\nsword.\nShe takes the letter-opener, goes to the birdcage, puts\nthe letter-opener down beside it and grabs the tiny\ncanary. As the bird chirps, she glances round at the\ndoor, as if to make sure that nobody is coming.\n        NARRATOR: A few days after Marie's fainting-fit\n        that frightened us all, and that was followed by\n        her feverish and debilitated state...\nShe takes the bird into her left hand so that its little\nhead is turned upwards, and picks up the letter-opener\nwith her right hand...\n\n\n                            \n\n\n59. ESTATE. STEWARD'S HOUSE. INT/DAY\nThe schoolteacher is led by the steward's wife to the\nliving room. She carries an apron and her sleeves are\nrolled up. Apparently she was just preparing a cake, and\nher sticky hands make her open the door with her elbow.\nBecause of the narrator's voice, we don't grasp what\nthey're saying, but we understand that she's asking him\nto come in and wait for the person he wants to see, and\nthat she can't keep him company now.\n       NARRATOR:...I went to see the steward, because I\n       wanted to borrow the carriage for the Whitsun\n       holidays again.\n       Since my marriage proposal, Eva had written me\n       once a week, and I got the feeling that she felt\n       lost and alone in the city, and was asking me\n       between the lines to come to see her again,\n       despite of her father's interdiction.\n       I wanted to spend Whitsun Saturday with her so\n       that I could be back on Sunday again and prepare\n       the confirmation feast with the pastor.\n       The steward had gone to the sawmill, but was\n       supposed to be back any minute. His wife, who\n       was busy preparing for Whitsun, asked me into\n       the living room and to wait there for his\n       return.\n                                                           66\n\nThe steward's wife has left the room. The schoolteacher\nsits around, bored. After a while he gets up, goes to\nthe window and looks out.\nThe courtyard is empty.\nSuddenly, the schoolteacher hears a female VOICE in the\nnext room SPEAKING softly.\nHe listens, then he goes to the wing door and looks\nthrough the gap on the etched glass-window of the door\ninto the next room.\nThere, Liesl sits beside the cradle and talks quietly to\nthe baby.\nThe schoolteacher opens the door. Liesl sees him, gets\nup and greets him politely with a curtsy:\n        LIESL: Good morning, Sir.\n         SCHOOLTEACHER: Hello, Liesl..\nSmiling, the schoolteacher goes to the cradle and looks\ninto it.\n         SCHOOLTEACHER: He's cute..\n       LIESL: Yes, he is.\n       SCHOOLTEACHER: Do you like him.\n       LIESL: Yes. Very much.\n\n       SCHOOLTEACHER: He was very sick last winter, I\n       was told.\n        LIESL: Yes. Very sick. But the doctor cured him.\n        With God's help.\nPAUSE. The schoolteacher looks out the window to see if\nthe steward isn't coming.\n        SCHOOLTEACHER:   Maybe,  I'll   pop  back   this\n        evening.\n        LIESL: I'm sure Father will be back for coffee\n        at four.\nShe looks at the grandfather clock, that indicates\nquarter to four. The schoolteacher thinks for a moment,\nthen he goes to the living room:\n        SCHOOLTEACHER: Then, I'll go sit down again next\n        door.\n       LIESL: Can I bring you something?      A   cup   of\n       coffee. I'm sure it's ready.\n        SCHOOLTEACHER (smiling at her eagerness): No,\n        no. Thanks.\nHe stands in the door:\n        I'll sit down over there again and just wait.\nHe wants to close the door behind himself. Suddenly\n                                                             67\n\n       LIESL says: Sir!\n       SCHOOLTEACHER: Yes?\n        LIESL: Can dreams come true?\nThe schoolteacher smiles, surprised at the unexpected\nquestion:\n        SCHOOLTEACHER: That depends, why?\n       LIESL(serious): On what?\n       SCHOOLTEACHER (smile): On what does it depend?\n       Well if you dream of getting the first prize at\n       the school feast, and study hard for it, then\n       your dream can come true.\n        LIESL, shakes her head, quietly: That's not what\n        I meant.\nThe schoolteacher feels that she has something on her\nmind and asks, this time without irony:\n        SCHOOLTEACHER: Well, what did you mean then?\nShe looks at him, wondering if she should really discuss\nit. He nods to encourage her.\n        LIESL: I mean, if you dream something in your\n        sleep, I mean, if you really dream it in your\n        sleep, can it come true?\n        SCHOOLTEACHER (also serious): Why, what did you\n        dream?\nShe bows her head.\nThe schoolteacher thinks for a moment, then he goes over\nto her.\n        Come on, tell me. You have something on your\n        mind, haven't you?\nShe shakes her bowed head. But suddenly, she starts to\ncry:\n        LIESL (crying): I always dream such horrible\n        things.\n        SCHOOLTEACHER (dear): Tell me what you've been\n        dreaming?\nShe sobs, he takes out a handkerchief and hands it to\nher:\n        Take this. Now, calm down again. And then tell\n        me what's going on.\nLiesl takes the handkerchief, blows her nose and wipes\naway her tears. She doesn't completely manage to hold\nher tears back, and breathes haltingly. She hands the\nhandkerchief back to the schoolteacher.\n        LIESL: Thanks.\nThe schoolteacher puts the handkerchief away with an\nimperceptible smile and then says reassuringly:\n                                                           68\n\n        SCHOOLTEACHER: All right. Now go on.\nThe girl sniffles a couple of times again, then swallows\nand says quietly:\n        LIESL: I dreamt that the Hansi ­ the midwife's\n        odd little boy ...\n        SCHOOLTEACHER (reassuringly): I know, I know.\n        LIESL: - ...that something very bad is going to\n        happen to him.\n        SCHOOLTEACHER: Something very bad?\nLiesl nods eagerly.\n        SCHOOLTEACHER: Like what?\n        LIESL: I don't know. Something like what\n        happened to Sigi not long ago. But even worse.\nShe starts to cry again:\n        But he's so sweet. He harms no one.\nTouched, the schoolteacher puts his arm around Liesl's\nshoulder.\n        SCHOOLTEACHER: All right. All right. That was\n        just a dream. You needn't take it so seriously.\n        LIESL (crying): They always make fun of him,\n        because he doesn't really...\n        SCHOOLTEACHER (calmly): Yes, I know, but nobody\n        will do him any harm, you can be sure of that.\nLiesl can't calm down.\n        Do you want my handkerchief back?\nShe shakes her head.\n        SCHOOLTEACHER: What gave you the idea that your\n        dream would come true?\nShe just shakes her head, and keeps on crying. Then he\ntakes the handkerchief out again and hands it to her. As\nshe doesn't take it, he nudges her. She looks up,\nconfused. He holds the handkerchief again with a\ncheerful nod. She takes it and blows her nose. The she\nslowly calms down.\n        SCHOOLTEACHER (now \"reasonable\" in order to\n        \"calm her down\"): Dreams don't come true. Let\n        alone that kind.\nShe shrugs her shoulders, as if she disagrees with what\nhe's saying. Her head bowed she stands before him,\nholding his handkerchief.\nShe breathes a few more times, then says with an almost\n\"adult\" voice:\n        LIESL(serious): But sometimes my dreams do come\n        true.\n\n                                                           69\n\n         SCHOOLTEACHER: What do you mean?\nPAUSE.\n         LIESL says: Last winter, before Putzl (she\n         points to the baby) became ill, I dreamt that my\n         brother put him beside the open window, so that\n         he'd die.\n         And the day the window was open and he caught a\n         chill and he almost died.\n\nThe schoolteacher is completely perplexed. At first he\ndoesn't know what to say.\n        SCHOOLTEACHER: What are you saying there? That's\n        complete nonsense!\nLiesl bows her head again.\n\n         SCHOOLTEACHER: Somebody probably didn't close\n         the window properly.\n         What gave you that idea? Why would your brother\n         do such a thing?\n\n         LIESL,(defiantly, as he's not believing her):\n         Because he's jealous.\n         SCHOOLTEACHER: And because you believe that, you\n         dreamt it. It doesn't mean anything at all. It's\n         just a coincidence.\n         LIESL (keeping her head bowed): All right.\n\nThe schoolteacher bends over to catch her gaze.\n\n         SCHOOLTEACHER: Look at me.\n\n\nShe looks at him reluctantly, maintaining her defiant\nreserve.\n\n         SCHOOLTEACHER: Don't tell such stories to\n         anybody!\n         You obviously don't realize the harm you can do\n         with it.\nAgain she looks down at the floor.\n        You didn't tell the story         to   your   parents,\n        didn't you?\nShe shakes her head.\n         All right then.\n         Forget it quickly.   I   shall    forget     it,   too.\n         Promise?\nAs she doesn't answer, he repeats:\n        Promise?\n                                                                   70\n\nShe nods almost imperceptibly.\n\n        Good.\n        Now can I have my handkerchief back...\n\nHe holds his hand out to her. Astonished she looks at\nthe handkerchief in her hands. She had forgotten it\ncompletely, and gives it back the schoolteacher.\n        Thank you.\nHe pockets the handkerchief.\n        Now, we both have a secret. And you promise me\n        that it will remain a secret between us. All\n        right?\nShe nods reluctantly. He insists, seeks her gaze:\n        Yes?!\n        LIESL (reluctantly): Yes.\n        SCHOOLTEACHER: Well. All right then.\n        You don't have to worry. Nothing will happen to\n        Hansi.\n        (smiling): Nobody is jealous of him.\n\nShe glances at him to see whether he's making fun of\nher. He looks at her seriously and gives her a nod that\ndemands an answer. She nods briefly. But it isn't clear\nwhether she just does it to please him.\n        Dreams don't come true. That only happens in\n        fairy-tales. Forget all about it.\nHe looks at her, as she stands there, head bowed.\nFinally he smiles and tries to \"crack a joke\" to make\nthe matter less serious:\n        Do you know what they did to little girls who\n        predicted the future in ancient times? They\n        burned them at the stake as witches.\nShe looks up at him, round-eyed.\n\n                            \n\n60. RECTORY. THE PASTOR'S STUDY. INT/DAY\nThe pastor comes through the door, goes to his desk, and\nis about to put down his briefcase.\nThe dead bird lies in the middle of the desk with its\nwings spread out. The pastor's letter-opener is stuck in\nits neck - only the hilt sticks out from its beak.\n\n                            \n\n\n\n                                                           71\n\n61. STREET. EXT/DAY\nThe schoolteacher and Eva drive in the carriage. In the\nbackground, we catch glimpses of the town.\n\n        NARRATOR: We had arranged to meet at the town\n        railway station, since Eva wanted to avoid being\n        seen with me. She was living with distant\n        relatives,   who    were    apparently   reporting\n        regularly to Eva's parents about her life-style.\n        She had become thinner which made her even\n        prettier, and once again I was ravished by her\n        mixture   of   shyness    and    almost  childlike\n        outspokenness.\n        EVA (imitating somebody): ...\"...You want your\n        hair parted r to the right or to the left?\" \"How\n        about one parting to the left and one to the\n        right\"?\nBoth laugh heartily.\n        All the people in the saloon were laughing their\n        heads   off.    Even    Mr.    Murer,   who's   so\n        distinguished that he never cracks a smile, had\n        to laugh.\nSHORT PAUSE, in which the laughter fades down.\n        SCHOOLTEACHER: Then, it isn't really so awful,\n        is it?\n        EVA: No. But sweeping up hair all day ­ honestly\n        the twins were more fun, I must say.\n        But it's all right. I can't really complain.\n\nThe schoolteacher looks at her sideways, smiling:\n        SCHOOLTEACHER: No?\nShe looks at him, doesn't understand that he's trying to\nmake her complain about their forced separation, and\nsays cheerfully:\n        EVA: No. Really.\nThe schoolteacher exchanges a smiling glance with her,\nthen looks back at the road:\n        SCHOOLTEACHER (smiling): And apart from the\n        twins, there's nothing you're missing?\nShe looks at him, surprised. Suddenly, she understands.\nShe shakes her head with a smile, then takes his hand\nfor a short moment, as if she were apologizing for her\nlack of sensitivity.\n        EVA: Oh, you of course!\nHe looks at her hand on his, but she already has\nwithdrawn it. Both seem very happy. After a few moments,\nduring which the horse keeps trotting, Eva leans against\nthe schoolteacher and puts her head against his\nshoulder. But the shaking of the carriage on the rutted\nroad makes that position untenable and so they sit side\nby side again and drive on. Finally\n                                                             72\n\n       EVA says: And how is the nurse? Does she only\n       speak Italian?\n       SCHOOLTEACHER: I   don't   know.   That's   what   the\n       steward told me.\n        EVA: I see.\nAt that moment the road crosses a brook, that runs\nthrough a small wood. The schoolteacher steers the\ncarriage on to a trail that branches off the road after\nthe bridge.\n        EVA: Where are you going?\n       SCHOOLTEACHER: Over there, into the forest\n       beside the brook. We can picnic over there. I\n       brought a basket of food.\n       EVA (softly): I don't want that.\n        SCHOOLTEACHER (perplexed): Why?\nEva looks down and shakes her head. The schoolteacher\nstops the carriage, turns to her:\n        What's going on?\n        EVA: Nothing. Please.\nNow he understands. He smiles although he can't really\nunderstand that she's been thinking such a thing of him.\nNow he talks to her almost as to a child, astonished and\nreassuringly.\n        SCHOOLTEACHER:   But  I   don't  want   anything\n        forbidden from you. I just wanted you to enjoy\n        the picnic.\nShe looks up at him.\n        EVA: Please.\n        SCHOOLTEACHER (astonished): Do you think, I\n        might want to bring disgrace on my future wife?\nShe keeps looking at him pleadingly. Finally he gives\nin, slightly disappointed:\n        All right then. I'll turn over there.\nHe drives on. After a few meters, Eva puts her hand on\nhis hands and on the reins. He stops the carriage, she\nlooks at him.\n        EVA: Thanks.\nHe doesn't know what say. They look at each other.\nSuddenly Eva leans forward and kisses him on the lips\nvery cautiously. They remain that way for a long while\nwithout their bodies touching each other.\nAfter separating, they forget at first to keep\nbreathing. Then, once the worst of the confusion has\nabated, they both turn away from each other. The\nschoolteacher lets the horse start trotting again, and\n                                                                73\n\nthey sit side by side on the bumping vehicle, looking\nstraight ahead, quiet and overwhelmed by the happiness\nof the moment.\n\n                            \n\n\n62. CHURCH INT/DAY\nThe church is packed.\nThe 8 candidates for confirmation are kneeling at the\nCommunion bench. One after the other, the pastor puts\nthe cup to their lips.\n\n       PASTOR:\n       Accept and drink!\n       This is the blood of the New Testament,\n       Shed for the forgiveness of your sins.\n\nAs he reaches Marie, who is kneeling fifth in line, he\nhesitates a long moment. For so long, that this causes a\nfew irritated stares from the devout parish. Even more\nthan the other children, Marie is also numb with\nexcitement. It almost looks like she might faint again.\nBut then he holds out the cup to her too, and she\ndrinks:\n\n       Accept and drink!\n       That is the blood of the new will,\n       spilled for you so that your sins         will   be\n       forgiven.\n\nHe wipes the cup, where Marie's mouth drank ­ as he does\nafter each child - and goes on to the next one,\nrepeating the rite...\n\n\n                            \n\n63. FOREST EXT/NIGHT\nDistant VOICES. At first incomprehensible. Gradually we\nunderstand them better:\n        VOICES: Hansi? Where are you? Give us a sign!\n        Hansi, where are you?\nHere and there silhouettes appear in the half-light.\nSome carry lanterns, other torches. It takes some time\nbefore they get nearer and become recognizable: they're\nmen and women from the village.\nAfter a while\n        MAN'S VOICE(calling): Over here. He's here.\nWe follow those running over: Bound to a tree is a small\nboy. His whole head is wrapped up in rags. A small slit\nhas been left open so the nose can breathe. He MOANS.\n                                                             74\n\nA paper has been tied around his neck with a white\nribbon.\nThe people hurry toward the child, free the child of its\nfetters. The child slumps down, his head is unwrapped,\ncovered in blood: it's the mongoloid son of the midwife.\nAstonished, somebody reads the words written in block\nletters on the paper):\n\n        FOR I THE LORD YOUR GOD AM A JEALOUS GOD,\n        VISITING THE INIQUITY OF THE FATHERS UPON THE\n        CHILDREN TO THE THIRD AND THE FOURTH GENERATION\n        OF THOSE WHO HATE ME.\n\n\n                            \n\n\n64. SCHOOL. INT/DAY\nCORRIDOR.\nMarie, Martin, Paul, Georg, and a couple of other\nchildren are waiting at the classroom door. They remain\nsilent. They're listening.\n\n        NARRATOR:   After    this   intricate  atrocity\n        committed on the retarded boy, even the Baron\n        was finally convinced that it would be more\n        intelligent to call upon the professional help\n        of the county's police force.\n        So a few days later a couple of plainclothes\n        policemen arrived and, after a visit to the\n        several of the crime scenes, started to ask in\n        various homes if anyone had noticed anything\n        suspicious.\n\nCLASSROOM\n\nThe two detectives question Liesl in the presence of the\nschoolteacher and become more and more aggressive. Liesl\nends up crying.\n\n        NARRATOR: After learning of Hansi's torture, I\n        didn't think at first of what Liesl had told me.\n        When it came back to my mind, I at first\n        hesitated to tell the authorities about it.\n        Because of such an absurd coincidence, I didn't\n        want to jeopardize the reputation and inner\n        peace of the steward's family.\n        But when I heard that Hansi might loose his\n        eyesight because of his injuries, one afternoon\n        I made Liesl come to school and tell the police\n        officers about her dream.\n        FIRST POLICE OFFICER: ...Thank God, we're not as\n        stupid as you might think.\n\n                                                           75\n\n        LIESL (crying, desperate): But I only dreamt it.\nPAUSE. The officers exchange an impatient look with the\nschoolteacher, who himself doesn't really know what to\nthink of Liesl's story. He looks at her thoughtfully.\nThe police officer turns to the girl again:\n        FIRST POLICE OFFICER: Now listen carefully! I'll\n        give you a last chance: you tell me, who told\n        you about the plan to torture the boy, and we\n        won't tell anybody who told us. All right?\nLiesl shakes her head desperately, crying again. The\npolice officer looks at the schoolteacher. The latter\ndoubts whether he should speak up. He feels sorry for\nthe girl. Finally, he says:\n        SCHOOLTEACHER:   She's    already   dreamed   of\n        something that has come true.\n       FIRST POLICE OFFICER (ironic): Is that so? And\n       what was it, if I may ask?\n       SCHOOLTEACHER (wanting to spare her      talking\n       about it): Something that happened       in her\n       family.\n       FIRST POLICE OFFICER (just as before): I see.\n       Something to do with her family. And have you\n       checked if it was true?\n        SCHOOLTEACHER (irritated): No.\nThe police officer looks at him, grunts with disdain,\nand turns to his colleague:\n        FIRST POLICE OFFICER (scornfully): Well, all\n        that may be true. Maybe we're really dealing\n        here with an authentic clairvoyant, and we don't\n        realize how lucky we are. Maybe we only need to\n        ask her, who's behind all this. The we send her\n        to bed, she dreams a bit, and tomorrow she tells\n        us who did it. How about that? Everything's\n        possible, isn't it?\nSuddenly, he yells at the girl:\n        Stop crying!\nLiesl jumps up with fear. The police officer stands\nright in front of her:\n\n       Your deceitful whining won't work with me. I've\n       got other ways to make you talk. I don't believe\n       in witches and magicians, let alone that a\n       chubby little girl like you has supernatural\n       hallucinations. Therefore you'd better get used\n       to the idea of telling the truth, because you\n       won't bet rid of me until you've come clean. Is\n       that clear?\n       All right, and now we're going to visit your\n       parents to see what they think of your version\n       of the story.\n                                                           76\n\nHe pulls the girl to her feet. She's thoroughly\nintimidated, and sniffles faintly. Then he leads her\ntoward the door, at the same time turning to the\nschoolteacher:\n        I'd be grateful if you came too.\nThe schoolteacher finds the policeman's behavior toward\nthe child exaggeratedly aggressive, but he follows\nreluctantly:\n        SCHOOLTEACHER: Of course.\nThe police officer opens the door to the\n\nCORRIDOR\n\nand almost bumps into a group of pupils that have\nassembled there.\n        FIRST POLICE OFFICER: Oooops! What do we have\n        here?\n           MARIE (kindly): Good afternoon. Good afternoon,\n           Sir.\n        CHILDREN (as before): Good afternoon. Good\n        afternoon, Sir.\nObviously the schoolteacher didn't expect them, but\ndoesn't want to show it in front of the police.\n        SCHOOLTEACHER: Good afternoon.\n           FIRST POLICE OFFICER: Why are you eavesdropping?\n        MARIE (politely): We saw from outside that the\n        schoolteacher was having visitors. We didn't\n        want to intrude. We were just waiting to talk to\n        the schoolteacher.\nPAUSE. The police officer looks at the schoolteacher:\n        SCHOOLTEACHER: What do you want?\n        MARIE (as if she was too shy to talk in front of\n        strangers: We wanted to ask you something about\n        Hansi.\nAgain, the police officer looks at the schoolteacher.\n        SCHOOLTEACHER: What is it?\n           MARIE (hesitates a moment, then \"screws up her\n           courage\" and asks): We heard he isn't well. We\n           just wanted to ask if we could be of any help.\n\n\n                               \n\n\n\n\n                                                              77\n\n65. THE MIDWIFE'S HOUSE INT/NIGHT\nThe doctor carefully examines Hansi's wounds. Especially\nthe areas around eyes that are badly affected. The boy\nmoans softly.\nThe midwife stands beside him, trying to stay calm, but\nshe is paralyzed with fear, and visibly still in a state\nof shock.\nIt's very quiet. The doctor speaks with a soothing,\nalmost tender voice to the child, who keeps on moaning:\n         DOCTOR (softly): All right... Everything's all\n         right, Hansi... I know, it hurts... You've got\n         to be patient... everything will be fine\n         again... everything...\nHe has finished his treatment (and has bandaged the\nboy's eyes again), and wants get up. But Hansi's hand\nclings to his, and holds him back. He hesitates a\nmoment. The doctor and the midwife exchange a brief\nglance. Then, the doctor cautiously frees his hand from\nthe child's.\n         I have to go now, Hansi. Don't worry, I'll be\n         back tomorrow.\nThe boy moans louder and tries again to grasp the hand\nof the doctor, who he can't see. Brief exchange of\nglances between the doctor and the midwife, who ends up\nsitting on Hansi's bed, taking the boy's hands.\n         MIDWIFE: It's all right, Hansi. Don't be afraid.\n         The Doctor will be back.\nThe doctor motions to the midwife that she should stay\nwith the child, and leaves the room silently and almost\nhastily.\n\n\n                            \n\n\n66. LANDSCAPE WITH A BROOK AND PASTURES EXT/DAY\nSitting at a brook, Sigi, Ferdinand and Georg have cut\nwillow twigs with their pocketknives and are now carving\nwhistles out of them. Their feet dangle in the water,\nthey're concentrated on their work.\nGeorg is the first to have finished. Proudly he tries it\nout, but the little whistle doesn't sound very good. He\nhides his disappointment, and keeps on carving to\nimprove the sound.\nThen Sigi's whistle is ready and it sounds very good.\nSigi is delighted. After a short and proud look over to\nhis rivals, he leans back into the grass and keeps on\nwhistling.\nGeorg looks with irritation at the \"braggart\", and keeps\non carving. Then he gives it another try, but the\nwhistle doesn't sound much better than before.\nSigi's   whistling   makes   Georg's  seem   ridiculous.\nFerdinand looks at Georg with a gloating grin.\n\n                                                            78\n\nSuddenly Georg pounces on Sigi and tries to grab his\nwhistle. Sigi fights back and refuses to let go.\nFerdinand also gets up and watches the two, grinning.\n\nEven if Sigi is no longer the weakling he used to be\nbefore his stay in Italy, Georg, who is three years\nolder than him, is much stronger: with the weight of his\nwhole body he charges at Sigi, making him fall backward\ninto the shallow water of the brook, and takes his\nwhistle away.\nThe shock almost knocks out Sigi, and though the stream\nisn't deep, half of his head lies under the flowing\nwater. Georg sees the danger, but his pride prevents him\nfrom helping him, as it means admitting his own unjust\nbehavior. For a moment he hesitates, a helpless and\ndefiant grin on his face. But Ferdinand has already\njumped into the water and pulls out Sigi, who shakes his\nhead to fully come to his senses.\nFerdinand looks up at Georg, who is standing on the\nbank, still holding the whistle in his hand. Then Georg\npoints his finger at him, and says furiously and\nguiltily.\n        GEORG (threatening): If you rat on me, you'll be\n        sorry!\n\n\n                            \n\n\n67. RECTORY. STUDY. INT/DAY\nThe pastor sits at his desk, working. A KNOCK is heard.\n        PASTOR: Come in!\nFlorian comes in, hesitantly. In his hand, he carries a\nbirdcage (we've already seen it in Scene 49 in the boy's\nbedroom at night). In the cage is the bird that Florian\nhad found on Thanksgiving day, and who has recovered in\nthe meantime.\n        PASTOR: Yes?\nThe boy looks embarrassed. He glances at his father,\nthen comes over with the cage and puts it carefully on\nhis father's desk. As Florian approaches, the pastor\nlooked on, amazed. After putting down the cage, Florian\nsteps back a little, then stops, his head slightly\nbowed.\n        PASTOR (not really understanding): What is it?\n        What do you want?\n        FLORIAN (softly): For Pipsi. (PAUSE. Then even\n        more softly): Because Father is sad.\nThe pastor looks at him, doesn't know how to react.\nThen,   with  a   hoarse   voice  and  trying to  look\nindifferent, he says:\n        PASTOR: Thank you.\n                                                           79\n\n        FLORIAN (as apprehensive in front of his\n        father's perceptible emotion): You're welcome,\n        Father.\nFor a moment, neither of them knows what to do. Then the\nboy leaves the room.\nThe pastor follows him with his eyes. Then, he sits\ndown. He tries to keep his composure, but in the end he\nbursts into tears. He sobs haltingly, trying hard not\nlet it be heard.\n\n\n                                \n\n68.THE STEWARD'S HOUSE INT/EXT/DAY\n\nTHE CHILDREN'S ROOM.\nGeorg stands at the window and looks down at the\n\nCOURTYARD\n\nComing from   the   manor,   the   steward   is   walking   over\nbriskly.\n\nTHE CHILDREN'S ROOM.\nGeorg leaves the window and sits down at his table,\ndoing his homework.\nWe hear the FRONT DOOR opening downstairs, then the\nfather's hasty STEPS on the stairs.\nFinally, the father appears in the door. He's out of\nbreath, furious, and tries to speak quietly\n        STEWARD: Give me that whistle!\nGeorg looks at his father, \"not understanding\".\n        GEORG: I beg your pardon?\n        STEWARD (forcedly, with threatening calm): Give\n        me that whistle!\n        GEORG: What whistle?\nAt this, the steward pounces on the boy and smacks him\nso hard that he falls out of his chair.\n        Give it to me!\n        GEORG (on the ground): What whistle?\nThe steward yanks him up and shoves him against the\nwall. Georg stumbles over the table which is standing in\nthe way, and lies back on the table top, trying to\nprotect his face with his hands.\n        STEWARD: Give away it to me, or I'll kill you.\n        GEORG (half moaning): I have no whistle.\nThe steward lets go of him and starts to beat                him\nfuriously.\n                                                                   80\n\n        GEORG (screaming): Ouch! ...Ouch!!\n        STEWARD (beat): You bastard, you wretch!\n        GEORG (scream): Ouch! Ouch! !! Please don't\nAt that moment, attracted by the noise, Emma, the\nmother, appears:\n        EMMA: For God's sake, Georg, what are you doing?\n        What has the boy done?\nThe mother's arrival has snapped the father out of his\nblind rage. He glances at her, then turns to the boy\nagain, breathless with excitement, but forcing himself\nto be calm:\n        STEWARD: For the last time: give it to me!\n        GEORG (almost crying with pain): But I don't\n        know what you mean, Father.\nThe mother looks uncomprehendingly from one to the\nother, then turns pleadingly to her husband:\n        EMMA: What's going on? What are you talking\n        about?\n        STEWARD (to Georg): You know exactly what I\n        mean.\nAgain the mother looks from one to the other, trying to\nsave the situation:\n        EMMA: But if he says so! Georg! What's going on?\nThe steward turns to her, annoyed by her insistence,\nlooks at her for a long moment, then at Georg again and\nturns on his heels and leaves the room.\n\nSTAIRWELL.\n\nThe steward runs down the stairs. The mother follows\nhim.\n        EMMA (excited): Georg! Please wait! What did the\n        boy do?! Please, tell me! Why are you so\n        furious?\nShe reaches the steward as he is just about to open the\nfront door and places herself in front of him.\n        EMMA (imploring, \"reasonable\"): Georg! Please!\n        Calm down. If you could tell me...\n        STEWARD (also \"reasonable\", in order to get rid\n        of her): Please don't interfere. Leave me alone\n        now! I have to go back to the Baron. He...\nAt that moment we hear from upstairs the full SOUND of\nSigi's whistle s from above, wild and lasting.\nFor a moment, the steward is paralyzed, then he seizes\nthe horsewhip hanging from hook in the wardrobe and\ndashes upstairs. We hear him thrashing the boy in the\n\n                                                           81\n\nroom, and soon the WHISTLING is replaced by Georg's\nSCREAMS OF PAIN\nAfter a short hesitation, the mother runs upstairs after\nher husband, and we now hear her trying in vain trying\nto control her husband.\n        EMMA: Georg! Please! Stop it! Don't kill him...!\n\n\n                             \n\n\n69. ESTATE. DINING ROOM. COURTYARD. INT/EXT/NIGHT\nThe meal is over. The Baroness watches the maid clearing\nthe table and putting everything away on a tray.\nThe Baron has stood up, standing with his back to his\nwife. He pours himself a glass of brandy.\n        BARON: ... with the birches over there in Aigen\n        that should make about six-thousand cubic\n        meters. Working steadily, they should have\n        finished it within three weeks. If until the end\n        of the month we...\nThe maid has left with the tray.\n        BARONESS (interrupts him): I won't stay here.\n         BARON (doesn't understand): What did you say?\n         BARONESS: I won't stay here.\n         BARON (turns around to her): What do you mean\n         BARONESS: What I mean is that I shall leave with\n         the children.\n         BARON: What do you mean: you're leaving with the\n         children?\n         BARONESS:   Come  on,   Armin!  It's   not   that\n         difficult to understand, is it?\nPAUSE.\n         BARON: May I ask you how you plan to do that?\n         BARONESS (quiet): I don't know yet. But in any\n         case, we're leaving this place.\n         BARON (sarcastic): We.\nLook of the Baroness (\"I don't need that kind of\nirony\").\n         BARONESS: Yes.\nThe maid enters to clear the rest of the table. It leads\nto a longer PAUSE. The Baron drinks his brandy, goes to\nthe window, waits. As the maid leaves the room, she\nlooks at the Baroness inquiringly:\n\n\n                                                             82\n\n         BARONESS (to the maid): I don't need you any\n         longer. Thank you.\n         MAID: Good night, Baroness. Good night, Baron.\n        BARONESS: Good night.\nEven after the maid has left, they remain SILENT for\nquite a long while. Finally, she says\n        BARONESS: I returned from Italy only out of\n        deceny toward you. I wanted to give us a chance.\n         BARON (turns around): You wanted me \"to give me\n         a chance\"?!\n         BARONESS: Yes.\n         BARON: Well, that's brilliant! And did I miss my\n         chance? Or what?\nPAUSE.\n         BARONESS (quietly): Do you think that will help\n         us solve the problem?\n         BARON: What?\n         BARONESS: Your sarcasm.\n        BARON: Actually, what is the problem that has to\n        be solved?\nThe Baroness looks at him, then gets up and wants to\nleave the room.\n        BARON (suddenly yelling): You stay here!!\nShe turns around, looks at him.\n        BARON (softer): You only leave this room if I\n        tell you to do so.\nShe looks at him.\n        BARONESS: Fine.\nShe goes back to her chair and sits down.\n         BARONESS: I wanted to spare you this, but you\n         force me to do it:\n         During our stay with Uncle Edoardo I fell in\n         love with a man. He's from Lombardy, he works in\n         the banking business and helped Uncle Edoardo in\n         a financial matter. He courted me and was also\n         very fond of the children. If Sigi has blossomed\n         and grown so healthy, it's largely thanks to\n         him.\n         Despite all this, we came back.\n         Because I feel committed to you. But I can't\n         stand this place any longer. Not so much for me\n         personally, though I can't say that life with\n         you is exactly thrilling for a woman of my age.\n         But if I leave this place, it's because I don't\n                                                            83\n\n         want Sigi, and later the twins, to grow up in\n         surroundings dominated by malice, envy, apathy\n         and brutality. What happened with Sigi's whistle\n         was the last straw. I'm sick and tired of\n         persecutions, threats and perverse acts of\n         revenge.\nPAUSE.\n         BARON: Did you sleep with him?\n         BARONESS   (laughing   scornfully):   You   don't\n         understand anything.\n         BARON: Did you sleep with him?\nPAUSE.\n         BARONESS (quietly): No. I didn't sleep with him.\nPAUSE.\n        BARON: You're lying, aren't you?\nThe Baroness looks at him. Then she gets up, about to\nleave the room again. At the same moment, somebody\nKNOCKS at the door. After a short gesture of irritation\n        BARON (irked): Come in!\nThe steward appears.\n        STEWARD: Good evening. Could I talk to you for a\n        moment, Baron?\n         BARON (annoyed): Can't it wait until tomorrow?\n        STEWARD:   It's  really   urgent.   Normally,  I\n        wouldn't have disturbed you so late.\nAnnoyed, the Baron leaves the room with him. As he goes\nout, the steward greets the Baroness with a nod.\nOnce the door is closed, she stops for a moment, goes to\nthe window, and looks out pensive. She ends up going to\nthe small bar and pours herself a glass of brandy. Her\nhands are shaking a little. She drinks from the glass,\ngoes back to the window and looks out waiting, taking a\nsip from now and then. Below in the\n\nCOURTYARD\n\na few people walk around nervously. But it doesn't look\nparticularly unusual. A saddled horse is led into the\nstable. Finally, the door of the\n\nDINING ROOM\nopens again. The Baron comes back inside. He looks\ndistressed. The Baroness doesn't know whether this is\nthe result of her conversation, or of the message\nbrought by the steward. The Baron paces a few steps,\npondering, then glances at his wife. Finally, she asks\n        BARONESS: What's going on?\n\n                                                             84\n\n       BARON: They've shot the heir to the throne of\n       Austria. In Sarajevo.\n\n\n                            \n\n\n70. VILLAGE AND SURROUNDING LANDSCAPE EXT/DAY\nThe same setting as in Scene 57. The countryside in all\nits summer splendor.\n\n       NARRATOR: The news spread around the village\n       like wildfire. What would the consequences be?\n       The first person who spoke the word WAR, was\n       severely contradicted. But once it had been\n       uttered, it remained at the center of all our\n       thoughts in a curiously stubborn way.\n       I wanted to go to the town as quickly as\n       possible, in order to discuss it with Eva, what\n       we should do if war broke out. Perhaps her\n       father would now agree to an earlier marriage.\n       I asked the Baroness for the bicycle, with which\n       Eva had visited her parents some time ago. The\n       following weekend I planned use it to ride to\n       town and see her.\n\n\n                            \n\n\n71. ESTATE EXT/DAY\nThe schoolteacher is pushing the bicycle out of the\nmanor house. He says good-bye to a maid, who closes the\ndoor behind him. Some SHOUTING o.s. makes him look\ntoward the steward's house: the steward comes out with\nthe midwife, and it looks like he's throwing her out\nwith a flood of angry insults.\n        NARRATOR: When I went to the estate on Friday\n        evening to pick up the bicycle, so I could take\n        it with me to the school, and get going early,\n        as the trip was a quite long one, I witnessed a\n        strange confrontation:\n        STEWARD: ...completely mad! Go if you want.\n        He'll throw you out on your ear.\n        Slandering other people and creating trouble.\n        That's all we need now!\n        Get out and never come back again! This is\n        unbelievable!\n        Go ahead, do whatever you think you have to do!\n        You're hysterical!\n        MIDWIFE (simultaneously): ...I'll go to the\n        Baron. We'll see what he says. You won't silence\n        me. Who do you think you are?! You'll see. I'll\n\n                                                           85\n\n        tell him that you tried to prevent me from\n        giving the police a statement.\nAngrily the steward slams the door behind him. At first\nthe midwife doesn't know what to do. Finally she turns\naway from the door and starts to cross the yard. There,\nshe sees the schoolteacher. She comes over to him.\n        SCHOOLTEACHER: Good afternoon, Mrs. Wagner.\n        What's happening?\n         MIDWIFE (very excited): Good afternoon. Can I\n         borrow your bicycle?\n         SCHOOLTEACHER: It's not mine.\n         MIDWIFE: Could I borrow it just the same?\n         SCHOOLTEACHER: I just borrowed it myself.      I\n         going to ride to town, to see my fiancée..\n         MIDWIFE: Please! Lend it to me!\n         SCHOOLTEACHER: Why do you need it? Where do you\n         want to go?\n         MIDWIFE: I must go to town.\n         SCHOOLTEACHER: What for?\n         MIDWIFE: I asked the steward for a carriage, but\n         that stubborn fool won't agree to anything.\nPAUSE.\n         Please! Lend me the bicycle.\n        SCHOOLTEACHER: Why? What is going on?\nAfter hesitating a while\n        MIDWIFE: I have to go to the police in town. I\n        now know who committed all these crimes.\n         SCHOOLTEACHER (flabbergasted): Who?\n         MIDWIFE: Will you let me have the bicycle?\n         SCHOOLTEACHER: Why don't you tell me?\n         MIDWIFE: From now on I shall only talk to the\n         police. I won't let them insult me (turning to\n         the steward's house): As you just saw.\n         SCHOOLTEACHER: Can't the doctor can lend you his\n         horse?\n        MIDWIFE: I don't know how to ride.\nThe schoolteacher looks at her inquisitively, because he\nstill doesn't understand what it's all about, but she\ndoesn't respond, and says:\n\n                                                            86\n\n         MIDWIFE: Please! Believe me! (She hesitates and\n         adds, now quietly and imploringly):\n         My son told me who did it to him. He may loose\n         his eyesight.\n         Please, you let me have the bicycle!\n\nThe schoolteacher looks at her. The midwife looks\npitiful: she tries to smile at him pleadingly, tears are\nstreaming down her face.\nFinally, he gives the bicycle to her. She grabs it\nquickly, says\n         Thanks!\nand rides away. The schoolteacher remains behind, alone.\nHe stands pensive, then he goes slowly back to the\nvillage.\n         NARRATOR: The state that woman was in, who I\n         knew was level-headed, had deeply impressed me.\n         What had her son told her, that she didn't dare\n         tell anybody?\n\n\n                             \n\n\n72. VILLAGE STREET. EXT/DUSK\nThe schoolteacher goes home.\nTRACKING SHOT.\n        NARRATOR: With each step I took from the estate\n        back to the school, I felt more foolish for\n        having given away the bicycle.\nAs he passes the midwife's house, he sees behind the\nfence in the garden, half hidden behind the bushes,\nMarie and a few other children. The shutters of the\nhouse are closed.\n        As I passed the midwife's house, I saw Marie,\n        Martin, and a few other children in the garden.\nThe schoolteacher stops, watches the children. After a\nfew moments, they notice that somebody is watching them.\n        MARIE: Good evening, Sir.\n         SCHOOLTEACHER: Good evening, Marie.\n         CHILDREN: Good evening, Sir.\n         SCHOOLTEACHER: What are you doing here?\n         MARIE: We wanted to see how Hansi was doing.\nPAUSE.\n         SCHOOLTEACHER: But can't       you   see   that   the\n         shutters are closed.\nPAUSE.\n\n                                                                 87\n\n         MARIE: Yes. We were worried. We saw Mrs. Wagner\n         riding off on a bicycle. So we wondered what had\n         happened to Hansi.\nPAUSE.\n        SCHOOLTEACHER: Go home now. Nobody said you\n        could come in here.\nThe children go out slowly. They open the wooden gate in\nthe fence, and go out into the street. They're visibly\nembarrassed at being caught by the schoolteacher when\nthey were doing something wrong. Some avoid the\nschoolteacher's eyes, while others mutter a greeting, as\nif they wanted to say goodbye, as they went away. The\nschoolteacher looks annoyed. As Marie steps out of the\ngarden door, he says:\n        SCHOOLTEACHER: You better go back home now,\n        hurry.\nMarie doesn't seem to feel guilty at all. Again she\ngreets him politely.\n        MARIE: Good evening, Teacher.\n        SCHOOLTEACHER (reluctantly): Good evening.\nThe children go away. The schoolteacher also goes on his\nway. After a few steps he turns around and looks at the\nchildren, then walks on.\n\n         NARRATOR: Then I thought of Liesl's dream again.\n         What if Liesl hadn't dreamt, but had known, that\n         Hansi was going to be tortured. Whose crimes did\n         she know of? Whose name had she refused to\n         reveal?\n         The strong interest of the children in Hansi\n         seemed strange to me, considering that they had\n         usually refused to have any contact with him\n         because of his disability, or only dealt with\n         him in a rather disdainful manner.\n\nThe schoolteacher stops. He ponders about this. Then he\ngoes back to the midwife's house.\n\n         Suddenly I wondered why the midwife had closed\n         the shutters of the house. Nobody in the village\n         ever shut their house. Why had the midwife\n         locked her boy in?\n\nHe has reached the front of the house again. Indeed,\nwith its closed shutters, it looks uninhabited. Only\nbecause of the tidy little front garden, could one tell\nthat somebody lived there.\nThe schoolteacher opens the garden gate and goes up to\nthe house. He tries to open the door and then the\nshutters. Everything is well shut. He peers through the\ncracks in the wooden shutters.\n        SCHOOLTEACHER: Hansi? Can you hear me? Hansi!\n                                                            88\n\nNobody seems to answer. For a short moment the\nschoolteacher disappears behind the house, apparently\nlooking for another way to get inside. But he soon comes\nback without having found anything.\n        NARRATOR: If the midwife couldn't take care of\n        him, she would have entrusted the boy to me, or\n        to the doctor. But since the night he was\n        mistreated, I hadn't seen him again.\nHe leaves the midwife's house and hurries to the\nneighboring house, the doctor's.\n        I decided to ask the doctor directly.\nHe enters the property, goes up to the entrance and\nrings. Nobody answers. He rings again, then he sees a\nnote tacked up:\n\n          The doctor's practice is closed\n                until further notice\n\n                            \n\n\n73. RECTORY. INT/NIGHT\nSTAIRWELL.\nThe pastor's wife and the schoolteacher stand before the\nclosed front door.\n        PASTOR'S WIFE: His daughter? Wasn't she with you\n        at your school?\n        SCHOOLTEACHER: Yes, she was.\n        PASTOR'S WIFE: And she didn't say anything?\nThe schoolteacher shakes his head. They both remain\nsilent and pensive.\n\n        SCHOOLTEACHER: I have a request.\n        PASTOR'S WIFE: Yes?\n        SCHOOLTEACHER: Could I ask Marie and Martin?\n        PASTOR'S WIFE: Don't you want to wait for my\n        husband? He's at the church. The service will be\n        over in a quarter of an hour. But if you insist.\n        Please, come in.\nShe opens the door\n\nLIVING ROOM\n\nand points to a chair.\n        Please be seated. Please. I'll fetch the kids\n        for you.\n\n                                                           89\n\nShe leaves the room. The schoolteacher remains standing.\nWaiting.\nFinally, the pastor's wife comes back with the two\nchildren.\n         MARIE and MARTIN: Good evening, Sir.\n         SCHOOLTEACHER: Good evening.\nPAUSE.\n         THE PASTOR'S WIFE: Don't you want to sit down?\n        SCHOOLTEACHER (who hasn't thought of it): Yes.\n        Perhaps. With pleasure.\nThey   sit   down.   The  children   sit  opposite   the\nschoolteacher.\n        PASTOR'S WIFE: Can I offer you something? ,\n        (smiling faintly): A cup of coffee? Like during\n        the piano lessons\nFirst the schoolteacher wants to refuse, then he decides\nto accept so as to get rid of the woman, and be alone\nwith the children.\n        SCHOOLTEACHER: Yes, with pleasure. That's very\n        kind of you.\n        PASTOR'S WIFE: I'll be back in a minute.\nThe schoolteacher turns to the children:\n        SCHOOLTEACHER: Did you know that the Doctor was\n        leaving Eichwald?\nShort PAUSE.\n        MARIE: No.\n         SCHOOLTEACHER: But you don't seem surprised at\n         my question.\n         MARIE: Our mother told us when she came to fetch\n         us.\n         SCHOOLTEACHER:   And   Xenia   didn't    tell    you\n         anything about it?\n        MARIE: No.\nShe looks at Martin who confirms it:\n        MARTIN: No.\n         SCHOOLTEACHER (incredulously): Not a word? It's\n         very unusual for a child not to tell his\n         classmates before going away on a trip.\n         MARIE (unimpressed):   Xenia   never    talks   much\n         about home.\n         SCHOOLTEACHER: Well, that's something completely\n         different?!\n\n                                                                90\n\nApparently Marie doesn't take it as a further question,\nand remains silent.\n        SCHOOLTEACHER: I get the feeling you're hiding\n        something from me.\n         MARIE: What?\n        SCHOOLTEACHER: That's what I'd really like to\n        know.\nSILENCE. Then the schoolteacher turns to Martin:\n        SCHOOLTEACHER: When you were looking for Hansi a\n        while ago, what did you want from him?\nShort PAUSE.\n        MARIE : We were worried. He's ill.\n         SCHOOLTEACHER: I'm asking Martin.\nPAUSE.\n        MARTIN: Yes. He isn't well. And since his mother\n        is gone... we thought, we should go and pay him\n        a visit.\nThe schoolteacher realizes that he won't get any further\nthis way.\n        SCHOOLTEACHER: Did you ever ask yourselves who\n        could have treated Hansi that way?\nPAUSE. Then the schoolteacher adds:\n        And Sigi?\nPAUSE.\n        And who tied the wire in the doctor's garden?\n        And who set fire to the barn?\n        Well?!\nPAUSE.\n        MARIE: Yes, of course we wondered.\n         SCHOOLTEACHER: Well?\n        MARIE: We discussed it with Father. He said it\n        must be a sick person.\nPAUSE. The schoolteacher doesn't know how to go on.\n        SCHOOLTEACHER:    Sigi   was    with    you at\n        Thanksgiving. And so was Hansi.\nPAUSE.\n        MARIE: I don't understand.\nWith demonstrative helplessness she looks at the\nschoolteacher, then at her brother, and again at the\nschoolteacher: Shaking her head and shrugging her\nshoulders.\n        SCHOOLTEACHER: What did they do to you?\n         MARIE (doesn't seem to understand): Who?\n\n                                                           91\n\n         SCHOOLTEACHER: Sigi and Hansi?\n         MARIE (as above): Why?\n         SCHOOLTEACHER:   They    obviously   were   being\n         punished. For what?\n         MARIE (as above): I don't know.\n         SCHOOLTEACHER: Liesl foresaw that Hansi would be\n         punished? What for?\n         MARIE (as above): I don't know.\nPAUSE.\n         Why do you ask us?\nPAUSE.\n         SCHOOLTEACHER:   You're  an   intelligent   girl,\n         Marie. Don't try and play dumb.\nPAUSE.\n         MARIE: I don't understand you, Sir. You should\n         talk with Father about this or with Mother.\n         Shall I go get her?\n\nThe schoolteacher looks at her.\n        MARIE: Martin, would you please get her?\nMartin gets up and is about to go to the door.\n        SCHOOLTEACHER: Stay here, Martin: I'll talk to\n        your parents when I consider it's the right\n        time. Now, I'm talking to you. And I expect you\n        tell me the truth.\nMartin sits down after exchanging a glance with Marie\nagain.\n        Where were you on the evening Hansi was found?\n         MARIE (doesn't seem to understand): At home.\n        SCHOOLTEACHER: I mean after the confirmation?\nAt that moment, the pastor's wife enters with the coffee\ncups on a tray.\n        PASTOR'S WIFE: There we are. The coffee will be\n        ready in a minute.\nShe puts the tray on the table. Turns to the\nschoolteacher, friendly as ever:\n        Were the children able to help you?\nThe schoolteacher looks at Marie, then he answers:\n        SCHOOLTEACHER: I'm afraid not. They don't know\n        anything, either.\n         PASTOR'S WIFE: That's really odd. A doctor can't\n         vanish into thin air. What about his patients?\n\n                                                             92\n\n        (to the children) Didn't his daughter tell you\n        anything at school?\nThe schoolteacher gets up, ready to leave.\n        SCHOOLTEACHER: No. I'm sorry if I disturbed you.\n       PASTOR'S WIFE: Why don't you stay? My husband\n       will be back any moment, and the coffee is\n       almost ready.\n       SCHOOLTEACHER: That's very kind of you, but I'm\n       really worried about the midwife's son.\n       PASTOR'S WIFE: And she didn't say when she'd be\n       back?\n        SCHOOLTEACHER: I didn't ask her. She caught me\n        off guard. She was completely panicked.\nThe pastor's wife shakes her head thoughtfully.\n        PASTOR'S WIFE: Strange... Wait a second! I think\n        that's my husband.\nAnd indeed, outside one can hear the FRONT DOOR and then\nthe STEPS of the pastor. The wife goes to the door to\nopen it. The pastor appears.\n        PASTOR (surprised to see the schoolteacher):\n        Good evening.\n       PASTOR'S WIFE: Good evening. The schoolteacher\n       has been anxiously waiting for you.\n       PASTOR (to the schoolteacher): Yes?\n        SCHOOLTEACHER: Yes. I'd like to have a quick\n        chat with you.\nThe pastor doesn't really understand what can be so\nurgent, and why the schoolteacher, which was unusual for\nhim, came to see him in the evening. But he remains\nfriendly:\n        PASTOR: Please. We'd better go to my study. It's\n        quieter there.\nThe schoolteacher nods to the pastor's wife, who is glad\nthat the required meeting can now take place, while the\npastor walks ahead with an inviting gesture. As the\npastor opens the door of the STUDY, he asks:\n        PASTOR: Well, how can I help you?\nThey enter the room and the pastor offers the\nschoolteacher a chair. Then he realizes that the windows\nare open and closes them, as the schoolteacher starts to\nspeak.\n        SCHOOLTEACHER: I spoke to the midwife today: she\n        said she now knew who tortured her son.\n       PASTOR (\"who\"?): She does?\n\n                                                           93\n\n       SCHOOLTEACHER: She'll only     tell   the   police.\n       That's why she went to town.\n       PASTOR (doesn't quite understand        what    the\n       schoolteacher is getting at): Well?\n       SCHOOLTEACHER: She left the boy behind alone and\n       has locked the whole house.\n       PASTOR: Locked it?\n        SCHOOLTEACHER (nods): I went to the doctor's\n        next door to ask him what was going on, whether\n        he was taking care of the child or... But\n        there's a piece of paper saying that the\n        practice is closed until further notice. The\n        doctor and his children have disappeared.\nThe pastor has almost finished closing the windows. He\npauses and turns to the schoolteacher:\n        PASTOR (stunned): What do you mean?\n        SCHOOLTEACHER (shrugs): I don't know. I thought\n        you might have been informed. That's why I'm\n        here.\nAfter a startled PAUSE the pastor shakes his head:\n        PASTOR: I have no idea.\nHe   finishes  closing   the  windows.   Then   he  goes\nthoughtfully over to the schoolteacher and sits down in\nfront of him.\n        PASTOR: Xenia... Wasn't his daughter in school?\n        SCHOOLTEACHER: Yes, she was. She never mentioned\n        anything.\nSILENCE. The pastor ponders. Then, after a while\n        SCHOOLTEACHER : I asked Marie and Martin. They\n        both know nothing either.\n        PASTOR   (looks   up   to    the  schoolteacher,\n        \"stunned\"): Why should they?\nThe schoolteacher almost dodges speaking further:\n        SCHOOLTEACHER: I don't know. When I went to the\n        midwife's place, they were there with a few\n        others in the garden.\n       PASTOR (\"doesn't understand\"): To do what?!\n       SCHOOLTEACHER: They were looking for the boy.\n       PASTOR (as before): Why?\n       SCHOOLTEACHER: They wanted to help him.\n       PASTOR: So what\n\n                                                             94\n\n         SCHOOLTEACHER (hesitates, then says): I don't\n         know how to say it. I have the feeling they're\n         hiding something.\n         PASTOR (refuses): What?\n         SCHOOLTEACHER (keeps on searching hesitantly for\n         his words): I don't know. (finally he dares to\n         come out with his suspicion): When the doctor\n         had his accident... last year, you remember,\n         Suddenly the children were in his garden.\n         Supposedly, in order to help Xenia.\n        PASTOR (doesn't understand): Yes... and?\nThe schoolteacher, uneasy, breathes hard. He knows that\nhis suspicions will seem odd, and senses that the pastor\nwon't go along with then.\n        SCHOOLTEACHER: Nothing. I had forgotten it.\n        Today, it came back to my mind again.\n         PASTOR (as before): I don't understand.\nPAUSE.\n        SCHOOLTEACHER: When they found the Baron's\n        son... the last time he had been seen, he was\n        with the children.\nThe pastor looks at the schoolteacher, then his face\nslowly freezes to a mask of refusal:\n        PASTOR: What are you getting at?\nOf course, the schoolteacher notices the reaction. But\nhe has already gone too far to backtrack. After a PAUSE\nhe goes on:\n        SCHOOLTEACHER: A couple of days before Hansi was\n        almost beaten to death, the steward's daughter\n        had predicted precisely that to me. Supposedly,\n        she had dreamed it. The police thinks she's\n        lying. Who told her about it? Who announced it\n        to her?\nLONG SILENCE. Finally, the pastor gets up, takes a few\nsteps, then, after another PAUSE, turns again to the\nschoolteacher. His face is ashen, and he can hardly\nspeak:\n        PASTOR: If I understand you correctly, you're\n        saying that your pupils, my children included,\n        committed these crimes. Is that right?\nThe schoolteacher has little affirmative and regretful\ngesture. He feels extremely uncomfortable in this role.\nAnother PAUSE. Then, the pastor continues:\n        Do you realize what you're saying?\nPAUSE. He breathes heavily, tries to control his\nemotions.\n        Do you know...\n                                                            95\n\nHis voice fails. His chin starts to shake, tears flood\nhis eyes, and he suddenly turns away.\nThe schoolteacher who has been looking at him, now looks\ndown and stays where he is without saying a word.\nAfter a while, the pastor has regained enough control of\nhimself to turn back to the schoolteacher:\n        I assume that I'm the first person to whom\n        you've uttered this monstrosity.\nMute reaction of the schoolteacher (\"of course\").\n        If you ever dare to bother other people with it,\n        if you publicly denounce respectable families\n        and their children in this abject way, I shall\n        make sure -- and you can take my word for it --\n        that you will go to prison.\nThe schoolteacher wants to reply something, but the\npastor continues:\n        I've seen quite a lot during my work as a\n        pastor, but I've never come across anything as\n        repulsive as this.\nHe looks at the schoolteacher for a moment with disdain:\n\n       One can tell that you have no children.\n       Otherwise,   you    wouldn't   stoop   to   such\n       viciousness. You have a sick mind. I wonder how\n       the school authorities could let you loose among\n       those poor creatures. I'll have a word with the\n       authorities at the proper time.\n       And now please leave my house. I never want to\n       see you here again.\n\n\n                            \n\n\n74. THE MIDWIFE'S HOUSE EXT/DAY\nThe steward, his wife and the schoolteacher try to break\ninto the house.\nFirst the steward tries several keys. As this doesn't\nwork, they break down a door at the rear of the house\nand go in.\n        NARRATOR: The midwife never came back. I waited\n        until the morning, two days later. Then, I went\n        to the manor house to inform the Baron. He\n        referred me to the steward and said to open the\n        house immediately and to look after the disabled\n        boy.\n\n\n                            \n\n75. THE MIDWIFE'S HOUSE INT/DAY\nBACK TO THE SCENE.\n                                                           96\n\nThe schoolteacher, the steward and his wife search\nthrough the house. Because of the closed shutters, its\nrooms are veiled in half-light. Several times they call\n\"Hansi\"!, \"Hello, Hansi, where are you\"?, which can\nfaintly be heard under the narrator's voice.\nIn the midwife's bedroom, the schoolteacher notices a\nphoto: it shows the doctor, an unknown woman, and Xenia\nas a small girl.\nThe boy is nowhere to be found.\n        NARRATOR: I had never come to the midwife's\n        house and felt uncomfortable at the idea of\n        barging into somebody else's house without\n        asking. It was strange, but we were still\n        seeking and calling out anxiously Hansi's name,\n        and I already knew, that we were searching in\n        vain. Anyone who knew the midwife also knew how\n        devoted she was to her disabled child, and that\n        she would never have left her wounded Hansi all\n        alone.\nThe three searchers, who have found nothing, meet again\nin the stairwell.\n\n\n                            \n\n\n76. THE MIDWIFE'S HOUSE EXT/DAY\nThe schoolteacher, the steward and his wife come out\nfrom behind the house, leave the property and go their\nseparate ways on the street. All that is left is the\nempty house with its closed shutters.\n\n       NARRATOR: During the next few weeks, the village\n       gossip-factory worked overtime.\n       Some claimed, the doctor was Hansi's father. He\n       and the midwife had tried to abort the child so\n       that the shame of their relationship wouldn't be\n       found out, and that's how the child became\n       disabled. Others even went as far as to claim\n       that there was something fishy about the death\n       of the doctor's wife, and that they wouldn't be\n       surprised, if the two weren't responsible for\n       it.\n\n\n                            \n\n77. MONTAGE: EXT/DAY\nThe houses of the doctor, the pastor, the farmer, the\nstreet before the school, the estate's administrative\nbuildings and the manor house.\nThere is nobody to be seen.\n\n       NARRATOR: Whoever had lynched the boy obviously\n       knew about the hidden crimes of his parents.\n                                                          97\n\n       Suddenly it seemed even possible that the doctor\n       and the midwife, as potential murderers, were\n       also the perpetrators of all the other crimes.\n       It was suspected, that the doctor had wanted to\n       spare his legitimate children and himself public\n       disclosure of his guilt, and had therefore fled\n       with them. Apparently he had taken the disabled\n       boy with him out of guilt. Understandably\n       enough, he had left behind his accomplice and\n       the mother of the disgraced child.\n       The fact that it was on a bicycle that she tried\n       to catch up with the man who had happily\n       escaped, was the cause of a great deal of\n       laughter.\n\nThe deserted estate is decorated with flags.\n        On July 28th Austria declared war on Serbia. It\n        was followed on Saturday, August 1rst, by the\n        German declaration of war on Russia, and on\n        France the following Monday.\n\n\n\n\n                            \n\n\n  78.CHURCH INT/DAY\n\nHIGH ANGLE SHOT:\nThe villagers are about to take their seats. The smaller\nchildren are sitting with their parents on the pews.\nAll are in their Sunday best, the members of the militia\nare in uniform. Flags are planted. Joyful excitement\nreigns everywhere.\nOnce the church is full, the Baron, the Baroness and\ntheir son Sigi walk down the aisle and sit down in the\nfront row.\n\n       NARRATOR: On the Sunday between those dates, the\n       whole village came to the festive service.\n       An atmosphere of expectation and departure was\n       in the air. From now on nothing would be the\n       same.\n       Only a few days ago everybody would have called\n       the life they lived as God's will, worthy of\n       being lived, and would have shunned any change.\n       The strange joy with which the coming war was\n       greeted, showed that this certainty of order and\n       security was based on very shaky foundations.\n\nCLOSE-UPS:\nOf all the adult leading characters of the film, aside\nfrom the doctor and the midwife. Also of Eva and her\nfather.\n                                                           98\n\n       In the frenzy of patriotic enthusiasm that was\n       flaring up, the events that had shaken Eichwald,\n       had become an irrelevant.\n       In the face of the coming war, Eva's father had\n       taken his daughter back and, at her pleading,\n       had come to Eichwald to cast an eye at the place\n       where his future son-in-law was living and\n       working. The prospect, that I might soon call\n       this beloved creature my wife, turned this day\n       also into a solemn day for me.\n       The pastor never mentioned our conversation\n       again. Our relationship was limited to what was\n       required professionally. He apparently never\n       went through with his threat to denounce me to\n       the school-authorities.\n\nMORE CLOSE-UPS.\nThe schoolteacher on the gallery lifts his hands and\ncues them to begin. They start SINGING. We see them one\nafter the other. At the end we see Marie: she wears the\nwhite ribbon in her hair.\n\n       Today, more than a quarter of a century later,\n       toward the end of my life, and several years\n       after the end of a second war that was to change\n       this world in a more cruel and radical way than\n       the first one, the one we faced at the time, I\n       wonder if the events of those days and our\n       silence about them, weren't the germ of the\n       tragedy toward which we were heading.\n       Didn't we all know secretly what had happened in\n       our midst? Hadn't we, in a way, made it possible\n       by closing our eyes? Didn't we keep our mouths\n       shut because otherwise we would have had to\n       wonder if the misdeeds of these children, of our\n       children, weren't actually the result of what\n       we'd been teaching them?\n\nThe image of Marie singing with the shining white ribbon\nfreezes.\n\n       I was drafted at the start of the third year of\n       the war. After the war, I sold the house in\n       Grundbach that I had inherited from my father,\n       who had died in the meantime, and with the money\n       I opened a tailor's shop in the town, where I\n       still live now.\n       I never saw anybody from the village again.\n\nOver the FREEZE FRAME the END CREDITS begin. Once the\nnarrator's VOICE has gone silent, we listen to Bach's\nsolemn chorale. The children sing beautifully.\n\n\n\n\n\n\nWhite Ribbon, The\nWriters :   Michael Haneke\nGenres :   Crime  Drama  Mystery\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:47.908116"}