{"title": "Who Framed Roger Rabbit?", "film_link": "/Movie Scripts/Who Framed Roger Rabbit? Script.html", "script_link": "/scripts/Who-Framed-Roger-Rabbit%3f.html", "info_raw": "\n\nWho Framed Roger Rabbit? Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (9.83 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Jeffrey Price  Peter S. Seaman\nGenres  Action  Animation  Comedy  Crime  Family  Fantasy  Thriller\nScript Date : September 1986\n\nRead \"Who Framed Roger Rabbit?\" Script\n\n\n", "script": "\n\n\nWho Framed Roger Rabbit?, by Jeffrey Price and Peter S. Seaman\n\n\n\n\n\n\n\n\n\n\n                   \"WHO SHOT ROGER RABBIT?\"\n                        (working title)\n\n\n                          Written by\n\n               Jeffrey Price and Peter S. Seaman\n\n\n\n\n\n\n                                                THIRD DRAFT\n\n                                                September 2, 1986\n\n\n\n\n\n\n\n\n\n                        WHO SHOT ROGER RABBIT?\n\n     This movie starts the way all movies should... with a\n     cartoon.  It's not a Disney or a Warner's.  It's not a\n     Fleischer, an MGM, or a Lanz.  This is a lesser known\n     studio.\n\n\n     FADE IN:\n\n     ON A \"MAROON CARTOON\"\n\n     Accompanied by zany CARTOON MUSIC, the TITLE CARD reads:\n\n                   MAROON CARTOONS PRESENT\n                BABY HERMAN AND ROGER RABBIT\n                           IN\n                      \"THE BUNNYSITTER\"\n\n     Below are two cameos of the cartoon's stars.  One picture is\n     of a cherubic baby in a bonnet innocently posed with his\n     thumb in his mouth.  The other is of a paunchy rabbit with a\n     gap between his front teeth.  He has a loveable, if slightly\n     shell-shocked look.  The cartoon begins...\n\n\n     BABY HERMAN AND ROGER RABBIT\n\n     are in a playpen when TWO FEMALE LEGS in high heels walk INTO\n     FRAME.  The VOICE belonging to the legs talks down to Baby\n     Herman in a maternal coo.\n\n                               VOICE (O.S.)\n               Mommy's going to the beauty parlor,\n               darling.  But I'm leaving you with your\n               favorite friend, Roger.  He's going to\n               take very, very good care of you...\n                      (voice turns\n                       ominous)\n               ... cause if he doesn't, he's going\n               back to the science lab!\n\n     Roger gulps as he watches the legs disappear.  We HEAR\n     FOOTSTEPS recede and a DOOR SLAM.  Roger turns confidently\n     back to his charge.  But the little tyke is already squeezing\n     through the playpen bars.\n\n                               BABY HERMAN\n               Baby bye-bye...\n\n     Roger makes a dive for him, misses, and gets his head stuck\n     between the bars.  He pleads with the Baby in a voice that\n     resonates of Huntz Hall in \"The Bowery Boys\".\n\n                               ROGER RABBIT\n               Hey, come back!  You heard what your\n               mother said!\n\n\n     BABY HERMAN\n\n     ignores Roger.  We FOLLOW HIM as he crawls into the kitchen.\n     He stops to regard something that has caught his attention...\n     a cookie jar.  It's sitting on top of the refrigerator.\n\n                               BABY HERMAN\n               Coo-kie.\n\n\n     ROGER\n\n     wearing the playpen like a pillory, comes running toward the\n     kitchen.  But the playpen is too wide to clear the door.  The\n     impact SHATTERING the playpen and sends Roger sprawling\n     across the kitchen floor.  When he looks up...\n\n\n     BABY HERMAN\n\n     is swinging precariously on the door of the freeer.\n\n                               ROGER RABBIT\n               Hang on, Baby.  I'll save you!\n\n     Roger makes a desperate leap across the kitchen for the kid.\n     But Baby Herman swings the door to the freezer open and Roger\n     disappears inside.  Baby Herman grabs a cookie and swings\n     back, shutting the door.  He climbs down and crawls out of\n     the kitchen.  After a beat, the freezer door opens.\n\n\n     ROGER\n\n     now shaped like a block of ice, falls out and hits the floor.\n     The block SHATTERS into ice cubes.  Roger looks around,\n     dazed.\n\n\n     BABY HERMAN\n\n     has taken this opportunity to crawl out the window.  Roger\n     races to the window.  His eyes pop out of his head at what he\n     sees.\n\n\n     ROGER'S POV\n\n     Baby Herman is crawling along the sidewalk under the shadow\n     of a safe being hoisted into a second floor window by the\n     Acme Safe Moving Company.  The rope holding the safe is\n     fraying down to a slender thread.\n\n\n     ROGER\n\n     gasps and rockets out the window toward Baby Herman.  The\n     rope snaps.  The safe falls.  Roger arrives just in time to\n     pluck the Baby out of harm's way.  But not in time to save\n     himself.  The safe CRUNCHES down on his head, burying Roger\n     into the sidewalk.  After a beat, Roger's hand appears and\n     spins the tumbler.  The safe door opens.  Inside, we see the\n     dazed rabbit with little TWEETING BIRDS circling his head.\n\n                               VOICE (O.S.)\n               Cut, cut, cut!\n\n     The cartoon action stops abruptly, but the goofy CARTOON\n     MUSIC PLAYS ON.  We begin a slow PULL BACK TO REVEAL that\n     this cartoon is being filmed LIVE ON A SOUND STAGE.  The\n     title card sits on an easle.  The female legs are paper\n     mache' props manipulated by two HUMAN CREW MEMBERS.  Wearily,\n     they lean the legs up against the stage wall.  A human\n     DIRECTOR, wearing a tweed jacket and baggy pleated pants,\n     steps onto the set.  From the equipment and the dress of the\n     crew, we can tell it's the 1940's.  Baby Herman throws his\n     cookie down in disgust.  He talks in a gravelly voice an\n     octave lower than Wallace Beery's.\n\n                               BABY HERMAN\n               What the hell was wrong with that\n               take??\n\n                               DIRECTOR\n               Nothin' with you, Baby Herman.  It's on\n               Roger... again!\n                      (over shoulder)\n               Hey!  Could we lose the playback?\n\n     The MUSIC suddenly STOPS as, off to the side, the SOUNDMAN\n     lifts the needle off a phonograph record.  The Director leans\n     over Roger and angrily plucks one of the birds circling his\n     head.\n\n                               DIRECTOR\n                      (continuing)\n               What's this, Roger?\n\n                               ROGER RABBIT\n                      (sheepish)\n               A tweeting bird?\n\n                               DIRECTOR\n               That's right, a tweeting bird.  But\n               what does the script say?  'Rabbit gets\n               conked.  Rabbit sees stars!'  Not\n               birds, stars!\n\n                               BABY HERMAN\n               Aw, for cryin' out loud, Roger!  I'll\n               be in my trailer... takin' a nap!\n\n     Baby Herman pulls himself up to his full height of two feet\n     and walks off the set.  He chooses a route that takes him\n     under the dress of the SCRIPT GIRL.  She jumps as if goosed.\n     Now two CREW MEMBERS lift the safe off Roger.\n\n                               ROGER RABBIT\n               Please, Raoul.  I can give you stars,\n               I know I can.  Just drop the safe on my\n               head one more time.\n\n                               DIRECTOR\n               I've already dropped it on you\n               twenty-three times.\n\n                               ROGER RABBIT\n               Don't worry about me.  I can take it.\n\n                               DIRECTOR\n               I'm not worried about you.  I'm worried\n               about the safe.\n\n     CONTINUED PULLBACK.\n\n     What we've been seeing has been from the POV of a MAN in a\n     shiny brown suit standing unobtrusively at the back of the\n     sound stage.  Under a beat-up fedora is a craggy face that's\n     seen a lot in its life... but apparently didn't think much of\n     it was funny.  EDDIE VALIANT takes a jolt from a pint of\n     whiskey, evidently in reaction to what he's seen.  He opens\n     his coat and returns the pint bottle to a shoulder holster\n     which had formerly held a .38.  Nerves steadied, he walks out\n     the stage door.\n\n\n     EXT. MAROON STUDIO - DAY\n\n     Valiant emerges from the stage onto a bustling Hollywood\n     studio lot where CARTOON CHARACTERS (TOONS) and humans are\n     comingling as if it were the most natural thing in the world.\n     Valiant stops by an Acme Novelty truck which is unloading\n     Toon props.  There are bombs, rockets, flattened pocket\n     watches, anvils, giant slingshots, etcetera.  The license\n     plate is California 1946.  He fishes out a pack of\n     Chesterfields and taps out a half a butt that had been\n     stubbed out.  As he lights it, Valiant regards a chubby,\n     balding man wearing a three-piece suit and a worried\n     expression coming towards him.  He is R.K. MAROON, studio\n     boss.  Maroon is leading an entourage of ASSISTANTS trying to\n     keep up.\n\n                               MAROON\n               Starting tomorrow there'll be no more\n               roast beef lunches.  What happened to\n               cheese sandwiches?  I was raised on\n               cheese sandwiches.\n\n     As the Assistants dutifully record his thoughts, Maroon sees\n     a GUY taking a nap in the shade of a palm tree.\n\n                               MAROON\n                      (continuing)\n               And tell that guy sleepin' over there\n               he's fired!\n \n                               ASSISTANT\n               It's your wife's brother, R.K.\n\n                               MAROON\n                      (reconsiders)\n               Oh... tell him he's promoted.  But get\n               him out of my sight.\n\n     As the Assistants disperse, Maroon approaches Valiant.\n\n                               MAROON\n               Valiant, did you see the rabbit?\n\n                               VALIANT\n               He was blowin' his lines, all right.\n               So what?\n\n                               MAROON\n               So what?  He's already put me three\n               weeks behind on the shooting schedule!\n\n     Now an EDITH HEAD-TYPE hustles up to show Maroon several\n     costume designs.\n\n                               COSTUMER\n               Your reaction, R.K.?\n\n     Maroon quickly checks out the drawing.\n\n                               MAROON\n               No!  That's not funny.\n \n     She flips another drawing.\n\n                               MAROON\n                      (continuing)\n               That's funny.  Put a homburg on him\n               it'll even be funnier.  Huh, Valiant?\n\n     He grabs the pad and shows Valiant.  The rendering is of a\n     hippo in a pink polka-dot tu-tu.\n\n                               VALIANT\n                      (deadpan)\n               Yeah, that'd be a riot.\n\n     Maroon responds to Valiant's sarcasm with raised eyebrows.\n\n                               MAROON\n               Boy, I hope what you have ain't\n               contagious or I'll be out of business.\n\n     He hands the pad back to the designer, who departs.\n\n                               MAROON\n                      (continuing)\n               How much do you know about show\n               business, Valiant?\n\n                               VALIANT\n               Only there's no business like it, no\n               business I know.\n\n     Valiant watches an ALLIGATOR in a rebel uniform dragging a\n     brace of cannons and several TOADSTOOLS parade by.\n\n                               MAROON\n               Yeah, and there's no business as\n               expensive.  I'm twenty-five grand over\n               budget on the latest Bunnysitter\n               cartoon and it's all because that\n               rabbit can't keep his mind on his work.\n               And you know why?\n\n                               VALIANT\n               One too many safes dropped on his head?\n\n                               MAROON\n               Nah, that goes with the territory.\n               He's a stunt bunny.\n\n     Maroon takes a copy of the \"Hollywood Tattler\" out of his\n     pocket.\n\n                               MAROON\n                      (continuing)\n               Here's the problem...\n                      (reads)\n               \"Seen cooing over calamari with\n               notsonew Sugar Daddy was Jessica\n               Rabbit... wife of Maroon star, Roger\".\n                      (looks up)\n               His wife's a tramp, but he thinks she's\n               Betty Crocker.  The doubt's eatin' him\n               up.\n\n                               VALIANT\n               So what do you want me to do?\n\n                               MAROON\n               Get me a couple juicy pictures.\n               Somethin' I can wise the rabbit up\n               with.\n\n                               VALIANT\n               I don't work in Toontown.\n\n                               MAROON\n               You don't have to.  The rabbit's wife\n               sings at an underground Toon revue\n               joint called The Ink & Paint Club.  You\n               can catch her in action there.\n\n                               VALIANT\n               The job's gonna cost you a hundred\n               bucks.\n\n                               MAROON\n               A hundred bucks?  That's ridiculous.\n\n                               VALIANT\n               So's the job.\n\n     Valiant starts to walk away.\n\n                               MAROON\n               All right, all right... You got your\n               hundred bucks.\n\n     Maroon turns, snaps his fingers.  His Assistant appears out\n     of nowhere with Maroon's checkbook and a pen.  The Assistant\n     turns and stoops so that Maroon can write the check on his\n     back.\n\n                               MAROON\n                      (continuing)\n               Fifty now, fifty when you deliver the\n               pictures.\n\n     Maroon tears the check off and hands it to Valiant.  Suddenly\n     Valiant ducks in reflex to a large shadow that passes\n     overhead.\n\n                               MAROON\n                      (continuing;\n                       chuckles)\n               Kinda jumpy aren't you, Valiant?  It's\n               just Dumbo.\n\n\n     ABOVE THEIR HEADS - DUMBO\n\n     swoops back and forth, then hovers, ears flapping like a\n     hummingbird.\n\n                               MAROON\n               I got him on loan from Disney.\n\n                               VALIANT\n               Aren't you the lucky one...\n\n     Valiant grabs the check from Maroon and starts for the gate.\n\n                               MAROON\n               When will I hear from you?\n\n                               VALIANT\n               As soon as is humanly possible.\n\n     We FOLLOW Valiant out the gate under a wrought iron sign that\n     reads \"Maroon Cartoon Studios\".  As he starts across the road\n     he's almost run over by a Toon roadster that ROARS out of the\n     gates.  When it BLASTS ITS HORN, it's the FIRST FIVE NOTES\n     from the WOODY WOODPECKER SONG:  \"HA-HA-HA-HA-HA\".  Valiant\n     jumps back as the roadster passes.  WOODY THE WOODPECKER'S\n     behind the wheel with a self-important smile on his face.\n     Valiant angrily waves the cloud of Toon dust away.\n\n                               VALIANT\n                      (coughs)\n               Damn Toons.\n\n\n     ACROSS THE STREET - A TROLLEY CAR\n\n     is slowing to a stop in front of the studio.  It's a Pacific\n     and Electric \"Red Car\", part of a vast system of electric\n     trollies that once criss-crossed the L.A. Basin.  Valiant\n     steps onto the \"Red Car\".  He reaches into his pocket to give\n     the CONDUCTOR his nickel fare.  But he comes up with a\n     handful of lint.  He holds out the check.\n\n                               CONDUCTOR\n               What do I look like, a bank?\n\n     The Conductor jerks his thumb toward the door.  Valiant\n     suffers the public humiliation,of having to step down past\n     the rest of the boarding passengers.  He walks around to the\n     back of the Red Car where a gang of TEN-YEAR-OLDS are\n     loitering.  When the BELL SOUNDS and the Red Car starts to\n     pull away, the Kids make a dash for a place on the cow\n     catcher.  Valiant joins them.  We HOLD as the Red Car moves\n     away and the street urchins regard their older partner in\n     crime with curiosity.\n\n                                              DISSOLVE TO:\n\n\n     A BILLBOARD SIGN\n\n     It reads:  \"L.A.'s Pacific and Electric Red Car -- America's\n     Finest Public Transportation System\".  PAN DOWN to see that\n     the sign is on the roof of the trolley terminal.  Red Cars\n     are going in and out of the shed.  MOVE IN on one car\n     approaching the terminal from down the street.  As it passes\n     by...\n\n\n     VALIANT\n\n     hops off his freeloader's seat on the back,\n\n                               KID\n               So long, mister.\n\n     Valiant waves laconically.\n\n                               VALIANT\n               Thanks for the cigarettes.\n\n     We FOLLOW Valiant as he crosses the street to a seedy\n     bungalow.  A note is push-pinned to the door.\n\n\n     CLOSE - NOTE\n\n     It says:  \"Tomorrow's Friday... Well?  Dolores\".\n\n\n     VALIANT\n\n     takes the note and walks back across the street toward the\n     terminal.  He climbs up a flight of stairs, heading for a bar\n     on the mezzanine.  The bar sports a red neon sign that used\n     to blink, \"The Terminal Station Bar\".  But now it just says,\n     \"Terminal\".\n\n\n     INT. TERMINAL BAR - DAY\n\n     The place must have been pretty swanky at the turn of the\n     century when it was built in the first burst of enthusiasm\n     over the new public transportation system.  It's in the motif\n     of a trolley car.  There's a large map on the wail above the\n     bar showing all the different lines.  Behind the bar is\n     DOLORES.  If you scraped off all the makeup, you'd find an\n     attractive woman in her late thirties.  She ministers to a\n     rag-tag assortment of Hollywood low-lifes -- who are truly at\n     the end of the line.\n\n\n     VALIANT\n\n     enters this den, lets his eyes adjust for a moment, then\n     bellies up to the bar.  He finds a spot between a ONE-ARMED\n     BLACK SOLDIER and a MIDGET stretched out on the bar passed\n     out.  Now a TROLLEY RUMBLES underneath them.  The bar starts\n     to shake like an earthquake, the lights flicker.  All the\n     drinkers, observing a time honored ritual, lift their glasses\n     simultaneously to avoid spilling any drops.  Even the Midget\n     lifts his head until the trolley has passed.  Valiant reaches\n     over the bar and blind-grabs a bottle of rye he obviously\n     knows is there.  He pours himself a shot.\n\n                               VALIANT\n               Hey, fellas, what's the good word?\n\n                               SOLDIER\n               Lost my job.\n\n     An ARTHRITIC COWBOY pipes up.\n\n                               COWBOY\n               Mule died.\n\n     A DEAF-MUTE scribbles a note on a pad hanging around his\n     neck.  He hands the note to Valiant.  It says \"My girl dumped\n     me\".  Valiant pats him on the back, consoling.\n\n                               VALIANT\n               Well, you know what they say about\n               dames, Augie...\n\n     Then Valiant mouths the rest of it for Augie's benefit only.\n     Augie reads his lips, then starts to roar silently, slapping\n     his thigh.  Now Dolores makes her way down the bar.  She\n     grabs the Midget by the suspenders and slides him out of the\n     way.\n\n                               DOLORES\n               So, makin' dame jokes, huh, Eddie?\n               Well, lemme remind ya pal, it was a\n               dame who took a hundred bucks out of\n               the till so your landlord would't\n               throw you out of your dump.  And it was\n               a dame who trusted you for the money\n               when no one else in town would.  And\n               it's a dame who's tired of waitin' for\n               you to straighten yourself out and get\n               a job!\n\n                               VALIANT\n               Would this be the same dame who's going\n               to feel awfully foolish when she finds\n               out I've got her money.\n\n     Valiant slides the check across the bar.  Dolores studies it.\n     She calms down a little.\n\n                               DOLORES\n               This is fifty bucks.  I need\n               seventy-five before they check the\n               books tomorrow.\n\n                               VALIANT\n               You'll have it in the morning.  Now be\n               a sport and lemme have twenty bucks to\n               put in my pocket.\n\n                               DOLORES\n               Is this paper even good?\n\n                               VALIANT\n               Check the scrawl.\n\n                               DOLORES\n                      (reads)\n               R.K. Maroon.\n\n     Now ANGELO, a Neanderthal sitting a few stools down, is\n     tapping the shell of a hardboiled egg.\n\n                               ANGELO\n               Maroon?  Valiant, don't tell me you're\n               workin' for a Toon?  Who's your client?\n               Chilly Willy or Screwy Squirrel?\n\n     Angelo chuckles at his own joke and goes to eat his egg.\n     Suddenly Valiant darkens.  He grabs Angelo by the shirt and\n     pulls him up to his face.\n\n                               VALIANT\n               Get this straight, greaseball.  I'm not\n               workin' for a Toon!  I'd never work for\n               a Toon!  Got that?\n\n     Valiant jams the whole egg into Angelo's mouth, turns and\n     storms out the door.  Angelo sputters and spits out the egg.\n\n                               ANGELO\n               What's his problem?\n\n                               DOLORES\n               Toon killed his brother.\n\n\n     EXT. INK & PAINT CLUB - NIGHT\n\n     Valiant knocks on the door of, a non-descript building in a\n     run-down factory area.  A speakeasy style peephole slides\n     open REVEALING the face of a TOON GORILLA.  Valiant offers\n     the password.\n\n                               VALIANT\n               Walt sent me.\n\n     The peephole slides closed and after a beat the door swings\n     open.\n\n\n     INT. CLUB\n\n     The Gorilla, dressed in a tux, gives Valiant the once over.\n     Valiant resents the assessment.\n\n                               VALIANT\n               Like your monkey suit.\n\n                               GORILLA\n               Wise ass...\n\n     We FOLLOW Valiant down the hall toward the main room.  We can\n     HEAR LAUGHTER and ZANY MUSIC from within.\n\n\n     INT. MAIN ROOM\n\n     When Valiant steps through the doorway, we see the place is\n     no dive.  It's a white tablecloth nightclub on a par with the\n     El Morroco or the Garden of Allah.  Behind the bar A\n     CATERPILLAR BARTENDER is using his many arms to shake and\n     pour several drinks at once.  Meanwhile a dozen PENGUIN\n     WAITERS are gliding back and forth along the tables serving\n     drinks to the well-heeled crowd.\n\n\n     ON STAGE\n\n     DONALD DUCK and DAFFY DUCK are seated opposite each other at\n     matching grand pianos.  What begins as a decorous Duck duet\n     on a Tchaikovsky piece (complete with knuckle-cracking,\n     seat-spinning preparations) quickly accelerates to a loony\n     game of one-upsmanship between these two irascible Ducks.\n     There is keyboard stomping, lid-banging, piano wire plucking\n     zaniness.\n\n\n     THE AUDIENCE\n\n     is HOWLING.  People are wiping the tears from their eyes\n     they're laughing so hard.  All except...\n\n\n     VALIANT\n\n     He lights a cigarette impassively, not humored by the Toon\n     hijinx.  He spots an empty table off to the side and makes\n     his way towards it.  A SILLY GEEZER in a loud suit is at the\n     next table.  The Geezer nods to him soberly as Valiant pulls\n     Out the chair and sits down.  A LOUD FLATULENCE SOUND erupts\n     from under Valiant.  The Geezer slaps his thigh with the\n     hilarity of it all.\n\n                               GEEZER\n               Will you listen to that?  It's a pip!\n               I'm thinking of callin' it a Whoopee\n               Cushion.\n\n     Valiant reaches under himself and comes up holding a deflated\n     rubber bladder.  The Geezer retrieves it from him.\n\n                               GEEZER\n                       (continuing)\n                No hard feelings, I hope.  Put 'er\n                there...\n\n     The Geezer grabs Valiant's hand before he can say no.  We\n     HEAR A BUZZ.  Valiant retracts his hand as if shocked.  The\n     Geezer howls with laughter and turns his palm to Eddie.\n\n                               GEEZER\n                      (continuing)\n               Hand buzzer... real gasser.\n\n     Valiant rolls his eyes and grabs a Penguin as it glides by.\n\n                               VALIANT\n               Scotch.\n\n                               PENGUIN\n               There's a two drink minimum.\n\n                               VALIANT\n               Just as long as there's no maximum.\n\n                               GEEZER\n               Waiter, I'll sign my check now.\n\n     The Penguin puts a bill down on the Geezer's table and zips\n     off.  The Geezer takes a fountain pen out of his jacket and\n     writes on the bill.  But there doesn't seem to be any ink\n     coming out.  He shakes and shakes the pen to get it flowing.\n     It flows all right.  Ink splatters all over Valiant's shirt\n     and pants.  Valiant looks down at the stain, doing a slow\n     burn.  The Geezer starts laughing.  Valiant jumps up and\n     grabs him by the lapels.\n\n                               VALIANT\n               That's it for you, pops!\n\n                               GEEZER\n                      (freaked)\n               Calm down, son.  Look, the ink is gone.\n\n     Valiant looks down at his shirt.  The stain is gone.\n\n                               GEEZER\n                      (continuing)\n               See?  It disappears.\n\n                               VALIANT\n               Well, why don't you make like the ink?\n\n     Valiant drops him into his chair and returns to his seat.\n     The Penguin glides up with his drinks.  Valiant swallows the\n     first one with one quick jerk of the head.\n\n\n     ON STAGE\n\n     Donald and Daffy's PIANO COMPETITION has reached a CRESCENDO\n     of mayhem.  They've got the axes out, and in time with the\n     MUSIC they reduce their pianos to matchsticks.  At the\n     completion of the piece, they step to the front of the stage\n     and with great decorum, arms around each other, they take\n     their bows.  The curtain comes down to GREAT APPLAUSE.  We\n     HEAR SFX of CRASHING AND BASHING backstage.  Now from behind\n     Valiant, we HEAR a familiar high-pitched VOICE.\n\n                               CIGARETTE GIRL\n               Cigars... cigarettes... Eddie?\n\n     Valiant turns to see BETTY BOOP standing with a box of\n     tobacco wares strapped around her neck.  In contrast to all\n     the other Toons, Betty's in black and white.\n\n                               BETTY BOOP\n                      (continuing)\n               Gee, it's swell to see you, Eddie.  We\n               miss you in Toontown.\n\n                               VALIANT\n               Wish I could say the same.  What're you\n               doin' here, Betty?\n\n                               BETTY BOOP\n               Work's been slow for me since the\n               cartoons went to color.  But I still\n               got it, Eddie...\n                      (sings)\n               'Boop boop be-doop'.\n\n                               VALIANT\n               Yeah, you still got it, Betty.\n                      (indicates\n                       Geezer)\n               Who's Mr. Jocularity?\n\n                               BETTY BOOP\n                      (leans in)\n               That's Marvin Acme, the gag king.\n\n                               VALIANT\n               Shoulda guessed.\n\n                               BETTY BOOP\n               He comes here every night to see\n               Jessica Rabbit.\n\n                               VALIANT\n               Big on the musical comedy, huh?\n\n                               BETTY BOOP\n               Sounds like you ve never seen her,\n               Eddie.\n\n     Now the lights dim and Betty moves on.\n\n\n     ON STAGE\n\n     the dour DROOPY walks out with the spotlight following him.\n     He's the evening's emcee.\n\n                               DROOPY\n                      (deadpan)\n               Hello, everybody.  I hope you're all\n               having as much fun as I am.  I have a\n               small announcement to make.  Jessica\n               Rabbit will not be able to sing\n               tonight.\n\n     There's a ROAR OF DISAPPROVAL from the men in the crowd.\n     They shower him with debris.\n\n                               DROOPY\n                      (continuing;\n                       deadpan)\n               I was merely jesting.  Without further\n               ado... here's woman times two,\n               Toontown's own chanteuse par\n               excellance... Jessica Rabbit!\n\n     There is excited APPLAUSE as the lights dim. A TOON COMBO\n     made up of CROWS in shades STRIKES UP the intro to the smokey\n     song, \"Why Don't You Do Right\".  A spotlight hits the\n     curtain. Now a curvaceous leg pokes out, teasingly.  The\n     crowd goes wild as the rest of the body belonging to the leg\n     emerges.  JESSICA RABBIT is a generously endowed red-headed\n     bombshell.  She's a humanoid Toon... in her case, more\n     beautiful than human.  Her figure is testimony to what a guy\n     can do with a pencil and a fertile imagination,\n\n\n     REACTION - VALIANT\n\n     This is not quite the bunny he expected Roger to be married\n     to.  His jaw drops.  And his reaction is mirrored all around\n     the room.  The men are panting so hard you couldn't keep a\n     match lit.\n\n\n     CLOSEUP - JESSICA\n\n     as she steps to the mike.\n\n                               JESSICA RABBIT\n                      (sings)\n               'You had plenty of money back\n                  in '22\n               You let other woman make a fool\n                  of you\n               Why don't you do right.\n               Like some other men do...\n               Get out of here and\n               Get me the money too...'\n\n     Jessica takes the mike and comes off the stage.  Slinkily.\n     she wanders among the tables, teasing the men as she goes.\n\n     Now there's a HOWL from behind Valiant.  A Tex Avery type\n     TOON WOLF, who came masquerading as a human, couldn't help\n     but show his true colors at the sight of Jessica.  He HOWLS\n     as if it were a full moon.  His tongue rolls out of his head\n     and piles up on the floor like so much clothesline.  His\n     eyeballs telescope out of his head.  And finally, the Wolf\n     levitates and snaps rigid like an open jacknife.  As the Wolf\n     makes a rush for the stage, the Gorilla Bouncer grabs him by\n     the suspenders.  The Wolf, legs spinning madly, practically\n     knocks Valiant's table over as he grabs at Jessica.  But the\n     Wolf has come to the end of his suspenders.  He snaps back\n     toward the Gorilla who is holding an anvil in front of the\n     suspenders.  CLANG!  The Wolf hits the anvil and slides to\n     the floor.  The Gorilla calmly whisks him into a dustpan and\n     carries him out.\n\n\n     JESSICA\n\n     like all good saloon singers, has continued her act\n     undaunted.\n\n                               JESSICA RABBIT\n                      (singing)\n               'Why don't you do right.\n               Like some other men do...'\n\n     She sashays over to the Geezer's table.  Teasingly, she\n     swirls the whisps of white hair onto his head into a Dairy\n     Queen.  He giggles gleefully and makes a grab at Jessica.\n     But she slips out of his grasp like mercury.\n\n                               JESSICA RABBIT\n                      (continuing)\n               'You ain't got no money\n               Ain't got no use for you...'\n\n     Now Jessica works her way over to Eddie.  She stops at his\n     table and sings tauntingly.  Then with a flourish, she throws\n     herself in his lap, and belts out the finale.\n\n                               JESSICA RABBIT\n                      (continuing)\n               'So get out of here...\n               And get me the money toooo!'\n\n     There is RAUCOUS APPLAUSE when she finishes.  Jessica looks\n     deep into Eddie's eyes.\n\n                               JESSICA RABBIT\n                      (continuing)\n               Thanks for your lap.\n\n     Before Eddie can reply, she jumps off, and slinks offstage,\n     leaving Eddie a pile of human wreckage.  Valiant slugs the\n     rest of his drink down to put out the fire in his libido.\n\n     When the lights come up, Valiant looks over to where Acme is\n     slicking down his eyebrows and patting his hair down.  He\n     stands, picks up a bouquet of roses from the chair beside\n     him, and as he passes Valiant's table, gives him a big wink.\n     Valiant watches Acme disappear backstage.  He stands, drops\n     a couple bucks on the table, and follows after him.\n\n\n     BACKSTAGE\n\n     Valiant steps past the curtain, keeping a discreet distance.\n     He follows Marvin Acme down a corridor and around the corner.\n     Acme stops and knocks on a dressing room door.  After a\n     moment, it opens and Acme goes inside.  Valiant checks over\n     his shoulder, but the backstage area is empty.  He eases over\n     to the door and puts his eye to the keyhole.\n\n\n     POV THROUGH KEYHOLE\n\n     Jessica is seated at her dressing table.  Acme is on his\n     knees next to her, kissing his way up her gloved hand, eyes\n     closed in ecstasy.  Jessica takes her hand out of the glove\n     and starts combing her hair, leaving Marvin kissing a\n     suspended Toon glove.\n\n\n     ANGLE ON VALIANT\n\n     while he continues his peeping.  The Gorilla bouncer sneaks\n     up behind him.\n\n                               GORILLA\n               Hey, whaddaya think you're doin',\n               chump?\n\n                               VALIANT\n               Who're you callin' chump, chimp?\n\n     The Gorilla smiles sadistically when he recognizes Valiant.\n\n                               GORILLA\n               Oh, it's da comedian...\n\n     The Gorilla grabs Valiant by the belt and lifts him off the\n     ground.  He opens the fire door and heaves Valiant out.\n\n\n     EXT. ALLEY - NIGHT\n\n     Valiant comes flying out the door and CRASHES into a bunch of\n     garbage cans in the alley.  The Gorilla stands in the doorvay\n     regarding the dazed Valiant.\n\n                               GORILLA\n               And don't lemme catch your peepin' face\n               around here again.  Got it?\n\n                               VALIANT\n               Ooga-booga.\n\n     The Gorilla slams the door.  Valiant picks himself up out of\n     the garbage.  He brushes himself off, then starts down the\n     alley toward the rear of the building.  We FOLLOW him around\n     the corner where he stops under Jessica's dressing room\n     window.  He drags over a milk crate to stand on, takes a\n     small camera out of his pocket and opens the bellows.  He\n     stands on the crate and aims the camera through the corner of\n     the window, as we HEAR the MUFFLED CONVERSATION from within.\n\n                               ACME (O.S.)\n               Are we going to play pattycake tonight?\n\n                               JESSICA RABBIT (0.5.)\n               Marvin, I have a headache...\n\n                               ACME (O.S.)\n                      (hurt)\n               But you promised...\n\n                               JESSICA RABBIT (O.S.)\n               Oh, all right.  But this time take that\n               hand buzzer off...\n\n     Valiant's eyes widen in disgust.\n\n                               VALIANT\n               Jesus Christ...\n\n     As he starts CLICKING pictures...\n\n                                              CUT TO:\n\n\n     EXT. MAROON STUDIO - LATE NIGHT\n\n     There's one light on in the Administration building.\n\n\n     INT. MAROON'S OFFICE - NIGHT\n\n     It's a large art deco office with walls covered with photos\n     of Maroon and various celebrities, human and Toon.  R.K.\n     Maroon is seated behind his desk.  Standing nearby is\n     Valiant.  They are both regarding a hysterical Roger Rabbit,\n     who's holding a set of 8 x lO glossies.  He's WAILING and\n     CRYING, Toon tears flooding off him in a torrent.\n\n                               ROGER RABBIT\n               Pattycake!  Pattycake!\n\n                               VALIANT\n               Baker's man... but no use ruinin' a\n               good pair of shoes over it.\n\n     ANGLE ON RUG\n\n     Roger's tears have formed a puddle around the desk.  Valiant\n     lifts a well-worn oxford and shakes the water off it.\n\n\n     MAROON\n\n     hands Roger his handkerchief.  Roger AAH-OO-GA'S his nose.\n\n                               MAROON\n               Take comfort, son, you're not the first\n               man whose wife played pattycake on him.\n\n                               ROGER RABBIT\n               I don't believe it.  I won't believe\n               it.\n\n                               MAROON\n               The pictures don't lie.  Mr. Valiant\n               here took them himself.\n\n     Roger takes another look at the pictures.\n\n\n     CLOSE - PHOTOS\n\n     They're shots of Jessica Rabbit and Marvin Acme seated knee\n     to knee, caught in the act of slapping palms... really\n     playing pattycake.\n\n\n     BACK TO SCENE\n\n     Maroon gets up and crosses to a bar table set up by the\n     window.  He pours a drink from a crystal decanter as Roger\n     starts sobbing again.\n\n                               ROGER RABBIT\n               But Jessy... she's the light of my\n               life, the apple of my eye, the cream in\n               my coffee...\n\n     Valiant eyes the booze longingly as he mutters to himself.\n\n                               VALIANT\n               Well, you better start thinkin' about\n               drinkin' it black.\n\n                               MAROON\n               Frankly, I'm shocked.  Marvin Acme's\n               been my friend and neighbor for thirty\n               years.\n\n     Maroon gestures out the window.  We see a blinking neon sign\n     on the roof of the building across the street -- \"Acme - If\n     It's Acme - It's A Gasser!\"\n\n                               MAROON\n                      (continuing)\n               Who would have thought he was the Sugar\n               Daddy?\n\n     Maroon turns and carries the drink to Roger.  Meanwhile,\n     Valiant sidles over to the bar to help himself.\n\n                               MAROON\n                      (continuing)\n               Well, the important thing now Roger, is\n               to put all this behind you.\n                      (hands him\n                       drink)\n               Drink this, son, you'll feel better.\n\n     Roger takes the glass and shoots it down in one gulp.\n\n                               MAROON\n                      (continuing)\n               I know this all seems painful now, but\n               you'll find someone new.  Won't he, Mr,\n               Valiant?\n\n     Eddie has just picked up the decanter to pour one for\n     himself.\n\n                               VALIANT\n                      (over shoulder)\n               Oh, yeah.  Good lookin' guy like him.\n               Dames'll be breakin' his door down.\n\n\n     CLOSE - ROGER\n\n     The booze is taking its effect.  There's a RUMBLE like a\n     volcano about to erupt.  Suddenly Roger's head turns into a\n     Toon steam whistle SHRIEKING.  The HIGH PITCH causes glass\n     objects in the room to SHATTER... including the crystal\n     decanter that Valiant's holding in his hand.  It EXPLODES,\n     soaking his suit with booze.  Valiant looks down at the\n     damage, completely exasperated.\n\n                               VALIANT\n               Son-of-a-bitch...\n                      (turns)\n               Mr. Maroon, I think I'll be goin' now,\n               so about the rest of my fee...\n\n                               MAROON\n               Sure, Valiant, sure...\n\n     Maroon sits at the desk and writes a check.\n\n                               MAROON\n               Being experienced in these matrimonial\n               matters, you have any advice for our\n               friend here?\n\n     Valiant crosses to the desk and takes the check.\n\n                               VALIANT\n               My advice?  Hop on over to Reno, get\n               yourself a quickie divorce.\n\n                               ROGER RABBIT\n               Divorce?  Never!\n\n     Suddenly Roger jumps onto Maroon's desk and grabs Valiant by\n     the lapels.\n\n                               ROGER RABBIT\n               Marriage is a two-way street and we're\n               just experiencing a detour!  Jessica\n               and I are going to get back together.\n               We're going to be happy!   H-A-P-P-I!\n\n     Roger zips off the desk and CRASHES out the window, leaving a\n     rabbit outline in the glass... backlit by the blinking Acme\n     sign.  Maroon and Valiant walk to the window and look out the\n     rabbit-shaped hole in the window.\n\n                               VALIANT\n               At least he took it well.\n\n\n     INT. VALIANT'S BUNGALOW - CLOSE - EMPTY BOOZE BOTTLE - EARLY\n     MORNING\n\n     PULL BACK TO REVEAL the bottle's on the floor next to the\n     couch Valiant's passed out on.  He's still dressed in his\n     clothes.  PAN the small studio apartment.  In the\n     kitchen/alcove, Valiant has created a makeshift darkroom.  We\n     see a curtain on a clothesline.  Various trays, and some\n     pictures clipped up on clothespins.  The pictures depict\n     Jessica Rabbit and Marvin Acme in various states of\n     pattycake.  Now there is LOUD POUNDING on the door.  But it\n     doesn't break through VaLiant's subconscious for several\n     seconds.  Finally, he rouses, gets up and walks a crooked\n     line to the door.  Valiant opens it and squints into the\n     excruciating sunlight.  When his eyes focus, REVEAL a\n     hang-dog POLICE DETECTIVE holding Eddie's morning paper.\n\n                               VALIANT\n               Lieutenant Santino... how ya doin'?\n\n     Santino ignores the question and regards Valiant with a\n     mixture of disgust and pity.\n\n                               LT. SANTINO\n               Tell me you didn't do a snoop job for\n               a Toon named Roger the Rabbit.\n\n                               VALIANT\n               That's what you woke me up for?\n\n     Santino flops open the morning paper.  Valiant's eyes narrow\n     as he reads it.  The headline screams:  \"TOON KILLS MAN!\" And\n     underneath:  \"Marvin Acme Murdered at the Hands of Jealous\n     Rabbit\".  Santino throws the paper on the sofa.\n\n                               LT. SANTINO\n               You got trouble, Eddie.\n\n     EXT. ACME FACTORY - DAY\n\n     An L.A. police car turns into the yard of the Acme factory\n     and pulls up in front of the old factory building.  There's\n     all kinds of official activity in the yard... cop cars, a\n     Coroner's truck, etcetera.\n\n     Valiant and Santino get out of the police car.  Santino\n     starts into the factory.  But he realizes Valiant's not\n     following him.  He turns to see Valiant looking over the wall\n     behind the factory, transfixed.\n\n                               LT. SANTINO\n               Now what?\n\n                               VALIANT\n               Just haven't been this close to\n               Toontown for awhile.\n\n\n     VALIANT'S POV\n\n     The sky above the wall is a different color, a little bit\n     more vibrant, a \"Toon Blue\", you might call it.\n\n\n     SANTINO\n\n     walks back and takes Valiant's arm.\n\n                               LT. SANTINO\n               Let's go, somebody wants to see you.\n\n     Santino leads Valiant into the factory.\n\n\n     INT. FACTORY - DAY\n\n     It's a large warehouse filled with stacks of Toon gags,..\n     boxes of dynamite, giant slingshots, boulders, everything\n     you've ever seen in a Roadrunner cartoon.  Santino stops\n     where a large black safe is imbedded at a cockeyed angle in\n     the floor.  A FORENSIC TEAM is at work around the safe.\n     They're chalking the outline around a body half obscured by\n     the safe.\n\n                               LT. SANTINO\n               They say the rabbit got the safe idea\n               from a cartoon he was makin' the other\n               day.\n\n                               VALIANT\n               What a gasser.\n\n                               LT. SANTINO\n               Wait here...\n\n     Santino walks to Acme's glassed office where a sobbing\n     Jessica Rabbit is being interrogated.  We can only see her,\n     not the person doing the interrogating.  Valiant sidles over\n     to where the Forensic Guys are dusting the photographs he had\n     taken for prints.  One of the Forensic Guys looks up from his\n     work.\n\n                               FORENSIC #1\n               Say, didn't you used to be Eddie\n               Valiant?\n\n     Valiant ignores the slings and arrows and surveys the scene\n     of the crime.  The door of the safe is ajar.  Valiant tries\n     to look inside.  Forensic #2 closes the door with his knee.\n\n     Now we HEAR the VOICE of Jessica Rabbit from behind them.\n\n                               JESSICA RABBIT\n               Mr. Valiant?\n\n     Valiant turns to the voice.  WHAP!  Jessica slaps him hard\n     enough across the face to make his head turn.\n\n                               JESSICA RABBIT\n                      (continuing)\n               I hope you're proud of yourself.\n\n     She turns on her heel and storms off, sobbing into a\n     handkerchief.  Valiant, rubbing his jaw, looks after her.  So\n     do the Forensic Guys.\n\n                               FORENSIC #1\n               She likes you, Valiant.\n\n                               FORENSIC #2\n                      (low wolf\n                       whistle)\n               When they drew her, they broke the\n               pencil.\n\n     Now two WHITE-JACKETS from the Coroner's office start to\n     carry Acme out on a stretcher.  As they pass Valiant, a hand\n     still wearing a Hand Buzzer flops out.  Valiant grabs it --\n     stopping the stretcher.\n\n                               VALIANT\n               Makes you wonder what in the world she\n               was doin' with a guy who didn't clean\n               his fingernails.\n\n\n     CLOSE - HAND\n\n     Imbedded under the fingernails is a reddish-brown substance.\n\n                               FORENSIC #1\n               So... it's blood.\n\n\n     VALIANT\n\n     peels a piece of it off... it chips and falls to the ground.\n     He squats to examine it.\n\n                               VALIANT\n               It's not blood, it's paint.\n\n     Suddenly the end of a cane comes down on Valiant's hand,\n     pinning it to the floor.  Valiant follows the cane UP to it's\n     gavel-shaped head -- past black pants, a black robe, to a\n     cadaver-like complected face, and a large hooked proboscis.\n     The head is shaved.  Rimless tinted glasses obscure the eyes.\n     Although he's human, the total appearance is frighteningly\n     vulture-like.  JUDGE DOOM is accompanied by Santino.\n\n                               DOOM\n               Is this man removing evidence from the\n               scene of a crime?\n\n                               LT. SANTINO\n                      (deferential)\n               Uh... no, Judge Doom.  Valiant here was\n               just about to hand it over, weren't\n               you, Valiant?\n\n                               DOOM\n               I'll take that.\n\n     Doom takes his cane off Eddie's hand and reaches out for the\n     paint chip.  Valiant palms a piece and drops a smaller piece\n     into Doom's hand.  Doom examines it.\n\n                               DOOM\n                      (continuing)\n               Looks like the deceased grabbed a\n               handful of your client's pantaloons,\n               Mr. Valiant.\n\n     Valiant stands to face the Judge, who towers over him.\n\n                               VALIANT\n               He's not my client.  I was workin' for\n               R.K. Maroon.\n\n                               DOOM\n               Yes, we talked to Mr. Maroon.  He told\n               us the rabbit became quite agitated\n               when you showed him the pictures, and\n               said nothing would stand in the way of\n               him getting his wife back.  Is that\n               true?\n\n                               VALIANT\n               Hey, pal, do I look like a\n               stenographer?\n\n                               LT. SANTINO\n               Watch your mouth, Eddie, he's a judge.\n\n     Doom smiles thinly at Valiant, tarns and walks with purpose\n     towards the door.  Santino and Valiant follow.\n\n                               DOOM\n               The rabbit's movements are fairly clear\n               after leaving the Maroon Studios.  He\n               ran across the street, jimmied this\n               door open, hoisted the safe on a block\n               and tackle...\n\n\n     EXT. ACME FACTORY\n\n     Doom leads them outside and indicates a window.\n\n                               DOOM\n               ... then stood out here waiting for his\n               prey.  After he cold-bloodedly\n               accomplished his task, he went home.\n               He was almost apprehended there by my\n               men.\n\n     Doom nods his head toward a group of sinister WEASLES (a la\n     Disney's \"Wind In The Willows\").  They're loitering by a\n     dogcatcher's wagon with \"Toontown Control\" on the side,\n     cleaning their fingernails with switchblades and polishing\n     Toon revolvers.\n         \n                               VALIANT\n               Men?  They look more like weasles to\n               me.\n\n                               DOOM\n               Yes, I find that weasles have a special\n               gift for the work.\n                      (turns back to\n                       Valiant)\n               The rabbit didn't contact you by any\n               chance, did he?\n\n                               VALIANT\n               Why would he contact me?  I just took\n               some lousy pictures.\n\n                               DOOM\n               So you wouldn't have any idea where he\n               might be?\n\n                               VALIANT\n               Have you tried Walla Walla?  Kokomo's\n               very nice this time of year.\n\n     Doom steps into Valiant's face.\n\n                               DOOM\n               I'm surprised you aren't more\n               cooperative, Mr. Valiant.  A human has\n               been murdered by a Toon.  Don't you\n               appreciate the magnitude of that?  My\n               goal as Judge of Toontown, has been to\n               rein in the insanity.  To bring a\n               semblance of law and order to a place\n               where no civilized person has ever been\n               able to step foot.\n               The only way to do that is to make the\n               Toons respect the law.\n\n     Suddenly a \"YA-HA-HOOEY\" interrupts his pontification, as a\n     scruffy little TOON GOPHER comes hurtling over the wall from\n     the Toontown side.  He's holding his blackened rear end...\n     apparently the result of a run-in with a stick of dynamite.\n     BONK!  The Gopher hits Doom in the back of the head, sending\n     them both sprawling.  The Gopher picks himself up and shakes\n     off the effects of the concusion.  When he sees who he's\n     knocked down, he panics.\n\n                               GOPHER\n                      (petrified)\n               Judge Doom!  Here, let me get that for\n               ya.\n\n     He whips a clothes brush out of his back pocket and furiously\n     tries to clean the Judge's cloak.  Doom picks up the Gopher\n     by the scruff of the neck and gets to his feet.\n\n                               DOOM\n               Why, you filthy little vagrant, you've\n               soiled my robe!\n\n                               GOPHER\n               It's cleanin' up real good. Judge.\n\n                               DOOM\n               You've defiled a symbol of justice.\n\n     As Doom carries the Gopher to the \"Toontown Control\" wagon,\n     Valiant shoots a look to Santino.\n\n                               VALIANT\n                      (aside)\n               Where'd this gargoyle come from anyway?\n\n                               LT. SANTINO\n               No one knows.  He bought the election\n               a few years back.  He's been rulin'\n               Toontown ever since.\n\n     When Doom gets to the wagon, the Weasles open up the back.\n     In place of steel bars is a stream of fluid.  A Weasle turns\n     a key and the flow of liquid stops.  The Gopher starts\n     kicking furiously, trying to avoid the lock-up.\n\n                                       GOPHER\n                Oh, no, Judge, please, please, lemme\n                go.  I think I hear my mother callin'\n                me.\n\n     Finally, the Gopher breaks free and makes a desperate dash\n     for the wall.  Doom watches him run and calmly turns to where\n     his car is parked.  It's a black Lincoln touring car with an\n     ugly bird-like hood ornament.\n\n                               DOOM\n               Voltaire... the Gopher!\n\n     Suddenly. the hood ornament SQUAWKS to life.  It's a hideous\n     TOON VULTURE.  The Vulture flaps into flight.\n\n     Just as the Gopher is about to make it over the top of the\n     wall the Vulture's talons sink into his rear end and lift him\n     airborne.  The Vulture drops the Gopher off with the Weasles.\n     They pin him down.\n\n                               GOPHER\n               Hey, don't I have any rights?\n\n                               DOOM\n               Yes, you do... to a swift and speedy\n               trial.\n\n     One of the Weasles retrieves a briefcase from the sedan, puts\n     it on the hood and snaps it open.  Twelve TOON KANGAROOS pop\n     up, arranged in a jury box.\n\n                               DOOM\n                      (continuing)\n               Court is now in session.\n\n     He raps the Gopher on the head with the gavel end of his\n     cane.\n\n                               DOOM\n                      (continuing)\n               The defendant is charged with vagrancy,\n               assault and resisting arrest.  How do\n               you find him?\n\n     The Kangaroo court delivers the verdict instantly. Twelve\n     LITTLE KANGAROOS pop up out of their Momma's pouches, holding\n     up small cards, each with a letter spelling Y-O-U A-R-E\n     G-U-I-L-T-Y.\n\n                               DOOM\n                      (continuing)\n               Guilty as charged.  Case closed!\n\n     Doom slams the briefcase shut.  He turns his attention back\n     to the Gopher.\n\n                               DOOM\n                      (continuing)\n               I hereby sentence you to the dip!\n\n                               GOPHER\n               Oh no, not the dip!  Anything but the\n               dip!  I'm too young to die...\n\n     As the Judge pulls on a black rubber glove, the Weasles take\n     out a stainless steel tub WHEEZING with sadistic glee.  They\n     fill it from a spigot on the truck.\n\n                               VALIANT\n               What's with the dip?\n\n                               LT. SANTINO\n               That's how he gets rid of the\n               troublemakers.  It's a combination of\n               acetone, turpentine and paint remover.\n               He calls it the...  Final Solution.\n\n\n     THE GOPHER\n\n     is wriggling and SCREAMING bloody murder as Doom lifts him up\n     and holds him over the tub.  Then, as he's lowered into the\n     solution, he starts to disappear. His pathetic SCREAMS are\n     snuffed MID-YELP.\n\n                               GOPHER\n               Help!  Help!  He...\n\n     The Gopher's gone.  All that's left of him is a paint slick\n     on the surface of the liquid.\n\n                               VALIANT\n               Jesus.\n\n     Doom pulls off the black rubber gloves finger by finger and\n     hands them to a Weasle.  He turns to Valiant.\n\n                               DOOM\n                They're not kid gloves, Mr. Valiant.\n                but that's how we handle things in\n                Toontown.  I would think you'd\n                appreciate that.\n\n     He gets into his car, he pauses and looks back at Valiant.\n\n                               DOOM\n                      (continuing)\n               After all, didn't a Toon kill your\n               brother?\n\n\n     INT. TERMINAL BAR - DAY\n\n     Dolores is behind the bar cutting lemon peels and preparing\n     for the day's bartending.  There's one early customer, a\n     grey-haired TROLLEYMAN in his Red Car uniform.  His hat's on\n     the stool next to him and he's already drunk.  The door\n     opens.  It's Valiant.  He walks over to the bar, reaches for\n     a bottle and a shot glass and helps himself.  Dolores picks\n     up a copy of the morning paper.\n\n                               DOLORES\n               Hey, Eddie, looks like you really\n               stepped in it this time.\n\n                               VALIANT\n               What are you complaining about?  Here's\n               your fifty bucks.\n\n     Valiant slides the check across the bar.\n\n                               TROLLEYMAN\n                      (mumbling to\n                       himself)\n               Thirty-five years and all I got to show\n               for it is a ticket punch.\n\n                               VALIANT\n               What's with Earl?\n\n                               DOLORES\n               A new outfit bought the Red Car.  Some\n               big company called Cloverleaf\n               Industries.\n\n                               VALIANT\n               No kiddin'?  Bought the Red Cars, huh?\n\n                               DOLORES\n               Bastards put him on notice.\n\n     Valiant picks up his glass. lifts it in toast to the\n     Trolleyman.\n\n                               VALIANT\n               Here's to the pencil pushers.  May they\n               all get lead poisoning.\n\n     Now the Trolleyman unsteadily climbs up on his stool to get\n     close to the Holy Grail... the Red Car route map over the\n     bar.\n\n                               TROLLEYMAN\n                      (wistfully)\n               The old Number Six Line... who'da\n               thought they'd close that one down?\n\n                               DOLORES\n               Eddie, get him down from there.  He's\n               gonna break his neck.\n\n     Eddie grabs Earl around the legs and throws him over his\n     shoulder like a sack of potatoes.  He carries him over to a\n     booth and puts him down carefully, covering him with a\n     tablecloth.\n\n                               TROLLEYMAN\n               Took you right to Toontown, it did.\n\n                               VALIANT\n               I know, I know... poor S.O.B.\n\n     Valiant walks back to his drink at the bar.\n\n                               DOLORES\n               Do you think the rabbit did it?\n\n                               VALIANT\n               I don't wanna think.  I wanna drink.\n\n                               VOICE (O.S.)\n               Make that a round.\n\n     Valiant and Dolores look down the bar, but there's no one\n     there.  Finally the familiar cowlick of Baby Herman rises to\n     the top of the bar as he clambers up a barstool.\n\n                               DOLORES\n               We don't serve formula. Snookums.\n\n                               BABY HERMAN\n               You serve martinis, doncha?\n\n                               DOLORES\n               Yeah...\n\n    Baby Herman slides his baby bottle down the bar to Dolores.\n\n                               BABY HERMAN\n               Make it dry.  Baby doesn't like to be\n               wet.\n                      (to Valiant)\n               You're Valiant, right?  The name's Baby\n               Herman.\n\n                               VALIANT\n               I know who you are.  Kinda out of your\n               neighborhood, aren't you?\n\n                               BABY HERMAN\n               Yeah, I had to go slummin'.  See, a\n               friend of mine's bein' framed.\n\n                               VALIANT\n               You mean the rabbit?  They got him\n               cold.\n\n                               BABY HERMAN\n               You don't believe that.  I mean. the\n               guy's an idiot, a moron, a complete\n               fool...  but he'd never kill anyone.\n               I know the guy.\n\n     Dolores brings Baby Herman his baby bottle cocktail.\n\n                               BABY HERMAN\n                      (continuing)\n               Thanks, doll.\n\n     When Dolores turns around, Baby Herman pats her on the\n     bottom.\n\n                               DOLORES\n                      (over her\n                       shoulder)\n               Oh, a ladies man, huh?\n\n                               BABY HERMAN\n                      (sotto voce; to\n                       Valiant)\n               My problem is I got a fifty-year-old\n               lust and a three-year-old dinkie.\n\n                               VALIANT\n               My problem is I come here to drink in\n               peace.  So if you don't mind...\n\n                               BABY HERMAN\n               C'mon, Valiant, doesn't this whole\n               thing smell a bit funny to you?  I\n               mean, no offense, but how did a\n               mucky-muck like R.K. Maroon find you in\n               the first place?\n\n                               DOLORES\n                      (chiming in)\n               Yeah, Eddie, it's not like you got an\n               ad in the Yellow Pages.\n\n                               VALIANT\n               Thanks for the vote of confidence.\n\n                               BABY HERMAN\n               And another thing, the paper said no\n               will was found.  But every Toon knows\n               Acme had a will and, in it he promised\n               to leave Toontown to the Toons.\n\n                               VALIANT\n               So where is it then?\n\n                               BABY HERMAN\n               Somebody took it from him.  That's what\n               this whole thing's about.\n\n                               DOLORES\n               The papers said the safe door was\n               opened, Eddie.\n\n                               VALIANT\n               Stick to stuffin' the olives, willya,\n               Dolores?\n\n                               BABY HERMAN\n               My hunch is it was Maroon.  He always\n               was after Acme's property.\n\n                               VALIANT\n               Yeah?  Does he wear pants this color?\n\n     Valiant takes the paint chip out of his pocket and dangles it\n     in front of Baby Herman.\n\n                               BABY HERMAN\n               No.  But neither does Roger.  That's\n               Diablo Red.  Roger's pants are Sunrise\n               Orange.\n\n                               DOLORES\n               Well, I'll be...\n\n                               BABY HERMAN\n               So what's your next move, Valiant?\n\n                               VALIANT\n               My next move?  That's easy.  I'm\n               gettin' up, and I'm walkin' out the\n               door, and I'm goin' home to bed.\n\n     Valiant stands.\n\n                               DOLORES\n               So you're not even gonna bother to find\n               out if the rabbit's gettin' framed?\n\n                               VALIANT\n               He's a Toon... who cares?\n\n     Baby Herman shakes his head sorrowfully.  As Valiant heads\n     for the door, Dolores whaps her towel down on the bar.\n\n                               DOLORES\n               Well, you used to care, Eddie.  And it\n               didn t matter if a client's skin was\n               black, white, or painted!\n\n     Valiant ignores her and walks out the door.\n\n\n     INT. VALIANT'S HOUSE - DAY\n\n     Eddie comes in the door with his coat over his shoulder.  He\n     tosses the jacket over the chair and walks to the Murphy bed.\n     He grabs the strap, and loosening his tie, walks away from\n     the wall, pulling the bed down.  What he doesn't see is...\n\n\n     ROGER RABBIT\n\n     asleep in the bed.\n\n\n     VALIANT\n\n     still with his back to Roger, sits down exhaustedly on the\n     bed and kicks off his shoes.  He lies back and pulls the\n     covers over him.  He closes his eyes, rolls over to get\n     comfortable.  Now he and Roger are nose-to-nose.  They both\n     open their eyes at the same time.  They freak.\n\n                               VALIANT\n                      (screams)\n               Aah!\n\n                               ROGER RABBIT\n                      (screams)\n               Aah!\n\n     They both jump out of the bed.\n\n                               VALIANT\n               What the hell are you doin'?\n\n                               ROGER RABBIT\n               I needed a place to hide.  I'm in\n               trouble, Eddie.\n\n                               VALIANT\n               So I hear.  Even talkin' to you could\n               get me a rap for aiding and abetting.\n\n                               ROGER RABBIT\n               Don't worry, Eddie, no one knows I'm\n               here.\n\n                               VALIANT\n               Oh, yeah?  Then how'd you find my\n               house?\n\n                               ROGER RABBIT\n               Well, I asked the newsboy on the\n               corner.  He didn't know.  Then I asked\n               a janitor, the fireman and finally the\n               green grocer down the way.  He was very\n               helpful.\n\n                               VALIANT\n               In other words, the whole goddamn world\n               knows you're here!  Out!  Get out!\n\n     Eddie tries to open the door, but Roger blocks it\n     spider-like, arms and legs extended.\n\n                               ROGER RABBIT\n               Please, Eddie, don't put me out.  I\n               didn't do it, I swear.\n\n     Valiant gives up trying to open the door and grabs Roger.  He\n     pulls and he pulls.  Finally Roger snaps off like a broken\n     rubber band.  The two of them go tumbling backward.  Valiant\n     makes a grab for Roger but he slips out of his grasp like\n     quicksilver.\n\n                               ROGER RABBIT\n                      (continuing)\n               Sure I wanted to win Jessy back, but\n               not that way.\n\n     Valiant lunges again.  Roger dodges.\n\n                               ROGER RABBIT\n                      (continuing)\n               After I left you, I went to see her at\n               the Ink & Paint Club.\n\n     Valiant picks himself up and tries to catch his breath.\n\n                               ROGER RABBIT\n                      (continuing)\n               She was on stage, so I found a piece of\n               paper and wrote her a love letter.\n\n     Roger pulls a piece of paper out of his pocket and starts\n     reading.\n\n                                ROGER RABBIT\n                       (continuing)\n               'Dear Jessy.  How do I love thee?  Let\n               me count the ways.  1-1000, 2-1000,\n               3-1000...\n\n     Valiant leaps for Roger and gets bim by the throat.  He rips\n     the paper out of Roger's hand and crumples it up and throws\n     it down.  He opens the door, throws Roger outside and quickly\n     slams the door shut.  He leans against it, breathing hard.\n     Suddenly, Roger comes through the mail slot like a limbo\n     dancer.  Valiant, too tired to chase him, just watches him.\n\n                               ROGER RABBIT\n                      (continuing)\n               Hey, that wasn't very nice.\n\n     He retrieves the love letter, straightens it and puts it back\n     in his pocket.\n\n                               ROGER RABBIT\n                      (continuing)\n               It took me almost an hour to compose\n               that.  But I decided not to leave it\n               anyway.  I'd read it in person, that\n               was my plan.\n\n     Valiant crosses to the kitchen area where the dark room is\n     still set up.  He opens the cabinet under the sink and comes\n     out with a bottle of Scotch.  He takes a shot glass and pours\n     himself one.\n\n                               VALIANT\n               Look, pal, if you're still here when I\n               finish this drink, I'm callin' the\n               police.\n\n                               ROGER RABBIT\n               Don't do that!  I'm innocent I tell ya.\n               The police'll just dip me.  They were\n               waitin' for me when I got home last\n               night.  I ran.\n\n                               VALIANT\n               If you're so innocent, why'd you run?\n\n                               ROGER RABBIT\n               Gee, Eddie, I'm a rabbit.  We always\n               run.\n\n     Valiant shoots the drink down and holds up the empty glass.\n         \n                               VALIANT\n               That's it.\n\n     He crosses to the phone on the counter.  He lifts the\n     receiver and starts to dial.\n\n                               ROGER RABBIT\n               Well, this is the moment of truth!  And\n               I've spoken the truth, but you won't\n               believe the truth.  So I guess the\n               truth is my goose is cooked, my hash is\n               slung. my fait is accompli.\n\n     As Valiant finishes dialing, he idly puts the empty shot\n     glass down on a photograph on the counter.\n\n                               ROGER RABBIT\n                      (continuing)\n               Won't anything change your mind?\n\n     Valiant turns from the pleading rabbit.  Now something he\n     sees on the counter gets his attention.\n\n\n     POV THROUGH SHOT GLASS\n\n     The shot glass is resting on one of the reject pictures of\n     Acme and Jessica.  The bottom of the glass is magnifying the\n     back of the exuberant Marvin Acme.  Sticking out of his back\n     pocket is a legal folder headed \"Last Will and Testament\".\n\n\n     CLOSE - VALIANT\n\n     He looks as if the truth has just hit him in the face.\n\n                               VALIANT\n               The goddamn will.\n\n                               VOICE\n                      (on phone)\n               L.A.P.D.?\n\n     Valiant slowly returns the phone to the cradle,\n\n                               ROGER RABBIT\n               You mean you believe me?\n\n     Now outside we HEAR TIRES SCREECHING to a stop.  Roger runs\n     to the window and pulls back the drapes.  His eyes bug out of\n     his head.\n\n                               ROGER RABBIT\n               It's Toon Control!\n\n     Valiant comes to the window and looks out, too.\n\n\n     VALIANT'S POV\n\n     The Toon Control wagon has stopped in front of the house.\n     The Weasles pile out.  One of them takes what looks like a\n     butterfly net out of the back.  Several others grab violin\n     cases.\n\n\n     EDDIE AND ROGER\n\n     Valiant jerks Roger back behind the curtain.\n\n                               VALIANT\n               Get away from that window.\n\n     Roger, elated, jumps into Valiant's arms.\n\n                               ROGER RABBIT\n               You're gonna help me?  How can I ever\n               thank you?\n\n     He plants a big wet Toon kiss on Valiant's lips.\n\n                               VALIANT\n               For starters... don't ever kiss me.\n\n\n     EXT. BUNGALOW\n\n     The Weasles are filing up the walk to the front door.  The\n     leader pounds on the front door.\n\n                               WEASLE\n               Police...\n\n\n     INT. BUNGALOW\n\n     Valiant puts Roger down.\n\n                               VALIANT\n               I'll talk to 'em.  Find a place to\n               hide.\n\n     Roger zips to the closet door and goes inside.\n\n                               VALIANT\n                      (continuing)\n               Not in there.  That's the first place\n               they'll look.\n\n     Valiant goes to the closet and opens the door.  REVEAL Roger\n     is now dressed in Eddie's trenchcoat and hat.  Playfully,\n     Roger snaps one of the handcuffs onto Eddie's wrist.  He's\n     got the Other attached to one of his wrists.\n\n                               ROGER RABBIT\n               Eddie Valiant... you're under arrest!\n               Just kidding...\n\n                               VALIANT\n               You idiot.  I lost the key for those\n               cuffs.\n\n     BOOM!  BOOM!  BOOM!  The KNOCKING is more impatient.  Valiant\n     looks to the door.\n\n                               WEASLE (O.S.)\n               Open up!\n\n\n     EXT. VALIANT'S DOOR\n\n     The Weasles open the violin cases and take out real tommy guns\n     and shoulder them in teams of two.  Suddenly they unleash a\n     torrent of MACHINE GUN FIRE, making the outline of a weasle\n     in the door with BULLETS.  The leader blows on the cut-out\n     and it falls in.  The Weasles file through one by one.\n\n\n     INT. APARTMENT\n\n     The Weasles don't bother to look around.  They all just start\n     BLASTING.  Bullets fly every which way.  The barrage destroys\n     Valiant's apartment in a matter of seconds.  When the\n     shooting stops and the smoke clears, the Weasles look around.\n     The head Weasle spots blood all over the kitchen floor.\n\n                                WEASLE #1\n               We got him.\n\n     But when he looks behind the counter, it's only a shattered\n     ketchup bottle.\n\n\n     EXT. REAR OF APARTMENT\n\n     Eddie and Roger, handcuffed together, are beating it down the\n     alley.  Roger, being a rabbit, is beating it a lot faster.\n     He's kicking up dust, his legs are blur.  Valiant stumbles\n     trying to keep up.  When they round the corner, Roger slams\n     on the brakes, Toon style.  Valiant goes skidding past him and\n     is jerked to a stop like a dog on a short leash.\n\n                               VALIANT\n               Hey!  What do you think you're doin'?\n\n                               ROGER RABBIT\n               Sorry, Eddie, I forgot you're not a\n               Toon.\n\n                               VALIANT\n               Don't ever forget that.\n\n\n     EXT. BUNGALOW - BACK WINDOW - THE WEASLES\n\n     come piling out the window.  They start sniffing the ground.\n     Suddenly one of them freezes on point, like a dog.  Another\n     blows a HUNTER'S HORN and they're off on the trail.\n\n\n     EXT. STREET - EDDIE AND ROGER\n\n     emerge from the alley.  They pause momentarily to\n     reconnoiter.  Eddie decides to go left, Roger right.  When\n     they get to the end of the cuffs, they snap back into a pile.\n     Valiant gets back to his feet and hauls Roger up angrily.\n\n                               VALIANT\n               This way, goof...\n\n     They start across the street.  But Roger goes on one side of\n     the Street sign, Eddie the other.  Roger coils around it like\n     a tether ball.  Valiant yanks Roger off the sign and they\n     duck across the street just as a trolley car passes.\n\n\n     THE WEASLES\n\n     come bloodhounding around the corner.  They search the street\n     for signs of the fugitive.  But when they get to the trolley\n     tracks, they stop, bewildered.\n\n                               WEASLE #1\n               Scent's cold.\n\n                               WEASLE #2\n               Pssst.\n\n     He points toward the trolley car pulling into the Terminal\n     Station.  They fall all over themselves scurrying over to the\n     trolley.  They surround it and jump aboard, tommy-gun at the\n     ready.\n\n\n     INT. RED CAR\n\n     The CONDUCTOR raises his hands like it was a hold-up.  A\n     couple PASSENGERS scream as the Weasles search the car.  But\n     no Roger or Eddie.  As quickly as they got on, they get off.\n\n\n     EXT. RED CAR\n\n     as it pulls away.  The Weasles look around perplexed.\n\n                               WEASLE #1\n               Funny... I could swear I smelled\n               rabbit.\n\n\n     ANGLE FROM ABOVE\n\n     Eddie and Roger are balanced on the trolley wire above the\n     Weasles' heads.  As the Weasles sniff around the barn, Eddie\n     and Roger ease along the wire, using the wall of the Terminal\n     Bar to lean on.\n\n\n     INT. TERMINAL BAR - KITCHEN\n\n     Dolores is preparing corned beef and cabbage.  The RADIO is\n     PLAYING \"MARES EAT OATS\".  A NEWSCASTER breaks into the\n     music.\n\n                               NEWSCASTER\n               News flash... Hollywood.  Citywide\n               Toonhunt for Roger Rabbit, suspect in\n               Acme slaying.  Police describe him as\n               short, cuddly...  and psychotic.\n\n     Dolores turns just as Roger's grinning face appears in the\n     window.\n\n                               DOLORES\n                      (startled)\n               Mother Mary...\n\n     Now Eddie's face comes into view.  He motions for her to open\n     the window.\n\n\n     OUTSIDE THE WINDOW\n\n     Roger and Eddie watch another trolley approach.  The contact\n     arm sparks its way along the wire as it rolls along towards\n     them.  Valiant watches as Dolores struggles to get the window\n     open.\n\n                               VALIANT\n               Hurry, hurry...\n\n     At the last second, the window opens.  Eddie jumps for the\n     sill, Roger dangling from the cuffs as the trolley passes.\n\n\n     INT. KITCHEN\n\n     Dolores helps pull Valiant through the window.  Then he drags\n     Roger inside.\n\n                               DOLORES\n               Jesus, Eddie, is this who I think it\n               is?\n\n                               VALIANT\n               Dolores, meet Roger Rabbit.\n\n     Roger bows at the waist, takes her hand and kisses it like\n     Charles Boyer\n\n                               ROGER RABBIT\n               Charmed, enchanted, pleasure's all\n               mined.\n\n                               DOLORES\n               Where'd you find him?\n\n                               VALIANT\n               The Toon Fairy left him under my\n               pillow.\n\n     Now Roger spots a plate of freshly shucked corn.\n\n                               ROGER RABBIT\n               May I?\n\n     Before she can answer, he grabs an ear, presses it to his\n     lips and applies the typewriter method to it.  When he gets\n     to the end of a row, we even HEAR the BING!\n\n                               DOLORES\n               He's a riot.\n\n                               VALIANT\n               Oh, yeah?  Well, you're not handcuffed\n               to him.\n                      (holds up\n                       cuffs)\n               Anybody in the back room?\n\n                               DOLORES\n               It's all yours.\n\n     We FOLLOW Dolores as she leads Valiant and Roger across the\n     hall.  She stops at a door, unlocks it, and leads them in.\n\n\n     INT. BACK ROOM\n\n     It's a tiny storage room/office with an institutional metal\n     desk, a cot, and assorted janitorial supplies stacked around.\n     Dolores shuts and locks the door behind her.  Valiant goes to\n     a metal locker and digs through some tools, coming out with a\n     hacksaw.  He sits on the cot and starts working on the cuffs.\n\n                               DOLORES\n               So you decided to help him after all?\n\n                               VALIANT\n               I oughta have my head examined.\n                      (to Roger)\n               Will you hold still?\n\n     Roger quiets like a child for a moment as Valiant saws\n     feverishly.  Then Roger slips his hand out of the cuff and\n     holds his side while Eddie keeps sawing.\n\n                               ROGER RABBIT\n               Does this help?\n\n                               VALIANT\n               Yeah, that's better.\n\n     Valiant saws a couple more strokes before the realization of\n     what Roger's done hits him.  His face darkens.  Roger sees\n     the look and sheepishly tries to recover by sticking his hand\n     back in the cuff.\n\n                               VALIANT\n               You mean to tell me you coulda taken\n               your hand outta that cuff at any time?\n\n                               ROGER RABBIT\n               Well, no, not any time.  Only when it\n               was funny.\n\n     Valiant looks at Roger like he's about to brain him.  Roger\n     pulls his hand free again, and cowers out of range.  Valiant\n     just rubs his forehead.\n\n                               VALIANT\n               Are you always this funny, or only on\n               days when you're wanted for murder?\n\n                               ROGER RABBIT\n               My philosophy is if you don't have a\n               sense of humor, you're better off dead.\n\n                               VALIANT\n               Yeah... well you just might get your\n               wish.\n\n                               DOLORES\n               Can you get him out of it, Eddie?\n\n                               VALIANT\n               If I can find whoever wanted to kill\n               Acme bad enough to get this.\n\n     Valiant throws the pattycake picture down on the table.\n     Dolores and Roger both examine it closely.\n\n                               DOLORES\n               Acme's will.\n\n                               ROGER RABBIT\n               So that's what this little drama is all\n               about.\n\n                               VALIANT\n               Yeah.  I think Maroon plays the part of\n               the sound mind, your wife the sound\n               body.\n\n                               ROGER RABBIT\n               I resent that innuendo!  My wife is\n               completely innocent.\n\n                               VALIANT\n               Your wife may be a lot of things, pal,\n               but innocent isn't one of them.\n\n                               DOLORES\n               So what's the scam, Eddie?\n\n                               VALIANT\n               Maybe Baby Herman was right.  Somebody\n               wants Acme's property.  Cack the old\n               man, pin it on Roger, and destroy the\n               will.\n\n                               ROGER RABBIT\n               The habeus corpus is thickening.\n\n                               VALIANT\n               Yeah.  Except they screwed up.  I don't\n               think they got the will.\n\n                               ROGER RABBIT\n               How do you know that?\n\n                               VALIANT\n               Well, Acme had the will in his pocket\n               that night at the club.  It was gone in\n               the morning when the cops found the\n               body.\n\n                               DOLORES\n               Maybe they just took it out of his\n               pocket.\n\n                               VALIANT\n               Then why'd they bother to crack the\n               safe?  You can drop a Mosler 90 from\n               Mount Baldy and it won't open.\n\n                               ROGER RABBIT\n               Well, Mr. Smarty-Pants Detective, your\n               logic is specious.  What prevented Mr.\n               Acme from putting the will back in the\n               safe before they killed him?\n\n                               VALIANT\n               Because he's not forty feet tall.  The\n               safe was up on the ceiling, remember?\n\n     Dolores whistles over his deductions.\n\n                               DOLORES\n               Eddie, you still got it.  Hey, tomorrow\n               maybe I'll go down to probate court and\n               see who's sniffin' around Acme's\n               estate?\n\n                               VALIANT\n               Yeah, do that.  I'm gonna go rattle\n               Maroon's cage.\n\n     Valiant finishes sawing the cuffs.  He stands and throws the\n     cuffs aside.  Valiant and Dolores go to the door.  Roger\n     follows them eagerly.\n\n                               ROGER RABBIT\n               What should I do?  Who should I see?\n               Where should I go?\n\n     Valiant turns.\n\n                               VALIANT\n               Nothin', no one, nowhere,\n\n     He slams the door.\n\n\n     INT. POLO LOUNGE - CLOSE - MAROON\n\n     He's in a booth in the middle of a business lunch.\n\n                               MAROON\n               Maybe money grows on trees in Toontown,\n               but not at the Maroon Studio.\n\n     WIDEN THE SHOT to REVEAL that Maroon's sharing a booth with\n     BUGS BUNNY and his AGENT.  Bugs is chewing on a carrot.\n\n                               BUGS BUNNY\n               Look, Doc, fiduciary considerations\n               aside, Roger Rabbit may have been\n               willing to play second banana to an\n               ankle-biter, but I ain't.\n\n\n     ACROSS THE ROOM\n\n     A MAITRE D' is leading Valiant and Augie, the deaf-mute to a\n     table by the door.\n\n                               VALIANT\n               This'll be fine, huh, Augie?\n\n      Augie nods his head.  They sit and pick up the menus.  Augie\n      takes one peek and looks at Valiant, alarmed.  He scribbles a\n      note.  Valiant reads it.\n\n                               VALIANT\n               Forget about the prices, pal.  If you\n               want the shrimp cocktail, you have a\n               shrimp cocktail.\n                      (puts menu\n                       down)\n               Excuse me, Augie, I've got a little\n               table-hopping to do.\n\n      Valiant gets up from the table and starts across the room.\n\n\n      AT MAROON'S BOOTH\n\n                               AGENT\n               I think you should know, R.K., we're in\n               negotiations for Bugs to star in his\n               own series at Warner Brothers.\n\n                               MAROON\n               Trying to scare up a bidding war\n               between me and Jack Warner, eh?  Well,\n               it won't work.  I'll call William\n               Morris and I'll have 'em put out a\n               rabbit call the likes of which this\n               town's never seen!\n\n                               BUGS BUNNY\n               It's your dime, Doc.\n\n                               MAROON\n               And stop callin' me Doc!\n\n                               BUGS BUNNY\n               Eh, sure, Doc.\n\n     Now Valiant arrives, pulls up a chair from next table and\n     sits down.\n\n                               VALIANT\n               Hi, Mr. Maroon.  Remember me?\n\n                               MAROON\n               Valiant?  What're you doin' here?\n\n                               VALIANT\n               I Just thought I'd drop by and show you\n               a photograph.\n\n                               MAROON\n               I've already seen your photographs.\n\n                               VALIANT\n               Yeah, but I enlarged this one.  Thought\n               you might be interested.\n\n     Valiant takes an enlargement of the pattycake shot and puts\n     it on the table in front of Maroon.  We can clearly see the\n     will sticking out of Acme's pocket.\n\n                               VALIANT\n               Anyway... enjoy your lunch.\n\n     Valiant stands and departs.  But his visit has done it's\n     trick.  Maroon looks l'ike he's seen a ghost.  We FOLLOW\n     Valiant across the room to his table where Augie is\n     blissfully attacking a shrimp cocktail.\n\n                               VALIANT\n               How is that, Augie, pretty good?\n\n     Augie nods enthusiastically.  Valiant keeps an eye on\n     Maroon's booth.  Now he nudges Augie as Maroon excuses\n     himself and goes into the phone booth just outside the door.\n     Augie puts his shrimp fork down and picks up his pencil.\n\n\n     AUGIE'S POV\n\n     We see Maroon talk on the phone MOS.  As his lips move,\n     Valiant supplies his words.\n\n                               VALIANT (V.O.)\n               It's me.  Valiant says there's a will.\n               I don't know what he's trying to\n               pull...\n\n\n     BACK TO SCENE\n\n     Valiant is reading of Augie's pad as Augie reads Maroon's\n     lips, and scribbles down what he says.\n\n                               VALIANT\n                      (reading)\n               Somebody's gonna have to take care of\n               him.\n\n     Augie looks up from his scribbling to exchange an eyebrow\n     raising glance with Valiant.  Then he turns back to Maroon\n     again.\n\n                               VALIANT\n                      (reading)\n               The old man had it at the club that\n               night.  That's right.  Yeah, I'm sure.\n               I'll be there.\n\n     Augie stops writing as Maroon hangs up the phone.\n\n                               VALIANT\n                      (continuing; to\n                       Augie)\n               Where?\n\n     Augie shrugs his shoulders.  Disappointed, Valiant lights a\n     cigarette.  Now Augie elbows him and gestures across at\n     Maroon, who's making another call.  Augie starts writing\n     again.\n\n                               VALIANT\n                      (continuing;\n                       reading)\n               Iris... cancel my appointments this\n               afternoon.  I'll be at Forest Lawn.\n\n     Maroon hangs up the phone and comes out of the phone booth.\n     He hustles out of the room.  Valiant stands.\n\n                               VALIANT\n               You did great, Augie.  Have another\n               shrimp cocktail.\n\n     Valiant drops a twenty on the table and pats Augie on the\n     back.\n\n\n     EXT. BEVERLY HILLS HOTEL\n\n     A CARHOP wheels a yellow Packard up in front.  Maroon climbs\n     in and ROARS off.  Valiant ENTERS THE FRAME.  He looks after\n     Maroon, then calmly starts walking down the driveway.\n\n\n     EXT. FOREST LAWN CEMETERY - RED CAR STOP - DAY\n\n     A Red Car pulls up.  Valiant climbs off.  He calmly crosses\n     the street and ducks behind the cemetery entranceway as\n     Maroon's Packard ROARS through.\n\n                               VALIANT\n                      (impressed)\n               Love that Red Car.\n\n     As Valiant starts to walk up the hill...\n\n                                              CUT TO:\n\n\n     THE ACME FUNERAL SITE - LONG SHOT - DAY\n\n     A hearse, and a line of black limos are parked in the lane.\n     Nearby, Marvin Acme's funeral is in progress.  Clustered\n     around a gravesite are the mourners... TOONS of every stripe.\n     There's MICKEY MOUSE comforting MINNIE.  TOM AND JERRY.\n     HECKLE AND JECKLE.  CHIP 'N DALE.  Everyone from the famous\n     to the not so famous is in attendance.  The eulogy is being\n     delivered in a familiar blustery Southern VOICE.  It's\n     FOGHORN LEGHORN.\n\n                               FOGHORN LEGHORN\n               Today we commit the body of brother\n               Acme to the cold, I say cold, cold\n               ground.  We shed no tears for we know\n               that Marvin is going to a better place.\n               That high, high, I say that\n               high-larious place up in the sky.\n\n     Foghorn Leghorn dramatically points skyward.\n\n                               TOONS\n                      (in unison)\n               A-men!\n\n\n     NEW ANGLE - VALIANT\n\n     is leaning up against a palm tree on the hill.  We have been\n     watching the proceedings from his POV.  Now he sees Maroon's\n     car pull up.  He moves around to the other side of the tree\n     as Maroon passes and starts wending his way through the\n     crowd.\n\n\n     AT THE GRAVESITE\n\n     Foghorn Leghorn nods to the funeral DIRECTOR, a pasty-faced\n     human in a black mourning coat.  The Director starts to turn\n     the crank lowering the coffin into the grave.\n\n                               FOGHORN LEGHORN\n               Give us a sign, brother Herman, that\n               you've arrived...\n\n     Much to the funeral Director's amazement, the crank starts\n     PLINKING Out the tune to \"POP GOES THE WEASLE\".  Now the Toon\n     mourners pick up on it and join in.\n\n                               TOONS\n                      (singing)\n               Round and round the mullberry bush, The\n               monkey chased the weasle...\n\n     The crank and SONG start going FASTER AND FASTER.\n\n                               TOONS\n                      (continuing;\n                       singing)\n               The monkey raid it all was in fun.  POP!\n               Goes the weasle.\n\n     Suddenly half of the lid to Acme's coffin flies open and a\n     harlequin CLOWN BOI-YOI-YOINGS out.  The funeral Director\n     faints dead away as the Toon SOBS turn to LAUGHTER.  The\n     Toons turn and head away from the grave comforted by a\n     funeral befitting a gag king.  They climb into their cars and\n     SCREECH off like the start of the Indy 500.  One mourner is\n     left at the gravesite.  Sitting in a chair dabbing at her\n     eyes with a handkerchief is Jessica Rabbit.  Maroon walks up\n     behind her.\n\n                               MAROON\n               So... trying to pull a fast one on me,\n               huh?\n\n     Jessica turns, startled.  She stands and faces Maroon.\n\n\n     VALIANT\n\n     smiles and leans in.  This is the moment he's been waiting\n     for.  Now just as the conversation begins, it is drowned out\n     by the NOISE from a LAWN MOWER.  Valiant turns to see a\n     GARDENER riding around on a small tractor cutting the grass.\n     Valiant tries to flag him down as he watches Maroon and\n     Jessica having an arguement.  There's accusatory finger\n     pointing.  In pantomime, Maroon gestures into his pocket as\n     if describing the position of Acme's will.\n\n     Jessica tries to leave.  He grabs her arm.  They're screaming\n     at each other but we don't hear a word.  Valiant waves\n     frantically for the Gardener to cut the machine.  But the\n     Gardener misconstrues it as a friendly greeting and waves\n     back.  Valiant turns in time to see Jessica kick Maroon in\n     the groin and stomp off to a red Auburn Speedster.  She jumps\n     in and speeds away as Maroon staggers back to his car.  The\n     Gardener stops the tractor next to Valiant.  He SHUTS OFF THE\n     ENGINE.  The cemetery is completely still again.\n\n                               GARDENER\n               Somethin' you want, mister?\n\n                               VALIANT\n               Not anymore...\n\n\n     EXT. INK & PAINT CLUB - ALLEY - NIGHT\n\n     A Steinway piano truck is parked next to the stage door.  TWO\n     husky PIANO MOVERS are rolling a baby grand up the ramp to\n     the stage door.  They knock on the door.  The Gorilla opens\n     it and they muscle the piano inside.  After a moment, they\n     reemerge.  We FOLLOW them back to the truck where a second\n     baby grand stands ready to be moved.\n\n                               MOVER #1\n               I don't know about you, but it makes me\n               sick to think of these beautiful pianos\n               gettin' chopped into match sticks every\n               night by those screwy ducks.\n\n     Struggling, they push this second piano into the club.\n\n\n     INT. CLUB - BACKSTAGE\n\n     They roll the piano over to the wall and park it next to the\n     first.\n\n                               MOVER #2\n                      (shakes head)\n               And they call it entertainment.\n\n     As they go out the stage door, MOVE IN on the baby grand.\n\n\n     INSIDE THE PIANO - VALIANT\n\n     is lying prone -- using the Steinway as his own Trojan Horse.\n     He lifts the piano lid to climb out, but then HEARS FOOTSTEPS\n     approaching.  He lowers the lid again.  Now someone starts\n     testing the keys.  We see the hammers strike the strings,\n     RUNNING UP THE SCALES until they reach the one under\n     Valiant's nose.  The hammer whacks Valiant's nose on the\n     backswing and strikes the string making a terrible SOUR NOTE.\n\n                               DONALD DUCK (V.O.)\n                      (exasperated\n                       QUACK)\n               Phooey!  Out of tune again!\n\n                               DAFFY DUCK (V.O.)\n               Not to worry, Donald.  We can fix that\n               with my sledgehammer.\n\n                               DONALD DUCK (V.O.)\n               Never mind, Daffy.  I've got an axe in\n               my dressing room.\n\n     Valiant's eyes widen.\n\n\n     ANGLE ON PIANO\n\n     as the VOICES of Daffy and Donald recede, Valiant raises the\n     lid and quickly climbs out.  He eases over to Jessica's\n     dressing room.  As he starts to open the door, he HEARS\n     SCUFFLING from inside.  Valiant puts his ear to the door.\n     More SCUFFLING.  Valiant straightens, then suddenly whips the\n     door open and flicks on the light.\n\n\n     INT. DRESSING ROOM\n\n     Nobody's there.  Perplexed, Valiant closes the door behind\n     him and checks behind the dressing screen.  In the closet.\n     No one.  He shrugs and starts to search the room.  He goes to\n     Jessica's dressing table and rifles the drawers.  In her\n     purse he discovers a Toon revolver.  He examines it.\n\n                               VALIANT\n               Girl's gotta protect herself.\n\n     Valiant puts the gun back in the purse and closes the drawer.\n     As he stands, he pauses to consider a Hurrel-like\n     black-and-white photo of Roger Rabbit in a silver deco frame.\n     He's dramatically posed with a cigarette like he was Tyrone\n     Power.\n\n     Valiant shakes his head and turns from the table.  Something\n     catches his eye.\n\n\n     ANGLE ON FLOOR\n\n     Behind the dressing table, the corner of a piece of blue\n     paper peeks out.  Valiant stoops down and fishes it out.\n     It's a cover for a legal document -- \"Last Will and Testament\n     -- Marvin Acme\".\n\n\n     VALIANT\n\n     stands, pleased.  He opens the blue folder.  But it's empty.\n     Valiant puts it in his inside pocket and turns to go when\n     suddenly an unseen hand flicks the lights off.\n\n                               VALIANT\n               Son of a bitch...\n\n     We can't see anything in the darkness.  But we hear the SOUND\n     of A FISTFIGHT.  There's the CRASHING of lamps and furniture\n     breaking.  Now the door opens for a second as the assailant\n     escapes.  Light floods in the room, illuminating Valiant on\n     the floor with a curtain wrapped around his head.  As he\n     struggles free the door closes.  The room is dark again.\n     Valiant scrambles to the door.  When he whips it open, REVEAL\n     the Gorilla framed in the doorway.  Valiant is frozen.  The\n     Gorilla flicks on the light.  He smiles wickedly.\n\n                               GORILLA\n               And here I tought we had mice.\n\n     Valiant tries to make a break for it.  WHAM!  The Gorilla\n     lays him out cold with a right cross.\n\n                                              BLACKOUT.\n\n\n     FADE IN:\n\n     VALIANT'S POV FROM FLOOR\n\n     As his vision comes INTO FOCUS, Valiant sees the Gorilla,\n     Jessica Rabbit, the Weasles and Judge Doom are standing over\n     him.\n\n                               GORILLA\n               ... I caught him rummagin' around in\n               here.  Then I called you, Judge, on a\n               counta you be da one we pay juice to.\n\n                               DOOM\n                      (clears throat)\n               You did the right thing, Bongo.\n\n\n     THE WEASLES\n\n     pull a groggy Valiant upright and plop him in a chair in\n     front of Doom.\n\n                               DOOM\n               Being caught breaking and entering is\n               not very good advertising for a\n               detective.  What were you looking for,\n               Mr. Valiant?\n\n                               VALIANT\n               Ask her...\n\n     Valiant nods toward Jessica, who stands coolly smoking a\n     cigarette.\n\n                               JESSICA RABBIT\n               Last week some heavy breather wanted\n               one of my nylons as a souvenir.  Maybe\n               that's what he was after?\n\n                               VALIANT\n               Look, doll, if I wanted underwear, I\n               woulda broken into Frederick's of\n               Hollywood.  I was lookin' for Marvin\n               Acme's will.\n\n                               DOOM\n               Marvin Acme had no will.  I should\n               know, the probate is in my court.\n\n                               VALIANT\n               He had a will, all right.  She took it\n               off Acme the night she and R.K. Maroon\n               knocked him off.  Then she set up her\n               loving husband to take the fall.\n\n                               JESSICA RABBIT\n               You, Mr. Valiant, are either drunk or\n               punch drunk.  Probably both.\n\n                               DOOM\n               These are bold accusations, Mr.\n               Valiant.  I hope you have some proof?\n\n                               VALIANT\n               I found the cover the will came in\n               behind the dressing table.\n\n     Valiant reaches into his pocket.  But the blue envelope is\n     gone.\n\n                               VALIANT\n                      (continuing)\n               They must've taken it off me.\n\n                               DOOM\n               They?\n\n                               VALIANT\n               The other people who were in here\n               lookin' for the will.  I woulda caught\n               'em if Cheetah here hadn't interrupted\n               me.\n\n     The Gorilla makes a move for Valiant.  Doom stops him.\n\n                               DOOM\n               Take it easy, Bongo.  We'll handle Mr.\n               Valiant our own way... downtown.\n\n                               VALIANT\n               Downtown?  Fine.  Get a hold of\n               Santino, I'd be more than glad to talk\n               to him.\n\n                               DOOM\n               Oh, not that downtown.  Toontown.\n\n     The mention of Toontown has a visible impact on Valiant.\n\n                               VALIANT\n                      (nervous)\n               You're not takin' me to downtown\n               Toontown?\n\n                               DOOM\n               Indeed we are.  We'll continue the\n               interrogation there.\n\n                               VALIANT\n                      (very agitated)\n               I ain't tellin' you nothin'!  Get me\n               Santino.\n\n                               DOOM\n               You're a very stubborn man, Mr.\n               Valiant.  Very pig-headed.  Boys, show\n               Mr. Valiant how we handle pig-headed\n               men at the Toontown station...\n\n     As the Weasles drag Valiant out of the room...\n\n                               VALIANT\n                      (screaming)\n               No... you bastards!  Leggo of me!\n\n\n     EXT. STREET - NIGHT\n\n     The Toon Control Wagon streaks along with the cat SIREN\n     WAILING.  It flashes by then slams on the brakes at the\n     entrance to an eerie tunnel.  A sign next to the tunnel says:\n     \"Toontown\".\n\n\n     INT. WAGON\n\n     The Weasles look over at the bound and gagged Valiant.  One\n     of them turns Valiant's head to look at the Toontown sign.\n\n                               WEASLE #1\n               What're you shakin' for?  Didn't you\n               have a good time last time you were\n               here?\n\n     With a wicked WHEEZE, the driver floors it.\n\n\n     EXT. TUNNEL\n\n     The wagon disappears into the murky darkness.  PAN UP to the\n     night sky.\n\n                                              DISSOLVE TO:\n\n\n     THE SKY - MORNING\n\n     PAN DOWN to the tunnel.  We can't see into the darkness but\n     we HEAR HOOTING and HOLLERING from within.  GUNS going off,\n     FIRECRACKERS EXPLODING, WHIPS CRACKING, all accompanied by\n     the WHEEZING LAUGHTER of the Weasles.\n\n                               WEASLE #1 (O.S.)\n               Soo-eey!  Soo-eey!\n\n                               WEASLE #2 (O.S.)\n               Let him go, boys.  I think he's got the\n               message.\n\n     After a beat, Valiant comes staggering out of the tunnel.\n     He's got a burlap sack over his head tied around his waist.\n     Behind him, the Weasles emerge holding paint cans and\n     brushes.  They watch as he trips and falls by the side of the\n     road.  The Weasles GIGGLE victoriously and head back inside.\n     Valiant lies there for a moment, catching his breath.  Then\n     he struggles to free his hands.  Finally he rips the sack off\n     his head and sits up.\n\n\n     CLOSE - VALIANT\n\n     We see he's got a huge Toon pig with a goofy grin painted\n     over his head.  Valiant pulls and tugs on it, but this is a\n     costume that won't come off.  Valiant curses, gets to his\n     feet and stumbles down the road.\n\n\n     EXT. RED CAR STOP\n\n     Valiant gets in the back of the line of PASSENGERS boarding\n     the Red Car.\n\n\n     INT. RED CAR - VALIANT\n\n     steps aboard.  The Trolleyman, who we recognize as Earl from\n     the Terminal bar, does a double-take when he sees the\n     ridiculously silly looking man/Toon.\n\n                               EARL\n               Here's one for the books... a Toon\n               wearin' human clothes.\n\n                               VALIANT\n               Earl... it's me, Valiant.\n\n                               EARL\n               Eddie?  Jesus, what happened?\n\n                               VALIANT\n               Toon cops worked me over.\n\n                               EARL\n               Boy, I'll say.  They gave you a real\n               Toon-a-Roo.\n\n                               VALIANT\n                      (apprehensively)\n               What am I, Earl?\n\n     Earl breaks the news to Valiant soberly.\n\n                               EARL\n               You're a pig... a happy-go-lucky pig.\n\n                               VALIANT\n               No...\n\n                               EARL\n               Does it hurt?\n\n                               VALIANT\n               Not much.  It's hard to talk.\n\n                               EARL\n               Uh, Eddie, do me a favor.  Could you\n               sit in the back so you won't cause as\n               much of a commotion.\n\n     Valiant tries to pull the brim of his hat down.  But it's\n     comically small on the huge head.  He makes his way down the\n     aisle past a veritable gauntlet of RAZZING, poking, tripping\n     PASSENGERS.  Finally he finds an empty seat in the back as\n     the Red Car starts up.\n\n\n     A LITTLE KID\n\n     wearing a baseball cap is sitting a few seats away with his\n     MOTHER.  The Kid looks back at Eddie and laughs.  He leans\n     over and whispers something to his Mom.\n\n                               KID\n               Can I, Mom?\n\n                               MOMMY\n               Go ahead, darling.  Take your bat.\n\n     The Kid takes his baseball bat and approaches Valiant\n     innocently.\n\n                               KID\n               Hi, Mr. Pig.  If I hit you on the head,\n               will you make me a cuckoo bird?\n\n     The Kid starts to take a swing with the bat.\n\n                               VALIANT\n               Kid, if you hit me on the head, I'm\n               gonna throw you out this window.\n\n     The Kid's eyes widen in terror.  This is not a typical Toon\n     response.\n\n                               KID\n                      (crying)\n                Mommy!\n\n\n     INT. VALIANT'S APARTMENT - BATHROOM - DAY\n\n     We hear the SOUND of the SHOWER.  Valiant's hand reaches out\n     past the shower curtain and grabs for a bottle.  But it's not\n     shampoo.  It's turpentine.\n\n                               VALIANT (O.S.)\n               Dammit!\n\n     CLOSE - TUB DRAIN\n\n     The water swirling down the drain is tinged with paint of\n     different colors.\n\n\n     CLOSE - VALIANT\n\n     He scrubs manically until the last of the pig head is gone.\n     He rinses off and he feels around his face.  The absence of\n     the Toon mask seems to bring him some relief.  He shuts off\n     the shower and slides the shower curtain back.\n\n\n     VALIANT'S POV - JESSICA RABBIT\n\n     is leaning up against the doorjamb, dressed as usual, in a\n     black cocktail dress with elbow length gloves and pearls.\n\n                               JESSICA RABBIT\n               Hello, Mr. Valiant.  I rang the\n               doorbell, but I guess you couldn't hear\n               it.\n\n                               VALIANT\n               That's because I don't have a doorbell.\n\n     Jessica, caught in her lie, flutters her eyelids nervously.\n\n                               JESSICA RABBIT\n               Oh... well, I... I just had to see you.\n\n                               VALIANT\n               Okay, you've seen me.  Now give me a\n               towel.\n\n     As she hands him a towel, she stares down at his anatomy.\n\n                               JESSICA RABBIT\n               What's that thing?\n\n     Valiant looks down at what she's referring to.\n\n                               VALIANT\n               Come on, lady, haven't you ever seen a\n               mole before?\n\n                               JESSICA RABBIT\n               Toons aren't given imperfections.\n\n                               VALIANT\n               No?  I guess we're not counting lying,\n               stealing and murder.\n\n                               JESSICA RABBIT\n               You've got the wrong idea about me.\n               I'a a pawn in this just like poor\n               Roger.  Can you help me find him?  I'll\n               pay you anything.\n\n                               VALIANT\n               Yeah, I'll bet you would.  You gotta\n               have the rabbit to make the scam work.\n\n                               JESSICA RABBIT\n               No, no, no... I love my husband.\n\n                               VALIANT\n               Oh, sure.  I can just feature you\n               standin' outside your little hutch,\n               holdin' a carrot cake waitin' for hubby\n               to come home.\n\n                               JESSICA RABBIT\n               Oh, please don't make fun of me, Mr,\n               Valiant.  You don't know how hard it is\n               being a woman looking the way I do.\n\n                               VALIANT\n               Yeah, well, you don't know how hard it\n               is bein' a man looking at a woman\n               looking the way you do.\n\n                               JESSICA RABBIT\n               I'm not bad, I'm just drawn that way.\n\n                               VALIANT\n               I'm not complainin'.  But give me\n               credit.  I'm the guy who took the\n               pictures of you and Acme playin'\n               pattycake, remember?\n\n     Jessica takes a cigarette out of her purse.  She lights it\n     and blows a cloud of Toon smoke.  It forms a recreation of\n     what she describes.\n\n                               JESSICA RABBIT\n               Maroon came to me.  He told me he'd\n               fire Roger if I didn't do it.  I went\n               along with him for Roger's sake.  It\n               was only pattycake, after all.\n\n     Valiant waves at the smoke scene, dispelling it.\n\n                               VALIANT\n               So altruistic.\n\n                               JESSICA RABBIT\n               It's the truth.  Why won't you believe\n               it?\n\n                               VALIANT\n               Cause I don't take Acme Dumb Pills.  I\n               don't know what you're up to, lady, but\n               I'm gonna nail you for the Acme murder.\n\n                               JESSICA RABBIT\n               If I'm as bad as you think, what's\n               stopping me from just killing you right\n               now?\n\n     Valiant reaches behind him and picks up a small cup on the\n     sink.\n\n                               VALIANT\n               This cup of turpentine right here.  Go\n               for that gun in your purse and I'm\n               gonna let you have it.\n\n     Jessica breaks down and starts sobbing.\n\n                               JESSICA RABBIT\n               Oh, Mr, Valiant, please... you're my\n               only hope.\n\n     She comes to Eddie and hugs him, burying her head in his\n     shoulder.\n\n                                JESSICA RABBIT\n               I'm weak... you're strong.  Can't you\n               find a place somewhere in your heart to\n               help me?\n\n     Valiant looks down at the luscious creature in his arms,\n     considering the request.  The moment is interrupted by the\n     CLEARING of a VOICE.\n\n                               DOLORES (O.C.)\n               Dabblin' in watercolors, Eddie?\n\n     Valiant, still in just a towel, sheepishly turns to face\n     Dolores, who's standing in the doorway.\n\n                               VALIANT\n               Dolores...\n\n     Dolores regards Jessica with undisguised contempt.\n\n                               DOLORES\n               Lemme guess... your cousin from Des\n               Moines?\n\n     Jessica straightens her dress.\n\n                               JESSICA RABBIT\n               Perhaps I should go.\n\n                               DOLORES\n               Must you?\n\n                               JESSICA RABBIT\n               Goodbye, Eddie... don't hate me.\n\n     Jessica blows Eddie a TOON KISS which flies across the room,\n     landing on Eddie's cheek.  She saunters past the smoldering\n     Dolores and out the door.  Dolores walks to Eddie and peels\n     the kiss off his cheek.  She crumples it up and throws it\n     down in the wastebasket.\n\n                               DOLORES\n               What was that?\n\n                               VALIANT\n               That was the rabbit's wife.\n\n                               DOLORES\n               The rabbit's wife?  Wanna tell me what\n               she was doin' with her arms around you?\n\n                               VALIANT\n               Probably lookin' for a good place to\n               stick a knife.\n\n                               DOLORES\n               I just stopped by to tell you that I\n               checked out the Acme probate.\n\n                               VALIANT\n               Maroon, right?\n\n                               DOLORES\n               Nope.  It's that Cloverleaf outfit\n               again.\n\n                               VALIANT\n                      (startled)\n               What the hell would they want with a\n               gag factory?\n\n                               DOLORES\n               Got me.  But unless the will shows up\n               by Friday midnight, it's theirs.\n\n     As Valiant considers this new development, he cocks an ear.\n     In the distance, we HEAR FAINT SINGING.\n\n                               VALIANT\n               What's that comin' from the bar?\n\n                               DOLORES\n                      (listens)\n               Sounds like singin'.\n\n                               VALIANT\n               Oh, no...\n\n     As Valiant grabs his pants...\n\n                                              CUT TO:\n\n\n     INT. TERMINAL BAR - DAY\n\n     Roger's out all right.  In fact, he's using the bar as a\n     stage for a song and dance number.  The tune is extremely\n     familiar.  In fact, it's the one that opens every Warner\n     Brothers cartoon...  The Looney Tune Anthem.  But we've never\n     heard words to go with it.\n\n                               ROGER RAB3IT\n               'The merry-go-round broke down\n               But you don't see me frown...'\n\n     Roger grabs Augie's pad and pencil, scribbles some drawings\n     lightning fast.\n\n                               ROGER RABBIT\n                      (continuing)\n               'Things turned out fine\n               And now she's mine...'\n\n     Roger flips through the pad which in crude animation, shows\n     the story of Roger and Jessica getting back together,\n     culminating in them kissing in a heart.  Augie's delighted.\n\n                               ROGER RABBIT\n                      (continuing)\n               '... Cause the merry-go-round\n               Went round...\n               Hoo-hoo, Hoo-hoo...'\n\n     Roger does backflips and acts like an escapee from the acute\n     ward.\n\n\n     THE DOOR OPENS\n\n     Eddie and Dolores enter.  Valiant stops in his tracks at the\n     sight of Roger's performance... and the smiles on the faces\n     of the sourpusses.\n\n\n     CLOSE - ROGER\n\n     doesn't see Eddie.  He moves into the next verse.  He twirls\n     around on the post.\n\n                               ROGER RABBIT\n               'My name is Roger Rabbit\n               I've got a crazy habit\n               I like to sing and dance and yuk...'\n\n     Roger goes to Angelo, lifts off his cap, and whacks his\n     toupee, making it spin like a top.\n\n                               ROGER RABBIT\n                      (continuing)\n               '... So brighten up and smile\n               You schmuck'.\n\n     All the regulars in the bar have a good laugh at that one.\n     Now as Roger twirls around on the post, he smashes into a bar\n     tray held by Eddie.  Valiant carries him toward the back\n     room, but the irrepressable entertainer gets on his knees Al\n     Jolson style and blows kisses to his audience.  The regulars\n     are HOWLING as Roger is carried out.\n\n\n     INT. BACK ROOM\n\n     Valiant flings Roger into the room and slams the door behind\n     him.\n\n                               ROGER RABBIT\n               Hey, don't I get an encore?\n\n                               VALIANT\n               Why, you crazy Toon... I've been out\n               there riskin' my neck for you.   I come\n               back here and you're singin' and\n               dancin'.\n\n                               ROGER RABBIT\n               But that's my calling, my purpose, my\n               raison d'etre.  Toons are supposed to\n               make people laugh... and believe me,\n               those people needed a laugh.\n\n                               VALIANT\n               And when they're done laughin' , they're\n               gonna call the cops.  That guy Angelo\n               would rat on you for a nickel!\n\n                               ROGER RABBIT\n               Angelo?  He's a pal, a chum...\n\n                               VALIANT\n               An arsonist and a kidnapper.  He\n               just got outta prison.\n\n                               ROGER RABBIT\n               Well... I still don't think he'd turn\n               me in.\n\n                               VALIANT\n               Just because you got 'em to laugh?\n\n                               ROGER RABBIT\n               A laugh can be a powerful thing, Eddie.\n               Sometimes it's the only weapon we have\n               in life.\n\n                               VALIANT\n               I think I prefer the Smith and Wesson\n               variety.\n\n                               ROGER RABBIT\n               I've met some cynical and miserable\n               humans in my time.  But you, Edward\n               Valiant, are positively funereal!\n\n                               VALIANT\n               Well, right now it's gonna be your\n               funereal.\n\n     Valiant takes his fist back to belt Roger.  Roger stands\n     stoicly, jaw thrust forward, eyes closed.\n\n                               ROGER RABBIT\n               Go ahead and throw that punch.\n                      (opens one eye)\n               But you'd be more successful with a\n               punch line.\n\n     Valiant drops his fist and rubs his temples with frustration.\n\n                               VALIANT\n               You're driving me crazy, you know that?\n               Let's go... you ruined this as a hiding\n               place.\n\n     Valiant grabs Roger by the scruff of the neck and opens the\n     door.  But he ducks back in quickly.\n\n\n     VALIANT'S POW - THROUGH DOOR - JUDGE DOOM\n\n     has entered the bar.  He stands FRAMED in the doorway,\n     Voltaire perched on his shoulder.  The red light of the neon\n     sign flashes on his glasses making him look like he's got\n     burning coals for eyes.  With the Weasles at the door backing\n     him up, the satanic Doom walks to the bar, his FOOTSTEPS\n     CREAKING along the wooden floor.  He surveys the scene, leans\n     over the bar for a glass.  Doom holds the glass up to the\n     light and looks at it disgustedly.  He picks up a bottle of\n     scotch and carries it down to where the one-armed Soldier is\n     sitting.  Doom stares at him, then pulls the empty sleeve out\n     of the amputee's pocket.  He uses it to wipe the inside of\n     the glass.\n\n                               DOOM\n               I'm looking for a rabbit.  He was last\n               seen in this neighborhood.\n\n     The barflies avoid Doom's stare and shoot covered glances to\n     one another.  But nobody says a word.  Doom pours a drink\n     into his newly cleaned glass... then gently pours it down\n     Voltaire's gullet.\n\n                               DOOM\n                      (continuing)\n               You couldn't miss him.  Buck teeth.\n               Orange pants.  About yea big.\n\n     Doom squashes the Midget's head down to approximate the size.\n\n                               DOLORES\n               There's no rabbit here, so don't harass\n               my customers.\n\n     Doom turns to Dolores.\n\n                               DOOM\n               I didn't come here to harass.  I came\n               here to reward.\n\n     Doom walks around Dolores toward the back.  But Doom stops\n     next to the blackboard.  On it is written:  \"Today's Special\n     - French Dip - $ .50\".  Doom erases the \"French\" and the\n     decimal point in front of the \"50\".  Then he picks up the\n     chalk and starts to write.  The CHALK SQUEAKS excruciatingly\n     on the blackboard.  Everyone winces but watches anyway, as\n     Doom writes \"Rabbit\" where the \"French\" was, and adds the\n     zeroes to the \"50\".  It now reads:  \"Rabbit Dip - $5000\".\n\n\n     AT THE BAR - ALL EYES\n\n     are fixed on the figure on the blackboard.  Angelo licks his\n     lips.\n\n                               ANGELO\n               Hey, I seen a rabbit...\n\n     Angelo looks defensively at all his cronies and back to Doom.\n\n                               ANGELO\n                      (continuing)\n               He's right here in the bar.\n\n     But instead of pointing to the back of the bar, he talks to\n     the empty barstool beside him.\n\n                               ANGELO\n                      (continuing)\n               Say 'ello, Harvey.\n\n     The tension is broken.  Everybody at the bar starts HOWLING.\n\n\n     INT. BACK ROOM\n\n     Roger turns to Eddie victoriously.\n\n                               ROGER RABBIT\n               My pal.\n\n\n     IN THE BAR\n\n     Doom stares down the regulars until the laughter stops.\n     Meanwhile, a Weasle has started sniffing around the bar where\n     Roger was dancing.  As Doom turns to leave, the Weasle\n     whispers in his ear as he points to the back.  Doom smiles\n     and pats the Weasle on the head.  He turns to Angelo and the\n     others.\n\n                                        DOOM\n                Now we'll see who laughs best...\n\n     The Weasle bloodhounds through the bar with Doom striding\n     after him.  We FOLLOW them to the door to the back room.\n     Doom rips the door open.\n\n\n     INT. BACK ROON\n\n     It's dark.  Doom flicks on the light.  REVEAL Valiant on the\n     cot, his pint bottle cradled in his arm.  He blinks as if\n     awakened from a drunken slumber.\n\n                               DOOM\n               Valiant?  Why is it that whenever my\n               men smell a rabbit, you're there?\n\n     Valiant plumps the pillow behind his head.\n\n                               VALIANT\n               Must be my cologne... Eau Dc Carrot.\n\n                               WEASLE #1\n                      (sniffs)\n               He's in here all right, boss.\n\n     Suddenly the Weasle grabs the pillow from under Valiant's\n     head and carves it to shreds with a switchblade.  Feathers\n     fly.  But no rabbit fur.\n\n                               WEASLE #2\n               Youse want we should take the place\n               apart?\n\n     The rest of the Weasles are arrayed behind Doom with Toon\n     crowbars, picks, and a jackhammer.\n\n                               DOOM\n               No, Sergeant.  That won't be necessary.\n\n     Doom walks over to the locker.\n\n                               DOOM\n                      (continuing)\n               I know a trick that no Toon can resist.\n\n     Doom raps on the locker with his knuckles.  Da-da-da-da-da...\n     It's a familiar pattern that demands a Da-da response.  Doom\n     moves to the desk and tries it again.  Da-da-da-da-da...\n\n\n     INSIDE A MAXWELL HOUSE COFFEE CAN\n\n     Roger is hiding while sweating out the urge to finish the\n     familiar coda.  We HEAR the RAPPING again, closer.\n     Da-da-da-da-da...  Roger's biting his nails.\n\n\n     DOOM\n\n     moves to the milk crate the coffee can is on.  Valiant gets\n     up off the cot.\n\n                               VALIANT\n               You know, Doom, I don't know who's\n               Toonier, you or the rabbit.\n\n     Doom just smiles and knocks the pattern out on the crate.\n\n                               DOOM\n               Shave... and... a haircut...\n\n     Roger bursts out of the can with the lid on his head.  He\n     responds con brio.\n\n                               ROGER RABBIT\n               Two... bits!\n                      (looks around)\n               Uh... oh...\n\n     PSSSHEW!  Roger flies out the door.\n\n\n     INT. THE BAR\n\n     He streaks across the bar and out the front door.   After a\n     beat, two Weasles step into the bar holding the butterfly net\n     they had stretched across the door.  They WHEEZE with glee at\n     the struggling Roger trapped inside.  A third Weasle carries\n     the Judge's briefcase.\n\n     Doom strides confidently into the bar.\n\n                               WEASLE\n               Oyez... oyez... oyez... court is now in\n               session.\n\n     Valiant and Dolores are led out by a couple Weasles holding\n     guns on them.  As Doom snaps the briefcase open on the bar,\n     the twelve Kangaroos pop up in their jury box.  Doom raps on\n     the bar with his gavel-headed cane.  The regulars watch the\n     bizarre scene in stunned silence.\n\n                               DOOM\n               Roger Rabbit is charged with the cold\n               blooded murder of a human... Marvin\n               Acme.  The jury will direct their\n               attention to exhibits A, B, and C.\n\n     The Weasles display photographs of Jessica and Acme playing\n     pattycake, a blow-up of his fingerprints spelling\n     RogerRabbitRogerRabbit in the whorls on the photographs, and\n     a picture of Acme lying under the safe.\n\n                               DOOM\n                      (continuing)\n               Motive, evidence, modus operandi.  How\n               do you find the defendant?\n\n     Once again the Kangaroo court wastes no time delivering the\n     verdict.  The Baby Kangaroos pop up with their Y-O-U A-R-E\n     G-U-I-L-T-Y signs.\n\n                               DOOM\n                      (continuing)\n               Guilty as charged.  Case closed!\n\n     Doom slams the briefcase shut.  Now two Weasles wheel the\n     stainless steel tub filled with dip into the bar.  Another\n     hands Doom his black rubber gloves.\n\n                               DOOM\n                      (continuing)\n               For this heinous crime, I sentence you\n               to the dip!\n\n                               ROGER RABBIT\n               No, no. not the dip!  Eddie, tell him\n               I didn't do it!\n\n                               VALIANT\n               I don't think it's gonna matter.\n               Sorry, pal, I tried.\n\n                               DOOM\n               Yes, and for that you're charged with\n               aiding and abetting.  But we'll let\n               Santino handle that.\n\n     Doom pulls on the rubber gloves.\n\n                               VALIANT\n               Hey, doesn't the rabbit even get a last\n               request?\n\n                               ROGER RABBIT\n               A blindfold, cigarette, noseplugs?\n               Just kidding.\n\n                               VALIANT\n               I think you want a drink.\n                      (to Doom)\n               How about it, Judge?\n\n                               DOOM\n               Well, why not?  I'm feeling magnanimous\n               tonight.  The successful conclusion of\n               this case draws the curtain on my\n               career as a jurist. I'm retiring to\n               take a new role in the private sector.\n\n                               VALIANT\n               Yeah?  Well, don't expect the Toons to\n               give you a gold watch.\n\n     Valiant pours a glass of whiskey filling it all the way to\n     the rim.  He holds it out to Roger.\n\n                               VALIANT\n                      (continuing)\n               Here you go, kid... say hi to Casper\n               for me.\n\n                               ROGER RABBIT\n               But, Eddie, you know what happens\n               when...\n\n                               VALIANT\n               Drink it, jerk.  All of it.\n\n     He grabs Roger's hand and forces the drink into it.  Roger\n     shrugs his shoulders and shoots the drink down.  We've seen\n     the reaction before.  Suddenly Roger's head turns into a\n     STEAM WHISTLE emitting such a PIERCING BLAST that is sends\n     everyone into ear-grabbing agony.  Glasses, bottles, mirrors,\n     even Doom's glasses SHATTER.  Valiant uses the distraction to\n     punch the Weasles holding Roger.  He grabs the rabbit by the\n     scruff of the neck. He gets as assist from Augie, who\n     couldn't hear the noise.  Unfazed, Augie whacks a Weasle on\n     the head with a barstool.  The Midget crawls behind Doom,\n     who's been momentarily blinded.  The one-armed Soldier pushes\n     him over.  Angelo is turning one Weasle's head around and\n     around like a cruller.  Finally, Doom gets to his feet.\n\n                               DOOM\n               After them you fools...\n\n     As the Weasles regroup, Valiant tips the stainless steel tub\n     over sending the dip spilling toward them.  The Weasles\n     recoil from the liquid.  Even Doom takes a step backward.\n\n\n     EXT. TERMINAL BAR\n\n     Eddie and Roger race down the stairs and toward the Toon\n     Control Wagon which is parked in front of Doom's Lincoln,\n\n                               ROGER RABBIT\n               Oh, Eddie, that was quick thinkin'.\n               Nothin' like usin' the old noggin, the\n               noodle, the grey matter...\n\n                               VALIANT\n               If I'm so smart, how come I'm runnin'\n               from the law with a Toon?\n\n     Valiant opens the door of the Toon Control wagon, and flings\n     Roger inside roughly.\n\n\n     INT. CAB\n\n     Eddie goes to start the vehicle but the key is gone.   Now\n     from behind them comes a DEEP RUMBLING VOICE somewhere\n     between Lord Buckley and Barry White.\n\n                               VOICE\n               Excuse me, gentlemen...\n\n     Eddie and Roger turn.  A snazzy TOON ROADSTER whose grill\n     functions as it's mouth is talking from behind the liquid\n     bars.\n\n                               ROADSTER\n                   If you effect my extrication, I\n                   could offer you some carburetion.\n\n     Valiant sighs with resignation and slides out of the cab,\n     Roger in tow.\n\n\n     EXT. REAR OF WAGON\n\n     Eddie and Roger come racing around the side of the wagon.\n     Valiant searches the back of the truck for the on/off switch.\n     He finds it and turns off the flow of acetone.  The Roadster\n     zips out of the truck and lands on the pavement, already\n     flexing and limbering.   Behind him, a comical number of other\n     TOON DETAINEES hop out like midgets out of a Volkswagon.\n\n     They all head for the hills.\n\n                               ROADSTER\n               Well... what're we waitin' for, the\n               William Tell Overture?\n\n\n     ANGLE ON TERMINAL BAR - THE WEASLES\n\n     come piling out.  They stack up like an Indian totem pole\n     searching every direction.  One of them spots Eddie and\n     Roger.  The Weasles stumble all over themselves in a mad\n     scramble down the stairs.\n\n\n     EDDIE AND ROGER\n\n     hop into the sleek two-seater.   Valiant looks at the myriad\n     of goofy cartoon gauges and switches on the Roadster's\n     dashboard.\n\n                               VALIANT\n               What do I do?\n\n                               ROADSTER\n               You don't have to do nothin'...\n\n     With a ferocious RUBBER BURNING SQUEAL, the Roadster ROARS\n     off in \"no frames\".  The exit is so fast that Eddie and Roger\n     are left behind, hanging mid-air.  But before they hit the\n     ground, the Roadster zips back INTO FRAME.  Eddie and Roger\n     fall back into their seats.  The Roadster bends around so his\n     grill is facing them.\n\n                               ROADSTER\n                      (continuing)\n               Uh... except hang onto your hat.\n\n     The Roadster ROARS off again in a cloud of Toon dust.\n\n\n     INT. SANTINO'S COP CAR\n\n     coming the other way.  It's followed by another squad car,\n     both with SIRENS BLARING.  When the red blur streaks by, Lt.\n     Santino turns to his PARTNER.\n\n                               LT. SANTINO\n               What the hell was that?\n\n                               PARTNER\n               Speeding rabbit, Lieutenant.\n\n                               LT. SANTINO\n               That's what I was afraid of.\n\n\n     EXT. STREET\n\n     Santino's car does a 180 degree spin, and goes after the\n     Roadster.  The second squad car follows.  The Weasles pile\n     into the Toon Control wagon and join the chase.\n\n\n     INT. THE ROADSTER\n\n     rockets down the street, then takes a turn so wide that it\n     drives up the front of the corner building, then back down on\n     the sidewalk, just avoiding a newsstand.  The squad car\n     following is not so dexterous.   It CRASHES into the stand,\n     sending newspapers flying.\n\n\n     THE ROADSTER\n\n     looks back over it's shoulder, admiring his handiwork.\n\n                               ROADSTER\n               Read all about it, Benny's back in\n               town!\n\n     Up ahead, an egg delivery truck is double-parked in their\n     lane.  Benny snaps around just as they're about to crash into\n     the back of the truck.  There's nowhere to go.   But Benny's\n     cool.\n\n                               ROADSTER\n               Going up...\n\n     Suddenly, just before impact, the Toon suspension on the car\n     accordions up, giving it a clearance of about fifteen feet...\n     just enough to get over the truck.\n\n\n     THE TOON CONTROL WAGON\n\n     doesn't come with this unique feature.  It tries to avoid the\n     truck but SMASHES into the back, splattering hundreds of eggs\n     and sending the Weasles flying.\n\n\n     EDDIE AND ROGER\n\n     look down from their suspended position at the chaos behind.\n\n                               ROADSTER\n               Next floor, sundries, knick knacks,\n               escaped convicts.  Watch your step.\n\n     The Roadster accordions back down to it's original height and\n     speeds past TWO MOTORCYCLE COPS.  The motorcycles ROAR after\n     them.\n\n                               ROGER RABBIT\n               Hey, Benny, what were you in for?\n\n                               ROADSTER\n               Reckless driving.  Do you believe that?\n\n                               VALIANT\n               Hard to imagine.\n\n     Benny zig-zags through traffic, scooting between cars, but\n     the Motorcycle Cops manage to stay on his tail.  Up ahead,\n     traffic is stopped in his lane.  With nowhere to go, Benny\n     passes a trolley car moving down the center of the street.\n     Suddenly, he swerves in front of the trolley to elude the\n     Cops... only to see another Red Car coming the other way.\n\n                               ROADSTER\n               Hold your breath, babies...\n\n     Benny sucks in his girth and gets on his tip-toes as the\n     trollies pass on either side of them.\n\n\n     WIDE SHOT\n\n     When the trollies clear, Benny staggers out from between them\n     still on tip-toes.  Benny plops down, squashes, then pops up\n     to his old self again.\n\n\n     BEHIND THEM\n\n     The crippled Toon Control wagon is struggling to keep up.\n     Voltaire circles above the truck and picks two Weasles up off\n     the roof.  They're each carrying several sticks of dynamite.\n\n\n     FROM THE AIR\n\n     We see Voltaire flying after the Roadster, which is speeding\n     along the palm-lined Elysian Park Drive.  The Weasles light\n     the dynamite sticks and with WHEEZING delight, bombard the\n     car below.\n\n\n     BENNY\n\n     swerves right and left dodging the EXPLOSIONS.  Now a stick\n     of dynamite falls into the back seat, fuse burning.  Benny\n     looks back.\n\n                               ROADSTER\n               Hate to sound like Chicken Little, but\n               is the sky falling or what?\n\n     Eddie and Roger turn to see the dynamite, fuse burning low.\n     Valiant makes a desperate grab for it.  But it rolls under\n     the front seat.  Roger jumps in Eddie's lap.\n\n\n     ABOVE - VOLTAIRE AND THE WEASLES\n\n     satisfied that they've hit their target, swoop back to the\n     Toon Control wagon.\n\n\n     IN THE ROADSTER\n\n     Valiant tries to untangle himself from Roger.\n\n                               VALIANT\n               Grab it, you idiot!\n\n     Finally, at the last second, Roger reaches down and picks the\n     dynamite up like a hot potato.  He flips it out of the\n     Roadster.\n\n\n     THE DYNAMITE\n\n     spins through the air, finally landing on the roof just as\n     Voltaire and the Weasles arrive.  BOOM!  The Toon Control\n     wagon is demolished.  When the smoke clears we see the\n     Weasles and Voltaire scattered roadside, faces blackened,\n     feathers smoking.\n\n\n     EXT. ECHO PARK STREET\n\n     Benny is leading a merry chase up and down the hills.  Beside\n     the two Motorcycles, there are half a dozen squad cars.  But\n     as Benny comes over the last rise, we see the road deadends\n     at Echo Park Lake.  The police have blocked off the\n     perpendicular streets with squad cars.  Eddie and Roger see\n     the deadend fast approaching.  Roger covers his eyes with his\n     ears.  Valiant braces himself.\n\n                               VALIANT\n               The brakes!  The brakes!\n\n     Benny hits the brakes.  Smoke pours out as they burn up and\n     the momentum is barely broken.\n\n                               ROADSTER\n               Forget the brakes, who brought the\n               water wings?\n\n     The Roadster SMASHES through the wooden guard rail and sails\n     out over the water.  KERPLOP!  It splashes down in the lake.\n\n\n     THE POLICE CARS\n\n     SCREECH to a stop at the edge of the lake.  Santino jumps out\n     and regards the floating Roadster.  He turns to the other\n     cops with a smirk.  When he turns back again, the smirk\n     disappears from his face.\n\n\n     ANGLE ON LAKE\n\n     Benny is calmly swimming away using his fenders to do the\n     crawl.  Now they pass a spooning COUPLE in a rowboat.  The\n     couple regard them open-mouthed.\n\n\n     THE EDGE OF THE LAKE\n\n     Benny nears the shoreline, touches bottom and wades out.\n     When they hit dry land, Benny shakes off like a dog.  He REVS\n     HIS ENGINE.\n\n                               ROADSTER\n               Maybe it's my imagination, but I always\n               seem to run better after I've had a\n               wash.\n                     (turns)\n               Now where can I drop you cats?\n\n     As Benny ROARS off...\n\n                                              CUT TO:\n\n\n     EXT. ALLEY - DAY\n\n     Benny peeks around the corner, then tip-toes into view. down\n     the alley until he stops in front of a back door.  Eddie and\n     Roger climb out.\n\n                               VALIANT\n               Thanks, Benny.\n\n                               ROADSTER\n               If you ever need me, just stick out\n               your thumb.\n\n     WHOOSH!  Benny is gone.  Valiant goes to the door and unlocks\n     it.  As he and Roger head up the back stairs...\n\n                                              CUT TO:\n\n\n     INT. BUILDING - CLOSE - DOORWAY\n\n     A hand painted design on the rippled glass shows a knight on\n     a white charger.  On the shield in bold letters it says,\n     \"Veritas\".  And lettered around it -- \"Valiant and Valiant -\n     Private Investigation\".\n\n\n     VALIANT\n\n     sticks his key in the door and unlocks it.  Roger studies the\n     banner.\n\n                               ROGER RABBIT\n                Valiant and Valiant?  Who's the other\n                Valiant?\n\n                               VALIANT\n                My brother.  Get inside.\n\n     He pushes Roger into the office.\n\n\n     INT. OFFICE\n\n     It's a typical detective office -- a couch, a sink, a window\n     -- except for the partner's desk in the middle of the room.\n     There's a chair on each side.  Valiant closes the door and\n     locks it.\n\n                               ROGER RABBIT\n                So what's our plan, our scenario, our\n                modus operandi?\n\n                               VALIANT\n                We can't do anything till it's dark.\n\n     Valiant picks up some yellowed newspapers off the couch and\n     dumps them on the floor.  They leave a clean spot on the\n     couch.\n\n                               ROGER RABBIT\n                Guess you haven't been here in a while.\n                     (reads\n                      headline)\n                'Japs Bomb Pearl Harbor'.\n\n     Roger walks over to the wall.  He takes a framed picture off\n     the wall which shows two guys clowning with Mickey Mouse.\n\n                               ROGER RABBIT\n                Say, who's this guy laughin'?\n\n                               VALIANT\n                Me.\n\n                               ROGER RABBIT\n                Gee, I didn't recognize you... I've\n                never seen you laugh before.  That your\n                brother makin' the rabbit ears?\n\n                               VALIANT\n                What is this, Twenty Questions?\n\n     Valiant grabs the picture from Roger and re-hangs it.\n\n                               VALIANT\n                      (continuing)\n                I'm gonna get some sleep.  I suggest\n                you do the same.\n         \n     Valiant stretches out on the couch.  Roger nudges him to move\n     over so he can lie down.  Grudgingly, Valiant slides over a\n     fraction giving Roger a tiny piece of the couch.  They lie\n     head to foot.\n\n\n     CLOSEUP - VALIANT\n\n     The problems of the day are knitting his brow.  Finally his\n     eyes close.  After a beat, we HEAR Roger SNORING.  It's LOUD.\n     Valiant's eyes pop open.  He rolls over.  WIDEN THE SHOT to\n     see what he sees.\n\n\n     ABOVE ROGER'S HEAD - A TOON DREAM BUBBLE\n\n     has appeared.  Inside the bubble is a saw sawing back and\n     forth through a log.  It is SYNCHRONIZED to the SOUND of\n     Roger's SNORE.  Valiant kicks Roger, trying to stop the\n     infernal SOUND.\n\n     Roger sits up.\n\n                               ROGER RABBIT\n                Huh?\n\n     In the dream bubble, the saw cuts through the log.  One end\n     of the log falls out of the bubble and BONKS Roger on the\n     head, knocking him unconscious.  Valiant shakes his head and\n     closes his eyes again.  We PAN UP off his face and PAST the\n     window where the sun is setting.  As the CAMERA MOVES ALONG\n     THE WALL, we see a gallery of framed newspaper clippings.\n     \"Valiant and Valiant Crack Popeye Kidnapping - Return Sweepea\n     to Loving Arms of Parents\".  And... \"Brothers Find Brothers:\n     Heckle and Jeckle Rescued From Redwood Forest!\"  And...\n     \"Goofy Cleared of Atomic Spying Charges\".  The PAN CONTINUES\n     until we get to the window again.  Now it's dark outside.\n     MOVE DOWN to Valiant's sleeping face.  He stirs. then opens\n     one eye.  Now they both pop open at what he sees.\n\n\n     VALIANT'S POV\n\n     Roger has a magnifying glass an inch in front of his face\n     that distorts his grinning face hideously.\n\n\n     VALIANT\n\n     startled from his sleep, reflexively shoves Roger away from\n     him.  He flies into a swivel chair and goes spinning around.\n\n                               VALIANT\n                You damn Toon!  No wonder they picked\n                you for the patsy.  Always gotta play\n                the fool.  You make me sick!\n\n                               ROGER RABBIT\n                Gee, you shamuses are a tough audience,\n                but what happened to you that was so\n                dark, lurid, embittering?\n\n                               VALIANT\n                You wanna know?  Well, since you're so\n                goddamn curious, I'll tell ya.  One of\n                you Toons killed my brother.\n\n                               ROGER RABBIT\n                A Toon?  Noooo.\n\n                               VALIANT\n                Yeah, a Toon.  It was the guy who\n                killed Bambi's mother.\n\n                               ROGER RABBIT\n                Him?  Oh, he was vile, heinous,\n                despicable... a smear on the drafting\n                board.\n\n                               VALIANT\n                Yeah, everybody thought so.  But me and\n                Teddy got a kick out of Toons.  All\n                Toons.  We couldn't see the bad in 'em.\n                And when this guy was accused of\n                knockin' over the First National Bank\n                of Toontown, we took his case.  But\n                when we looked into it, we found out he\n                did do it after all.  We went to his\n                house to take him in.  But he was wise.\n                He got the drop on us... literally.\n\n                               ROGER RABBIT\n                      (wincing)\n                Safe?\n         \n                               VALIANT\n                Piano.  Guy got away, disappeared into\n                Toontown.  Nobody ever saw him again.\n\n     Now the PHONE on the desk RINGS.  Roger makes a move to it.\n\n                               ROGER RABBIT\n                I'll get it.\n\n                               VALIANT\n                Get away from there.\n\n     The PHONE RINGS TWO MORE TIMES and stops.\n\n                               ROGER RABBIT\n                Wrong number?\n\n                               VALIANT\n                No, it's not.\n\n     Valiant goes to the phone anticipating a RING which comes\n     after a moment.  Valiant picks up the receiver.\n\n                               VALIANT\n                      (continuing)\n               Dolores?\n         \n                                              INTERCUT:\n\n\n     DOLORES\n\n     on the phone in the Terminal Bar.\n\n                               DOLORES\n               I was hopin' you'd be there.  Maroon's\n               called here about four times.  He says\n               he's gotta talk to you tonight.  He\n               says he can help you.\n\n                               VALIANT\n               I'll bet.\n\n                               DOLORES\n               Are you gonna call him, Eddie?\n\n                               VALIANT\n               What've I got to lose?  You okay,\n               Dolores?\n\n                               DOLORES\n               Yeah... they closed me down for a\n               coupla weeks.\n\n                               VALIANT\n               That'll work out just fine.  When this\n               thing is over, I'll take you to\n               Catalina.  How does that sound?\n\n                               DOLORES\n               Familiar.  Be careful, Eddie.\n\n     Dolores hangs up the phone.\n\n                                              INTERCUT TO:\n\n\n     VALIANT\n\n     He CLICKS the switchhook and dials.\n         \n                               VALIANT\n               Maroon?  Whaddaya want?\n\n                               MAROON\n                      (on phone)\n               Have you got the will?\n\n                               VALIANT\n               Maybe.  Why?\n\n                               MAROON\n                      (on phone)\n               Meet me at my studio at nine o'clock.\n               If you've got the will maybe we can\n               stop this thing.\n\n                               VALIANT\n               Stop what?\n\n     CLICK.  Maroon has hung up.  Valiant hangs up the phone and\n     goes to a wall safe.  He spins the combination.\n\n                               ROGER RABBIT\n               Gee, Eddie, you're not gonna go, are\n               ya?  Maroon'll be layin' for ya at nine\n               o'clock.\n\n                               VALIANT\n               That's why I'll be there at 8:45.\n\n                               ROGER RABBIT\n               I tell you what, maybe I better come\n               with you.\n\n                               VALIANT\n               Forget it.\n\n     Valiant reaches into the safe for a .38 revolver.  He checks\n     the cylinder. Then he takes out a wooden box about 8\" X 12\".\n     He closes the safe, picks up a black doctor's bag and puts\n     the box and the revolver into it.\n\n                               ROGER RABBIT\n               You know, Eddie, I'm not as much of a\n               chump, and a patsy, a yokel as you\n               think.\n\n                               VALIANT\n               How much is a shave and a haircut,\n               Roger?\n\n                               ROGER RABBIT\n                      (sheepish)\n               Two bits.\n\n                               VALIANT\n               I rest my case.\n\n     Valiant goes to the door, pauses.\n\n                               VALIANT\n                      (continuing)\n               If I don't make it back here by ten...\n\n                               ROGER RABBIT\n               Yeah?\n\n                               VALIANT\n               ... I'd head for Cucamonga.\n\n     Valiant closes the door, leaving Roger alone.  Roger paces\n     back and forth manically.\n\n                               ROGER RABBIT\n               Cucamonga?  I don't know anybody in\n               Cucamonga.\n\n\n     EXT. MAROON STUDIO - NIGHT\n\n     The lot is dark and deserted.  Now headlights cut through the\n     darkness as Maroon's Packard pulls up in front of the\n     Administration building.\n\n\n     INT. CAR - MAROON\n\n     reaches over and opens the glove compartment.  He takes out a\n     small automatic.  But his hands are so slippery with\n     perspiration, it falls to the floor.  Cursing, he takes out\n     a handkerchief, wipes his hands and his face and picks up the\n     gun again.  As he gets out of the car, we see the clock says\n     8:55.\n\n\n     INT. ADMINISTRATION BUILDING - NIGHT\n\n     Maroon hustles up to his office door.  He looks nervously\n     over his shoulder, then goes inside.\n\n\n     INT. MAROON'S OFFICE\n\n     Maroon switches on the lights.  He goes to his desk.  He\n     takes out the gun and puts it in the left hand drawer.  Then\n     he takes it out and puts it in the right hand drawer.  Then\n     back to the original drawer.  Finally satisfied, he goes to\n     the bar to calm his obviously shattered nerves.  As his\n     shakey hand starts to pour from the decanter, another hand\n     comes INTO FRAME.\n\n                               VALIANT\n               Steady, R.K., that stuff's eighteen\n               years old.\n\n     Maroon jumps back as Valiant steps from behind the curtain,\n     holding his black bag.\n\n                               MAROON\n               Valiant!  You surprised me.\n\n                               VALIANT\n               That was the idea.\n\n     Valiant takes over the pouring duties.  He turns and carries\n     Maroon's drink to him.  Maroon goes and sits down in his\n     chair.  He looks to the pistol hiding place.  Valiant\n     casually sits on the desk, putting his legs over the drawer.\n\n                               VALIANT\n               You're not too good at this, are you,\n               R.K.?\n\n                               MAROON\n               No... I'm not.  I'm a cartoon maker,\n               not a murderer.\n\n                               VALIANT\n               Well, everybody needs a hobby.\n\n                               MAROON\n               No, you gotta understand, Valiant, I\n               had nothin' to do with Acme gettin'\n               killed.  I just wanted to sell my\n               studio.  But they wouldn't buy my\n               property unless Acme would sell his.\n               And he wouldn't.  So I was gonna\n               blackmail Acme with pictures of him and\n               the rabbit's wife.\n\n     Maroon gets up from his chair, highly agitated.\n\n                               MAROON\n                      (continuing)\n               But then it all went to hell.  I been\n               around Toons all my life.  I can't sit\n               around and see them all destroyed.\n\n     Maroon eyes Valiant's black bag.\n\n                               MAROON\n                      (continuing)\n               You got the will in there, don't ya?\n\n                               VALIANT\n               No, I don't.\n\n                               MAROON\n               You tricked me, damn you!\n\n                               VALIANT\n               Take it easy.\n\n                               MAROON\n               There's no time to take it easy!  You\n               don't realize the diabolical mind we're\n               dealing with!\n\n\n     ANGLE ON WINDOW\n\n     A gun pokes through the open window past the curtain.  It's a\n     Colt .45 Buntline -- an unmistakeable gun with an extra long\n     barrel.\n\n                               MAROON\n               If I don't get that will by midnight\n               tonight, Toontown's just gonna be land\n               for the free...\n\n\n     VALIANT\n\n     sees a reflection of the gun on the glass on a movie poster\n     on the wall.  He turns.  But it's too late.  BANG!  BANG!\n     BANG!  Maroon crumples, caught mid-sentence.  Valiant dives\n     behind the desk and draws his gun.  He looks over at Maroon's\n     dead body on the floor.\n\n                               VALIANT\n               And the home of the brave?\n\n     Valiant crawls to the window where the shots came from.  He\n     looks out.\n\n\n     VALIANT'S POV\n\n     The comely silhouette of Jessica Rabbit runs to her car,\n     jumps in and ROARS out the the studio gates.\n\n\n     VALIANT\n\n     grabs his black bag, climbs out of the office window and\n     jumps off the fire escape to the lot below.\n\n\n     EXT. STUDIO LOT\n\n     Valiant hops into Maroon's Packard.  He hits the starter\n     button and takes off after Jessica.\n\n\n     NEW ANGLE\n\n     as the car pulls away, the trunk lid lifts.  Roger Rabbit\n     peers out, disoriented.  Then closes it.\n\n\n     EXT. STREET - NIGHT\n\n     Jessica's car speeds along.  Valiant is in close pursuit in\n     the Packard.  He's about to catch up on the straightaway when\n     Jessica's car disappears into a tunnel.\n\n\n     VALIANT\n\n     slams on his brakes.  The Packard goes fishtailing, finally\n     spinning to a stop at the foot of the \"Toontown\" sign.\n\n     Valiant gets out of the car.  He looks down the tunnel.  He's\n     sweating.  He loosens his necktie.  He paces back and forth\n     at the tunnel mouth.  He looks up at the Toontown sign and\n     suddenly smashes it with his fist.  It spins around like a\n     weathervane.\n\n     Valiant walks to the Packard with purpose.  He grabs the\n     black bag and puts it on the hood.  He opens it and takes out\n     the wooden box.\n\n\n     CLOSE - BOX\n\n     as the clasp is popped and the box opened, REVEAL a stunning\n     presentation model TOON .38 resting on crushed velvet.  It's\n     everything a real gun could be... and more.  Each feature is\n     exaggerated... the barrel, the cylinder, the ivory grips are\n     all Toon-sized.\n\n\n     VALIANT\n\n     picks the gun up and hefts it respectfully.  Then he opens an\n     ammo section in the wooden box. SIX TOON .38 DUM-DUM BULLETS\n     are in velvet creases.  The Toon Bullets blink to life as if\n     awakening from a long sleep.\n\n                               DUM-DUM #l\n                      (rubbing eyes)\n               Eddie... is that really you?\n\n                               VALIANT\n               Uh-huh.\n\n                               DUM-DUM #2\n               What year is it?\n\n                               VALIANT\n               '46.\n\n                               DUM-DUM #3\n               Who won the war?\n\n                               DUM-DUM #4\n               Who do you think, dummy?\n\n                               DUM-DUM #5\n               Welcome back, Eddie.\n\n                               DUM-DUM #6\n               Where you been the last five years?\n\n                               VALIANT\n               Drunk.\n\n     He opens the cylinder.\n\n                               VALIANT\n                      (continuing)\n               Feelin' frisky tonight, boys?\n\n                               DUM-DUMS\n               Yeah!\n\n     The Bullets eagerly dive into their respective chambers.  He\n     snaps the cylinder closed, reaches into his shoulder holster\n     and takes out the pint bottle.  He unscrews the cap and pours\n     the rest of the booze onto the ground.  When it's drained, he\n     flings the bottle in the air and FIRES the Toon .38.  KA-POW!\n     It makes a SOUND like a CANNON.\n\n\n     THE TOON BULLET\n\n     climbs like a rocket into the dark sky.  It SCREECHES up to\n     the bottle, puts on the brakes.  The Bullet puts on a\n     jeweler's eyepiece, then it whips out a little hammer and\n     chisel acd delivers one delicate tap.\n\n\n     VALIANT\n\n     watches as a cut glass chandelier falls out of the sky and\n     CRASHES at his feet.  Valiant holsters his weapon and climbs\n     into the Packard.  He puts it in gear and pulls into the\n     tunnel.\n\n\n     IN THE TUNNEL - DRIVING\n\n     As Valiant heads toward the proverbial light at the end of\n     the tunnel, suddenly the CAR RADIO COMES ON.\n\n                               RADIO ANNOUNCER\n               ... From the tippy tip top of\n               Toontown's Tip Top Club, this is Mellow\n               Melody Matinee.  Here's our favorite\n               cricket, Jimmy, with 'Give A Little\n               Whistle'.\n\n                               JIMINY CRICKET\n                      (on radio)\n               'When you get in trouble, and you don't\n               know right from wrong...'\n\n     Valiant turns the on/off switch, then punches all the buttons\n     but to no avail.  The SONG PLAYS ON anyway.\n\n                               JIMINY CRICKET\n                      (continuing)\n               '... Give a little whistle\n               Give a little whistle...'\n\n                               VALIANT\n               I hate Toontown...\n\n     As Jimmy croons on, Valiant emerges from the tunnel.\n\n\n     VALIANT'S FOV\n\n     Through the windshield we see we have arrived in Toontown,\n     where it's a beautiful sunny day.  Eddie is now driving down\n     a phantasmagorical boulevard in a completely animated world.\n     It's a Max Fleischer version of a city neighborhood.  The\n     trees and buildings are swaying in time with the MUSIC.\n     Eddie looks to his left and sees a huge Aphrodite-like hood\n     ornament on the front of a TOON CAR.  Then as the car starts\n     to pass him he sees hood... hood... hood... more hood then a\n     CHAUFFEUR, then more car, and finally the Wolf we remember\n     from the Ink & Paint Club.  He's in top hat and tails, a TOON\n     LAMB in the passenger seat.  He tips his hat.\n\n                               WOLF\n               Helloooo, cousin.\n\n     Now he drives past a Toon building under construction.  Like\n     everything else in Toontown. the construction company sports\n     the name \"Acme\".  The sign out frontsays:  WATCH OUR\n     PROGRESS.  Eddie looks up, and before he can drive by, the\n     building gets built floor by floor with accompanying SFX in\n     about two seconds.\n\n     Up ahead, the street is clear for blocks.  Then suddenly cars\n     pour out of all side streets at once, clogging the boulevard\n     like arteriosclerosis.  There is mad HONKING in this cartoon\n     traffic jam.  Eddie shakes his head.  He pulls over, parks\n     and gets out.\n\n     Valiant pulls out his Toon .38.  Suddenly, the street empties\n     in the blink of an eye.  Shutters close, and the sidewalk\n     rolls up like window shades.  It's so quiet you could hear a\n     pin drop.  In fact, a PIN DROPS from a second story window,\n     landing with the CLANG! of a manhole cover.  All is quiet\n     again.  Valiant starts across the street -- there is a CREAK\n     behind him.  Valiant whirls around, levelling his pistol at\n     the sound.\n\n\n     ANGLE ON PACKARD - ROGER\n\n     peeks out of the trunk of Maroon's car.\n\n                               ROGER RABBIT\n               Don't shoot, Eddie.  It's me.\n\n     Valiant lowers the gun as Roger emerges.\n\n                               VALIANT\n               What the hell are you doin' in there?\n\n                               ROGER RABBIT\n               I followed you to the Maroon Studios.\n               When I heard those shots, I thought I'd\n               help you and investigate the inside of\n               this trunk.\n\n     Valiant reaches into the black bag in the car.  He comes out\n     with a pair of TOON HANDCUFFS.  He slaps one on Roger's\n     wrist.\n\n                               ROGER RA13BIT\n                      (continuing)\n               Hey, what're you doin'?\n\n     Valiant drags Roger to the steering wheel.\n\n                               VALIANT\n               I'm making sure you don't help me\n               anymore.\n\n     He locks the cuff to it, and heads across the street.\n\n\n     AROUND THE CORNER - VALIANT\n\n     stops at a street sign.  The post is bristling with fingers\n     pointing in different directions; i.e., Poughkeepsie,\n     Transylvania, Walla Walla, South Pole (the finger points down\n     of course), and finally a finger which says:  The Dame.\n     Eddie follows the finger down the side street to a high rise\n     building.\n\n     He catches a glimpse of Jessica darting into the elevators.\n     Valiant hustles inside after her.\n\n     Valiant goes to the elevators, and watches the floor\n     indicator spinning round and Round, finally stopping with a\n     BING at the 125th floor.  The elevator doors open and Valiant\n     steps on.\n\n\n     IN THE ELEVATOR\n\n     Valiant punches 125.  Suddenly the elevator takes out with\n     such velocity that Valiant is thrown to the floor.  After a\n     moment, it stops so fast that he hits the ceiling.  Then\n     bounces back to the floor as the doors open.  He picks\n     himself up and steps off the elevator.\n\n     He's in a foyer with four doors.  Valiant opens the first and\n     steps inside.  He disappears.\n\n\n     NEW ANGLE\n\n     Valiant is on the outside of the building hanging onto a\n     flagpole for dear life.  He looks down at the street which\n     looks miles below.  Valiant inches back along the flagpole to\n     the door and pulls himself to safety.\n\n\n     INSIDE - VALIANT\n\n     tries the next door.  This time more carefully.  A SPEEDING\n     TRAIN is coming right at him.  He slams the door.  He tries\n     the next one.  A homely OLD TOON LADY is in a bathtub.  She\n     lets out a BLOODCURDLING SCREAM.  Valiant closes that door\n     quickly, and turns to the last.  When he opens this one, we\n     HEAR FOREBODING MUSIC.  We see...\n\n\n     A DARK ALLEY\n\n     Warily, Valiant walks into the alley, gun drawn.  There's a\n     NOISE behind the garbage cans.  Valiant turns as a DEAD BODY\n     with a knife in his back falls out of the shadows at\n     Valiant's feet.  A SQUEAKY VOICE comes from behind Valiant.\n\n                               VOICE\n               I guess they didn't clean up after the\n               last moider.\n\n     Valiant whips around to see a TOON RAT perched on a skull\n     picking his teeth.  Valiant kicks the skull.  The rat\n     scrambles for cover.\n\n     As Valiant continues on, we see...\n\n\n     JESSICA RABBIT\n\n     Steps out of the shadows behind him and aim the gun at his\n     back.\n\n                               JESSICA RABBIT\n               Don't move, Valiant.\n\n     Valiant turns slowly to see Jessica's got a bead on him with\n     her revolver.\n\n                               VALIANT\n               Well... I always figured I'd get it in\n               Toontown.\n\n     BLAM!  She fires.  But Valiant's still standing.  We HEAR a\n     CRASH behind Eddie as a figure falls into some boxes from a\n     fire escape above.\n\n                               JESSICA RABBIT\n               I think I got him.\n\n     Jessica runs past Valiant to the figure.  He follows,\n     bewildered.\n\n\n     ANGLE ON GROUND\n\n     We can see two rabbit ears sticking out from behind a box\n\n                               VALIANT\n               You shot Roger.\n\n                               JESSICA RABBIT\n               That's not Roger.  It's one of Doom's\n               men.  He killed R.K. Maroon.\n\n     Jessica moves the box aside and tugs on the rabbit ears.  The\n     rabbit head pops off.  Underneath is a Weasle.  In his hand\n     is the Colt .45 Buntline.\n\n                               VALIANT\n               Lady, I guess I had you pegged wrong.\n\n                               JESSICA RABBIT\n               Don't worry, you're not the first.  We\n               better get out of here.\n\n     As they run down the alley...\n\n                                              CUT TO:\n\n\n     THE PACKARD - ROGER\n\n     is behind the wheel making ENGINE NOISES like a little kid.\n     He pushes all the buttons, windshield wipers, convertible\n     top, etcetera, until he accidentally hits the starter button.\n     VROOM!  The Packard fires to life.  Roger's startled for a\n     moment, but quickly regains his composure.\n\n                               ROGER RABBIT\n               Hmmm... What would be the harm if I\n               took her for a spin?\n\n     He throws it into gear.  The Packard bucks into the car in\n     front of it.  Then Roger shifts again.  The same process is\n     repeated in reverse.  He SMASHES back and forth.  BANG!\n     BANG!\n\n                               ROGER RABBIT\n                      (continuing)\n                Ah... the open road.\n\n\n     AROUND THE CORNER - EDDIE AND JESSICA\n\n     come racing down the street.\n\n                               JESSICA RABBIT\n               It was Doom who killed Acme, you know?\n\n                               VALIANT\n               Why didn't you tell me?\n\n                               JESSICA RABBIT\n               I didn't know who I could trust.\n\n                               VALIANT\n               We're even.  By the way, I did find\n               your husband.\n\n                               JESSICA RABBIT\n                      (excited)\n               Where is he?\n\n                               VALIANT\n               He's right here in the...\n\n     Valiant rounds the corner and points toward the spot where\n     the car used to be.  But all that remains is a crumpled\n     bumper.\n\n                               VALIANT\n                      (continuing)\n               ... car.\n\n     He shakes his head and looks around for signs of Roger.\n\n                                              INTERCUT TO:\n\n\n     THE PACKARD\n\n     is careening down Toon streets totally out of control.\n     Panicked, Roger is spinning the wheel as if it were a\n     motorboat.  He drives in one side of Mother Goose's Shoe and\n     out the other, diapers all over the windshield.  Unable to\n     see, Roger steers right off the road.  The car hurtles\n     through space.  As it starts to fall, we see it's Toon\n     Monument Valley.  The Packard passes a promontory on which\n     WILE E. COYOTE is perched.  As Roger passes, he waves to the\n     Coyote.\n\n                               ROGER RABBIT\n               Hi, Roger Rabbit.  Love your work.\n\n                                              INTERCUT TO:\n\n\n     EDDIE AND JESSICA\n\n     who are now facing a squad of TEN Toon Control Weasles.  They\n     unleash a fusilade of bullets.\n\n     Valiant knocks Jessica to the ground.  The bullets pass\n     harmlessly overhead going into the window of the Acme Cheese\n     Shop, riddling a round of cheese.  The CHEESEMAKER'S hand\n     comes INTO FRAME changing the sign that says \"Gouda\" to\n     \"Swiss\".\n\n     Valiant rolls and FIRES his Toon .38 Special.  The Toon\n     Bullet turns into a cannonball, which rolls down the street\n     busting up the Weasle squad like a bowling ball through ten\n     pins.\n\n     As Eddie pulls Jessica to her feet, two more Weasles descend\n     on them.  They fling Toon knives, which pin Eddie to a wooden\n     fence.  Valiant rips one hand free, and BLASTS two shots at\n     them.\n\n     The Toon Bullets get to the Weasles, and open their nose\n     cones.  Two frying pans emerge and BONK the Weasles on the\n     head.\n\n     Jessica starts to pull the knives out, releasing Eddie.\n\n                               VALIANT\n               How did you get onto Doom?\n\n                               JESSICA RABBIT\n               Marvin told me.  Doom was after his\n               land.  Ne was afraid.  That's why he\n               brought me his will.\n\n     Valiant sees a Weasle skulking at them with a tommygun.\n     BLAM!  Valiant fires at him.  The Weasle ducks back around\n     the corner.  But Valiant's Dum-Dum SCREECHES to a stop and\n     goes around the corner, too.  We HEAR an EXPLOSION.  The\n     Weasle come staggering out and falls in the street.\n\n                               VALIANT\n               So where is it?\n\n                               JESSICA RABBIT\n               When I opened up the blue envelope, all\n               that was inside was a blank piece of\n               paper.\n\n                               VALIANT\n               A joker to the end.\n\n     Now Weasles are coming at them from every direction.  Valiant\n     aims the Toon .38 at a Toon tank rolling their way.  But when\n     he pulls the trigger, the gun just CLICKS.  Empty.\n\n                               JESSICA RABBIT\n               Looks like our goose is cooked, our\n               hash is slung, our fait is accompli...\n\n                               VALIANT\n               Lemme guess where you got that from.\n               Tell me somethin', what'd you ever see\n               in that guy anyway?\n\n                               JESSICA RABBIT\n               He made me laugh.\n\n     Valiant shakes his head.  Now they are completely surrounded\n     by Weasles.  The situation looks bleak.\n\n                               VALIANT\n               Well, do you prefer to die this way or\n               that way?\n\n     Valiant jerks his thumb indicating the direction behind him.\n     Suddenly, there's a rubber-burning SCREECH as Benny the\n     Roadster arrives next to Valiant's hitchhiker-posed thumb.\n\n                               ROADSTER\n               Need a lift?\n\n     Valiant does a take.\n\n                               VALIANT\n               Benny.\n\n     The Roadster looks back approvingly as Jessica climbs in with\n     Eddie.\n\n                               ROADSTER\n               Mr. Valiant, you've made a vast\n               improvement in the company you keep.\n\n     Benny blasts through a couple of Weasles.  They swing back\n     and forth like tavern doors, then topple.\n\n     He takes a hard right into the next block which is the Toon\n     Arctic.  His tires turn into skis.  He slaloms back and forth\n     between trees.  The Weasles pursue on dogsled.\n\n     Benny grabs a striped barber's pole -- the North Pole -- and\n     slides down it.  They land in the Toon Sahara.  Benny crawls\n     up a large sand dune, his tongue hanging out of his radiator.\n     He glances back at the Weasles who are mounted on camels,\n     waving scimitars.  When they reach the top of the sand dune,\n     we see they're on the precipice of a bottomless chasm.\n\n                               ROADSTER\n               Look, the drawbridge -- we're gonna\n               make it.\n\n                               VALIANT\n               I don't see any bridge.\n\n                               ROADSTER\n               That's because you gotta draw it first.\n\n     Benny takes a pencil hanging from a post lettered \"Draw\n     Bridge\".  He wets the pencil point and in a flash draws a\n     bridge.  It's a rickety rope bridge.  Using the pencil as a\n     balancing pole, Benny starts to tiptoe across.\n\n     The Weasles jump off t'heir camels and start filing onto the\n     bridge after them.\n\n     When Benny finally reaches the other side, Valiant grabs the\n     pencil from him and gets out of the car.\n\n                               VALIANT\n               Hold on a second.\n\n                               JESSICA RABBIT\n               Eddie, come on.\n\n     But Valiant stands facing the Weasles, who are charging at\n     him, swords raised.  With a sly smile, Valiant holds up the\n     eraser end of the pencil.  This freezes the Weasles.  But as\n     Valiant starts to erase a rope support, the eraser breaks off\n     the pencil and falls down into the chasm.  The Weasles WHEEZE\n     with relief and advance for the kill.  At the last second,\n     Valiant takes the business end of the pencil and scribbles a\n     handsaw.  He grabs it by the handle and saws the rope.  The\n     bridge swings away, smacking the Weasles into the opposite\n     canyon wall.  One by one, they slide off and disappear into\n     the abyss.\n\n\n     VALIANT\n\n     climbs back into Benny.  The Roadster takes off again, making\n     a skidding left turn onto the main drag.  As they make their\n     break into the Toontown tunnel...\n\n\n     EXT. TOONTOWN TUNNEL - L.A. SIDE - NIGHT\n\n     A ten gallon drum is sitting by the side of the road under\n     the Toontown sign.  From in the tunnel we hear the SOUND of\n     Benny's ENGINE coming closer.  Now a foot comes out of the\n     shadows and rests on the ten gallon drum.  As the SOUND of\n     the ROADSTER gets VERY LOUD, the foot kicks the drum over,\n     spilling a clear liquid across the road.\n\n\n     NEW ANGLE - THE FOOT\n\n     belongs to Judge Doom.  Doom smiles sadistically as the\n     Roadster with Eddie and Jessica aboard comes shooting out of\n     the tunnel.  When Benny hits the liquid, he starts to skid.\n\n                               ROADSTER\n               Uh-oh... whoaaa...!  Look out!\n\n     His tires smoke, then disappear. It's a dip slick.  Without\n     tires, Benny spins out of control, finally ending up in the\n     bushes roadside.\n\n     Before Eddie and Jessica can make a move, they are surrounded\n     by a horde of Weasles pointing what looks like a hundred guns\n     at them.\n\n                               DOOM\n               Are you two all right?\n\n     Doom opens one of the Roadster's doors and helps Jessica out.\n     Valiant climbs out after her.  The Weasles quickly relieve\n     him of his Toon pistol.\n\n                               DOOM\n                      (continuing)\n               These roads can be very treacherous at\n               night, especially in a maniacal Toon\n               vehicle.\n\n                               VALIANT\n               The pot's callin' the kettle maniacal.\n\n                               DOOM\n               I've had enough of your insolence!\n                      (to Weasles)\n               Put him in my car.  I think they'll\n               enjoy attending our ribbon cutting at\n               the Acme factory.\n\n     The Weasles prod Valiant and Jessica into Doom's Lincoln.  A\n     Weasle refers to Benny WHIMPERING in the bushes.\n\n                               WEASLE\n               What about him?\n\n                               DOOM\n               He's not going anywhere.  We'll send\n               the mobile unit after him.\n\n     Doom climbs into the car and it zooms off, Weasles jumping\n     onto the running boards.\n\n\n     BENNY\n\n     crawls out of the bushes on his axles.\n\n                               ROADSTER\n               The boinin', the boinin'...\n\n     He makes it down into the drainage ditch, dipping his\n     tootsies one by one.  There's a HISS as they hit the water\n     and the chemicals from the dip are extinguished.\n\n                               ROADSTER\n                      (continuing)\n               Oh, yeah... that's better.\n\n     Now Benny hears the SOUND of another VEHICLE COMING out of\n     the Toontown Tunnel.  He ducks down and peeks over the ditch\n     to see...\n\n\n     ROGER IN THE PACKARD\n\n     come SCREAMING out of the tunnel backwards.  Maroon's Packard\n     looks like the winner of a demolition derby.\n\n     Benny stands and waves to him.\n\n                               ROADSTER\n               Roger!\n\n     Roger sees him and slams on the brakes, skidding the Packard\n     into the Toontown sign.\n\n                               ROGER RABBIT\n               Benny?\n\n     Benny hobbles over to the Packard.  He pops his trunk and\n     rummages around.  He comes out with Toon boltcutters.  He\n     clips Roger's cuffs off.\n\n                               ROADSTER\n               Doom's got your wife and Valiant.  He\n               took them to the Acme factory,\n\n                               ROGER RABBIT\n               Let's go!\n\n     Benny nudges Roger to the passenger side.\n\n                               ROADSTER\n               Slide over, son.  It looks like you've\n               done enough drivin' for tonight.\n\n     Now the Toon Roadster gingerly gets behind the wheel of the\n     Packard.  He hits the gas and the Packard lurches down the\n     road.\n\n\n     INT. ACME FACTORY - NIGHT\n\n     Doom's car is parked inside.  There are several other\n     vehicles as well.  There's a steamroller, a road grader, and\n     a huge modified tanker truck.  It's mounted with a thousand\n     gallon vat, the contents of which are being stirred by a\n     motorized unit.  All the vehicles are marked with a large\n     green four-leaf clover logo.\n\n\n     VALIANT AND JESSICA\n\n     are held at gunpoint by a couple of Weasles, while several\n     others are busy JACKHAMMERING the brick wall at the far end\n     of the factory.  Doom pulls on his rubber gloves, turns to\n     the Weasles.\n\n                               DOOM\n               Frisk them.  See if they have the will.\n\n     Several Weasles rush for the opportunity to frisk Jessica.\n     The head Weasle slaps the others away.  Then WHEEZING\n     laciviously, he turns to the task.  He starts to move his\n     hands over her body when Jessica stomps her heel on his feet.\n\n                               JESSICA RABBIT\n               Get your hands off me, you little\n               rodent!\n\n     The Weasle hops away angrily and quickly frisks Valiant.  He\n     turns to Doom and shakes his head.\n\n                               DOOM\n               No matter.\n                      (checks watch)\n               I don't expect the will to show up in\n               the next fifteen minutes.  By then\n               Cloverleaf will own Toontown quite\n               legally.\n\n                               VALIANT\n               So you're Cloverleaf?\n\n                               DOOM\n               No one person is Cloverleaf.  We're a\n               vast company with diverse interests...\n               gasoline, tires, automobiles.\n\n\n     AT THE BRICK WALL\n\n     The jackhammering has stopped.  A Weasle plucks one brick out\n     of the wall.  Toon light beams through.  He reaches into the\n     hole in the wall and comes out holding a bunch of Toon\n     bananas.  WHEEZING wickedly, he passes them out to his\n     compatriots.  They devour the bananas, throwing the peels\n     helter-skelter.\n\n\n     VALIANT\n\n     turns his attention from the brick wall back to Doom.\n\n                               VALIANT\n               Come on, Doom.  What would a company\n               like that want with Toontown?\n\n                               DOOM\n               It wasn't Toontown they wanted.  It was\n               my idea of how to put the land to\n               better use.\n\n     Doom goes to the truck and starts turning on valves and\n     starting compressors.\n                               DOOM\n                      (continuing)\n               In fact, they thought my concept so\n               brilliant, that they offered me the\n               Directorship of Transportation.  I've\n               accepted.\n                      (to Weasle)\n               Bring me Mr. Valiant's gun.\n\n     The Weasle trots over and delivers Valiant's Toon .38.  Doom\n     inspects it.  He reads an engraving on the frame.\n\n                               DOOM\n                      (continuing)\n               'Thanks for getting me out of the\n               hoosegow.  Yosemite Sam'.\n                      (looks up)\n               How sweet.\n\n     Doom throws the gun on the ground.  He pushes back a long\n     lever on the truck, letting loose a tiny spurt of fluid from\n     the discharge valve.  The gun disappears.\n\n                               JESSICA RABBIT\n               Dip?\n\n                               DOOM\n               That's right.  Enough to dip Toontown\n               off the face of the earth.\n\n\n     EXT. ACME FACTORY - ROGER AND BENNY\n\n     have been watching the proceedings through a window.  They\n     turn to each other stunned.\n\n                               BENNY/ROGER RABBIT\n               Dip Toontown?\n\n                               ROGER RABBIT\n               We gotta do something!\n\n     Roger scurries back to the Packard hidden outside the gates.\n     He opens Valiant's black bag and comes out holding Eddie's\n     real pistol.  Benny comes tenderfooting up.\n\n                               ROADSTER\n               Roger, what're you gonna do with that\n               gun?\n\n                               ROGER RABBIT\n               I'm gonna save them, of course.  You go\n               for help.  Find Dolores at the Terminal\n               Bar.  She'll know what to do.\n\n                               ROADSTER\n               Well... all right...\n\n     Reluctantly, Benny gets behind the wheel of the Packard.\n\n                               ROADSTER\n                      (continuing)\n               But you be careful now with that gun.\n               This ain't no cartoon.\n\n     Benny pulls away.  Roger turns with determination and zips\n     back to the window\n\n\n     INT. FACTORY\n\n     Doom pulls the tarp off the top of the truck, revealing a\n     modified water cannon.\n\n                               JESSICA RABBIT\n               You're sick, Doom.  Where do people\n               like you come from?\n\n                               DOOM\n               Never mind where I come from.  Just\n               watch where I'm going.\n\n                               VALIANT\n               Don't you think anyone's gonna notice\n               that Toontown's gone?\n\n                               DOOM\n               They won't care.  Who's going to miss\n               some ridiculous talking mice when they\n               can have the future?\n\n\n     EXT. BACK OF FACTORY - ROGER\n\n     is trying to jimmy open a window using his whole body for\n     leverage.  He finally pops the window open.  Gun drawn, he\n     climbs over the sill.  And falls head first.\n\n\n     INT. BATHROOM\n\n     Roger splashes into the toilet bowl in the Acme washroom.  He\n     bobs up.  He drains the water out of the pistol barrel and\n     peeks over the bowl.  He gets a determined look in his eye.\n\n                               ROGER RABBIT\n               It's time to make my move.\n\n     Roger starts to climb out of the toilet.  He reaches for\n     something to grab onto.  Unwittingly, he gets the toilet\n     chain hanging from the tank above.  As he pulls himself out,\n     the toilet flushes.   Roger has only a moment to register a\n     dumbfounded expression before he is sucked down the john.\n\n\n     IN THE FACTORY - DOOM\n\n     continues expansively.\n\n                               DOOM\n               Right here where we're standing, will\n               be the cornerstone of my idea... the\n               cloverleaf -- an elegant cement\n               structure that intertwines freeways.\n\n                               VALIANT\n               What the hell's a freeway?\n\n                               DOOM\n               A freeway, Mr. Valiant, is eight lanes\n               of asphalt running uninterrupted from\n               L.A. to Pasadena.  Pasadena to\n               Hollywood.  Hollywood to Santa Monica.\n               Someday everyone will be in cars\n               driving happily, non-stop from one end\n               of the L.A. Basin to another.\n\n                               VALIANT\n               That's what this is all about?  Tell\n               me, who's gonna use your lousy freeway?\n               We got the Red Cars, the best public\n               transportation in the country.\n\n                               DOOM\n               Not for long.  We're retiring the Red\n               Cars.  People will drive, Mr. Valiant,\n               because they'll have to.  And when they\n               drive, they'll have to buy our cars,\n               our tires, our gasoline.\n\n                               JESSICA RABBIT\n               Why'd you bother to call it a freeway?\n\n     Doom steps up into their faces.  Behind him, several Weasles\n     are fashioning a noose.\n\n                               DOOM\n               Has a nice ring.  Too bad you two won't\n               be around to enjoy it.\n\n     Suddenly Roger EXPLODES out of the drainage grate in the\n     floor.  His entrance sends the Weasles flying.  Roger lands\n     on his feet, James Cagney-like, levelling his gun on Judge\n     Doom.\n\n                               ROGER RABBIT\n               Get 'em up.  All of you!  Or I let the\n               Judge have it!\n\n                               JESSICA RABBIT\n               Roger, darling!\n\n                               ROGER RABBIT\n               Yes, it's me, my dearest.  I'd embrace\n               you but first I have to take care of\n               some unfinished business.\n\n                               DOOM\n               Put that gun down, you buck-toothed\n               fool.\n\n                               ROGER RABBIT\n               Go ahead.  Give me an excuse to fill\n               you full of holes, pump you full of\n               lead.\n                      (over shoulder)\n               How'm I doin', Eddie?\n\n                               VALIANT\n               Real good, Rog... but maybe you better\n               let me take over.\n\n                               ROGER RABBIT\n               Not before I satisfy my sense of moral\n               outrage.\n\n     Milking the moment, he shifts the gun from one hand to\n     another.  He circles Doom, poking and prodding him with the\n     gun.\n\n                               ROGER RABBIT\n                      (continuing)\n               You think you could get away with this?\n               Hah!  We Toons may be idiotic, but\n               we're not stupid!\n\n\n     POV OVERHEAD\n\n     We LOOK DOWN on the proceedings from high in the rafters.\n     PULL BACK TO REVEAL we're watching from the POV of Voltaire,\n     who's perched on the top inventory rack.  Voltaire cleans his\n     fingernails, casually.\n\n                               ROGER RABBIT\n               Yes, justice, Judge Doom.  The real\n               meaning of the word probably hits you\n               like a ton of bricks!\n\n     Voltaire calmly nudges an Acme Ton-Of-Bricks off the shelf.\n\n\n     CLOSE - ROGER\n\n     He never sees it coming.  SMASH!  The bricks land on his head\n     and bury him.  The only thing we can see of Roger is his hand\n     with the gun in it.\n\n                               DOOM\n               Well, this is turning out better than\n               I thought.\n\n     Doom picks the gun up.  The Weasles drag Roger out from under\n     the bricks.  Big bright stars are circling his head.\n\n                               ROGER RABBIT\n                      (delirious)\n               Look, stars!  Ready when you are,\n               Raoul.\n\n     Valiant shakes his head, but Jessica starts to laugh.\n\n                               JESSICA RABBIT\n               I have missed you, Roger.\n\n                               DOOM\n               Tie the lovebirds together.\n\n     The Weasles twirl Toon rope around Roger and Jessica like a\n     cocoon.  They hook them on a power winch.  Then hit a button\n     and raise Roger and Jessica until they're suspended fifteen\n     feet above the floor... right in the path of the Dipmobile.\n\n     Doom hands Valiant's gun to the head Weasle.\n\n                               DOOM\n                      (continuing)\n               Let him watch his Toon friends get\n               dipped...  then shoot him.\n\n     Doom turns and starts to walk away.\n\n\n     ANGLE ON GROUND\n\n     He steps on a Toon banana peel and goes flat on his keester.\n\n\n     THE WEASLES\n\n     always quick with a laugh, BREAK UP at their boss'\n     misfortune.  The one guarding Eddie is so overcome with\n     LAUGHTER that he's slapping his thigh with his gun hand.\n     Valiant sees his opportunity.  He starts to make a move\n     toward the distracted Weasle and almost gets his hands on the\n     gun when:\n\n                               DOOM\n               Watch out, you idiot... he's going for\n               the gun!\n\n     The Weasle turns at the last second, sticking the barrel up\n     against Valiant's nose.  Doom gets to his feet.  He glowers\n     at the Weasle and knocks him on the head with the gavel head\n     of his cane.  Doom stalks out of the room.\n\n     The Weasles scramble to positions on the Dipmobile.  One\n     FIRES UP the ENGINE.\n\n     The streetcleaner brushes start to turn.  The vehicle starts\n     to creep forward.\n\n     Another Weasle climbs into the turret.  He puts Roger and\n     Jessica in the crosshairs of the cannon.\n\n     Beads of sweat break out on Valiant's face.\n\n     The Weasle, WHEEZING with evil glee, starts to press his\n     finger to the trigger.\n\n                               ROGER RABBIT\n               You guys think this is real funny,\n               doncha?\n                      (to Valiant)\n               Eddie, do somethin'!\n\n     At the last second, Eddie shouts at the Weasle.\n\n                               VALIANT\n               Hey!\n\n     The Weasle turns to him.\n\n                               VALIANT\n                      (continuing)\n               Before you pull the trigger, I want you\n               to know somethin' about the guy you're\n               about to dip.\n\n     Suddenly, Eddie breaks into the \"Looney Tooney Song\".  The\n     song Roger had sung in the bar.  The silly voice that comes\n     out of his mouth surprises everybody, especially Roger.\n\n                               VALIANT\n                      (continuing;\n                       sings)\n               'His name is Roger Rabbit\n               He's got a crazy habit...'\n\n     Valiant starts skulking across the floor.  It's a cross\n     between Groucho Marx and a Chuck Berry Duck Walk.\n\n                               VALIANT\n                      (continuing;\n                       sings)\n               'He likes to sing and dance and yuk\n               So brighten up and smile you\n                  schmuck...'\n\n     Valiant starts \"hoo-hooing\", slapping himself in the\n     forehead.  Now the Weasles start GIGGLING.  They've never\n     seen a human do this before.\n\n                               VALIANT\n               'Now my name's Eddie V\n               I'm looney too you'll see'\n\n     Valiant flips into a handstand and starts walking on his\n     hands.\n\n                               VALIANT\n                      (continuing)\n               'I walk with my hands\n               And I shake with my feet...'\n\n     He offers his foot to a Weasle who shakes it.  The others\n     HOWL.  Eddie flips upright and grabs a stick of Acme\n     dynamite.\n\n                               VALIANT\n                      (continuing)\n               'I think dynamite\n               Is swell to eat'.\n\n     Eddie takes a bite out of the Toon dynamite and acts like\n     he's savoring it.  The spectacle of this human doing this is\n     too much to bear.  Now the Weasles are rolling on the ground,\n     holding their sides.\n\n                               JESSICA RABBIT\n               He's lost his mind!\n\n                               ROGER RABBIT\n               Yeah, isn't it great?  Keep it up,\n               Eddie... you're killing 'em, you're\n               slayin' 'em, you're knockin' 'em dead.\n\n     Roger means it.  The Weasles are laughing so hard they're\n     giving themselves heart attacks.  Valiant spins around on the\n     floor like a clock dial gone berserk.\n\n                               VALIANT\n               Hoo-hoo-hoo-hoo...\n\n     One by one, the Weasles keel over... dead.  Opaque WEASLE\n     SPIRITS leave their bodies with wings and harps, and float\n     heavenward, still laughing.\n\n\n     VOLTAIRE\n\n     alarmed at the scene below, grabs a brick and flaps toward\n     the ceiling.  He throws the brick through the skylight and\n     flies out.\n\n                               VOLTAIRE\n               Doom!  Doom!\n\n\n     ON THE DIPMOBILE\n\n     The Weasle on the turret collapses onto the trigger.  The\n     unmanned dip cannon starts spraying, as the arm sweeps\n     slowly back and forth like an, automatic lawn sprinkler.\n\n\n     VALIANT\n\n     hitches a ride on the last ascending Weasle Spirit, letting\n     it hoist him to the top of the truck.  As he moves the Weasle\n     body off the trigger...\n\n\n     VOLTAIRE\n\n     CRASHES back through the skylight and swoops down on Eddie.\n     He sinks his talons into Eddie's back and lifts him into the\n     air.\n\n     As Valiant is being pulled skyward he reaches for something\n     along the wall of inventory.  He grabs a handful of Acme\n     Small Pills and jams a couple dowm the buzzard's mouth.\n     Instantly, Voltaire starts to shrink.  As he gets smaller, he\n     can no longer hold Eddie up.  They both descend as Voltaire\n     shrinks to the size of a chick.\n\n     The sprayer is swinging back towards Roger and Jessica.  At\n     the last second, Valiant reaches up and blocks it.  It swings\n     back the other way.\n\n     As Valiant scrambles up on the vehicle to turn it off,\n     Voltaire has found a box of Acme Big Pills.  He pecks into\n     it... and after a beat, EXPLODES out of the box.  He's now\n     three times the size he was before.  Voltaire flaps in for\n     the kill.\n\n     Valiant reaches the turret just in time to swing the cannon\n     around.  The spray of dip blasts one of Voltaire's wings off.\n     He spins earthward like a flaming Messerschmidt, finally\n     landing in the dip vat and dissolving into a black pool.\n\n     Doom arrives just in time to see his pet bird dissolved.\n     Angrily, he steps onto a giant Acme Mousetrap.  He uses a\n     piece of Acme cheese to spring it, catapulting him through\n     the air.\n\n     Just as Valiant is about to turn off the dip cannon, Doom\n     lands on the truck.  He knocks Eddie off the turret with a\n     flying tackle.  They both hit the floor.\n\n     Doom gets up, leaving Eddie stunned.  He sprints to where the\n     Weasle had dropped Eddie's pistol.  Finally Eddie shakes it\n     off.  He sees Doom about to reach the gun.  He straps on a\n     pair of Acme Rocket Skates, fires them up and shoots across\n     the floor.  He knocks Doom into a stack of Acme boxes,\n     toppling the whole shelf down on top of him.\n\n     As the sprayer swings back toward Roger and Jessica, they\n     have their last moment together.\n\n                               JESSICA RABBIT\n               Roger, I want you to know I love you.\n               I loved you more than any woman has\n               ever loved a rabbit.\n\n                               ROGER RABBIT\n               Be comforted in the knowledge that as\n               we face the Grim Dipper, our paint will\n               be comingled for eternity.\n\n     They both close their eyes, waiting for the end.  But it\n     never cames.  The truck runs up on some boxes and the sprayer\n     arm swings back the other way.\n\n     Doom grabs an Acme slingshot, loads an Acme boulder and fires\n     it at Valiant.  BLAM!  It whacks Valiant on the head, laying\n     him out cold in front of the Cloverleaf steamroller,\n\n     Doom climbs into the steamroller and starts it up.  He puts\n     it into gear and starts it rolling toward Valiant.\n\n     Valiant comes around to see the huge roller bearing down on\n     him.  At the last second, Valiant rolls out of the way and\n     grabs an Acme boxing glove.  It accordians out and smashes\n     Doom in the face.  He goes flying out of the driver's seat,\n     turning the wheel as he falls.  The steamroller starts to\n     turn in circles.\n\n     Valiant jumps Doom.  But Doom is stronger.  He throws Valiant\n     off and starts whacking him with his fist.  He pummels\n     Valiant backward toward the drum of the steamroller.  Valiant\n     grabs the nearest thing for defense.  It's a can of Acme\n     Stay-Put Adhesive.  He whips it up in front of his face.\n     Doom puts his fist right through it, covering his hand with\n     glue.  He smiles at Valiant and hauls off again.  Valiant\n     ducks.  Doom's fist strikes the top of the drum of the\n     steamroller.  Frantically he tries to pull it off.  But it\n     \"Stays-Put\".  The roller starts to suck his fist down and\n     under.\n\n                               DOOM\n               Nooooo!\n\n     Jessica and Roger avert their eyes as the steamroller crushes\n     Doom.\n\n     Valiant breathes a sigh of relief.  He starts for the dip\n     truck as the cannon swings back toward Roger and Jessica.\n     But neither of them are watching the cannon.  Their eyes are\n     fixed on the ground behind the steamroller.\n\n\n     ANGLE ON GROUND\n\n     There isn't the messy pile of blood and guts you'd expect to\n     see if a human got run over.  Instead, we see that Judge\n     Doom's remains have rolled out like a flat black pancake.\n     After a beat, an edge curls up with a CREAK.  Now the whole\n     shape peels off the floor and wobbles to it's feet. REVEALING\n     DOOM IS A TOON.\n\n                               ROGER RABBIT\n               Eddie, look out!\n\n\n     VALIANT\n\n     turns to see Doom stick his flattened thumb in his mouth.  He\n     blows, re-inflating himself.  His glasses CRACK and fall off.\n     Then his prosthetic eyeballs pop out.  His teeth shatter and\n     fall out of his mouth like china.  Underneath his latex mask\n     we can see his Toon mouth and evil red Toon eyes.\n\n                               VALIANT\n               Holy shit, he's a Toon!\n\n                               DOOM\n               Surprised?\n\n                               VALIANT\n               Not really.  Only a Toon could think of\n               something as goofy as that freeway\n               idea.\n\n     Doom takes the black rubber gloves off, REVEALING red hands\n     with long fingernails.  He makes his fist into an anvil and\n     advances on Valiant.\n\n                               DOOM\n               Is that so?  Well, we'll see who's the\n               goofy one.\n\n     BLAM!  From ten feet away, he smashes Valiant with a\n     bone-crushing punch.  Valiant staggers backwards.\n\n                               DOOM\n                      (continuing)\n               By the way, when I killed your brother,\n               Teddy, I used to talk just like this.\n\n     Doom spesks in a Toony high-pitched squeak.  Valiant\n     recognizes him now.\n\n                               VALIANT\n               You?\n\n                               DOOM\n               That's right, me.\n\n     BLAM!  Doom hammers Valiant again.  He's defenseless against\n     Doom's super human strength.  BLAM!  Valiant goes\n     sprawling to the ground.  Now Doom's hand turns into a\n     buzzsaw.  He goes to administer the coup de grace.\n\n                               DOOM\n                      (continuing)\n               Now Eddie's gonna be deady, just like\n               Teddy.\n\n     With his last ounce of strength, Valiant grabs the Acme\n     Boxing Glove.  He pops it.  The glove extends across the\n     room, punching the release lever on the dip truck.\n\n\n     CLOSE - VALVE\n\n     A flood of dip gushes out of the valve and rolls toward Doom\n     like a wave.\n\n\n     DOOM\n\n     SCREAMS as the torrent hits him with a CRASH.  But there's no\n     escape for him this time.  The flood of liquid envelopes him\n     at the ankles.  He dissolves into it like a melting candle.\n\n\n     THE DIPMOBILE\n\n     continues forward inexorably.  The arm is swinging towards\n     Roger and Jessica.  It gets closer and closer...\n\n     Valiant tries to get to the truck, but it's too late.  The\n     cannon has reached them.\n\n\n     CLOSE - ROGER AND JESSICA\n\n     They close their eyes, preparing to meet their Maker.  But\n     nothing happens.\n\n     The spray of the cannon suddenly peters out.  It dries up in\n     a harmless drip as the tank has completely emptied.\n\n     Valiant gets to the controls of the power winch.  He hoists\n     Roger and Jessica up out of the way.  The Dipmobile passes\n     harmlessly underneath them and SMASHES through the brick\n     wall.\n\n\n     TOONTOWN\n\n     is REVEALED in all its splendor.  It's a bucolic setting.  A\n     rainbow shares the blue sky with a smiling sun.  Fawns and\n     butterflies, chipmunks and flowers watch curiously as the dip\n     truck rolls past.  Suddenly it's lifted off the ground.  We\n     see it's resting on the top of a TOON GIANT's head.  This\n     Giant plucks the truck off his head, regards it, then pops it\n     in his mouth.\n\n\n     VALIANT\n\n     lowers Roger and Jessica to the ground.  We HEAR POLICE\n     SIRENS approach.  When Valiant unties them, Jessica turns and\n     exclaims...\n\n                               JESSICA RABBIT\n               My hero!\n\n     Then she hugs Roger passionately.  Valiant can only shrug.\n\n\n     THROUGH THE WALL - TOONS\n\n     start coming in.  They look around at the scene, bewildered,\n     then gather around Doom's robe, mask and shoes lying in the\n     puddle of dip.  There's a reddish slick floating on top.\n     Valiant wanders over and joins them.\n\n                               VALIANT\n               Hi-ho, the Doom is dead.\n\n\n     ANGLE ON DOOR\n\n     Dolores, Lt. Santino, and several other COPS rush in, guns\n     drawn.  Dolores runs to Eddie and puts her arms around him.\n     Santino looks down at the remains on the floor.\n\n                               LT. SANTINO\n               What the hell is that?\n\n                               VALIANT\n               Doom.\n\n                               LT. SANTINO\n               Jesus Christ... that was the Judge?\n\n     Valiant takes the paint chip out of his pocket.  He puts it\n     up against the red slime on the robe.  It's a match.\n\n                               VALIANT\n               That was the murderer of Herman Acme,\n               Maroon... and my brother.\n\n     Dolores looks down at the front of Valiant's shirt.  A dark\n     stain is appearing.\n\n                               DOLORES\n               Eddie, we better get you to hospital.\n               You're bleedin'.\n\n     Valiant looks down at the stain.\n\n                               VALIANT\n               That's not blood.  That's ink.  That\n               goof Acme squirted me with some the\n               other day.  Why it's comin' 'through\n               now, I don't know.\n\n                               ROGER RABBIT\n               That's because it's\n               Disappearing-Reappearing Ink.  Shows up\n               three days later.  Gives you enough\n               time to get away from the victim so he\n               doesn't punch you in the nose.  Great\n               gag.\n\n                               VALIANT\n               Yeah...\n\n                               DOLORES\n               I'll treat you to a new shirt.  After\n               all, you did save Toontown.\n\n                               JESSICA RABBIT\n               Problem is without Marvin's will, the\n               land still goes to Cloverleaf.\n\n                               ROGER RABBIT\n               That's right.  If only we knew what\n               happened to that will...\n\n     Valiant looks up from his shirt.\n\n                               VALIANT\n               Say Roger, remember that love letter\n               you wrote your wife at the Ink & Paint\n               Club?\n\n                               ROGER RABBIT\n               Yeah?\n\n                               VALIANT\n               I think you oughta read it to her.\n\n                               ROGER RABBIT\n               Good idea.\n\n     He reaches in his pocket, pulls out the paper and clears his\n     throat.\n\n                               ROGER RABBIT\n                      (continuing;\n                       reads)\n               Dear Jessy... How do I love thee?  Let\n               me count the... I, Marvin Acme, of\n               sound mind and body... Hey?\n\n\n     CLOSE - PAPER\n\n     The Disappearing-Reappearing Ink is coming up over Roger's\n     scribbling.\n\n                               VALIANT\n               Keep reading...\n\n                               ROGER RABBIT\n                      (reads)\n               Hey, it's the will.  I, Marvin Acme, of\n               sound mind and body, hoo-hoo-hoo-hoo,\n               do hereby bequeath in perpetuity the\n               property known as Toontown to those\n               loveable characters...\n\n     PAN the Toon crowd, who are listening to the reading of the\n     will.  It is a gallery of recognizable faces.  Everyone from\n     Mickey to Bugs, Yakky Doodle to Yosemite Sam, Dumbo to Dopey,\n     Bambi to Droopy, Tweety Bird to Tinkerbell.  They're all\n     there.\n\n                               ROGER RABBIT\n                      (continuing)\n               ... who have given me and the rest of\n               humanity so much mirth and merriment...\n               the Toons.\n\n     The Toon crowd erupts with a CHEER!  Hats go in the air and\n     they descend on Roger, slapping his back.  Roger breaks away\n     from the crowd and joins Eddie.\n\n\n     TWO SHOT - EDDIE AND ROGER\n\n     They stand side by side, looking out over Toontown.\n\n                               ROGER RABBIT\n               Well, Eddie, you still think I'm a\n               patsy, a simp, a chump?\n\n     Eddie wipes the spit off his face.\n\n                               VALIANT\n               No, kid, you're a real hero.\n\n                               ROGER RABBIT\n               I guess I am at that.  Cigar?\n\n     Roger holds out a large stogie.\n\n                               VALIANT\n               Why not?\n\n     Roger lights Eddie's and one for himself.\n\n                               VALIANT\n                       (continuing)\n               By the way, Roger, you were right about\n               your wife.  She's a good lady.  I'm\n               glad you got her back.\n\n                               ROGER RABBIT\n               And I'm glad you got your sense of\n               humor back.  Think you'll keep it?\n\n                               VALIANT\n               Only time will tell.\n\n     Valiant puffs on the cigar.\n\n                               VALIANT\n                      (continuing)\n               Pretty good cigar.  Where'd you get it?\n\n                               ROGER RABBIT\n               From this box here...\n\n     Valiant glances down.  The box says, \"Acme Exploding Cigars\".\n     He looks to Roger, but it's too late.  KABOOM!  KABOOM!\n     Their cigars blow up in classic Toon tradition, blackening\n     both their faces.  Roger starts laughing.  Eddie stares at\n     Roger for a moment, then he starts laughing too.  They throw\n     their heads back in a HOWL.  The other Toons join in.  Pretty\n     soon the whole factory is shaking with LAUGHTER.\n\n\n     A TOON COP\n\n     dressed in blue uniform and hat with his back to us tries to\n     restore order in the Acme factory.  As soon as he talks, we\n     recognize the stutter.  It's PORKY PIG.\n\n                               PORKY PIG\n               O-k-k-k, mmmove along.  There's\n               nnnothin' else to see.  T-t-that's it.\n               T-t-that's all, folks.\n                      (turns to\n                       CAMERA)\n               Hmm, I l-l-like the sound of that.\n\n     Then, savoring the phrase, Porky stutters out the famous\n     sign-off.\n\n                               PORKY PIG\n                      (continuing)\n                Eee-ba-da, eee-ba-da... t-t-that's all,\n                folks!\n\n     CARTOON MUSIC UP.\n\n                                               IRIS OUT.\n\n                                THE END\n         \n\n\n\n     \n\n\n\n\nWho Framed Roger Rabbit?\nWriters :   Jeffrey Price  Peter S. Seaman\nGenres :   Action  Animation  Comedy  Crime  Family  Fantasy  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:38:50.377440"}