{"title": "Wild Bunch, The", "film_link": "/Movie Scripts/Wild Bunch, The Script.html", "script_link": "/scripts/Wild-Bunch,-The.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Wild Bunch, The Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"http://www.imsdb.com/posters/Wild-Bunch,-The.jpg\" title=\"Wild Bunch, The Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  None available<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Walon Green\" title=\"Scripts by Walon Green\">Walon Green</a><br/>  <a href=\"/writer.php?w=Sam Peckinpah\" title=\"Scripts by Sam Peckinpah\">Sam Peckinpah</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Western\" title=\"Western Scripts\">Western</a><br/><br/>\n<b>Script Date</b> : February 1968<br/>\n<b>Movie Release Date</b> : June 1969<br/>\n<br/>\n<a href=\"/scripts/Wild-Bunch,-The.html\">Read \"Wild Bunch, The\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n\n<b>                                 THE WILD BUNCH\n</b>\n\n                                   Written by\n\n                           Walon Green &amp; Sam Peckinpah\n\n\n<b> \n</b>\n<b>         \n</b>                                                  February 12th, 1968\n<b>          \n</b>\n<b>          \n</b>\n<b>          1.\n</b>\n<b>          FADE IN:\n</b>\n<b>          OUTSKIRTS OF A SOUTH TEXAS RAILROAD YARD (SAN RAFAEL)\n</b>\n<b>          A TRAIN ROARS PAST REVEALING IN THE DISTANCE FIVE MET RIDING\n</b>          TOWARD CAMERA along the tracks. In CLOSE F.G. is.the back\n          part of a sign.\n\n<b>          NARRATOR\n</b>          To most of America in 1913, the Age\n          of Innocence had arrived and the\n          stories of the Indian Wars and the\n          Gold.RuSh and the Great Gunfighters\n          had become either barroom ballyhoo\n          or front-porch remiraiscences... .But\n          on both sides of the $io Grande men\n           still lived as thia7 had in the 1 70's\n          and 1 80's -- unchanged. men in a\n          changing land.\n          THEY WEAR THE KHAKI UNIFORMS OF THE UNITED STATES CnVALJRY..\n          The horses bear the government brand and the saddles are\n          regulation.\n          PIKE BISHOP,. wearing lieutenant's bars, rides slightly ahead\n          of the others. He rides stiffly; always slightly in pain...\n          Pike is a not unhandsome, leather-faced man in his early\n          forties. A thoughtful, self-educated top gun with a penchant\n          for violence who is afraid of nothing - except the. changes\n          in himself and those around him.\n          Make no mistake, Pike Bishop is not a hero -- his values are\n          not ours -- he is a gunfighter, a criminal, a bank. robber, a\n          killer of men. His sympathies are not for fences, for\n          trolleys.and telegraphs or better schools. He lives outside\n          and against society because he believes in that way of life\n          and if he has moments of sympathy for others, moments of\n          regret, t hey ' are short lived. He is not a 'good man'\n          according to the righteous... To them he is totally bad,\n          and he wouldn't have it any other way.\n          Next to him DUTCH ENGSTROM wears the uniform of a sergeant.\n          Dutch is bigâ\u0080\u009e good-natured with a fast gun hand, strong\n          loyalty and, like Pike, a bone deep distaste for rules and\n          regulations. He can sing,. has more than his share of charm,\n          but believes in nothing except two men, and Pike is one.\n          Behind them ride two brothers, LYLE and TECTOR GORCH,\n          dressed as corporals. Lyle and Tector are big, tough, hot\n          tempered and sudden. They work together, eat together and\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          2.\n</b>\n<b>          2 CONTINUED\n</b>          sometimes sleep together with the same whore. Brutal,\n          vicious in a fight, illiterate,. they are always pressing\n          for an advantage and once they get it -- they never let go.\n          They are without loyalty or honor, to anyone except each\n          other and that is limited.\n          A fifth man wears the single stripe of a PFC. This is. AL'GEL.\n          Angel is a good-looking, bilingual Mexican boy in his middle\n          20's who has seen so much blood and violence and cruelty\n          under Diaz that he rebelled -- but his rebellion was not with\n          Villa or Obregon, his was a one-man revolution against them\n          all. He believes in his family, his village and the inherent\n          dignity of. man (some men at least). \" He is faster than his\n          companions with a gun -- and a better shot -- but he can't.\n          laugh at the loss of love or suffer the loss of pride --\n          Mexican pride - a pride that can kill him, but if it does,.\n          he will have no regrets.\n          REACHING THE SIGN THE MEN STOP. Witut.speaking they, begin\n          to brush off their clothing and get their uniforms in order.\n\n<b>          4 THE SIGN READS IN RAILROAD LETTERS: SAN RAFAEL, TEXAS\n</b>           And underneath, someone has printed:\n\n<b>           Wï¿½LCO ME TO SAN RAFAEL\n</b>\n<b>           THE SEVENTH OLDEST TOWN IN SOUTH TEXAS\n</b>\n<b>           FOUNDED 1703, POPULATION 5\n</b>\n<b>           1914, POPULATION 2682\n</b>\n<b>          STAY ON AND GROW WITH OUR COMMUNITY\n</b>          PIKE' AND ' DUTCH STARE FOR A MOMENT AT THE SIGN, slightly\n          bemused. _\n\n<b>          DUTCH\n</b>          Make you feel welcome?\n\n<b>          PIKE\n</b>\n<b>          (DRYLY)\n</b>          It helps..\n\n<b>          TEC TOR\n</b>          What's it say?\n\n<b>          ANGEL\n</b>          (baiting him)\n          It invites us to stay with the community\n          and grow. It is here, perhaps with time\n          and small miracle -- that you could be\n          taught to read.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          3.\n</b>\n<b>          5 CONTINUED\n</b>          Tector looks at Angel for a long moment, then turns to Pike.\n\n<b>          TECTOR\n</b>          I never enlisted to serve with no\n          smart-mouthed kid.\n\n<b>          ANGEL\n</b>          Nor I with dogs.\n\n<b>          DUTCH\n</b>          (grinning at Pike)\n           ITd like to transfer to another unit --\n           there seems to be dissension in the\n          ranks.\n\n<b>           PIKE\n</b>          (t0 Teotor and Angel)\n          Itll transfer both of you -- just one\n          more word.\n          They look at him silently. He means it. Finally Tike spurs\n          his horse and the group sta'ts for town, CAMERA PANNING. THEM\n          PAST. THE STATt.ON Aï¿½M BOXCARS into a side street.\n\n<b>          EXT.. MAIN SQUARE OF SAN RAFAEL DAY\n</b>\n\n<b>          THE SQUARE. SHOWS THE MEXICAN/SPANISH INFLUENCE AND.IS CROWDED\n</b>          with weekend visitors. Men,. women and children are. milling\n          about, shopping and idly trading gossip.. The town.has the\n          look of turn of the century Americana along with its.Spanisn\n          heritage. The group of soldiers enter almost unnoticed.-\n          Riding downethe street they pass:\n          A LARGE TENT IN FRONT OF WHICH IS A BANNER ANNOUNCING a\n          W.C.T.U. meeting, which, according to the SOUNDS of the bass\n          drum and a sermon denouncing rum, is presently going on\n          inside.\n\n<b>          SPEAKER (OS)\n</b>          Leviticus. 10.9. Do not drink wine or\n          strong drink thou,nor thy sons with\n          thee least ye die. It shall be a\n          statute forever. Look. not though. upon.\n          the. wine when it. is red when it giveth\n          his color in the cup when it moveth\n          itself aright at the last it biteth\n          like a serpent and stingeth like an\n          adder.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CONTINUED\n</b>\n<b>          SPEAKER (OS) (CONTID)\n</b>\n<b>          (THEN)\n</b>          That is in the good book.. but here in\n          this town, it is five cents a glass.\n          Five cents a glass, does anyone think\n          that that is really the price of a\n          ----drink? The price of a drink let him\n          decide who has lost his courage and his\n          pride and who lies a govelling heap\n          of clay not far removed from a beast\n          today.-\n\n<b>          CONGREGATION (OS)\n</b>          I hereby solemnly procaise, God helping\n          me, to abstain from all di stilled, fer-\n          mented and malt ligi34rs3 including wine,\n          beer and cider, and to employ all proper\n          means to discourage the Ilse of and.\n          traffic in the same.\n\n<b>          AS THE GROUP RIDES AROUND THE SQUARE,. THREE. SOLDIERS,\n</b>          ABE,. PHIL AND BURT, at the hitching rail on one side of the\n          street,. turn and keep pace with the group on horseback.\n\n<b>          ON THE OTHER SIDE OF THE SQUARE THREE OTHER SOLDIERS,\n</b>\n<b>          BUCK, FRANK AND CRAZY LEE, DO THE SAME.\n</b>\n<b>          10 PIKE AND HIS GROUP RIDE PAST THE GENERAL STORE AND THE\n</b>\n<b>          SALOON. AT Tï¿½- END OF THE STREET, THEY DISMOUNT ACROSS FROM\n</b>          THE YELLOW AND BROWN RAILROAD ADMINISTRATION BUILDING. As\n          they swing out of the saddle the other ' soldiers' join them.\n          1l.' PIKE AND HIS COMPANIONS REMOVE EMPTY SADDLE BAGS FROM their\n          horses and step onto the boardwalk or sidewalk that surrounds\n          the'square. Some passersby look curiously.\n\n<b>          PIKE\n</b>          (after a moment, a little\n\n<b>          AWKWARDLY)\n</b>          Fall in -- and follow me.\n          The men,. with the 'exception of Tector, Phil and Abe, shuffle\n          into a ragged column of twos.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          5.\n</b>          12. PIKE MOVES DOWN THE FILE, looks around.\n\n<b>           BUCK\n</b>           Real quiet, 'sir.'\n           Pike looks at the horses, then at:\n\n<b>          13, THE SIGN OVER THE ENTRANCE OF A BUILDING ACROSS THE STREET\n</b>           It reads: PECOS AND SOUTH TEXAS R.R.\n          14. PIKE PAUSES. FOR A MINUTE and behind him the men surreptitious-\n          ly touch their holstered forty-five automatics. Pike leaves\n          the boardwalk, crossing toward. the railroad office. Tector\n          and Phil stay with the horses.\n\n<b>          PIKE AND DUTCH, LOOKING AROUND AS THEY LEAVE. THE BOARDWALK,\n</b>\n<b>          ACCIDENTALLY BUMP INTO A LADY SHOPPER, WHO DROPS HER PACIKAGE.\n</b>\n<b>          PIKE\n</b>          (removing his hat)\n          Beg pardon, Ma'am.\n\n<b>          DUTCH\n</b>          (as she stops)\n          Let. me, Ma'am.\n          Dutch picks up the package, Pike offers the lady his arm.\n          She hesitates, accepts. Pike and Dutch, followed by the\n          others, lead her across the 'street.\n\n<b>          16. ON THE ROOF OF THE BUILDING OPPOSITE THE RAILROAD OFFICE ARE\n</b>\n<b>          TEN. MEN STRETCHED OUT BEHIND THE FALSE FRONT T_DLY WATCHING\n</b>          THE CROWD BELOW, THEIR RIFLES AT THEIR SIDES Behind them.\n          on the flat of the roof are open bedrolls, and the remains of\n          at least three meals. It is hot., they have been there a -long\n          time, and they are tired.\n\n<b>          17., PAT HARRIGAN, A DAPPER, SELF-IMPORTANT, BACK=SHOOTING RAIL-\n</b>\n<b>          ROAD EXECUTIVE SITTING IN THE MIDDLE OF THE MEN -- ALL RAGGED\n</b>          HARDCASES -- frowns a little as he watches the soldiers in\n          the street below. It is. hotter than hell on the tin roof and\n          he is sweating heavily. He turns, edges forward, then nudges:\n          18, DEKE THORNTON SITTING NEXT TO HIM, his back against the wall,\n          Thornton is a hard-bodied, quiet-spoken man, with a lined\n          face and the embittered manner of someone who has changed\n          sides to stay alive and while part of his life has gone out\n          of him with the change, the personal integrity by which he\n          has lived is still. intact.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          6.\n</b>\n<b>          18 CONTINUED'\n</b>\n<b>           HARRIGAN\n</b>\n<b>           (HARSHLY)\n</b>           The soldiers sit up -- take a look!\n           Thornton straightens, turns slowly, looks -- stiffens a\n          little.\n\n<b>           HARRIGAN\n</b>           Pike?\n\n<b>          THORN TON\n</b>          (after a long moment)\n          He's there.\n          The bounty hunters react and prepare to fire. Over this shot\n          is the sound of Pike calling to Thornton -- from the past.\n          19 PIKE REACHES THE DOOR AND WITHOUT PAUSING, murmurs 'goodbye'\n          to the lady and enters, followed by the others,\n          20 ON THE ROOF, HARRIGAN WHIRLS ON HIS MEN as they begin aim-\n          â\u0080¢ing, ready to fire..\n\n<b>           HARRIGAN\n</b>\n<b>           (HISSING)\n</b>          Hold your fire; -- We wait till they come\n          out -- catch them in the act.\n           (to Thornton)\n           Then.you kill him or go back to Yuma;\n           Thornton turns toward him, his.face white, remembering-\n\n<b>          INT. PRISON CELL - DAY AND NIGHT - (MONTAGE EFFECT)\n</b>\n\n<b>          JAIL DOORS CLANGING SHUT\n</b>          20A THORNTON, WRISTS LASHED TO THE BARS OF THE CELL'S window,\n          is being whipped by a guard.\n          20B THORNTON on the rock pile is making little ones of big ones.\n\n<b>          EXT. SAN RAFAEL - ROOF TOP DAY\n</b>\n\n<b>          21 T.C. &amp; COFFER, TWO OF THE MEN, POINT TOWARD TECTOR.AND PHIL\n</b>          .standing by the horses.\n\n<b>          COFFER.&amp; T.C.\n</b>\n<b>          (SIMULTANEOUSLY)\n</b>          I can nail himl\n\n<b>          THORNTON\n</b>\n<b>          (SAVAGELY)\n</b>          He said wait.\n\n<b>          T.C.\n</b>\n<b>          (WHINING)\n</b>          What if they go.out back?\n\n<b>          COFFER\n</b>\n<b>          (DISGUSTEDLY)\n</b>          It's covered, you two-bit rednecked peckerwood.\n          The men settle slightly. Thornton remains tense -- then turns as:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          7.\n</b>\n<b>          22 THE W.C.T.U. BAND AND PARADE START UP AT THE END OF THE\n</b>\n<b>           STREET ACROSS THE SQUARE.\n</b>\n<b>           HARR IGAN\n</b>           That's all we needed:\n\n<b>          INT. PAY OFFICE - DAY\n</b>\n\n<b>          23 THE PAYMASTER IS REPRIMANDING A CLERK.\n</b>\n<b>          PAYMASTER\n</b>          What -you meant to do does not interest\n          me What you did --\n          Then, seeing:\n          24 PIES AND THE OTHERS waiting, he steps to the ody window,\n          smiling with the thought that their visit means. military\n          business for the railroad. His mood. changes as the men draw\n          their\\guns and Pike steps towards him.\n\n<b>          PAYMASTER\n</b>          (reaching for air)\n          What is it?...What do you want?\n          25 DUTCH., LYLE AND THE. OTHER MEN SWIFTLY MOVE behind the\n          counter. Pike ignores the paymaster and turns to:\n          26 CRAZY LEE STRINGFELLOW,. a young, compulsive killer with just\n           enough sense to. pour piss out of a boot (if the instructions\n           were printed on the heel: (the instructions are -- to pour,\n          tip!)\n\n<b>           PIKE\n</b>           If they move, kill them.\n           C.L. grins happily and squats on the floor, his 12 gauge\n          pump shotgun angled up at:\n\n<b>          27 THE TERRIFIED PAYMASTER, HIS TWO ASSISTANTS AND MARGARET, A\n</b>          HATCHET-FACED HARRIDAN IN HER FIFTIES i,iho enters the office\n          carrying. a.wrapped package and is instantly shoved into. a\n          corner with the other prisoners.\n          28 ON THE STREET -- THE W.C.T.U. BASS DRUM BOOMS CLOSER as the\n          parade picks up kids and other scoffing supporters as it\n          moves around the square. . People and their children are\n          crowding through the trees to the boardwalk to watch the band.\n          and group of believers following the_,. in a formation that is\n          almost as rigid as. their song and their faces.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          8.\n</b>\n<b>          29 ON THE ROOF TOP -- HARRIGAN AND THORNTON NERVOUSLY WATCH THE\n</b>\n<b>          BAND.. THE OTHER MEN EQUALLY TENSE KEEP THEIR RIFLES TRAINED\n</b>\n<b>          ON THE DOOR.\n</b>\n<b>          EARRIGAN\n</b>          Damn them!\n          The parade moves toward the saloon.\n\n<b>          THO RNTO N\n</b>          They should have been told:\n\n<b>          HARRI GAN\n</b>          Told-what!? Sus t how. long do you think\n          anyone in this manure pile can keep his\n          mouth shut?\n          Before Thornton can answer:\n          30 T..C.. SHIFTS TO CHANGE POSITION and his hand. touches the tin\n          roof, ,causing him to.yelp with pain.. The others snap a look\n          in his. direction, then freeze as:\n          31 'VECTOR ON THE BOARDWALK. LOOKS UP,. SEES NOTHING, leans back\n          against a rail watching the horses and the hymn singers.\n          After a moment, he smiles a little, beating time,. as he\n          remembers some forgotten march he watched from his daddy's\n          shoulders.\n\n<b>          32 IN THE PAY OFFICE -- ANGEL CROSSES TO THE WINDOW AS THE NOISE\n</b>          FROM THE PARADE GROWS LOUDER. He looks out Behind hi::\n          3.3 PIKE AND THE OTHERS ARE LOADING SACKS OF SILVER into their\n          saddle bags. They are almost ready to. leave.\n          The paymaster, his assistants and the customer, their hands\n          still up, watch C.L.\n\n<b>          MARGARET\n</b>          Trash -- Filthy trash!\n\n<b>          C.L.\n</b>          (gently.)\n          You just. hush now --\n\n<b>          ANGEL\n</b>          People marching and singing coming\n          down the street -- going to pass near\n          the horses.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          33 CONTINUED\n</b>\n<b>          C\n</b>\n<b>          PIKE\n</b>\n<b>          (GRINNING)\n</b>          Well, we'll just join in.\n          Angel, turning away, hesitates, looking up through the window\n\n<b>          AT:\n</b>\n<b>          34 SUNLIGHT GLEAMING OFF THE BARREL OF A GUN ON THE ROOF ACROSS\n</b>\n<b>           THE STREET\n</b>\n<b>           ANGEL\n</b>           Rifles -- one -- no three,. maybe\n           more, on the roof.\n\n<b>          35 PIKE QUICKLY CROSSES TO THE WINDOW AND LOOKS OUT.\n</b>\n<b>          PIKE\n</b>          Waiting for us\n\n<b>          (SOFTLY)\n</b>          Son of a bitch\n          He turns and crosses quickly to the back door. Dutch\n          follows. Pike opens it a little, looks ou.t at.\n\n<b>          EXT. REAR OF OFFICE'- DAY\n</b>\n\n<b>          36 FRA? BUILDINGS AND BARE ADOBE HUTS SURROUNDED BY TRASH AND\n</b>\n<b>           TIN CANS AND AMONG THEM THE INDISTINCT. FIGURES OF RIFLES AND\n</b>          HATS -- they are surrounded. -\n          37 IN THE OFFICE -- DUTCH JOINS PIKE AT THE DOOR and looks out,\n          then curses softly.\n\n<b>          DUTCH\n</b>          How in hell could they have known\n          we were coming?\n\n<b>          PIKE\n</b>          How in hell do I know?\n\n<b>          DUTCH\n</b>          Where do we go?\n\n<b>          -PIKE\n</b>          Out front -- that's where the horses\n          are..\n          He shuts the door, crosses toward the paymaster.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          10.\n</b>\n<b>          37 CONTINTJED\n</b>\n<b>           C.L.\n</b>           We go ing..out back, Mr. Bishop?\n\n<b>           PIKE\n</b>           No, son -- we got company there too --\n           (as the boy looks at him)\n          -Besides, when I travel, I like my feet\n          to dangle.\n\n<b>          C.L.\n</b>          (indicating the prisoners)\n          I kill 'em-now?\n\n<b>          PIKE\n</b>          (after a moment)\n          No. You just hold them here and wait\n          as long as you can -- after the shooting\n          starts.\n\n<b>          C.L.\n</b>          111-1 hold 'am till hell freezes over\n          or you say different !\n          Pike, pushing the frightened paymaster in front of him,\n          hesitates., looks. at C.L., then continues to . the door, grabs\n          the handle, looks back again.\n\n<b>          38 C.L.\"IS CROUCHED IN FRONT OF THE TWO ASSISTANTS AND MARGARET.,\n</b>           singing to himself, happy as a clam.\n          39 DUTCH, ANGEL AND THE OTHERS look at Pike. They are ready.\n          40 PIKE JERKS OPEN THE DOOR,. KICKS THE terrified paymaster out\n          into the street.\n\n<b>          ON THE ROOF -- THE BOUNTY HUNTERS OPEN FIRE AS THE DOOR FLIES\n</b>\n<b>          OPEN AND THE PAYMASTER STUMBLES OUT INTO THE STREET INTO THE\n</b>          MIDST OF THE BAND,. screaming as the gunfire cuts him down.\n          The marchers are frozen for a brief instant, then scatter in\n          terror as:\n\n<b>          42 PIKE AND THE OTHERS BURST OUT THE DOOR, FIRING AT THE MEN ON\n</b>          THE ROOF. -- RTJNNING TO THEIR HORSES. through the' screaming,\n          terrified marchers.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          .11 11.\n</b>\n<b>          IN THE OFFICE -- C.L. WATCHES THE ASSISTANTS AND MARGARET,.\n</b>\n<b>          IGNORING THE RIFLE SLUGS THAT SMASH THROUGH. THE BUILDING AND\n</b>          INTO THE OFFICE. The sound of the band is drowned out by\n          gunfire and screams. C.L. frowns a little.\n\n<b>          C.L.\n</b>          They was playing \"Gather at the\n          River.\" You know that one?\n          (as they quickly nod assent)\n          Then sing it Z\n          AND THEY DO, ALL OF THEM, THEIR VOICES RISING. WITH FERVOR and\n          C.L. joins them, marching up and down,. waving the shotgun in\n          time to the music.\n\n<b>          A SERIES OF ANGLES\n</b>\n<b>          THE STREET IS A CONFUSED MELEE AS THE BANDITS RUN FOR THEIR\n</b>\n<b>          HORSES, TRADING FIRE WITH THE BOUNTY HUNTERS.\n</b>\n<b>          MEN AND WOMEN, MARCHERS, BANDSMEN AND SPECTATORS RUN FOR\n</b>          COVER, some collide with the bandits,. some hit by the cross-\n          fire fall wounded in the dusty road.\n\n<b>          PIKE AND MEN FIRING BACK, REACH THEIR HORSES.\n</b>\n<b>          PHIL IS SHOT,. GOES`, DOWN FIRING -- IS HIT AGAIN AND AGAIN AND\n</b>\n<b>          DIES.\n</b>\n<b>          TECTOR GORCH IS WOUNDED HIGH ON THE SHOULDER AND IGNORES IT,\n</b>\n<b>          STANDING CALMLY, % F IR IN G UP AT THE A B USHERS WITH HIS 30.06.\n</b>\n<b>          A MAN IS HIT ON THE ROOF AND SCREAMS AND PITCHES FORWARD,\n</b>          falling.to the street. below as.\n          ANGEL AND LYLE BOTH FIRING rapidly, almost simultaneously,\n          kill. one. man and then another. Two others are wounded by\n          the bandits' fire.\n\n<b>          THE NIGHTMARE OF A PARADE CONTINUES - TO MILL AS THE FLEEING\n</b>          BANDITS MOUNT their plunging horses.\n\n<b>          HARRIGAN AND THE BOUNTY HUNTERS CONTINUE A BARRAGE OF FIRE\n</b>\n<b>          THEN :\n</b>          THORNTON TENSES, RECOGNIZING PIKE. He hesitates, then lifts\n          his gun to fire.\n\n<b>          PIKE, HAVING DIFFICULTY MOUNTING HIS HORSE, LOOKS UP,\n</b>          HESITATES, recognizes Deke, then snaps off a shot which\n          misses Thornton and kills SHEP, a bounty hunter firing\n          beside him. Thornton fires and:\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          12.\n</b>\n<b>          45-\n</b>\n<b>          53 CONTINUED\n</b>\n<b>          THE TUBA PLAYER, RUNNING WITH HIS INSTRUMENT IN FRONT OF PIKE\n</b>          is hit and falls into the street..\n          THE WILD BUNCH SWING ONTO THEIR HORSES AND WHEEL them around, I\n          but two are hit, Burt is barely able to control his hors 1,\n          theother , Abe , dies with his animal\n          PIKE MOUNTS AND GALLOPS HEADLONG INTO THE FRANTIC CROWD, some.\n          of his men. following, others splitting off in different\n          directions.. Behind them,. two lie dead in the street.\n\n<b>          54 IN THE OFFICE -- C.L., SINGING,. MARCHING WITH THE ASSISTANTS,\n</b>          stops, looks out â\u0080¢ the window, laughs with delight at the\n          excitement, turns:.\n\n<b>          55 THE TWO ASSISTANTS AND MARGARET ARE RUNNING FOR THE BACK DOOR.\n</b>          He-lifts his shotgun, yells for them to halt.\n          56 IN THE STREET - FRANK, WOUNDED EARLIER, FALLS FROi HI S\n          HORSE, dumping his laden saddle bags. His. foot hangs in the\n          stirrup and his horse drags him after the others. The horse\n          is shot and goes down -- Frank struggles to his feet, is out\n          down as:\n\n<b>          57 DUTCH,. FOLLOWING BEHIND, SWINGS DOWN AND PICKS UP THE BAG,\n</b>          then spurs through the crowd, past Frank and into the tent.\n          Horse, man and tent go down in a cloud of dust and canvas.\n          Then, the horse,. Dutch still in the saddle, rises, breaks\n          clear and races away.\n          58. A WOMAN, 'BLIND WITH TERROR, SPINS TO THE GROUND as she runs\n          into Pike I s horse as it slides to: a halt as Pike â\u0080¢ turns to\n          help Dutch.\n          A TERRIFIED CHILD STANDS and holds its ears, screaming as the\n          horses thunder past.\n\n<b>          60 ON THE ROOF --â\u0080¢ THE BOUNTY HUNTERS CONTINUE FIRI NG , IGNORING:\n</b>          61 HARRIGAN AND THORNTON. AS THEY TRY TO STOP THEM, KICKnr G T-B:'IR\n           RIFLES ASIDE, dragging them. away from the wall -- but the :.r\n          fight them off and. keep firing.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          13.\n</b>\n<b>          62 AT THE FAR END OF THE STREET -PIKE AND. HIS MEN EMERGE FROM\n</b>           THE CLOUD OF DUST THAT covers the shambles of-the ambush, and\n          ride for the edge of town.\n          63 ON ANOTHER STREET A CITIZEN AIMS A PISTOL AND FIRES. The\n          shot hits'. I\n          61 BURT'S HORSE, CAUSING THE ANIMAL TO CAREEN WILDLY. It\n           crashes through the railing and falls, throwing Burt through\n          the glass window of a store.\n\n<b>          65 . IN THE OFFICE -- C.L. QUIETLY RELOADS HIS GUN:\n</b>\n<b>          66 AS THE BUNCH NEAR THE. EDGE OF TOWN -- A FARMBOY STANDS UP IN.\n</b>\n<b>           A BUCKBOARD AND FIRES A SHOTGUN INTO THE FACE OF BUCK.\n</b>\n<b>           I\n</b>          67 THE BIRDSHOT CATCHES BUCK IN THE FACE,.:: BLINDING HIM... He\n           screams and reels in the saddle..\n          68 LYIE. GORCH KILLS THE BOY WITH ONE SHOT- .. and rides on.\n          69 BUCK HANGS DESPERATELY ONTO THE HORN as- his horse follows the\n          others.\n          70 ON THE ROOF -- THO RNTON AND HARRIGAN FINALLY FORCE the bounty\n          hunters to cease firing after the wild bunch.\n\n<b>          71. .PASSING THE RAILROAD. STATION ON THE FAR SIDE. OF TOWN -- PIKE\n</b>          PULLS UP HIS HORSE AND WHEELS around to see if they are being\n          followed, kicking loose a lady's shawl tangled in his stirrup.\n          72 NOBODY IS FOLLOWING - NOT YET.. Pike spurs his horse and\n           rides away, the others following.\n          (The six bandits remaining are Pike, Dutch, the Gorch\n          brothers, Angel and Buck, now blinded..)-.\n\n<b>          A SERIES OF ANGLES. OF\n</b>          73- THE CARNAGE LEFT BY THE GtJNFI IT\n\n<b>          75\n</b>          WOMEN AND CHILDREN are sobbing hysterically while townspeople\n          move among the dead and dying, ineptly trying to help.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          14.\n</b>\n<b>          73-\n</b>\n<b>          75 CONTINUED\n</b>           THORNTON LOOKS AT THE SHAMBLES, then turns away sickened and\n           slowly follows as the:\n           BOUNTY HUNTERS SCRAMBLE down from the roof.\n\n<b>          76 IN THE PAYMASTER'S OFFICE -- C.L., HIS GUN RELOADED, LOOKS\n</b>           AROUND THE OFFICE, humming softly.\n\n<b>          77 REACHING THE STREET -- THE BOUNTY HUNTERS RUN TOWARDS THE\n</b>           DEAD BANDITS followed by Harrigan..\n          78 THORNTON MOVES SLOWLY BEHIND THEM, cursing. softly as he.\n          watches the men rush to bodies like a. puck of wild. dogs in\n          a gut wagon -- they smell. blood and have forgotten the leash..\n          79 COFFER AND THE SOUTHERNER,. T.C. NASH, are stripping the\n          pockets of one body while arguing over whose shot killed the\n          man. Harrigan runs toward them.\n\n<b>          COFFER\n</b>          Well, just dig it out and see. if it\n          ain't my,... 06 S\n\n<b>          HARRI GAN\n</b>          (pointing to the paymaster)\n          You stupid damn fools! ... How could you\n          shoot this employee and let the others\n          get away?\n\n<b>          T. C.\n</b>\n<b>          (QUICKLY)\n</b>          I didn't shoot that old. boy...-My first\n          shot killed this man. right here.\n\n<b>          COFFER\n</b>          (overlapping, crossing\n          to another body)\n          He's lying'. Him and them others was\n          shootin' that old 'employee' full of\n          holes while I was droppin' this bandit\n          and them others too -- I must've killed\n          all three of 'em, sir, while --\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          15.\n</b>\n<b>          79- CONTINUED\n</b>\n<b>           THORNTON\n</b>           (interrupting him as T.C.\n           and the others protest)\n           Harrigan:.. He shot the old an -\n\n<b>           (WEARILY)\n</b>          Maybe we all did.\n          (crossing to him)\n          But by God the next time you plan\n          your massacre a little more carefully\n          ...or I'll begin it with you!\n\n<b>          HARRIGAN\n</b>\n<b>          (FURIOUS)\n</b>          You'll begin a trip back to Yuma Prison\n          if you don't learn to keep your mouth\n          shut l Why - in hell didn't you kill Pike\n          when you had the chance?\n          But Thornton doesn't answer -- he turns, listening to:\n\n<b>          C.L. (OS)\n</b>\n<b>          (SINGING)\n</b>          \"Shall we gather at the river\n          Where bright angels rise and fall\n          Shall we gather at the river\n          When the work's all done next fall?\"\n\n<b>          80 THORNTON AND HARRI GAN WHIRL ,AND RUN FOR THE OFFICE FOLLOWED\n</b>          BY SIMPKINS (the town marshal and trombonist in the W. C.T.U.\n          band), FRAY, his deputy, and the bounty hunters.\n\n<b>          81 IN THE PAYMASTER'S OFFICE -- C.L. IS MARCHING AROUND SINGING,\n</b>           THE . SPRAWLED BODIES OF THE ASSISTANTS AND MARGARET are near\n           the back door. C . L. turns as the men burst in :\n\n<b>           C.L. â\u0080¢\n</b>           Sing.' \"Shall we gather at the river --\"\n          82 THO.RNTON FIRES AND C.L. STAGGERS, falls to one knee,. the\n           shotgun dragging on the floor, his face mirroring shock and\n          surprise.\n\n<b>          C.L..\n</b>          Well, how'd you like to kiss my sister's\n          black cat's ass.\n          Harrigan fires. C.L. slumps, goes down on the other knee.\n          More bounty hunters burst into the room.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          16.\n</b>\n<b>          83 C.L. LAUGHS, FALLS FLATS ROLLS AND BEGINS TO PUMP THE SHOTGUN\n</b>           and everybody dives for cover and opens fire, riddling him\n          with bullets.\n          84 BUT HE TAKES THE MARSHAL, the deputy and one bounty hunter\n           with him before he is cut to pieces.\n          85 HARRIGAN AND THORNTON LOOKING DOWN at the shambles in the\n          room, turn as:\n\n<b>          86 WAINSCOAT, THE MAYOR, ENTER, FOLLOWED BY A GROUP OF SHOCKED\n</b>          AND IRATE TOWNSPEOPLE. BENSON, a beefy redneck rancher,\n          curses bitterly as he crosses to Harrigan.\n\n<b>          BENSON\n</b>          We're holding you -- your whole damned rail-\n          road responsible for this carnage --\n\n<b>          HARRIGAN\n</b>          Mr. Benson...o\n\n<b>          WAINSCOAT\n</b>          (almost screaming)\n          Innocent people are dead ...women\n          mangled -- dying --because you used\n          our town as a battlefield; You're\n          going to pay, sir -- your-railroad\n          is going to pay for our blood;\n\n<b>          HARRIGAN\n</b>          (blowing up) \n          Without the railroad this place would\n          still be a lousy little pueblo, so\n          don't make any threats to me;\n\n<b>          BENSON\n</b>          (topping him)\n          You can't ambush innocent people. on\n          our street!\n\n<b>          HARRIGAN\n</b>\n<b>          (YELLING)\n</b>          We were preventing a robbery and.attempt-\n          ing to capture a band of outlaws...\n\n<b>          WAINSCOAT\n</b>\n<b>          (LOUDER)\n</b>          You lured that gang in here... the rail-\n          roadts been blabbing about a big silver\n          payload for weeks;\n\n<b>          HARRIGAN\n</b>          We represent the law!\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          17.\n</b>          MORE IRATE CITIZENS BURST INTO THE OFFICE. Thornton moves\n          through them-out the door.\n          88 IN THE STREET -- HE STOPS, looking at the dead and dying,\n\n<b>          LISTENING:\n</b>\n<b>           BENSON (OS)\n</b>           If it takes vigilantes -- if it takes\n           federal troops -- I'll stop you and\n          ----your hired killers..\n\n<b>          HARRIGAN (OS)\n</b>          I can. assure you that there won't be\n          any more trouble... . My men will follow --\n\n<b>          BENSON (OS)\n</b>          (cutting him off)\n          Your men enter this town again and\n          they will be shot on sight;\n          Thornton ignores them, slowly rolling a cigarette, looking\n          after Pike.\n          Harrigan exits, crosses to Thornton.\n\n<b>          HARRIGAN\n</b>          I pulled. you out of jail to get- that\n          bunch -- and you failed --\n\n<b>          THORNTON .\n</b>\n<b>          (INTERRUPTING)\n</b>          You gave the ordersl If you want the\n          job done right -- you keep the hell\n          out of it next time - You and the\n          rest of your railroad trash\" I'll do\n          it -- but my way. - -\n\n<b>          HARRIGAN\n</b>          What.makes you think there'll be a\n          next time for you? What makes you\n          think you're not going back behind\n          bars for twenty more years?\n          Thornton's face twists as he hears again the clanging of cell\n          doors and the whimpering of prisoners..\n\n<b>          THORNTON\n</b>          Because I'm all you've got\n          (then, softly)\n          Because I know him.\n          (turning away bitterly)\n          Because you know I'll get him -- I'll\n          kill him rather than go-back.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          18.\n</b>\n<b>          88 CONTINUED\n</b>\n<b>           HARRI GAN\n</b>           Twice .he' s made a fool of me - He never\n           will again.\n           (then, turning to Thornton)\n           You know why you're here --\n           (before Thornton can\n\n<b>           ANSWER)\n</b>           Not because you're good -- because I\n           want him dead -- at your hands -- the\n           hands of his old friend, his partner --\n\n<b>           THO RNTON\n</b>           (after a moment)\n           IT 11 get him -- you have my word.\n\n<b>          EXT. DRY ARROYO - DAY (LATE AFTERNOON EFFECT)\n</b>\n\n<b>          89 THE WILD BUNCH RIDES DOWN A STEEP TRAIL INTO A DRY ARROYO\n</b>           They are weary, but determined. Buck, last in line, covered\n           with blood, is swaying in the saddle. Although severely\n           wounded, he still clutches the bags of silver.\n          90 REACHING THE BOTTOM OF THE ARROYO THE MEN SPUR their horses\n           across the d r y stream bed and up the steep bank on. t he other\n          side.\n\n<b>          91 DUTCH AND PIKE ARE IN THE LEAD. BEHIND THEM THE OTHERS LUNGE\n</b>           UP IN SINGLE FILE. Angel, second to last, reaches the top,\n          turns as:\n\n<b>          92 BUCK, NOW COMPLETELY BLIND, FALLS BACKWARD OVER THE REAR OF\n</b>\n<b>           HIS HORSE, HITS THE GROUND AND SOMERSAULTS BACKWARDS TO THE\n</b>           BOTTOM, still clutching the saddle bags.\n          93 ANGEL PULLS UP and calls to Pike.\n\n<b>           ANGEL\n</b>          Fijate.\n          94 BUCK, ON HIS HANDS AND KNEES, MOANS WITH PAIN as he attempts\n          to crawl up the slope.\n          95 PIKE RIDES DOWN TO HIM,. SWINGS OFF EIS HORSE and stands\n          looking down.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          19.\n</b>          96 THE BLIND MAN, HEARING HIM,, gropes in his direction.\n\n<b>          97 PIKE GENTLY TAKES THE BAGS OF SILVER. OUT OF BUCK'S HAND.\n</b>          Buck lurches forward, grabbing at Pike who steps back, Pike\n          crosses to his horse, and painfully climbs into the saddle.\n\n<b>          BUCK\n</b>          (dying, almost incoherent\n          with pain)\n          I kin still -ride...I can't see, but I\n          kin ride...\n           - (then)\n           No, I can't --\n           (.then, yelling)\n           Finish it, Mr. Bishop.\n\n<b>          98 PIKE. DRAWS HIS GUN P41 D FIRES\n</b>\n<b>          99 BUCK, ON HIS KNEES, â\u0080¢ IS CAUGHT SQUARE BY THE. SHO T AND HURLED\n</b>          OVER BACKWARDS. He slides several feet over the smooth,\n          round pebbles of the wash, then is still.\n          Pike turns his horse and spurs it . up the slope.\n          100 THE MEN WATCH SILENTLY AS PIKE RIDES UP. and halts. They\n          don't move, all looking down-at-Buck.\n\n<b>          PIKE\n</b>          (after a. long moment,\n          trying to cover the loss)\n          You boys want to move on -- or stay here\n          and give him a 'decent burial'.?\n\n<b>          TECTOR\n</b>          (the sentimentalist)\n          Well,. he was a good man --\n\n<b>          PIKE\n</b>\n<b>          (BITTERLY)\n</b>          He's dead!\n\n<b>          (THEN)\n</b>          And he's got a 'lot of 'good men? back\n          there to keep him company.\n\n<b>          LYLE\n</b>          Too damn many.\n\n<b>          DUTCH\n</b>\n<b>          (SOFTLY)\n</b>          I'd like. to say a. few kind words for\n          all the departed -- then perhaps a hymn\n          or two would be in order -- followed by\n          a' church supper with a choir. CONTINTED\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          20.\n</b>\n<b>          100 CONTINUED\n</b>\n<b>          LYLE\n</b>          (riding away)\n          Crazy bastards -- both of you l\n          Tector follows his brother, cursing..\n          101 PIKE AND DUTCH LOOK AT EACH OTHER silently -- try to grin --\n          finally make it -- then follow. The bunch is attentive, but\n           now certain that they are not being closely followed, they\n          can relax a little..\n          Pike and Dutch are side by side.\n\n<b>          PIKE\n</b>\n<b>          (WEARILY)\n</b>          ,Ten years ago it was some shaky\n          drunk with a tin badge that hid\n          in the g1n mill till you cleared\n          town with your grab...Now, they're\n\n<b>          I\n</b>          c waitin'. for you --\n\n<b>           : DUTCH\n</b>          With old friends. '\n\n<b>          LYLE\n</b>          (pulling back to'\n          join them)\n          Old friends?\n\n<b>          DUTCH\n</b>          Deke Thornton.\n\n<b>          LYLE\n</b>          I thought he was your partner?\n\n<b>          PIKE\n</b>\n<b>          (SHORTLY)\n</b>          He was -- but he got old and tired\n          and when that happens, things change.\n\n<b>          DUTCH\n</b>          'He changed -- you didn't.'\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          3/21/68\n</b>\n<b>          20-A\n</b>\n<b>          101-A INT. DENVER HOTEL SUITE - NIGHT.\n</b>\n          The following scenes will be superimposed over 101 and 102.\n          The suite consists of three adjoining rooms and is very\n          plush indeed,\n          TWO VERY BEAUTIFUL-YOUNG WOMEN in revealing night dress are\n          hindering more than helping, a somewhat loaded Pike Bishop\n          as he attempts to get into his clothes. The ladies are\n          giggling. and there is a great deal of grab-ass between the\n          three. -\n          101-B THORNTON, fully dressed and looking very sharp in his big\n          city clothes, enters from one of. the adjoining rooms.\n          ELIZABETH, a tall, lovely near-naked,.dark-haired girl,\n          follows him and takes his arm possessively. For a moment\n          both watch:\n          101-C PIKE'S girls'effectively stop his half-hearted attempts and\n          begin disrobing him.\n\n<b>          THORNTON\n</b>\n<b>          (SHARPLY)\n</b>          Come on pardner, let's get out\n          of here. -\n\n<b>          PIKE\n</b>          (Grinning at him)-\n          You.sound like you're all caught\n          up,\n\n<b>          THORNTON\n</b>          Caught up enough to know we've\n          overstayed our welcomes\n\n<b>          PIKE\n</b>          (Suddenly angry)\n          What in hell is the matter with\n          you?\n\n<b>          ELIZABETH\n</b>          Stay -- please,\n\n<b>          'PIKE\n</b>\n<b>          (CONTINUES)\n</b>          We've got money.to spend and\n          not a worry in the worlds\n\n<b>          (THEN)\n</b>          They're not going to look for\n          us in their own backyard,\n\n<b>          (CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          3/21/68\n</b>\n<b>          20-B\n</b>\n<b>          101-4 (CONTINUED):\n</b>\n<b>          THORNTON\n</b>          How can you be. so damned sure?\n          He shakes off the girl, crosses to a sideboard, pours a\n          drink..\n\n<b>          PIKE\n</b>\n<b>          (FLATLY)\n</b>          That's my business -- being sure.\n          There is a knock at the door and. Thornton whirls. Elizabeth\n          throws the bolt.\n\n<b>          THORNTON\n</b>\n<b>          (SAVAGELY)\n</b>          Hold it!\n\n<b>          PIKE\n</b>\n<b>          (GRINNING)\n</b>          Relax -- just a little champagne\n          I ordered.\n\n<b>          101-D ELIZABETH. STICKS. OUT HER TONGUE AT THORNTON AND OPENS THE.\n</b>          DOOR and gunfire fills the room as:\n\n<b>          101-E A DEPUTY SHERIFF STEPS INTO THE DOORWAY-AND SHOOTS THORNTON\n</b>          high on the shoulder. Thornton. is knocked sprawling... The\n          Deputy moves into the room (followed by three other men)\n          and fires at Pike but misses, as.\n          101-F PIKE SLIPS PAST the screaming women into an adjoining room.\n          The other men pursue.P.ike as the Deputy bends down and\n          snaps Thornton's wrists together with handcuffs. The sound:\n          of gunfire is heard from the street outside, then two of\n          the men re-enter the room. The Deputy looks up..\n\n<b>          DEPUTY\n</b>          Get him?\n          The man shakes his head.\n          101-G THORNTON, HIS FACE TWISTED WITH PAIN AND BITTERNESS, makes\n          no attempt â\u0080¢to struggle as he .is pulled to his feet and\n          moved out the door.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          21.\n</b>          102, THEY ARE SILENT, RIDING, EVEN LYLE is embarrassed by this\n           betrayal.\n\n<b>           PIKE\n</b>           He's had five years on the r ck pile,\n           Dutch -- and twenty more to u go --\n          that.can hurt a man.\n\n<b>          LYLE\n</b>          (after a moment)\n          Say -- I've heard it's like the.old\n          times in Argentina...3utch Cassidy\n          down. there making a killing...\n\n<b>          PIKE.\n</b>          Bolivia...but it'll be over there\n          too, pretty soon. Those :pining\n          companies will bring down a bunch\n          .of hardcases and Butchtll get his..\n\n<b>          (THEN)\n</b>          ..Every one of us is worth a year of\n          drinking and whoring to any fool that\n          can read a wanted poster and carry a\n          gun.\n\n<b>          DUTCH\n</b>\n<b>          (SOFTLY)\n</b>          Deke Thornton isn't just. any fool that\n          can carry a gun and read-a wanted\n          poster.\n\n<b>          PIKE\n</b>          Fo -- but he takes a dim view of 20\n          more years in the Carcel --\n\n<b>           (THEN)\n</b>           We can hope he ain't on. our tail -- but\n          don't bet on it..\n\n<b>          LYLE\n</b>\n<b>          (HAPPILY)\n</b>          Tector and I have been stealing since\n          the big depression and we ain't never\n          been caught. This Thornton don't bother\n          us nohe..\n\n<b>          PIKE\n</b>\n<b>          (WEARY)\n</b>          I don't really give a damn about Deke\n          Thornton...I just know that I'd surely\n          like to aet the hell off. this horse.\n\n<b>          CUT TO:\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>          107 THORNTON-LOOKS AT HIM WHITE WITH ANGER, then .c ntrols it -\n          he is trapped. Finally, he nods and moves away, then stops\n          and turns back, his anger almost beyond any control.\n\n<b>          THORNTON\n</b>          Tell me, Mr. Harrigan.-- how does\n          it feel?\n          (as Harrigan looks at him)\n          Getting paid for it?\n          (stepping closer)\n          -Getting paid to sit back and hire\n          your killings with the law's arms\n          around you? How does it feel to\n          be so damned right;?\n\n<b>          HARR IGAN\n</b>          (after a moment, coldly)\n          Good, Mr..Thornton...it feels good.\n\n<b>          THORNTON\n</b>\n<b>          (SOFTLY)\n</b>          You dirty son of a bitch.\n\n<b>          HARRIGAN\n</b>          (grinning at him)\n          You have 30 days to get him -- or 30 days\n          to Yuma. You're my Judas Goat, Mr. Thornton.\n          (motioning to the bunkhouse)\n          Use them -- lead them -- get Pike --\n          then kill them off. When you come back,\n          I: want all of them head down over a\n          saddle.\n          (pointing to the bunkhouse\n\n<b>          AGAIN)\n</b>          All of them -â\u0080¢- head down over a- saddle.\n          (as Thornton starts to speak)\n          30 days.\n          Heturns and walks away whistling.\n\n<b>           DISSOLVE TO.-\n</b>\n<b>          EXT. BORDER RAILROAD CULVERT AREA (AFTERNOON EFFECT)\n</b>\n          108 THE WILD BUNCH PULLS UP at the railroad which marks the\n          border and look out into Mexico.\n\n<b>          ANGEL\n</b>\n<b>          (SOFTLY)\n</b>          Mexico lindo.\n\n<b>          LYLE\n</b>          What's so 'lindoÂ° about it.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          22.\n</b>\n<b>          INT. RAILROAD BUNKHOUSE - DAY\n</b>\n\n<b>          103 DEKE THORNTON STANDS A LITTLE BEHIND HARRIGAN WHO IS SEATED\n</b>\n<b>          AT A SMALL DESK IN FRONT OF THE OTHER BOUNTY HUNTERS,\n</b>          The interior of the room is tawdry, disorderly and smells\n          bad. The bare walls are decorated with pin-ups from the\n          Police Gazette.\n          The men sit attentively on the bunks. and.foot lockers.,\n          Harrigan is marking beside their names in a large ledger\n          book. After making a 'notation, he looks up..\n\n<b>          HARRIGAN\n</b>          The hard money value of the men\n          killed less my commi.sson amounts\n          to. one hundred and fifty dollars.\n          104 THE MEN MUMBLE AND SHIFT. Harrigan holds up four wanted\n          posters. The bounty hunters move closer for a better look.\n\n<b>          HARRIGAN\n</b>          Bishop... .Engstrom... .Lyle and Tector\n          Gorch...are worth a total of four\n          thousand five hundred dollars -- and\n          you let them all ride outs\n          (after a moment)\n          Any one'of these pelts would not only\n          clear you with the company,.but would\n          mean a bundle of cash to raise hell\n          with.\n          Harrigan stands, crosses to the door.\n\n<b>          T.C.\n</b>          How '.bout a little liquor money for\n          tonight, Mr. Harrigan?\n\n<b>          HARRIGAN\n</b>          There won't be any tonight -- you\n          move after them in ten minutes --\n          (turning back)\n          Get them -- get Pike and youtre rich.\n          (then).\n          But if one of you quits on me I'll pay\n          a thousand dollar bonus to the man who kills\n          him.\n          105 THE MEN SILENTLY BEGIN TO PACK THEIR BELONGINGS. Harrigan\n           motions to Thornton, then exits.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          23.\n</b>\n<b>          EXT. RAILROAD YARD DAY\n</b>\n          106 HARRIGAN AND THORNTON WALK AWAY FROM the bunkhouse into the\n          deserted railroad yard..\n\n<b>          HARRIGAN\n</b>          Why should I let you go with them?\n\n<b>          THORNTON\n</b>\n<b>          (WEARILY)\n</b>          We've'been over that before, Mr.\n          Harrigan.\n\n<b>          HARRIGAN\n</b>          You could just ride off -- even join\n          him again -- you'd like that, wouldn't\n          .you?\n\n<b>          THORNTON\n</b>          What I like and what I. need are two\n          different things.\n\n<b>          (THEN)\n</b>          'Listen -- I don't want to go back to\n          prison, Mr. Harrigan,... .not ever -- but\n          it.has to be my way...\n\n<b>          HARR IGAN\n</b>          All right..\n\n<b>          THORNTON\n</b>          I need good men: You saw what happened\n          today.\n\n<b>          HARRIGAN\n</b>\n<b>          (FLATLY)\n</b>          You'll use what you have.\n\n<b>          (THEN)\n</b>          And you'll see it doesn't happen again\n          or I'll see you dead or rotting for -the\n          rest of -- you try\n          your life behind bars\n          to run -- I'll be after you and so will.\n          they.\n\n<b>          THORNTON\n</b>\n<b>          (ANGRY)\n</b>          I gave you my word.\n\n<b>          HARRIGAN\n</b>          We'll -see what it's worth -- five\n          minutes.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          2\n</b>\n<b>          108 CONTINUED\n</b>\n<b>          TECTOR\n</b>          Just more of Texas as far as I'm concerned.\n\n<b>          ANGEL\n</b>          You have no eyes.\n          And he rises ahead with Pike and'Dutch across the tracks\n          into Mexico.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. ARROYO SECO - BUCK'S FACE - DAY (LATE AFTERNOON)\n</b>\n\n<b>          109 IT IS A MASS OF DRIED BLOOD WHICH THORNTON WIPES AWAY WITH\n</b>           HIS GLOVED HAND, then looks up at the eight bounty hunters\n           who are sitting on their horses watching him.\n\n<b>           THORNTON\n</b>           (wear4.ly) V\n           All rightt... .How many of you killed\n           this one?\n\n<b>          110 COFFER SWINGS OFF HIS HORSE FOLLOWED BY SEVERAL OTHERS.\n</b>\n<b>          COFFER\n</b>          I knowed I wounded' three -- but\n          I wasn't sure about --\n\n<b>          THORNTON\n</b>          (as the others yell in\n\n<b>          PROTEST)\n</b>          Jabali:...\n          111 JABALI, AN AGING NAVAHO INDIAN trots up to.him'.\n\n<b>          THORNTON\n</b>          This pelt should clear you up -- take\n          him back to town...and tell Harrigan\n          to get me a list of every Army garrison\n          and payroll schedule on the border.\n          (to.the.others, crossing to\n          his horse)\n          We got another half hour of light and\n          they might be just up ahead counting\n          their money.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          26.\n</b>\n<b>          EXT. BANDIT CAMP - DAY (SUNSET EFFECT)\n</b>\n\n<b>          112 PIKE AND HIS MEN RIDE INTO THE RUINS OF A SMALL RANCHERO.\n</b>          A young boy takes their horses while an old.man and his\n          wounded son (the father of the boy) watch. Behind them,\n          an ancient woman pays no attention as she slaps tortillas\n          into shape. Two small children watch, big-eyed.\n          ;113 THE MEN ARE QUIET WITH FATIGUE AS THEY DISMOUNT AND TIE. j\n          THEIR HORSES.. FREDDY SYKES, a skinny old man in tattered range\n          clothes, crosses to Pike as he unloads his saddle bags.\n\n<b>          SYKES\n</b>          Them others ain't comin'?\n\n<b>          PIKE\n</b>          No.\n\n<b>          SYKES\n</b>          (after a moment)\n          None of 'em?\n          111 PIKE TAKES THE BAGS OUT OF THE CORRAL TO THE FIRE that burns\n          near an adobe wall and drops them on a poncho, watches as\n          the others do the same.\n\n<b>          SYKES\n</b>          (joining him again; worried)\n          But I got horses and gear for all\n          them fellers like you said --\n\n<b>          PIKE\n</b>          They won't need them -- we will.\n          Sykes thinks this over, finally nods. a little and turns away.\n          115 LYLE AND HIS BROTHER AND DUTCH STAND in a half. circle around\n          the poncho. waiting. Angel, the last, drops his saddle bag,\n          then crosses to the wall and drops down to rest. For a long\n          moment the men look down.a-t the pile of saddle bags.\n\n<b>          LYLE\n</b>          About the sharing up...\n\n<b>          PIKE\n</b>\n<b>          (WEARILY)\n</b>          The sharing up's going to be the\n          some as always.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          27.\n</b>\n<b>          115 CONTINUED\n</b>\n<b>          LYLE\n</b>          (whining; pointing to\n\n<b>          ANGEL)\n</b>          Tector and I don? t like the idea of him\n          getting the same as us...He's just\n          starting out and this is our stake for\n          new territory.\n          Pike looks at him silently. He has heard this kind of\n          argument many times in the past and it is obvious he is sick\n          to death of it. Lyle finally looks awa- at his brother;\n\n<b>          TECTOR\n</b>          And I figure a 'share to that old\n          man for watching the horses is a\n          share too much.\n          ll&amp; PIKE TAKES A KNIFE OUT OF HIS BELT, opens a saddle bag,.\n          takes out a sack of silver, kneels to slit the bag open.\n\n<b>          LYLE\n</b>          You hear me, Pike? -- I said it\n          ain't fair...\n          Pike stands,. flips the knife into the ground, faces the\n          brothers.\n\n<b>          P IKE\n</b>\n<b>          (SOFTLY)\n</b>          If you two boys don't like equal\n          shares why in hell don't you just\n          take it all?\n          They look at him silently.\n\n<b>          117 DUTCH DRIFTS AWAY A LITTLE TO TIE SIDE OF PIKE. â\u0080¢SYKES\n</b>          MOVES OUT OF THE BACKGROUND, a buffalo gun now dangling\n          from one arm. The brothers tense. Angel laughs softly.\n\n<b>          PIKE\n</b>          (almost a whisper)\n          Well,..why don't you answer me, you\n          dapnned yellow.-livered trash?\n          The brothers fide, et., look at each other.\n\n<b>          LYLE\n</b>          Ah.--' Pike, you know...\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          28.\n</b>\n<b>          117 CONTINUED\n</b>\n<b>          PIKE\n</b>          (his voice a whip)\n          I don't know a damned thing except\n          I either lead this bunch or I end\n          it -- right now;\n\n<b>          LYLE\n</b>          No, sir -- we divide just as you\n          say.\n          Pike looks at them a moment, then picks up his knife and\n          alicea open a bag and -turns it upside down and dumps the\n          contents onto the spread-out poncho watching as:\n\n<b>          118 STEEL WASHERS POUR 01 0 THE PONCHO\n</b>          119 THE GROUP IS SILENT IN DISBEL'EF staring at the pile of\n          worthless steel. Hykes eases up, takes a cautious look.\n\n<b>          TECTOR\n</b>          Rings:, Steel rings!\n\n<b>          DUTCH.\n</b>          (quietly).\n          Washers!\n\n<b>          120 PIKE TURNS AWAY. LYLE TAKES ANOTHER BAG AND CUTS INTO IT.\n</b>          More-washers pour out. _\n\n<b>           PIKE\n</b>           (under his breath)\n           Son of a bitch!\n          121 LYLE'S BOOT FLASHES INTO THE PILE. The washers fly in all\n          directions. Lyle whirls on Pike.\n\n<b>          LYLE\n</b>          Washers...we shot our way out of\n          that town for a dollar's worth of\n          steel holes.\n          He kicks into the pile and scatters Washers across the\n          clearing.\n\n<b>          PIKE\n</b>          They set it up:\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          29.\n</b>\n<b>          121. CONTINUED\n</b>\n<b>          LYLE\n</b>          (yelling).\n          Who the hell is 'they!!?\n\n<b>          SYKES\n</b>          (laughing; cackling)\n          'They?': by 'they, are just plain\n          and fancy 'they.' 'They.'\n          (dancing around them his\n          high laughter splitting\n          the night)\n          Caught you, didn't they? Tied a tin\n          can to your tail -- didn't they?\n          Lead you in and waltzed you out -- Oh\n          my what a bunch -- big tough ones --\n          standing around with a handful of\n          holes -- a thumb up your ass and a\n          big grin to pass the time of day with.\n          122 TECTORSWINGS AT HIM, BUT THE OLD MAN DUCKS, then falls and\n          rollsaway, still laughing. Tector starts'to follow, Pike\n          stepsbetween them.\n\n<b>          PIKE\n</b>          Railroad men -- Pinkertons -- bounty\n\n<b>          HUNTERS\n</b>\n<b>          (THEN)\n</b>          .Deke Thornton.\n\n<b>          SYKES\n</b>          (in disbelief )\n          Deke Thornton? -- He was with. them?\n\n<b>          LYLE\n</b>          (as Pike doesn't answer;\n\n<b>          QUIETLY)\n</b>          How come you didn't know?\n\n<b>          123 PIKE TURNS AWAY. DUTCH LOOKS AT PIKE QUESTIONINGLY, THEN\n</b>          ALL TURN as the SOUND of laughter comes from behind.\n\n<b>          ANGEL IS SITTING AGAINST-THE WALL LAUGHING.\n</b>\n<b>          ANGEL\n</b>          .(to Tector)\n          Hey, gringo; You take my share.\n\n<b>          125 TECTOR WHIRLS, HIS HAND FLASHING FOR HIS GUN.\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          30.\n</b>          126 BEFORE HE CAN DRAW ANGEL'S. EXPRESSION TURNS serious and a\n          gun is suddenly in his hand covering the big outlaw. Angel\n          smiles again...then pleads mockingly.\n\n<b>          ANGEL\n</b>          Don't kill me, gringo ...por favor...\n          Take my share of the 'silver' -- but\n\n<b>          --\n</b>          don't kill me, please.\n          Tector tenses, almost snarling with rage..\n\n<b>          PIKE\n</b>          ,k for it I\n          Tector-, looking at Angel's gun, half turns to Pike.\n\n<b>          PIKE:\n</b>          (continuing; softly)\n          Go on, fall apart!\n          Lyle and Tector hesitate, their hands on their guns -- Dutch\n          moves back into the shadows of the firelight, his rifle\n          drifting across Tector.\n          127 ANGEL SMILES AND SLOWLY replaces his gun.\n\n<b>           \\ DUTCH\n</b>           Let's walk soft, boys...\n\n<b>          128 LYLE, STILL MORE THAN HALF READY TO GO FOR HIS GUN,\n</b>          hesitates.\n          129 TECTOR LOOKS AT PIKE, DUTCH, ANGEL, T.HEN slaps his gun into\n           his holster -- and moves away, but his hand is never far\n          from the weapon..\n\n<b>          130 THE GROUP STANDS MOTIONLESS FOR A MOMENT, THEN SYKES REACHES\n</b>           INTO HIS COAT, LIFTS OUT A BOTTLE,. SITS BY THE FIRE and\n          hands'it to Dutch.\n          Dutch sits by Sykes, takes a drink, offers the bottle to\n          Tector, Tector hesitates, then hunkers down and drinks.\n          Slowly the others.follow suit.\n\n<b>          DUTCH\n</b>          (as the bottle moves around)\n          What's our next move?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          31,\n</b>\n<b>          130 CONTINUED\n</b>\n<b>           PIKE\n</b>           Agua Verde is the closest three\n           days maybe -- then we sell the extra\n           stock -- get some griib and the news\n           and drift back to the border -- maybe\n           a payroll -- maybe abank --\n\n<b>          LYLE\n</b>\n<b>          (GENTLY)\n</b>          Maybe that damned railroad:\n\n<b>          TEC TOR\n</b>          That railroad sire bsi hell ain't\n          getting 4ny easier. â\u0080¢\n\n<b>          SYKES\n</b>\n<b>          (QUIETLY)\n</b>          And we,ain't getting any younger.\n          For a moment, it looks like he'll get a smart answer in\n          return, then:\n          Lyle drinks and lifts the bottle to Angel who.crosses to.the\n          fire,. drinks and passes it to Sykes.\n\n<b>          PIKE\n</b>\n<b>          (FINALLY)\n</b>          .We got to start thinking beyond\n          our guns -- theft days are closin'\n          fast.\n\n<b>          LYLE\n</b>          (without malice)\n          All your fancy planning and talk\n          damn near got us shot to pieces\n          for.some lousy bags of washers...\n          Now this was goin.' to be our last\n          job before we head south ...We spent\n          all our time and money getting ready\n          for this.\n\n<b>          PIKE\n</b>\n<b>          (DRYLY)\n</b>          You spent your time and money running\n          whores in Hondo while I spent my stake\n          setting it up.\n          LYLE CALMLY PICKS UP A WASHER, flips. it to (or at) Pike who\n          catches it, looks at it, through it, drinks, tosses it back\n          on the pile.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/23/68\n</b>\n<b>          32.\n</b>\n<b>          131 CONTINUED\n</b>\n<b>          PIKE\n</b>\n<b>          (TRUTHFULLY)\n</b>          Looks like I'd have been better\n          off running whores than making plans9\n          stealing horses and buying uniforms.\n          1.32 THE MEN ARE SILENT FOR A LONG MOMENT. Then they break into\n           soft laughter which builds slowly.\n\n<b>           LYLE\n</b>           (after a moment)\n           He --.he was making plans while me\n           and Tector was --\n          He breaks up and can't continue.\n\n<b>          DUTCH\n</b>          (his laughter growing)\n          ,-While you was getting your bell\n          rope pulled by --\n          (standing; almost choking)\n          By two -- mind you, two -- Hondo\n          whores -- while Pike's dreaming of\n          washers - you're matching two of\n          them -- in tandem\n          And the wild bunch falls apart in laughter -- even Pike is\n          caught, but as he laughs, he knows that they are together\n          again.\n\n<b>          EXT. DESERT - DAY (SUNSET EFFECT)\n</b>\n\n<b>          133 DEKE THORNTON AND THE BOUNTY HUNTERS ARE GROUPED AROUND A\n</b>\n<b>          - FIRE EATING..\n</b>\n<b>          T.C.\n</b>          How close you figure we are?\n\n<b>          THORNTON\n</b>          Not close enough... They're across the\n          border by now. -\n\n<b>           COFFER\n</b>          Deke - you rode with. Pike -- what\n           kind of a man are we up against?\n\n<b>          THORNTON\n</b>          (after a long moment; softly)\n          The best --\n\n<b>          (THEN)\n</b>\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68.\n</b>\n<b>          330\n</b>\n<b>          133 CONTINUED\n</b>           THORNTON (CONT tD )\n           He's never got caught. -\n          (after a moment)\n          And he won't be if you boys don't\n          learn your trade. -\n\n<b>           FESS\n</b>          How was it -- then mm\n           (as Thornton looks at him)\n          You know -- in the old days? I only\n          come out here last spring.\n\n<b>          THORNTON\n</b>          (after a long moment)\n          You can saddle up or shut up -- take\n          your choice --\n\n<b>          COFFER\n</b>          (after a long moment)\n          \"What will he do?\n\n<b>          THORNTON\n</b>          That's what I have to figure.\n\n<b>          COFFER\n</b>          Maybe they'll split up.\n\n<b>          THORNTON\n</b>          No -- not 'that. bunch. They'll try\n           again. - -\n\n<b>           T.C.\n</b>           How do you know?'\n           But Thornton doesn't answer.\n\n<b>           EXT. PIKE'S CAMP - NIGHT\n</b>\n          134 PIKE AND DUTCH ARE SIDE BY SIDE IN THEIR blankets listening\n           to Angel play the guitar. For several moments they are.\n           silent, then:\n\n<b>           PIKE\n</b>           Didn't you run some kind of mine --\n           in Sonora?\n\n<b>          DUTCH\n</b>          Yeah, I helped run a little copper --\n          nothing for us there except day wages,\n          if it was running now -- which it ain't.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          3L..\n</b>          135 PIKE FINDS IT.IMPOSSIBLE TO get comfortable. Groaning and\n          wincing with pain he shifts on the bedroll.\n\n<b>          PIKE\n</b>          Why in the hell, did you ever quit it?\n\n<b>          DUTCH\n</b>          Why in hell are you still goin'?\n\n<b>          PIKE\n</b>          I don.'t know\"any better -- maybe\n          don't want any better,\n          (then, after a moment)\n          Hell, I wouldn't know what to do\n          with 'better' if it poked me.in the\n          eye with a sharp stick.\n\n<b>          DUTCH\n</b>          (laughing softly)\n          You -never gave it :a chance9 Pike.\n\n<b>           PIKE\n</b>\n<b>          (ANGRY)\n</b>          I threw away more chances in one\n          year that you will see in your\n          whole.l.ife -- but that don't mean\n          you have. to ' be a damn fool like me.\n          Dutch sits up, rolls and lights a cigarette.\n\n<b>          DUTCH\n</b>          You got a halfway hard mouth, partner.\n\n<b>          PIKE\n</b>          What in hell do you want me to-say ,-?\n\n<b>          DUTCH\n</b>          Just don't give me, no lectures..\n          They are silent -- finally:\n\n<b>           PIKE:\n</b>          This was going to be my last, too...\n          I'm not getting around any better --\n          like the red-haired lady said to the.\n          white-haired judge -- 'I only got so\n          many miles left -in my backside, Your\n          Honor, and I aim to keep it moving\n          while I'm still young enough to feel.\n          what it's there for.'\n          (a.s Dutch -laughs softly)\n          I'd like to make a good score -. then\n          back off. CONTINUED\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          35.\n</b>\n<b>          135 CONTINUED\n</b>\n<b>          DUTCH\n</b>          Back off to what?\n          (as Pike doesn't answer)\n          Any real ideas for a next one?\n          Pike closes his eyes and leans back.\n\n<b>          PIKE\n</b>          Pershing. has. got men spread over\n          the whole border. Everyone of those\n          garrisons is going to be.gptting\n          payroll.\n\n<b>          DUTCH\n</b>          That kind of information is kind of.\n          rough to come by.\n\n<b>          PIKE\n</b>          (sitting up)\n          Well -- I don't figure it's going to\n          .be easy, but it can be done.\n\n<b>          DUTCH.\n</b>          They'll be waiting for us.\n\n<b>          PIKE\n</b>          I wouldn',t have it any other way.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. THORNTON'S CAMP - NIGHT\n</b>\n          136- MOST OF THE BOUNTY HUNTERS ARE ASLEEP, only'Thornton and Cof -\n          fer are awake. Thornton sits up,.begins to roll a cigarette.\n\n<b>          COFFER:\n</b>          If he's in old Mex -- do we follow\n          him?\n\n<b>          - THORNTON\n</b>          No.\n\n<b>          COFFER\n</b>          Why not ?..\n\n<b>          THORNTON\n</b>          He'll be back.\n\n<b>          COFFER\n</b>          Harrigan ' said something about\n          thirty days --\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          36.\n</b>\n<b>          136 CONTINUED\n</b>\n<b>          THORNTON\n</b>          (after a moment)\n          That's what he said,\n\n<b>          CUT TO:\n</b>\n<b>          137 EXT.. PIKE'S CAMP - NIGHT\n</b>\n\n<b>          DUTCH\n</b>          You must have hurt that railroad\n          pretty bad -- they spent a lot of\n          time and money getting that ambush set\n          up for us.\n\n<b>          PIKE\n</b>          (smiling at the memory)\n          Well, I caught up to them -- two or\n          three times -- There was a man named\n           Harrigan -- He had a certain way of\n          doing things -- So I made him change\n          his ways -- when you do that to a\n           narrow man -- he can't live with it -\n           from then on he's got to change you --\n           break you -- just to prove he's.right --\n          there-'s a hell of a lot of people, Dutch --\n          that just can't stand to be wrong.\n\n<b>          DUTCH\n</b>          Pride, I guess\n\n<b>          PIKE\n</b>          I guess -- but they can't ever forget\n          it -- that pride that being wrong\n          or learn by it.\n\n<b>           DUTCH\n</b>           (after a long moment)\n           And you -- and me --did we learn --\n           being wrong today?\n\n<b>          PIKE\n</b>\n<b>          (SOFTLY)\n</b>          Well, I surely hope to God we did.\n          138 SYKES CROSSES TO PIKE, GIVES HIM a cup of coffee, moves\n          away,\n\n<b>          DUTCH\n</b>          Where'd you find him?\n\n<b>          -CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/6 8\n</b>\n<b>          37.\n</b>          138 (Cont,)\n\n<b>          PIKE\n</b>          .(softly)\n          That toothless old wreck was a real\n          gun about twenty years back --\n          used to run with Thornton and me\n          killed his share and more -- around\n          ----Langery -- Ambushed stages all along\n          that old board highway.,.He had those\n          Swede immigrants so scared theyQd\n          starve rather than go to town and\n          by beans for their kids, and there\n          wasn't a sheriff in. the territory\n          to take issue --\n          He laughs, drinks the coffee and gags..\n\n<b>          PIKE\n</b>\n<b>          (CONTINUING)\n</b>          And he ain't changed -- only now-he\n          does his killing with a coffee cup.\n          Dutch laughs and then both lean back listeningas:\n          139. ANGEL, WRAPPED IN HIS SERAPE LEANING AGAINST THE-WALL, plays\n          the great ranchero songs of old Mexico.,\n          140 LYLE.AND TECTOR ARE ALSO AWAKE and listening.\n\n<b>          DUTCH\n</b>          (softly) -\n          Pike, I wouldn?t have it no other\n          -way aither.\n\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT. DESERT SAND DUNE. AREA - DAY\n</b>\n\n<b>          141 PIKE AND THE OTHERS (NOW DRESSED FOR THE TRAIL) RIDE ALONG\n</b>           THE'TOP-OF A HIGH DUNE;. They are tired and dirty.\n           Near the edge they dismount to lead their horses to the\n           bottom. -\n          1L.2 THE SAND IS LOOSE AND THE FOOTING EXTREMELY DIFFICULT as they\n          start down in single file, Sykes is last, he leads his own\n          horse, a pack animal, and three of the empties.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          38.\n</b>          143 SUDDENLY SYKES SLIPS AND LOSES HIS-FOOTING. He falls\n\n<b>          FORWARD:\n</b>          PULLING THE FIVE HORSES DOWN WITH HIM.. Unable to\n          control his slide he collides with/Tector who is next in\n          line. Tector's fall starts a p fain reaction in which\n          all the men slide to the bottom of ttLe hill.\n          145 PICKING UP SPEED THEY TUMBLE TO THE BOTTOM and land in\n          a giant cloud of. dust. There. is a: profusion of coughing\n          and swearing as the men and-animals struggle to their\n          feet..\n          146 TECTOR STANDS,. CURSES AT SYKES,. then picks up a. stone\n          and throws it at.the old man who is hit and falls\n          backward.\n\n<b>          147 PIKE GRABS TECTOR'AND SWINGS HIM AROU3D...\n</b>\n<b>          PIKE\n</b>          Leave him alone!\n\n<b>          TECTOR\n</b>\n<b>          (R'AVING)\n</b>          Hats goin' to get pis killed -- get\n          rid of him!\n\n<b>           PIKE\n</b>           (his anger growing)\n          We don.'t get rid of nobody\n          we stick together -- just like\n          it used to be -- when you side\n          aman you stay with him --\n          (shaking him)\n           If you can't do that you're worse\n          than some animal -- you're finished --\n          we're finished -- all of us!\n          Tector looks at him silently.\n          148 PIKE TURNS TO MOUNT THE HORSE. Placing his foot in\n          the stirrup he stiffly starts to swing on. The leather\n          breaks and. he falls under the animal. Landing on his\n          back, he lets out a loud shriek.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          39.\n</b>          1.9 THE OTHER N'EN LOOK DOWN AT HIM AS TEEM MOUNT. Dutch,\n           ready to mount his horse hesitates, but doesn't move to\n          help.\n          150 PIKE STRUGGLES TO HIS FEET. None of them move forward\n          to help him and he doesn't expect them to. He is\n          visibly miserable as he recovers the reins of his\n          animal and tears off the.broken leather.\n          151 LYLE AND TECTOR GRIN A LITTLE. Sykes turns away.\n\n<b>          TECTOR\n</b>\n<b>          (PIOUSLY)\n</b>          'Pears 'Brother Pike' needs help,\n          Brother Lyle.\n\n<b>          LYLE\n</b>          Riding with 'Brother Pike' and old\n          .man Sykes makes a man wonder if it\n          ain't time to pick up his chips\n          and-find another game.\n\n<b>          TECTOR\n</b>          (suddenly yelling\n          at Pike)\n          How in hell are you going to side any-\n          body if you can't get on a horse.\n          152 PIKE LOOKS AT THEM, THEN STEPS onto the makeshift stirrup\n          and mounts, concealing his pain, taking a few seconds to\n          gather up the reins and position himself. In the b.g.,\n          Dutch swings onto his horse.\n\n<b>          PIKE\n</b>          Were about two hours from the\n          Santa Caterinas.\n          He turns and rides toward the mountains, the men following.\n\n<b>          153 SYKES RIDES UP BESIDE PIKE\n</b>\n<b>          SYKES\n</b>          That was a mighty fine talk you\n          gave the boys 'bout stickin' to-\n          gether.\n          (as Pike doesn't\n\n<b>          ANSWER)\n</b>\n<b>          CONTML ED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          40.\n</b>\n<b>          153 CONTINUED\n</b>\n<b>           SYKES (CONT'D)\n</b>          That Gorch was near killin' me\n          or me him --\n\n<b>          (THEN)\n</b>          Damned old fool like me's not worth.\n          takin' along.\n\n<b>          PIKE\n</b>          We started together -- we'll end it\n          together.\n\n<b>          SYKES\n</b>          By God, that's the way I see it --\n          that's the way it's always been with\n          me...Sorry 'bout Deke - never\n          figured him that way,\n          (then, as Pike\n          doesn't answer)\n          Back in. San. Rafael -- my boy how' d.\n          he do?\n           They ride for a while in silence as: Pike. thinks this over,\n          finally:. _\n\n<b>           PIKE\n</b>          Your boy2\n\n<b>           SYKES\n</b>          C.L. -- Clarence Lee -- my daughter's\n           boy ---not too bright, but a good boy --\n           He handle higself all right? -- I told\n          him -- you do -- just what Mister Bishop\n          says -- Did he conduct hisself well?\n\n<b>          PIKE\n</b>          (after a long moment)\n          He did fine --\n\n<b>          (THEN)\n</b>          Why didn't you tell me he was your\n          grandson?\n\n<b>          SYKES\n</b>          Well, you had enough on your mind\n          He had to pull his weight just like\n          the rest of us -- just wanted to know\n          he didn't let you down -- run. when\n          things got hot --\n\n<b>          PIKE\n</b>          (after a moment)\n          No ---he did fine...just fine.\n\n<b>          DISSOLVE TO:\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/1./68\n</b>\n<b>          )}1 A\n</b>\n<b>          EXT. BORDER ` R A ILROAD CULVERT AREA) - DAY\n</b>\n          THORN TON AND THE BOUNTY HITTERS follow the wild bunch's\n\n<b>          154\n</b>          trail. They are hot and tired and with the exception of\n          Thornton,.. are apprehensive.\n          Coffer pulls up, calls to Thornton:\n\n<b>          COFFER\n</b>          That culvert -- good place for them\n          ----to make an ambush.\n\n<b>          THORNTON\n</b>          Go on - ride up and find out.\n          Coffer hesitates, his -ayes wide with fear. Thornton draws\n          his gun, pulls back the hammer.\n\n<b>          THORNTO1\n</b>\n<b>          (SAVAGELY)\n</b>          Go onl\n          Coffer rides forward.\n\n<b>          THORNTON\n</b>          (to the others)\n          Next time I want advice from any of you\n          scum I'll ask for it -- until then, keep .\n          your mouths shut and do what y-ou' re to ld%\n\n<b>          COFFER\n</b>          (turning back, calling)\n          All clear\"'--\n\n<b>          155 THORNTON RIDES UP TO THE CULVERTS HALTS, DISMOUN-TS, STEPS\n</b>          INTO the shade, the others follow suit.\n\n<b>          COFFER\n</b>          From here on, its Mexico, Mr, Thornton.\n\n<b>          T.C.\n</b>          Do we follow?\n\n<b>          THORNTON\n</b>          What's the closest town of any size2\n\n<b>          COFFER\n</b>\n<b>          (POINTING)\n</b>          Agua Verde -- maybe two or three days.\n          (then, pointing in the\n          apposite direction)\n          Juarez -- five -- six days hard riding,\n\n<b>           THORNTON\n</b>          What's in Agua Verde?\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          155 CONTINUED\n</b>\n<b>           COFFER\n</b>           Mexicans -- what else.\n           (then quickly, as Thornton\n           turns on him)\n          Headquarters for Huerta regulars.\n          fighting Obregon, led by an old time\n          bandit named Mapache.\n          Thornton thinks about this, then mounts and rides back in\n          the direction they have come from.\n\n<b>          COFFER\n</b>          Don't-we follow?\n\n<b>          THORNTON\n</b>          No -- we wait.\n\n<b>          T.C.\n</b>\n<b>          (MOUNTING)\n</b>          How long --â\u0080¢ Mr. Thornton.\n\n<b>          THORNTON\n</b>          'Twenty-eight days.\n\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT. DESTROYED HACIENDA (SAN CARLOS)-â\u0080¢- DAY\n</b>\n          '156 THE BANDITS ARE RIDING under'a broad sky across through a\n          destroyed pueblo filled with silent ghostlike people, four\n          or five crying children, vultures and four men hanging\n          from a tree. In the distance is a high range of mountains.\n          Angel spurs his horse and rides up beside Pike.\n\n<b>          DUTCH\n</b>          (to Pike)\n          We're not going to find much down here.,\n          That damned Huerta' s scraped it clean.\n\n<b>          ANGEL\n</b>          (in Spanish)\n          May he die the death of a thousand\n          traitors.\n          , ( then)\n          My village is up there ...in those\n          mountains.\n\n<b>          PIKE\n</b>          So --?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          43.\n</b>\n<b>          156 CONTINUED\n</b>\n<b>          ANGEL\n</b>          I wish to visit my f amily...I can do\n          it and meet you in Agua Verde a day\n          of ter you get there.\n\n<b>          PIKE\n</b>          How?\n\n<b>          ANGEL\n</b>          Going this way, you will. have to turn\n          east when you get south of the range...\n          I-know the way to cross the mountains.\n\n<b>          DUTCH\n</b>          If you know a shorter way..': show us.\n          Angel looks away and is silent for several seconds.\n\n<b>          PIKE\n</b>          Ashamed of having us meet your people?\n\n<b>          ANGEL\n</b>\n<b>          (SINCERELY)\n</b>          Yes.;..They don' t know about zny life\n          when I am out of the village.\n          Pike and Dutch both laugh softly, then Pike pulls up at a .\n          watering trough and dismounts as his horse begins to drink.\n\n<b>          PIKE\n</b>          Far as Ifm concerned, you can go,\n\n<b>          LYLE\n</b>          (dismounting, joining\n\n<b>          THEM)\n</b>          Far as I'm concerned -- he goes he\n          dontt come back.\n\n<b>          DUTCH\n</b>          That sounds right to me..\n\n<b>          PIKE\n</b>          Looks like I'm outvoted.\n\n<b>          157 TECTOR JOINS THEM\n</b>\n<b>          TECTOR\n</b>\n<b>          (DISMOUNTING)\n</b>          Whatfs the problem?\n\n<b>          PIKE\n</b>          Wants to visit his folks alone -- thinks\n          we're a little rank for his people.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>          14k.\n\n<b>          157 CONTINUED\n</b>\n<b>          I\n</b>\n<b>          LYLE\n</b>          (as Tector drinks beside\n          his horse)\n          I think he can go straight to hell.\n\n<b>          TECTOR\n</b>          Probably wants to get a bunch of his\n          _people and waylay us!\n\n<b>          DUTCH\n</b>          And take what?\n          Tector thinks this over, doesn't answer.\n\n<b>          PIKE\n</b>          (to Angel)\n          How do' you want it?\n\n<b>          ANGEL\n</b>          (after a long moment)\n          I invite you to my village -- my home.\n          (then, looking at Tector\n          and Lyle)\n          Any violence -- any disrespect -- and\n          I will. kill you.\n          Tector and Lyle look at him without expression for a moment,\n          then:.\n\n<b>          LYLE\n</b>          You got a sister?\n\n<b>          ANGEL\n</b>          ...Yes.\n\n<b>          LYLE\n</b>          I would be proud to.make her acquaint-\n          ance -- and. that of your Mama, too.\n\n<b>          TECTOR\n</b>          (trying not to laugh)\n          And your Grandmaw too, sonny...\n          Angel looks at them, then mounts, rides toward the mountains\n\n<b>          AS-WE:\n</b>\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT. DRY ARROYO -'DAY\n</b>\n          158 THORNTON AND HIS BOUNTY HUNTERS are riding back past the place\n          where Buck died. The men are sullen,. some almost openly\n          defiant.\n\n<b>          CONTINUED)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          45.\n</b>\n<b>          158 CONTINUED\n</b>\n<b>          T.C.\n</b>          We go back with our tail between our\n          legs Harrigan will have our hides.\n\n<b>          THORNTON\n</b>\n<b>          (PATIENTLY)\n</b>          They'll be coming back -- and we'll\n          be waiting for them.\n\n<b>          C OFFER\n</b>\n<b>          (WHINING)\n</b>          We was supposed to go after them --\n          Thornton reins up, looks at Coffer, who looks quickly away.\n\n<b>          THORNTON\n</b>          You have something to say?\n          Coffer instantly lifts his hands in submission and shakes\n          his head. Then, after a moment:\n\n<b>          COFFER\n</b>          They say Freddy Sykes is with them --\n          you rode with the old man, didn't you,\n          Mr. Thornton -- you and Pike and the\n          old man?\n          But Thornton rides on and doesn't answer.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. ANGEL'S VILLAGE - DAY\n</b>\n          159 TECTOR AND LYLE ARE SEATED ON THE GROUND trying to duplicate\n          the intricacies oÂ£ a very complicated cat's cradle demon-\n          strated to them by ROCIO, the lovely bright-eyed 13 year old\n          sister of Angel. Both men are drinking tequilla, but both\n          are sober, entranced and completely dominated by the girl.\n          All three straighten as:\n          160 CARMEN, ANGEL'S MOTHER, CALLS from a nearby fire where she\n           is preparing food with her mother.\n\n<b>          CARMEN\n</b>          Miha -- trigame auga.por los frijolesl\n          The girl jumps to her feet, hands both men a bucket (or olla)\n          and leads.them down the bank to the river. (The natural\n          beauty of this location should contrast with other landscapes\n          in the picture. This village and its inhabitants represent\n          a complete and green contrast to the arid world of the\n          wild bunch),\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CWGE8\n</b>\n<b>          46.\n</b>\n<b>          161 AN GEL AND PIKE SEATED IN THE THATCHED SHADE OF A RAMADA WITH\n</b>\n<b>          DON JOSE, ANGEL'S GRANDFATHER, WATCH SILENTLY. SYKES IS A\n</b>          FEW FEET AWAY. Angel watches dully,. his eyes mirroring his\n          agony. Pike laughs softly, watching.\n\n<b>          PIKE\n</b>          Hard to believe.\n\n<b>          DON JOSE\n</b>          Not so hard -- we all dream of being\n          a-child again -- even the worst of us --\n          perhaps the worst most of all..\n\n<b>          PIKE\n</b>          (looking: at him)\n          You know us, then --\n\n<b>          DON JOSE\n</b>          I know myself only -- where I have been,\n          what I have done.\n\n<b>          PIKE\n</b>          Like to ride with us, old man?\n          And for a moment, the old man's eyes flash as he watches:\n          162- DUTCH AND THREEVILLAGERS SHOEING a very small, very mean\n          16L. mule. All four have been drinking a little and are thoroughly\n          enjoying themselves as is the mule as he pitches and knocks\n          them all sprawling..\n\n<b>          DON JOSE\n</b>          -- I am too old.\n          (almost cursing, indicating\n\n<b>          SYKES)\n</b>          .Too old even to ride beside this\n          ancient gringo.\n\n<b>          165 SYKES LAUGHS AND DRINKS\n</b>\n<b>          SYKES\n</b>          Hell, you ain't so old; partner.\n\n<b>          166 ANGEL STANDS, TURNS TO THEM\n</b>\n<b>          ANGEL\n</b>\n<b>          (BITTERLY)\n</b>          And the soldier. who shot my father\n          what was his name?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          .? .\n</b>\n<b>          166 CONTINUED\n</b>\n<b>          DON JOSE\n</b>          They were many -- who shot -- your father\n          resisted like a man and died like a man --\n          names in this matter have no importance.\n          (to Pike proudly)\n          I killed one;\n           (as Pike looks at him)\n          I lie -- I ran --\n\n<b>           SYKES\n</b>          Joe --'by God I like you. I like a\n          man who tells the truth.\n\n<b>          ANGEL\n</b>\n<b>          (IMPATIENTLY)\n</b>          And the leader -- how was he called?\n\n<b>          DON JOSE\n</b>          (after a moment)\n          Mapache.\n\n<b>          ANGEL\n</b>          That is.name enough.\n\n<b>          PIKE\n</b>          The Federal. troops they don? t.\n          protect you --\n\n<b>           ICON JOSE\n</b>          They were Federal troops; -- commissioned\n          by the traitor Huerta -- seven of the\n          village were killed --.our horses and\n          cattle and corn stolen -- all in the name\n          of Huerta, the killer of our President\n          Francisco I.. Madero -- In Mexico, Senor -\n          these are the years of sadness.\n\n<b>          ANGEL\n</b>          (after a long moment,\n\n<b>          STANDING)\n</b>          And Teresa?\n\n<b>          DON JOSE\n</b>          Gone.\n\n<b>          ANGEL\n</b>\n<b>          (WHIRLING)\n</b>          They took her?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          4$ .\n</b>\n<b>          166 CONTINUED\n</b>\n<b>          DON JOSE\n</b>          No -- she went with them because she\n          wished to. She became the woman of\n          Mapache -- and others -- she went with\n          them laughing -- Drunk with wine and love.\n          Angel, knowing it's true, turns and moves away. Pike looks\n          after him.'\n\n<b>          167 DON JOSE HANDS SYKES THE BOTTLE, SYKES DRINKS, HANDS IT TO\n</b>           PIKE who drinks.\n\n<b>           DON JOSE\n</b>           To him she was a goddess. To be wor-\n           shipped from afar -- with music and\n           flowers -- a deity to be followed and\n           adored at a dis -nee but Mapache\n           -' knew she was a mango -- ripe and waiting...\n\n<b>          PIKE\n</b>          -So Angel lives with a dream -- while\n          Mapache eats the mango --\n\n<b>          DON JOSE\n</b>          Just so -\n\n<b>          ( THEN)\n</b>          You have been there -- with the dream?\n\n<b>          PIKE\n</b>          Many times -- and with the mango too.\n\n<b>          SYKES\n</b>\n<b>          (CACKLING)\n</b>          You just bet he has, Joe.\n\n<b>          PIKE\n</b>          I never could carry a candle to you,\n          old timer.\n\n<b>          DON JOSE\n</b>          (to Pike)\n          And. which do you prefer, the dream or\n          the taste?\n\n<b>          PIKE\n</b>          I dream when I sleep -- and eat when\n          I'm hungry.\n\n<b>          DON JOSE\n</b>          (laughing with Sykes)\n          Just so â\u0080¢ -- the both of you and Map-ache\n          and I --\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          49.\n</b>          168 ANGEL, SOME DISTANCE AWAY, watches evening come upon the\n          quiet village and watches:\n          169 TECTOR AND LYLE moving from the pond carrying water, now\n           surrounded by a dozen laughing children.\n          70 DUTCH AND THE THREE OLD MEN trying to pound a horseshoe\n          an the mule.\n          1.71 HIS MOTHER AND GRANDMOTHER AND other village women now\n           basting a kid cooking over the coals and:\n          172 PIKE,. SYKES AND HIS-GRANDFATHER laughing in the ramada.\n          17 3 ANGEL TURNS AWAY, his eyes suddenly blind with tears,.\n          Then,-turns and crosses to his Grandfather..\n\n<b>           ANGEL\n</b>          Where is Mapache?;\n\n<b>           CUT TO:\n</b>\n<b>          EXT..-RAILROAD YARDS\\ SAN RAFAEL. DAY (SUNSET EFFECT)\n</b>\n          '17L. THORNTON LEADS THE BOUNTY HUNTERS ALONG THE RAILS toward the\n          bunkhouse. They have been riding a long time. The men are\n          tired and bitter. Suddenly Coffer draws his gun and points\n          it at Thornton's back.. For a moment it. looks as if he will\n          shoot, then Thornton pulls up sharply,. and kicks his. horse\n          to one side as:\n\n<b>          175 HARRIGAN STEPS OUT OF THE BOXCAR (OR STATION OFFICE)\n</b>           stands waiting. Coffer's gun has disappeared.,\n\n<b>           THORNTON\n</b>           Ride ahead, all of you.\n           And they do, riding toward Harrigan as we.,\n\n<b>           CUT TO:\n</b>\n<b>           EXT. ANGEL 'S VILLAGE - NIGHT\n</b>\n          176 MOST OF THE VILLAGE IS gathered around three or four fires\n           eating the young goat meat... drinking tequilla and mescal,\n          - watching:.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE'.\n</b>\n<b>          2/ ,2/68\n</b>\n<b>          50.\n</b>          177 TECTOR AND LYLE dance a Mexican Virginia reel as\n          178 SYKES BLOWS ACCOMPANIMENT with harmonica along with two\n           of the local guitar players.\n\n<b>          179 THE VILLAGERS CHEER THEM ON, THEN TWO PRETTY GIRLS (ANNA\n</b>           AND LINDA) JUMP UP and. dance with the- Gorch brothers,\n           learning the steps from the willing, if surprisingly\n          bashful, teachers.\n\n<b>          180 PIKE, A PIECE OF GOAT MEAT IN HIS HAND LISTENS TO. THE-\n</b>\n<b>           MURMURING OF CARMALITA, A RATHER PLUMP AND QUITE PRETTY\n</b>           YOUNG GIRL, seated between him and Dutch. Angel, across.\n           the fire, raises his voice and repeats the question:.\n\n<b>          ANGEL.\n</b>          You must tell me.- where Map ache?\n\n<b>          181 HIS GRANDFATHER, WATCHING PIKE AND DUTCH AND CARMALITA,\n</b>          laughing softly to himself, finally turns, his smile fading.\n\n<b>          DON JOSE\n</b>          Why do you wish to know -- for your\n          father - or the whore?\n          Pike looks up as Angel fights within himself to find an\n          answer,\n\n<b>          PIKE\n</b>\n<b>          (FINALLY)\n</b>          It doesn't make any difference, kid\n          our business is in Agua Verde\n          For a moment Angel looks like he will explode, then he\n          lifts a bottle of tequi.lla in salute to Pike.\n\n<b>          ANGEL\n</b>          As you say, Jefe - to Agua Verde and\n          'our business.'\n\n<b>          CUT TO:\n</b>\n<b>          EXT.. AGUA VERDE PLAZA - DAY\n</b>\n          182 PIKE AND THE-OTHER It N ARE WATERING THEIR HORSES under the\n          shade of several large trees in the main plaza of Agua Verde,.\n          The town itself is dull and sun colored like. the surrounding\n          country. Its most remarkable features are a great deal of\n          soldiers exiting and entering a cantina-like building and\n          a small, aging, ornate, church.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          51.\n</b>          18 3 SYKES PURCHASES A TACO FROM A SMALL BOY and gums at it\n          while the contents run into his beard.\n          18. PIKE LIFTS A STIRRUP FROM HIS SADDLE on the hitching rail\n           and examines the repair, then puts it on his horse. Tector.\n           and Lyle squat in the shade working at making a cat's cradle.\n           Angel is talking quietly to three Mexican peons some distance\n          away. â\u0080¢.\n          185 DUTCH LEAVES. THE BUILDING and joins Pike.\n\n<b>           DUTCH\n</b>           All soldiers - not a bounty hunter\n           in sight.\n\n<b>          PIKE\n</b>          We'll go. have a drink, then try and\n          sell the horses.\n\n<b>          SYKES\n</b>          'Who'.s going to buy -- looks to me like.\n          this place has been picked clean.\n\n<b>          ANGEL\n</b>          (joining Pike)\n          He's been here;\n          186 THE HORSES PUT THEIR EARS BACK and whinny nervously as an\n          incredible noise is heard off scene. The men snap their\n          heads.around and look at:\n\n<b>          187 A HUGE CLOUD OF DUST FROM THE EDGE OF T1 014N MOVING DOWN THE\n</b>          STREET towards the plaza. Inside is the almost ghostlike\n          appearance of a 1912 or 1913 touring car. Four mounted men\n          are riding on each side and a host of small.children are\n          running, screaming, behind it.\n\n<b>          188 THE CAR PULLS UP IN FRONT OF THE CANTINA-LIKE BUILDING.\n</b>\n<b>          SIX MEN GET OUT AND TWO OF THEM INSTANTLY BEGIN DUSTING\n</b>          AND POLISHING. The mounted guards. take up positions around\n          the vehicle. The group shows deference to a large man\n          wearing general's braid. -EL 'MAPACHE. Next to him is his\n          second in command, ZAMORRA. The third man dressed in white\n          linen is MOHR, a German military advisor. With him is ERNST,\n          his aide.\n          189 PIKE AND THE OTHERS WATCH with interest as the men enter a\n           cantina-like building. Then without a word they cross the\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          52.\n</b>\n<b>          189 CONTINUED\n</b>          street, drawn to the vehicle. Angel is tense, knowing\n          that his man has arrived.\n\n<b>          PIKE\n</b>          I seen one just like this in Waco...\n\n<b>          LYLE\n</b>          Run on steam?\n\n<b>          PIKE\n</b>          No...alcohol:...or gasoline.\n          190 FREDDY SYKES EDGES UP CLOSE TO PIKE. He is anxious to make\n          a. statement and he speaks to him as he walks around the car.\n\n<b>          SYKES\n</b>          Pike... .I heard about one they got up\n          north that. kin fly;\n          Pike nods sagely. Te.ctor Gorch on the other side of the\n          car hears the remark.\n\n<b>          TECTOR\n</b>\n<b>          (SCORNFULLY)\n</b>          .That was a balloon ,you damned old fool.\n\n<b>          PIKE\n</b>          No,. the old man's right. They -got t em\n          now with motors and wings -- cover 60\n          miles in less than an hour...goin' to\n          use them in the war, they say.\n          (as T(ector looks at\n          him astonished)\n          This could cover. 30 miles in an hour --\n          ' cording to the road, of course.\n\n<b>          DUTCH\n</b>          That could run a horse right into the\n          ground.\n\n<b>          PIKE\n</b>          Not that easy -- these automobiles can't\n          stand.any rough ground -- or hot sun\n          like a horse ---they're for show mostly.\n          191 TECTOR TOUCHES A FENDER AND ONE of the guards spurs toward\n          him, cursing in Spanish. Tector backs off,. hands in the air.\n\n<b>          TECTOR\n</b>          I was just going to touch th.,e damn\n          thing, not marry it.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          53.\n</b>\n<b>          191 CONTINUED\n</b>\n<b>           ANGEL\n</b>           Un gigante de miquina -- Ha de tenor\n           una fuerza tremenda.\n           (A giant of a machine -- What force it\n           must have)\n\n<b>           GUARD\n</b>           -La fuerza.do 1,000 caballos.\n           (The force of 1,000 horses.)\n\n<b>          ANGEL\n</b>          Y el dueno -- un general por lo menos.\n          (And the owner -- a general at least.)\n\n<b>          GUARD\n</b>          Mapache? Mis que un general - un hombre\n          hecho para reinar todo Mexico, si Dios quiere.\n          (Mapache? More than a general -- a man\n          to.rule all of Mexico if God wills.)\n\n<b>          192 ANGEL SMILES AT THE MAN, TURNS AND CROSSES TOWARD. THE\n</b>\n<b>          CANTINA. PIKE STOPS HIM.\n</b>\n<b>          PIKE\n</b>          You're here with us,pardner -- any\n          business you got with the general comes\n          after we finish ours -- and that is\n          selling horses..\n\n<b>          ANGEL\n</b>          (after a moment, shrugging)\n          As you wish.\n          He turns away, Pike grabs him, jerks him back,\n\n<b>          PIKE\n</b>\n<b>          (GENTLY) _\n</b>          You make.one move to trouble and I'll\n          -kill you -- understand -- we stick\n          together.\n\n<b>          DUTCH\n</b>          (before Angel can answer)\n          Angel -- who does this thing belong to?\n\n<b>          ANGEL\n</b>          (with due respect)\n          Es el carrazo oficial de.su excelencia\n          el Generalisimo Mapache.\n          Dutch turns smiling and tells the others.\n\n<b>          DUTCH\n</b>          The official carrazo of the Pache\n          Generalisimo. CONTINUED\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/32/68\n</b>\n<b>          51..\n</b>\n<b>          192 CONTINUED\n</b>\n<b>          PIKE\n</b>          Let's get some beer and talk to the\n          general about his automobile and our\n          extra horses,,.nice and easy.\n          The men turn and follow him into the cantina.\n\n<b>          INT. CANTINA - DAY\n</b>\n\n<b>          193 THE CANTINA IS A LARGE MANY LEVELED ROOM IN A HALF DESTROYED\n</b>          HACIENDA FILLED WITH MEXICANS wearing the uniforms of\n          Huerta,' s counter-revolutionary army and their ladies,,\n          A small mariachi band wanders among the. tables. playing folk.\n          songs of the era. In certain areas horses are stabled.--\n          a blacksmith shop is working, guns are being repaired, knives\n          and bayonets sharpened..,and food is being cooked for the\n          troops by their women. Kids, as .always,. are very evident.\n          19L. MAPACHE AND HIS GROUP ARE SEATED AT A TABLE which is in' a\n          covered area raised above the others. It is obvious from.\n          his position and respect accorded him that he is the local\n          .boss of the area.' The German officer, Mohr, and Ernst, are\n          'sitting on one side of him. Lieutenant Zamorra is seated\n          on the other side. Herrera is close by.\n          1.95. PIKE AND THE OTHERS MOVE TOWARDS A CORNER of the cantina\n          eyeing the Mexicans with the kind of caution that men who\n          are vastly outnumbered generally show.. They sit quietly\n          at a table, ignoring the suspicious looks of the soldiers.\n          196 AT MAPACHE'S LONG TABLE, the General and the Germans watch\n          them with pointed interest. Mohr nudges Mapache and asks\n          who they are. Mapache shr ugs -- he doesn't know,\n          197 EMMA, A PRETTY WAITRESS, CROSSES TO PIKE'S table to take\n          their order.\n\n<b>          EMMA\n</b>          Diga?\n\n<b>          PIKE\n</b>          Beers.. six cervesas,\n\n<b>          EMMA\n</b>          Como?\n          Angel remains silent, looking at the General,\n\n<b>          'CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          55.\n</b>\n<b>          197 CONTINUED\n</b>\n<b>          DUTCH\n</b>          Seii cervesas.\n          The girl leaves to' get the order. The men at the table look\n          around the cantina. At a nearby table a group of men are\n          throwing dice and laughing loudly. The mariachis are gather-\n          ing around Mapache.. Lyle shifts in his chair to look at them.\n          198 MAPACHE IS LAUGHING AND DRINKING. The German. leans close\n          to Zamorra and speaks in Spanish.\n\n<b>          MOHR\n</b>          Do you know these Americans?\n\n<b>          ZAMORRA\n</b>          No.\n          The German settles back in his.chair and. begins placing\n          a cigarette in a holder.\n\n<b>          1.99 TECTOR AND LYLE LOOK SUSPICIOUSLY AROUND AT THE MEXICANS\n</b>          in the cantina. The other men tired from the trail only\n          half listen to them as the girl serves beer.\n\n<b>          TECTOR\n</b>          Probably talking about us behind our\n          backs.\n          200 DUTCH TURNS TO PIKE WHO IS QUAFFING a large beer.\n\n<b>           DUTCH\n</b>           I'm down to about twenty in silver...\n\n<b>           PIKE\n</b>           The G3neralisimo has cleaned this part\n          a of the country ...He ought to have it\n          to spare.\n\n<b>          DUTCH\n</b>          Generalisimo hell -- he's just a damn\n          bandit grabbing all he can for himself.\n\n<b>          PIKE\n</b>\n<b>          (GRINNING)\n</b>          Like some others I could mention?\n\n<b>          DUTCH\n</b>          No sir -- we don't.hang nobody or\n          torture them -- I hope the people\n          here kick him and the rest of the scum\n          like him right into-their graves.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          56..\n</b>\n<b>          201 ANGEL SITTING QUIETLY WITH HIS GLASS OF BEER WATCHES\n</b>          MAPACHE, his eyes burning with hatred.\n\n<b>          ANGEL\n</b>          We will if it takes a thousand years:\n          Then suddenly, he reacts to the sound of a girl's voice off\n          scene.\n\n<b>          TERESA\n</b>          Vamos:...te va. gustar el Alenman:\n          Angel. spins around in his chair watching as:\n          202 TWO PRETTY MEXICAN GIRLS, TERESA AND RASA, laughing and\n          giggling, pass-the table.\n\n<b>          ANGEL\n</b>          .Teresa;\n          He reaches out and grabs the better looking of the two by\n          the arm.\n\n<b>          LYLE (OS)\n</b>          Hey,. boy...you know them cuties?\n          Teresa recognizes him,: then pulls away,\n\n<b>          TERESA\n</b>\n<b>          DEFAME:\n</b>\n<b>          ROSA\n</b>          Llamo los otros!\n\n<b>          TERESA\n</b>          No, Vete, ahorita vengo;\n          Pike and Dutch tense as Angel stands and jerks her toward\n          him, -\n\n<b>          PIKE\n</b>          Let her go!\n          203 ANGEL LOOKS AT THE GIRL, furious and hurt..\n\n<b>          ANGEL\n</b>          Djaste el pueblo;\n\n<b>          TERESA\n</b>          Si deje el pinche pueblo. Y ahora\n          vivo con el generalisimo;\n          She jerks away from Angel and starts toward the other table.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          57.\n</b>\n<b>          203 CONTINUED\n</b>          Angel. watches her go. In the b.g.,the group of Mariachis\n          playing loudly have moved around Mapache's table.. No one\n          there seems. to have seen the action.\n\n<b>          PIKE\n</b>          Take it easy!\n          He places a hand on Angel's shoulder.\n\n<b>          DUTCH\n</b>          (to Angel)\n          Que pasa::\n\n<b>          PIKE\n</b>          His sweetheart --\n\n<b>          ANGEL\n</b>          (still. watching Teresa)\n          \"She was my woman and she left the\n          village.,\n\n<b>          20L . TERESA SPLITS THE MARIACHIS AND STEPS-UP BESIDE EL MAPACHE\n</b>          and begins kissing his ear..\n\n<b>          TECTOR\n</b>\n<b>          (LAUGHING)\n</b>          Sure ain't your woman no more.'\n\n<b>          LYLE \"\n</b>          Just look at her licking that, big devil's ear.\n          Angel watches, his rage growing, then stands -- Pike goes\n          for-him., .. but too late..\n\n<b>          ANGEL\n</b>\n<b>          (HISSES)\n</b>          Put a!\n          In a split second he draws and fires.\n\n<b>          205 TERESA HAS JUST'S.TARTED TO SIT ON THE BIG MAN'S LAP WHEN\n</b>\n<b>          THE BULLET FROM THE FORTY-FIVE CATCHES. HER IN THE STOMACH\n</b>          and hurls her to the floor. The others at the table duck\n          for cover, their guns coming out.\n\n<b>          206 ANGEL IS STARING AT THE GIRL AS PIKE T\"EROWS A PUNCH DIRECTLY\n</b>          into the side of his head dropping him onto the floor, knock-\n          ing him out. The others stand, hands an -theirguns,\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          58.\n</b>\n<b>          207 THE ENTIRE AREA IS COMPLETELY SILENT. SEVERAL SOLDIERS\n</b>\n<b>          ARE STANDING WITH THEIR GUNS COVERING PIKE AND THE OTHERS.\n</b>          Mapache and the'others slowly rise, look at Angel, now\n          realizing who shot the girl.\n          208 MAPACHE STARTS TOWARDS THEM. He pushes over chairs and shoves\n          people aside as he approaches the group. Zamorra9 the Germans\n          and other members of his retinue are close on his heels.\n\n<b>          209 PIKE AND THE OTHERS ARE SILENT AND UNMOVING AS MAPACHE STEPS\n</b>          up to the'table and quickly scans the group.. Angel gets to\n          his knees9 Mapache kicks him in the.head and when Angel. falls\n          back, stamps him several times with his boot,, steps away.\n          One of Mapache's men starts to bash Angel's head with a rifle`\n          butt,. Mapache stops the man with a gesture,. then turns to\n          the others.\n\n<b>          MAPACHE\n</b>          Qua basura es este?\n          Mapache again. kicks Angel..\n\n<b>          ZAMORRA\n</b>          Why did he try to kill His Excellency...?\n\n<b>          PIKE\n</b>          He didn't, he was. after the girl...\n          Mapache is having difficulty understanding. He looks at\n          Z'amorra with a puzzled expression.\n\n<b>          ZAMORRA\n</b>          La.muchacha,..\n\n<b>          DUTCH\n</b>          Era su novia;\n          The Mexicans immediately respond to Dutch's explanation.\n          Both Z.amorra and Mapache smile.\n\n<b>          O MAP ACHE\n</b>\n<b>          (PLEASED)\n</b>          His fiancee??...\n\n<b>          PIKE\n</b>          He went a little crazy when he saw\n          her with you.\n          Mapache laughs. His ego is pleased with the idea that.he\n          had taken someone's woman. He turns and explains grandly\n          in Spanish to the rest of. the cantina.\n\n<b>          MA PA CHE\n</b>          Mato su vieja porque salio con El Mapache;\n          The soldiers in the cantina laugh and ad lib their response..\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          59.\n</b>          210 PIKE. AND DUTCH TRY TO SMILE as do the Gorch brothers and Sykes.\n          211 MOHR IGNORES them, looking with interest at the U.S..Army\n          .45 pistols that the men are wearing.\n\n<b>          MOHR\n</b>          (.to Pike)\n          Are you men in Agua Verde for business?\n\n<b>          PIKE.\n</b>          Thought we might sell a few horses.\n\n<b>          MOHR\n</b>          You must have been associated with\n          the American Army, is that riot so?\n          Tector and Lyle snicker slightly at the remark. Mapache and\n          Zamorra turn, listening carefully to the conversation.\n          The cantina is silent.\n\n<b>          DUTCH\n</b>          -No -- were not associated with anyone...\n\n<b>          MOHR\n</b>          I see,..1 was curious because of.the\n          equipment which you are carrying.\n          (as they look at him)\n          That pistol is restricted for use'by\n          army personnel. It can't be purchased\n          or even owned... legally.\n\n<b>          -PIKE\n</b>\n<b>          (GUARDEDLY)\n</b>          Is that so? - -\n\n<b>          MOHR\n</b>          You're surprised at my interest?\n          (then as Pike doesn't answer)\n          Weapons are a specialty of mine.\n          Mohr bows his head slightly and clicks his heels barely audib3y,\n\n<b>          MOHR\n</b>          I am Commander Frederick Mohr-of the\n          Imperial German. Army. For the last six-\n          months I have been in Mexico helping\n          fight against the revolutionaries.\n          212. ANGEL ON THE FLOOR IS CONSCIOUS, but uimoving., listening to\n          what is being said. Several of Mapache's men stand around him.\n\n<b>          MOHR\n</b>          Unfortunately your government has chosen\n          to aid the rabble in their so-called\n          struggle for liberty...\n\n<b>          PIKE\n</b>          I. never heard of any American troops\n          fighting down here...\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          60.\n</b>\n<b>          212 CONTINUED\n</b>\n<b>          MOHR\n</b>          They are aiding in diplomatic channels...\n          It would be very useful to us if we knew\n          of Americans who did not share their\n          government's naive sentiments.\n\n<b>          PIKE\n</b>          We have vez\"y'few sentiments in common\n          with our government.\n\n<b>          MAPACHE\n</b>          Qua diga?\n\n<b>          MOHR\n</b>          (Xn Spanish)\n          Generalisimo, I think we should ask\n          these gentlemen to have a drink with us.\n          And Pike, understanding. that much Spanish, smiles as we.\n\n<b>          DISSOLVE TO:\n</b>\n<b>          INT. BAR - NIGHT\n</b>\n\n<b>          213 A MARIACHI IS BLOWING HARD AND SAD INTO A TINY BRASS\n</b>          TRUMPET AS he looks at the body of Teresa being dragged\n          out. Emma and.Rosa'are still very much in evidence..\n          214 AT MAPACHE'S TABLE, PIKE, DUTCH, LYLE, TECTOR AND SYKES are\n          all seated at the raised table on the dais..,. Mapache seated\n          at one end is tired and looks half asleep,.\n          In the b.g. Angel can be seen still on the floor. A couple\n          of guards are sitting near him.\n          2,15 SEVERAL MARS. ARE SPREAD OUT on the table.\n          Emma and Rosa crying softly, watch as the dead body of the\n          girl. is dragged through a door at one end of the room.\n          Zamorra is seated.next to the German listening intently,\n\n<b>          PIKE\n</b>          Of all those garrison rail spurs that\n          ofie is the easiest to hit -- But I've\n          got to figure where we can get out with.\n          the wagon.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          61.\n</b>          216 HE POINTS TO A PLACE ON THE MAP, looks at Dutch who shrug,\n          doubtfully,\n\n<b>          DFTCH\n</b>          (to ZRmorre)\n          Why do you want us to\n          hit a train that's so close to the\n          border ...The General could take an\n          army up there and get it.\n\n<b>          MOHR\n</b>          President Huerta is anxious to better\n          relations with the U.S. -- not destroy\n          them. -\n\n<b>          PIKE\n</b>          Arms shipments are generally. kept secret\n          ...how did you find out about this one?\n\n<b>          ERNST\n</b>          Mapache has a superb intelligence force..\n          (indicating Mohr)\n          Organized under the supervision of my\n          superior officer.\n\n<b>          ZAMORRA\n</b>          (drinking, laughing)\n          Gentlemen., we are quite well organized\n          and well able to pay $10,000 in gold.\n          (asâ\u0080¢ they react)\n          If you are not able to do the work we\n          will find someone else,\n\n<b>          PIKE\n</b>           ' (as the others react)\n          I -- we can do 'it , , ,\n\n<b>           (THEN)\n</b>          But we're going to need special equipment.\n\n<b>          ZAMORRA\n</b>          Our accountant will arrange everything.\n\n<b>          SOHR\n</b>          (smiling at Mapache)\n          Soon you will be the best armed general\n          in Mexico.\n          Mapache raises his glass In a toast,\n\n<b>          MAPACHE\n</b>          A la conquistat.,.\n          Pike nudges Lyle who raises his glass; the other men follow\n          suit. Mohr smiles and elegantly raises a drink.\n\n<b>          CONTINUM)\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          62.\n</b>\n<b>          216 CONTINUED\n</b>\n<b>          MOHR\n</b>\n<b>          PROSIT\n</b>\n<b>          ERNST\n</b>          Prosit:a I\n          217 PIKE AND DUTCH.DRINK, put down their glasses.\n\n<b>          PIKE\n</b>          With your permission ...I need a bath.\n\n<b>          ERNST\n</b>\n<b>          (GRINNING)\n</b>          With my permission -- You all need a\n          bath.\n\n<b>          LYLE\n</b>          Well,. .I don't need no bath...Tector\n          and me need'some of them senoritas.\n          (to Zamorra)\n          How 'bout that boy, can you fix us up?\n\n<b>          ZAMORRA\n</b>          Porque no?\n          Zamorra yells to JUAN. JOSE, an aide, standing nearby.\n\n<b>          ZAMORRA\n</b>          Oye!...Traeles unas viejas! Andale!\n\n<b>          MOHR\n</b>\n<b>          (STANDING)\n</b>          Gentlemen, you will excuse me, I'm\n          sure.\n\n<b>          21$ PIKE AND DUTCH LOOK AT HIM,. THEN STAND.\n</b>\n<b>          DUTCH\n</b>          I'm sure.\n          219 DUTCH FOLLOWS PIKE TO ANGEL where they lift him off the\n          floor.\n\n<b>          PIKE\n</b>          We better get him cleaned up...\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          63.\n</b>          220 MAPACHE CROSSES QUICKLY TO THEM, drawing his gun.\n\n<b>          PIKE\n</b>          Por favor, General -- but I need him.\n\n<b>          MAPACHE\n</b>          I\"give you someone much better.\n\n<b>          PIKE\n</b>\n<b>          (FLATLY)\n</b>          I choose my own... withyour permission.\n          Zamorra joins Mapache, looks at Pike whose hand is close to\n          his. gun, turns to the General.\n\n<b>          -ZAMORRA\n</b>          Mi jefe, deje que se lo lleven..\n          Mapache replaces his gun.\n\n<b>          MAPA CHE\n</b>          Take him. It is not important to\n          me -- take him!'\n          Then he.looks away as:\n\n<b>          221 JUAN JOSE APPROACHES THE TABLE.WITH TWO BEAUTIES, ANNA\n</b>          and LUCHA. Lyle and.Tector turn.and react with delight.\n\n<b>          TECTOR\n</b>          Hey! ...Here come our sweeties!\n\n<b>          LYLE\n</b>          (laughing softly)\n          More than enough to go around...\n          (as one girl sits\n          on his lap)\n          And then some!\n          He turns\" and beckons to Pike and Dutch who, with Sykes, are\n          carrying Angel out of the saloon, but they ignore him.\n\n<b>          CUT TO:\n</b>\n<b>          IN-T. BOX CAR DAY\n</b>\n<b>          222 HARRIGAN AND THORNTON ARE SEATED AT A TABLE STUDYING PAYROLL\n</b>          SCHEDULES. MUNITION SCHEDULES AND NAPS. The other bounty\n          hunters are scattered around the car grumbling about the\n          inaction.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          614..\n</b>\n<b>          222 CONTINUED\n</b>\n<b>          HARRIGAN\n</b>          And you want to gamble everything this\n          one shipment will be attacked?!\n\n<b>          THORNTON\n</b>           If they're in Agua Verde that's what\n          - --they'll go for.\n\n<b>          HARRIGAN\n</b>          If?! Why not Juarez?\n\n<b>          THORNTON\n</b>          Because we would have heard::.\n          (then, patiently)\n          If they are in Agua Verde they will have\n          seen Mapache.\n\n<b>          HARRIGAN\n</b>\n<b>          (DISGUSTED)\n</b>          And.who in the hell_is Mapache?\n\n<b>          THORNTON\n</b>          A killer for Huerta who calls himself\n          a.general.-- with enough guns he can\n          become a power in northern Mexico -\n          my guess is Pike will try and get\n          them f or â\u0080¢ him.\n\n<b>          HARRIGAN\n</b>          The train will be guarded by regular\n          troops!!\n\n<b>          THORNTON\n</b>          Not regulars --.green recruits and not.\n          worth a damn! I'll need twenty trained\n          men -- not recruits or this gutter trash\n          you.'ve given me.\n\n<b>          HARRIGAN\n</b>          You'll get the job done with what you\n          have -- that'p our bargain.\n          (then looking at the\n\n<b>          CALENDAR)\n</b>          Twenty-four days.\n\n<b>          CUT TO:\n</b>\n<b>          INT. STEAM HUT - DAY\n</b>\n\n<b>          223__ AN ANCIENT WOMAN POURS A BUCKET OF WATER ONTO THE STONES IN\n</b>\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          65.\n</b>\n<b>          223 CONTINUED\n</b>          GENTER OF AN ADOBE STEAM HUT. The structure is about twenty-\n          five feet in diameter with a small. open oven in the center\n          surrounded by a great deal of rocks. Light comes in through\n          a tiny hole in the center of the ceiling which also allows\n          smoke to escape.\n          PIKE, ANGEL AND DUTCH are sitting on a bench against one\n          wall. Angel has been cleaned up, but looks beaten.\n          225 SYKES IS IN ONE CORNER, thoroughly enjoying himself.\n          The men are all nude and stark white against the mud.' color of\n          the walls. As the woman exits, Dutch stands and empties a\n          bucket of water over' himself -and the others. They all gasp\n          with relief. All have towels around their waists and none\n          are completely sober. Pike's leg is heavily scarred and he\n          is in pain. He stands and drinks, gets closer to the fire9\n          massaging his leg.\n\n<b>          DUTCH\n</b>          I don't see how you stand it\n\n<b>          PIKE\n</b>          Some day I'm going to build me one of\n          these and live in it.\n          (then to Angel)\n          I don't know why I â\u0080¢ didn' t just let him\n          kill you.\n\n<b>          ANGEL\n</b>\n<b>          ( IRATE)\n</b>          I'm not going to steal guns for that\n          devil to rob and kill my people again.\n\n<b>          DUTCH\n</b>          Very 'noble .\n\n<b>          SYRE S\n</b>          I didn't see no tears runnin' down your\n          face when you rode in from San Rafael.\n\n<b>          ANGEL\n</b>\n<b>          (ANGRY)\n</b>          They were not my people -- nor yours --\n           I care about my people, my villag.e,\n          Mexico.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          65A.\n</b>          226 ANGEL GETS UP OFF THE BENCH and dumps a bucket of water on\n           his head. Pike looks at. Dutch. Both drink from a bottle.\n\n<b>           SYKES\n</b>           Listen, bog, you ride the trail with\n           us your village don't count -- if it\n           does- -you jest don't go along.\n\n<b>          ANGEL\n</b>          Then I don't go along!\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          66.\n</b>          227 PIKE AND DUTCH LOOK AT ANGEL through the steam.\n\n<b>          DUTCH\n</b>          One load of guns isn't going to stop him\n          from raiding villages.. You ought to be\n          thinking about all that money you'll have.\n\n<b>          PIKE\n</b>\n<b>          (EXPANSIVELY)\n</b>          Take them a large bag of gold when it's\n          over.\n\n<b>          DUTCH\n</b>          A small bag.\n\n<b>          PIKE\n</b>          Move them a thousand miles away and buy\n          them a ranch --. two -- three, ranches.\n\n<b>          DUTCH\n</b>          One -- a very Small ranch.\n\n<b>          ANGEL\n</b>          They'll never leave...You see, it's\n          their land -- and no one will, ever\n          drive them away.\n\n<b>          SYKES\n</b>          (sblemnl4),\n          I'll drink to that sentiment -- and to.\n           love --\n           (singing softly)\n           But when all is said and done --\n           I!11 drink to -- gold.\n\n<b>           DUTCH\n</b>           Salud'.\n\n<b>           CUT TO:\n</b>\n<b>           INT. BODEGO - NIGHT\n</b>\n          228 IT IS LONG AND NARROW AND SHADOWY and Lyle, Tector and their\n           two ladies are exploring it very carefully and with great\n           dignity -- candles in hand.\n\n<b>           LYLE\n</b>           The dons of Spain built-this some three\n           hundred years ago --\n          He belches, then looks about in awe at the huge casks.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          67.\n</b>\n<b>          228 CONTINUED\n</b>\n<b>          TECTOR\n</b>          Itm all for them dons'.\n          229 TECTOR SUDDENLY SWINGS A MATTOX ON TO a six foot cask\n          which rests on top of two others of equal height, it\n          bounces out of his hand. He draws his gun and fires as\n          does Lyle. Liquid gushes down.\n          229A LYLE STEPS UNDER IT, lifts his face, drinks, then drags:\n          his lady beside him.\n\n<b>          LYLE\n</b>          (as the torrent pours\n          over them removing his\n\n<b>          HAT)\n</b>          Have a dollop, honey -- there's enough\n          here for both of us.\n          And. she does, tasting the good wine:; laughing.\n\n<b>          CUT TO:\n</b>\n<b>          INT. STEAM HUT - NIGHT\n</b>\n\n<b>          230 PIKE AND DUTCH EXCHANGE LOOKS AND HAVE ANOTHER DRINK, AS\n</b>          ANGEL PALES.. Both are ready to write Angel off. and forget\n          about the problem.\n\n<b>          ANGEL\n</b>          Would you give someone a gun to\n          kill your mother, or your father,\n          or your brother?\n          231, DUTCH LOOKS AT PIKE. Pike thinks it over. Both have.\n           another pull on the bottle.\n\n<b>          PIKE\n</b>          Son -- twenty thousand cuts a lot\n          of. family ties.\n\n<b>          ANGEL\n</b>          No -- you gringos are no different.\n          I have seen how Lyle takes care of\n          his brother.\n          He takes the bottle, drinks, then throws it on the rocks.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          68.\n</b>\n<b>          231 CONTINUED\n</b>\n<b>          ANGEL (CONT' D )\n</b>          My people don't have guns so Mapache\n          takes the food out of their mouths\n          and clothes off their backs. With\n          guns my village could fight, If I\n          could take guns to my people I would\n          go with you -- but not just for\n          gold,\n          232 THE MEN ARE MOMENTARILY SILENT. Angel lifts a bucket\n          of water, spills part of it on his head, passes it to Sykes\n          who drinks a little of the water, spits it out, puts the\n          bucket down, pours two bottles of tequilla into it,\n          drinks. again -- smiles, passes it to Angel, who drinks\n          and passes it on.\n\n<b>          DUTCH\n</b>\n<b>          (DRINKING)\n</b>          .Al]. we'd need is for El Mapache to\n          find out we armed some village...\n\n<b>          SYKES\n</b>          Let him find out.' Mr. Bishop --\n          (as P ï¿½ke looks\n          a t\\ him )\n          You know as well as I there ain't no\n          way of collecting from Mapache 'cept\n          off a lot of dead bodies -- mostly\n          ours, the way he thinks.\n          Pike considers this -- looks at the old man, finally\n          nods .\n\n<b>          ANGEL\n</b>          I would take guns ...if Mapache found\n          out, you would say I stole them,\n\n<b>          DUTCH\n</b>          How many cases of rifles did Zamorra\n          say were in that shipment?\n\n<b>          PIKE\n</b>          Twenty.\n\n<b>          DUTCH\n</b>          Give him one.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          69.\n</b>\n<b>          232 CONTINUED\n</b>\n<b>          PIKE'\n</b>          (after a long moment)\n          You can have one case and one case of\n          ammo, You'll give up your share of the\n          gold.\n\n<b>          DUTCH\n</b>          __-He'll have to show up with us. when we\n          deliver..,.\n\n<b>          ANGEL\n</b>          I' will:..\n\n<b>          PIKE\n</b>\n<b>          (SOFTLY)\n</b>          i. know. you will...\n          Then. they all turn as:\n          233 TECTOR AND.LYLE AND THEIR LADIES enter, somewhat wet and\n          stained with wine.\n\n<b>          LYLE.\n</b>          (awkwardly) '\n          I' d like. you to meet my fiancee.\n\n<b>          TECTOR\n</b>          (tears in his eyes)\n          They just got engaged.\n          234 FOR A MOMENT THE GROUP:is frozen,-looking at the.bride to\n          be, her bridesmaid and:the best man. and groom,.. then all\n          stand., together and bow.\n\n<b>          PIKE\n</b>          Pleasure-, Ma' ain.\n\n<b>          ANGEL\n</b>          Tanto gusto, senorita.\n\n<b>          DUTCH\n</b>          Mucho gusto, senorita..\n\n<b>          SYKES\n</b>          (softly to himself).\n          Son of a bitch.\n\n<b>          (THEN)\n</b>          Trot them on in, boys -- I' :m hell on\n          packin' mules, but I'm 'a delight with,\n          .a pretty girl.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          00\n</b>\n<b>          234 CONTINUED\n</b>          Tector and Lyle and their girls look at him as both Pike\n          and Dutch nearly fall off the bench, laughing too hard to\n          drink their health as we:\n\n<b>          DISSOLVE TO:\n</b>\n<b>           EXT. BROKEN DESERT AREA (DEEP ARROYO) - DAY\n</b>\n\n<b>          235 PIKE AND DUTCH ARE RIDING AHEAD OF A LARGE. WAGON (LOADED\n</b>          WITH BARRELS) DRIVEN BY SYKES. The others are riding.\n          behind. The walls of the arroyo tower above the men.\n          Pike is tense in the saddle as the pain in. his leg becomes\n          almost. unbearable.\n\n<b>          DUTCH\n</b>          You never told me how you got all\n          tore up like that...\n          236 PIKE REFLECTS FOR A MOMENT. His face is almost white.;\n          Then he reaches in his saddle bag and pulls out a bottle.\n          He drinks, passes the bottle to Dutch..\n\n<b>          PIKE\n</b>          I met a woman I wanted to marry...\n           Pike 'grins a little at what now seems an absurd thought.\n\n<b>          236A SUPERIMPOSED OVER THE. SCENE IS PIKE IN JUAREZ:\n</b>          INT. KITCHEN v NIGHT\n\n<b>          236B PIKE. COMES IN THROUGH THE KITCHEN-DOOR WITH AN ARM LOAD\n</b>          of groceries and too much to drink.\n          236C AURORA STANDS WAITING FOR HIM. She is very beautiful and\n          very angry..\n\n<b>          PIKE\n</b>          Buenas no the s mi amor.\n          Aurora swings and catches him full handed across the face9\n          the groceries scatter on the floor -- Pike bounces off the\n          wall,. looks at her, tries to grin.\n\n<b>          PIKE\n</b>          Your husband due back?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          71.\n</b>\n<b>          2360 CONTINUED\n</b>\n<b>          AURORA\n</b>          No, never you are late -- two days\n          late.\n          Pike is startled by this, starts to protest, realizes it is\n          true, tries to make apologies. Aurora turns and stalks off.\n\n<b>          LAP DISSOLVE TO:\n</b>\n<b>          INT. KITCHEN - NIGHT\n</b>\n          236D -PIKE IS SHOVING POTS AND PANS AROUND, attempting'to cook\n          dinner, while Aurora sits watching stony faced until he\n          .turns away, then she can hardly keep from giggling.\n\n<b>          AURORA\n</b>\n<b>          (FINALLY)\n</b>          You need help?.\n\n<b>          PIKE\n</b>          No!\n          He picks up a pan with a hot handle, drops it, spilling hot\n          stew or soup on his foot, hops around cursing looking at\n          the shambles on the stove and on the floor.'\n          236DD AURORA STANDS LOOKING AT HIM WITH LOVE, then smiling softly\n          crosses to the side-board and pours him a drink. He takes\n          it, suddenly both are laughing.\n\n<b>          CUT TO:\n</b>\n<b>          INT. BEDROOM - NIGHT\n</b>\n\n<b>          PIKE AND AURORA STAND IN THE SEMIDARKNESS SLOWLY DISROBING.\n</b>          Suddenly Pike embraces her and pulls her to the bed. They\n          begin to make love, then:\n          THE DOOR SMASHES OUN AND LUKE, a skinny bad mouthed Texan\n          steps into the room, a_double barreled shot gun in his\n          hands ready to fire.\n          AURORA SCREAMS and throws herself in front of Pike. Luke\n          fires, the charge killing her as Pike dives out of bed --\n          jumping for his gun on a nearby table.\n          LUKE FIRES AGAIN, the blast catching Pike across the thigh\n          and knee. Pike goes down. Luke crosses to the bed and\n          sits watching him writhing almost bleeding to death on the\n          floor.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          4/23/68\n</b>\n<b>          71A.\n</b>\n<b>          236 1 OVER THE ABOVE IS THE FOLLOWING DIALOGUE:\n</b>\n<b>          PIKE\n</b>          She had a husband and I should have had\n          enough sense to kill him. He wasn't around\n          and I got careless. One night he.walked in\n          on us - - got her with the first shot. He\n          caught me here with the second then the\n          damndd coward turned and ran.\n\n<b>          236J EXT. DESERT AREA - DAY\n</b>\n\n<b>          DUTCH\n</b>          You didn't catch up with him?\n\n<b>          PIKE\n</b>          Not yet but there-hasn't been.a day or an\n          hour that I haven't thought about getting\n          him - - he didn't want that woman he just.\n          wanted to kill somebody - - well, he killed\n           her - - not me and I'll see him dead\n           for it.\n\n<b>          I\n</b>          (Then yelling back)\n          Move along, Freddy - - we've got a long way\n          to go:\n          He turns back to Dutch, takes the bottle,.. drinks deeply and\n          puts it away.\n\n<b>          PIKE\n</b>          This is the last go round - - this time\n          we do it right.\n\n<b>          CUT TO:\n</b>\n<b>          M.\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANCE\n</b>\n<b>          2/27/68\n</b>\n<b>          71B.\n</b>\n<b>          EXT. DESERT - DAY (DAWN EFFECT)\n</b>\n          237 A TRAIN CHUGS ACROSS THE FLAT STRETCH of desert. The small\n          steam. locomotive pushes a flatbed and pulls a succession\n          of three cars.\n          Another flat, a passenger and a cattle. The train moves\n          toward the only object in sight:\n\n<b>          238 A RICKETY TRACKSIDE WATER TOWER AND MAINTENANCE SHOP\n</b>\n<b>          239 IN FRONT OF THE ENGINE TWO ARMY ORDINANCE GUARDS RIDE ON\n</b>          THE-FLAT car, wearily checking the track for obstructions.\n          ON THE SECOND,FLAT CAR TWO MORE ARMED GUARDS sit on crates\n          of weapons and..arnmunition, gazing at the passing scenery.\n\n<b>          INT. PASSENGER CAR - DAY\n</b>\n\n<b>          241 THORNTON AND NINE OTHER BOUNTY HUNTERS SLOUCHED ON THE.\n</b>\n<b>          WOODEN BENCHES.WIDE AWAKE.\n</b>\n<b>          \\-I\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          72...\n</b>\n<b>          214.2 AT THE REAR OF THE CAR, A DOZEN VERY YOUNG ARMY RECRUITS\n</b>           are sprawled across the seats near their beefy first\n           sergeant, FRANK MC HALE who is snoring loudly.\n\n<b>          INT. CATTLE CAR : DAY\n</b>\n\n<b>          214.3. THE CATTLE CAR IS LOADED WITH THE HORSES OF THE SOLDIERS\n</b>\n<b>          AND THE BOUNTY HUNTERS.\n</b>          The soldiers' horses are roach-maned and unsaddled. I\n          At one end of the car, the railroad livestock man is asleep\n          on a pile of straw, an empty jug at his side. The animals\n          of the bounty hunters are standing saddled, with the cinches\n          loosened.\n\n<b>          INT. PASSENGER CAR - DAY\n</b>\n          244 THE TRAIN SLOWS AND A FEW OF THE SOLDIERS. lift their heads\n          and look out the windows.\n           Seeing nothing but the vast empty plain, they quickly resume\n          their slumber.\n          245. THE BOUNTY HUNTERS TENSE.- THORNTON STANDS, looks out...\n          nothing,' but:\n          214.6. A RICKETY WATER TOWER AND TINY maintenance shack -- no horses,\n          wagons, nothing.\n\n<b>          INT. PASSENGER CAR\n</b>\n          214.7 THORNTON TURNS back to his seat.\n\n<b>          EXT.. TRAIN - DAY\n</b>\n\n<b>          248 THE ENGINE PULLS TO A STOP UNDER THE RICKETY TOWER. THE\n</b>          FIREMAN CLIMBS OUT OF THE CAB AND ONTO THE TENDER. He\n          reaches up and grabs the lanyard and lowers the spout.\n\n<b>          219 THE FIREMAN FINDS HIMSELF GAZING DIRECTLY INTO THE BARREL OF\n</b>          A SAWED-OFF SHOTGUN: HELD BY ANGEL. The fireman gasps\n          and-takes a step back.\n          250 ANGEL SLIDES OFF THE SPOUT AND ONTO the tender. He covers\n          the fireman and the `two man crew. The- crew -urns and Angel\n          smiles aiid puts his .f_nger to his l 1ps, then gestures. The\n          firemanand the crew begin to take on grater,\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          73.\n</b>          PIKE, DUTCH AND LYLE step out 'from behind the maintenance\n          shack and climb swiftly onto the tender. Pike slips toward\n          the engine compartment.\n          252. DUTCH TURNS TOWARDS THE GUARDS ON THE flatcar behind the\n          engine.\n          253 LYLE SCRAMBLES AROUND THE ENGINE TO HANDLE the two men on\n          the.flat car in front.\n\n<b>          DUTCH LOOKS DOWN AT TEE GUARDS ON THE SECOND FLAT CAR.\n</b>\n<b>          THEY ARE LOUNGING WITH THE GUNS SEVERAL FEET AWAY.\n</b>          He whistles an.d they look up. While he covers them:\n          255 ANGEL CLIMBS DOWN from the tender onto the flat car over the\n          crates toward the coupling Joining the flat to the passenger\n          car.\n          256 ON THE FRONT FLAT CAR the two- guards turn, freeze as Lyle\n           moves around .the .front of the engine and whistles., his\n           shotgun covering. them.\n          25? IN THE CAB, PIKE IS\\STANDING WITH his hand on the throttle\n           looking up at Dutch.\n          25$. AT THE COUPLING -ANGEL GRABS. THE PIN and starts to pull on it.\n          259 IN THE CAB PIKE. WA TC HESï¿½ DUTCH , WHO WAVES HIS HAND, motion-\n           ing .Pike to ease the train back. Pikes hand moves on the\n          throttle..\n\n<b>          260 THE COUPLING MOVES SLIGHTLY AND. ANGEL LIFTS THE IN.\n</b>\n<b>          -INT. PASSENGER CAR - DAY.\n</b>\n          263:: THORNTON- FROWNS AS THE CAR moves slightly. He stands, and\n           walks toward the front of the car. Through the window on\n          the. door, he sees:\n\n<b>          262 ANGEL SCRAMBLING OVER THE CRATES TOWARDS THE TENDER.\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>          263 THORNTON DUCKS BACK AND STARTS TO DRAW HIS . gun,..: pauses and\n          turns back into the car.' Silently he gestures to the\n          bounty hunters.\n          The soldiers in the back of the car continue to sleep as\n          Thornton and his men move past them toward the horse car.\n          REACHING THE SERGEANT, still snqring loudly, Thornton hesi-\n          tates, then decides against it and enters the horse car.\n\n<b>          265 IN THE CAB, PIKE EASES THE THROTTLE FORWARD.\n</b>          266 THE ENGINE AND. TENDER AND FLAT CAR PULL\" SLOWLY away from\n           the passenger and cattle car.\n\n<b>          267 THE GAP IS BECOMING LARGER BETWEEN THE PASSENGER-CAR AND\n</b>\n<b>          THE FLAT CAR WHEN DUTCH SEES:\n</b>          268 A 'MAN JUMPING A HORSE OUT OF THE CATTLE CAR. It is one of\n          the bounty hunters. Another horse quickly follows. Dutch\n          turns and yells.\n\n<b>          DUTCH\n</b>          They're coming;\n          269 GORCH ON FRONT OF THE. LOCOMOTIVE WHIRLS AROUND and looks\n          back for an instant as Dutch yells. The two guards jump\n           for their weapons. Lyle turns back,'watches them, then\n          kills both as they pick up their rifles.\n\n<b>          270 IN THE CAB, PIKE POURS ON THE COAL.\n</b>\n<b>          271 STEAM POURS OUT OF THE. CYLINDERS AND THE WHEELS SPIN ON\n</b>\n<b>          THE RAILS...\n</b>\n<b>          272 AS THE WHEELS GAIN TRACTION AND TEIE TRAIN LURCHES FORWARD,\n</b>\n<b>          DUTCH PITCHES FORWARD, FALLING OVER THE EDGE BETWEEN THE\n</b>          TENDER AND THE FLAT CAR, turning in the air, catching the\n          tender with his hands and his feet precariously balanced\n          on the coupling.\n\n<b>          273 OVER THE RAILS, DUTCH HANGS ONTO THE IRON HAND GRIP ON THE\n</b>          BACK OF THE TENDER. His feet are bracing him on the bounc-\n          - ing coupling. He is inches above the rail.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          75.\n</b>\n<b>          27I, ON THE FLAT CAR THE TWO GUARDS SCRAMBLE OVER THE CASES\n</b>          AND GRAB THEIR GUNS. They start .forward.\n          275 DUTCH LETS GO and, hanging on with one hand, manages to get\n          his gun out of the holster. He fires blindly over the edge,\n          IN TAE .CAB, PIKE .AND ANGEL WHIRL at the sound of the shot.\n          Pike instantly kicks the engineer and fireman out of the\n          cab, then turns toâ\u0080¢c'limb onto the tender..\n\n<b>          ANGEL\n</b>          (ahead of him)\n          Yo V07;\n          Pike hesitates, then turns back to the throttle.\n          27.6 DUTCH DUCKS AS SHOTS FROM THE GUARD splinter wood nearh=s\n           face.. He is barely able to hang on. and. is slipping down\n          closer to' the rails.\n\n<b>          EXT. PASSENGER CAR - DAY\n</b>\n\n<b>          277 SOLDIERS ARE POURING' OUT OF THE PASSENGER CAR WATCHING:\n</b>\n<b>          278 IN THE DISTANCE THE TRAIN AND THE PURSUING BOUNTY HUNTERS.\n</b>          Hurriedly, they enter the cattle car.\n\n<b>          INT. CATTLE CAR - DAY\n</b>\n          279 A3,. THEY REMOVE THEIR HORSES, SOME TRYING to resaddle in\n          the car.\n\n<b>           EXT. TRAIN COUPLING-\n</b>\n          28.0 DUTCH PULLS THE TRIGGER AND HIS .45 clicks empty..\n\n<b>          281 THE GUARDS. EDGE FORWARD TO FINISH HIM.\n</b>\n<b>          282 ANGEL FIRES AND ONE GUARD DROPS SCREAMING OFF THE FLAT CAR,\n</b>          The other guard panics and scrambles back over the crates.\n          A second shot catches him in the small of the back, hurling\n          him over the edge of the car.\n          283 ANGEL RUSHES FORWARD, and bracing himself on a stanchion,\n          grabs Dutch by the jacket and pulls him aboard.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          76.\n</b>\n<b>          EXT. LIVESTOCK CAR - DAY\n</b>\n          284 THE RECRUITS ARE SCRAMBLING around outsi de.the car. Some\n          are climbing in through the open door. Inside the horses\n          can be heard kicking and neighing.\n\n<b>          SGT. MC HALE\n</b>\n<b>          (SCREAMING)\n</b>          Order; Dammit;,..Corporal9 get those\n          ---men out of that car, ..get the animals\n\n<b>          OUT;\n</b>          (then, looking off)\n          Corporal -- ride back to the telegraph\n          at Todos Malos and tell tam that\n          Pinkerton gang has robbed the train\n          and we are in pursuit:\n          As the corporal mounts and rides off, the sergeant .contin\"--ns\n          to watch:\n\n<b>          285 THE TRAIN ROLLS OFF INTO THE DISTANCE FOLLOWED BY THE\n</b>\n<b>          BOUNTY HUNTERS.\n</b>          286 THORNTON LEADING HIS MEN IS ABOUT a mile and a half behi^c.\n          the train.\n\n<b>          287 THE TRAIN NEARS A WAGON ROAD WITH A NARROW BRIDGE THAT\n</b>          CROSSES IT AND SUDDENLY the wheels lock. With a shower of\n          sparks it slides to a stop beside:\"\n          288 A LARGE WAGON ON THE RIVERSIDE OF THE CROSSING. The\n          bandits scramble off the train and begin loading cases of\n          guns onto the waiting wagon. Sykes and Tector Gorch assist,\n          them. The wagon is directly beside the car and the unload-\n          ing is very rapid.\n\n<b>          289 PIKE CLIMBS TO THE TOP OF THE-.CAB WATCHING:\n</b>          290 THE CLOUD OF DUST OF THE APPROACHING BOUNTY HUNTERS. He\n          yells down to the men:\n\n<b>          PIKE\n</b>          Get the guns off and get on, out of here;\n          He turns and scrambles down inside the cab.\n          Outside the men quickly finish loading and the wagon pulls\n          up alongside the cab.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          77.\n</b>\n<b>          290 CONTINUED\n</b>\n<b>          DUTCH\n</b>          We're ready!\n\n<b>          PIKE\n</b>          Not yet - I want to return e. favor..\n          He.â\u0080¢yanks the throttle into reverse and jumps off the\n          locomotive onto the wagon.\n\n<b>          291. THE HEAVILY LOADED WAGON WINDS DOWN A STEEL TRAIL INTO\n</b>\n<b>          THE CANYON BESIDE THE SMALL RICKETY BRIDGE.\n</b>          In the b.g.., the train picks up speed heading back towards\n          the scene of the robbery.\n\n<b>          292 THE BANDITS PULL THE WAGON UP BESIDE THE RIVER BANK WHERE\n</b>\n<b>          THEY. HAVE. PRE-RIGGED A CABLE CROSSING.\n</b>          In perfect order Dutch and Angel begin attaching the ropes\n          to-the tongue of the wagon as Sykes unhitches.\n\n<b>          293 THE BOUNTY HUNTERS RIDE THEIR HORSES DOWN A: STEEP SLOPE\n</b>\n<b>          AS THE TRAIN RUSHES PAST.\n</b>          29lï¿½ WITH ANGEL LEADING, THE..HORSES ARE PULLED into the river.\n          Large barrels on the side of the wagon serve as floatation\n          gear. The current catches it and begins to swing it on\n          the rope downstream and across the river..\n          295 THE BOUNTY HUNTERS ARE RAPIDLY CLOSING THE GAP. In the\n          distance. they can see the bandits, now in mid-stream,\n          296 OUTSIDE THE CATTLE CAR, RECRUITS ARE LINED UP saddling\n          their horses.\n\n<b>          297 INSIDE, THREE OF THEM ARE STILL CHASID THEIR PANICKY.\n</b>\n<b>          HORSES AROUND.\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>          78 e.\n\n<b>          298 OUTSIDE, A SOLDIER YELLS:\n</b>\n<b>          SOLDIER\n</b>          Sergeant; They're coming back...\n\n<b>          LOOK;\n</b>\n<b>          299 THE ENGINE IS ROARING TOWARD THEM FROM THE DISTANCE.\n</b>\n<b>          MC HALE\n</b>          (realizing what is\n\n<b>          -HAPPENING)\n</b>          Get those horses away from the car!.\n          (running to the car)\n          Get them out of there;\n\n<b>          300 INSIDE THE CAR, THE MEN HAVE CAUGHT AND SADDLED ONE HORSE.\n</b>          Which.is now bucking, the saddle hanging under its belly.\n          The other rears as the Sergeant yells again.\n\n<b>          MC HALE\n</b>          Get out ; ...The engine's coming !\n           And It is at about forty miles an hour. The Sergeant turns\n          and runs.\n\n<b>          301 INSIDE THE MEN RUSH FOR THE DOOR\n</b>\n<b>          302 ON THE TRACK THE ENGINE SLAMS INTO THE CARS.\n</b>\n<b>          303 IN THE CATTLE CAR, HORSES AND 14EN ARE HURLED AROUND IN\n</b>          THE CAR by the impact.\n\n<b>          30. THE HORSES REHITCHED, PIKE AND THE OTHERS ?\"WORK TO FREE THE\n</b>\n<b>           WAGON BOGGED IN THE MUD ON THE FAR SIDE OF THE RIVER.\n</b>\n<b>          305_ ON THE OPPOSITE BANK, THE BOUNTY HUNTERS PULL UP AND BEGIN\n</b>\n<b>          FIRING.\n</b>\n<b>          306 ANGEL, LIGHTING A BIG CIGAR MOVES AWAY FROM PIKE AND THE\n</b>\n<b>          OTHERS.\n</b>          307 PIKE ROPES ONTO THE' WAGON FROM the front and pulls with\n          his horse.\n          308 SYSES IS IN THE DRIVER'S SEAT AND DUTCH is next-to him, lying\n          prone. on the wagon returning the fire of the bounty hunters.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          79.\n</b>          309 LY'LE AND TECTOR ON HORSEBACK SPUR.up.to the wagon.\n\n<b>          PIKE\n</b>          Get on those rear. wheels'.\n          The Gorch brothers scramble down into knee-deep water and\n          begin to push.\n\n<b>          310 DUTCH AIMS AND FIRES.\n</b>          311 A MAN STAGGERS OUT from half cover and drops to his knees,\n          312 DUTCH FIRES AGAIN and another man drops. The bounty\n           hunters back up.and hunt better cover.\n\n<b>          313 THORNTON SPURS FOR THE SHAKY BRIDGE.\n</b>\n<b>          313A ANGEL, HIDDEN IN THE BRUSH AT THE FAR END OF THE BRIDGE.,.\n</b>           puffs on the cigar watching, Thornton..\n\n<b>          313B THREE FUSES ARE-IN HIS HAND. HE LIGHTS ONE WITH HIS CIGAR.\n</b>\n<b>          314 IN THE RIVER BELOW THE BRIDGE, PIKE AND HIS MEN PUSH AND\n</b>           heave against the wagon slowly moving. it up onto-the\n          bank. Then:\n          314A SEEING THORNTON STARTING ACROSS THE BRIDGE, PIKE raises\n           his.rifle but the range is far and the wagon has begun\n          to move.\n          315 THORNTON FORCES his terrified animal across the tottering\n           structure, then whirls as a bullet whines past his head.\n           The shot has come from behind. Above and through the trees\n          he can see:\n          316 THE CAVALRY DISMOUNTING AND CONTINUING to fire.\n          317 THE BOUNTY HUNTERS WHIRL around and return the-fire.\n\n<b>           THORNTON\n</b>\n<b>           (YELLING)\n</b>           Don't shoot; ...It's the army, you\n           idiots; -\n          But his words are drowned out in a volley-of firing.\n          Some of the soldiers start for the bridge. Three or\n          four of the bounty hunters quickly mount and spur on to\n          the bridge after Thornton.\n\n<b>          I\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          80.\n</b>          318 THORNTON FORCES HIS animal forward, stops, recognizing:\n          319 PIKE AT THE WAGON. PIKE looks at him a moment, then -yells at\n          his men and pulls the wagon up out of the mud and labor s\n          up the slope,\n          320 ANGEL WATCHES THE FUSE BURNING under the bridge toward the\n          far banks where the bounty hunters are beginning to fall\n          back to the water:\n          321 THORNTON FOLLOWED BY THREE OTHER BOUNTY HUNTERS rides forward..\n          Angel lights the remaining two fuses, mounts and spurs after\n          Pike and the wagon.\n          322 SOME OF THE BOUNTY HUNTERS PUSH THEIR HORSES DOWN THE SLOPE Ta-\n          WARD THE WATER AWAY FROM THE SOLDIERS, who led by McHale, are\n          closely flanking them. The firing is general now.\n          323 THE WAGON GOES UP THE RIM OF A GULLY, then down the other\n          side and out of sight..\n          324 . IN THE COVER OF THE GULLY, DUTCH AND THE GORCH BROTHERS mount\n           up and follow Sykes up the gully.\n          3 PIKE TURNS HIS HORSE, SPURS BACK THE WAY HE CAME. At the top\n           pulls. up as Angel joins.him. Both turn, watch. as:\n          325 FIVE STICKS OF DYNAMITE GO OFF in the shallow water on the\n           far side of the river among-the bounty hunters..\n           Horses go down, men. are thrown into the river. It is a sham-\n          bles. A few bounty hunters struggle dawnstream,\n          326 THORNTON, TWO THIRDS ACROSS THE BRIDGE pulls up, looks back as\n           do the three bounty hunters behind him, then at:\n          327 THE DISTANT FIGURES OF PIKE AND ANGEL. Pike lifts his hat i\n          a mocking' salute.\n\n<b>          328 BENEATH THE BRIDGE, THE TWO FUSES REAC.E THE DYNAMITE AND THE\n</b>          BRIDGE EXPLODES, blowing Thornton'and the three bounty\n          hunters into the river,\n\n<b>          329 PIKE WATCHES WITHOUT EXPRESSION. ANGEL GRINS WITH SATISFACTION.\n</b>          Finally both turn and ride after the wagon followed by scat-\n          tered ineffective shots of the soldiers,\n\n<b>          330 ON THE FAR SIDE OF THE RIVER, MC HALE STOPS A GROUP OF SCLDIISS\n</b>           from following on horseback.\n\n<b>           MC HALE\n</b>           Halt... '. Halt dammit;\n           That is-Mexico -- and . we can't\n           go there -- not yet.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          81.\n</b>\n<b>           EXT. BOUNTY HUNTERS' CAMP (RIVER AREA) - DAY (SUNSET EFFECT)\n</b>\n\n<b>          331 THE BOUNTY HUNTERS WITH THE EXCEPTION OF THORNTCN HAVE RE-\n</b>          GROUPED ON THE MEXICAN SIDE OF THE RIVER, still wet and dazed\n          from the river. A huge mesquite wood fire is burning in the\n          centre of came and several men have placed boots and articles\n          of clothing around it. Three horses, unsaddled, are tied to\n          a picket line in the b.g.\n\n<b>          T. C.\n</b>          Sure would like to get ahold of my fool\n          horse,\n\n<b>          COFFER\n</b>          SomeMex kid's probably ridin' him home\n          right now,\n\n<b>          JESS\n</b>          I don't see how I could'a lost both my\n          boots; .They always was hard as hell\n          to gat on but that little ole river just\n          sucked 'em right off;\n\n<b>          T.C.\n</b>          â\u0080¢That little ole dynamite helped some,\n\n<b>          ROSS\n</b>          They was waiting for us.\n\n<b>          COFFER\n</b>          Dollars to doughnuts that same kid\n          that's ridin' T.C.'-s horse is wearing\n          your-boots right now,\n\n<b>          332 JESS THINKS THIS OVER, THEN REACHES QUICKLY FOR HIS SHIRT\n</b>\n<b>          EXTENDED ON A POLE TOWARDS THE FIRE, WHICH HAS BEGUN TO BURN.\n</b>          He-drops it onto the sand and stamps on it. The men watch9\n          silent, but slightly amused,\n\n<b>          T. C.\n</b>          What do you reckon we ought'a do now?.\n          .,.Go back?..,Them soldiers was shooting\n          at us,\n\n<b>          JESS\n</b>          You see Thornton;.,. I never did see him\n          come up',\n\n<b>          T. C.\n</b>          See him;... I was with him; But I never\n          seen him come up either,.\n\n<b>          COFFER\n</b>          If you'reâ\u0080¢asking me, I think we ought'a\n          go after them bandits and make that swim.\n          worth something.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          82.\n</b>\n<b>          332 CONTINUED\n</b>\n<b>          ROSS\n</b>          (the fourth\n          bounty hunter)\n          I'd like to take some good pelts\n          back.. or at least maybe steal\n          something down here.\n\n<b>          T. C.\n</b>          ----Why go back at all -- just rob\n          every Mez' we see.\n\n<b>          -.COFFER\n</b>          You don't know this country -- step\n          out of line and every Mex you see will\n          be shooting your ass full of holes.\n          T. Co\n          Well, I'm sure as hell going to steal\n          me a horse;\n          333 THORNTON IS STANDING ON THE EDGE OF THE CLEARING looking at\n          the men around the f ire. He is tired and has obviously ridden\n          a long way, and shows the affects of the explosions ripped\n          clothes, a bloody gash on his face -- a twisted knee that is\n          bad enough to make him limp through the remainder of the film.\n\n<b>          THORNTON\n</b>          Steal as some grub -- I got the\n          horses.\n          33. THE MENWHIRL AROUND AT THE s o and of Thornton' s voice,\n\n<b>          T.C.\n</b>          Hey... you find my horse;\n\n<b>          ROSS\n</b>          .We thought the dynamite must've got\n          you or them . soldiers.\n\n<b>          JESS\n</b>          Or that damned river.\n\n<b>          THORNTON\n</b>          \"Them soldiers\" are going to get us all\n          if they ever get the chance...Who\n          started firing at them?\n          The men look at one another momentarily.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          83.\n</b>\n<b>          331 CONTINUED\n</b>\n<b>          COFFER\n</b>\n<b>          (LYING)\n</b>          Well, Old Huey started firing up.at\n          tem. I even tried to stop him...\n          Then one of them bandits nailed him\n          from across the river,\n\n<b>          ROSS\n</b>          Them soldiers started shooting first:\n          Thornton, without answering, steps to the fire,\n\n<b>          THORNTON\n</b>          How many rifles? And how much\n          ammunition?\n\n<b>          AD LIB\n</b>          (as they look)\n          Got mine...damn little...twelve\n          rounds.â\u0080\u009eItm clean,..44ts but no\n          301 30 t s, . - . I}O round - lost mine.\n\n<b>          THORNTON\n</b>          We'll use what we got.\n\n<b>          COFFER\n</b>          Are we going after-them?\n\n<b>          THORNTON\n</b>          We are; -- unless youtd like to go\n          back. and face a firing squad.\n\n<b>          JESS _\n</b>\n<b>          (WHINNING)\n</b>          How, in-hell am I goin' to fight\n          without boots?\n\n<b>          THORNTON\n</b>          Your problem.\n\n<b>          (THEN)\n</b>          Saddle up -- we're riding out..'\n          In the b.g., a horse whinnies as the men look at him dumb-\n          founded.\n\n<b>          JESS\n</b>          Now...?\n\n<b>          THORNTON\n</b>\n<b>          NOW;;\n</b>          And they jump as we:\n\n<b>          CUT TO:\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          84,\n</b>\n<b>          EXT. ROUGH COUNTRY NEAR (THE RIVER) - DAY (SUNSET EFFECT)\n</b>\n\n<b>           4\n</b>\n<b>          335 DUTCH IS EXAMINING THE HOOF OF ONE OF THE WAGON HORSES. PIKE\n</b>           is beside him. Sykes is still on the reins, Angel is sitting\n           on the cases of guns. The Gorch brothers are both riding '14\n           horses on either side. Dutch looks up, shakes his head.-\n\n<b>           PIKE\n</b>          Lyle; .Put your horse in the traces!\n          336 LYLE HANDS A BOTTLE OF WHISKEY TO TECTOR and nudges his horse\n          forward.-As he swings off, it is obviaeas that he is a little\n          drunk,\n\n<b>          PIKE.\n</b>          And you better dry out -- we got no\n          cause to celebrate.\n\n<b>          TECTOR\n</b>          Well, we got all them guns,. Pike.\n\n<b>          PIKE\n</b>          And we got a hell of a long way to go\n          'with a considerable number of people\n          just waiting to take 'em away.\n\n<b>          337 LYLE AND DUTCH BEGIN PUTTING LYLE'S HORSE INTO THE TRACES.\n</b>\n<b>          SYKES\n</b>          Where's the General supposed to meet\n          us? -\n\n<b>           PIKE\n</b>          Agua Verde -- or before -- and when he\n           does, don't look for no open arms.\n\n<b>          DUTCH\n</b>          What about Thornton and them others?\n\n<b>          PIKE\n</b>          Last I saw he was ridin' four sticks of\n          dynamite into the river.\n\n<b>          SYKES\n</b>          Don't count on him stayin' t.ere.\n          - (as Pike looks at him)\n          You know him --.I know him he'll\n          be along.\n\n<b>           PIKE\n</b>           (after a long moment)\n          Yeah he'll be along.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          85.\n</b>          338 HE CROSSES SLOWLY TO HIS HORSE, his weariness showing, puts\n          his foot in the stirrup, hesitates.\n\n<b>          R\n</b>\n<b>          339 THE GROUP WATCHES SILENTLY.\n</b>          140 PIKE STEPS UP INTO THE SADDLE, the pain twisting his face.\n          For- a long moment no one moves, then:\n          LYLE FULLS. A BOTTLE out of his. jumper, hands it to Pike. 34-\n          Pike drinks, hands it'to Sykes who drunks, hands it to Angel\n          who drinks,. hands it with a touch of a smile to Tector who\n          hesitates, then half grins himself; drinks and hands it to\n          Lyle. Lyle looks at the bottle, upends it over his mouth, a\n          few drops spill out into his mouth, looks at the bottle in\n          disbelief, tosses it gently aside.\n\n<b>          LYLE\n</b>          (to Pike , simply)\n          It'll be a cold day in hell 'fore\n          -I do that again. -\n          And suddenly they are all laughing.\n\n<b>          PIKE\n</b>          Let's move.-\n          And they do, still chuckling-as we.;\n\n<b>           CUT TO:\n</b>\n<b>          INT. MEXICAN RAILROAD STATION - DAY (SUNSET EFFECT)\n</b>\n          342 A TELEGRAPH'OPERATOR SNAPS AWAKE as a message comes over the\n          wire..-. As the machine clicks, he diligently writes the mes-\n          sage. When he is, finished he hands it to JUAN, a' small.: boy .\n          who` is dressed in a poorly fitting uniform. -\n\n<b>          OPERATOR\n</b>          Porel generalisimo: Andale!\n          The boy runs out of the building and into the street.\n\n<b>          EXT. MEXICAN RAILROAD STATION DAY\n</b>\n          343 MANY UNIFORMED SOLDIERS ARE DEPLOYED AROUND THE TRAIN while\n          they load horses into old boxcars -- also loading are:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/27/68\n</b>\n<b>          86,.\n</b>\n<b>          344 WOUNDED SOLDIERS, MAPACHE? S CAR AND WOMEN AND. CHILDREN AND\n</b>          OTHER. CIVILIANS who are. part of Mapache's encampment, Most\n          climb'on top. of the box cars where they set up housekeeping..,.\n          building f ires, ' cooking food -- ignoring the sporadic rifle.\n          fire that is beginning to grow in volume as\n          345 THIRTY' OR FORTY BIG HATTED REVOLUTIONARIES probe for the\n           weakness of Mapache's position at the railroad station.\n           Note: Mapache's soldiers show signs of having recently suf-\n           fered a beating and it..is obvious that they are retreating...\n\n<b>          346 JUAN RACES FROM THE OFFICE THROUGH TEE SOLDIERS TOWARD THE\n</b>          END OF THE TRAIN where:\n          347 MAPACHE'STANDS LOOKING OVER THE NEARBY HILLS with field\n           glasses. Beside him are his lieutenants,. one MAYOR (PEREZ),\n           the two Germans and ten or twelve soldiers. One- soldier is\n          hit and falls dying.\n\n<b>          PEREZ\n</b>          Mi general -- tenemos que irnos.'\n\n<b>          ZAMORRA\n</b>          Par favor.\n          Mapache ignores them.\n          Juan,â\u0080¢rushing'toward Mapache, almost falls as Herrera jerks\n          him to a halt..\n\n<b>          JUAN\n</b>\n<b>          (OFFICIOUSLY)\n</b>          Telegrama de San Antonio para su\n          exaelencia, el general. (A telegram\n          from San\"Antonio for his excellency,\n          the General.)\n\n<b>          HERRERA\n</b>          (reaching for the\n\n<b>          MESSAGE)\n</b>          Yo to llevo;\n          347A JUAN PULLS IT AWAY. HERRERA.GRINS, and. understanding his\n          wish to: deliver it personally, steps aside. Juan runs to\n          Mapache, skids to a halt and salutes.\n\n<b>          JUAN\n</b>          Mi General... telegrama de San Antonio.\n          The general returns the salute solemnly and opens the paper,\n          reads it.\n\n<b>          MAPACHE.\n</b>          Los-gringos se robaron el tren;\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          87,\n</b>\n<b>          3!7 CONTINUED\n</b>\n<b>          ERNST\n</b>          (to his companion,\n\n<b>          MOHR)\n</b>          Was sagt er?\n          Mohr smiles. Mapache is obviously pleased. He looks up at\n          the Germans.\n\n<b>          MAP ACHE\n</b>          The gringos take the guns...\n\n<b>          MOHR\n</b>          Sie haben die Geware gestclen!\n\n<b>          ERNST\n</b>          Ach so;...Gut -\n           (patting Mapache\n           on the shoulder)\n          Sehr gut.mein General!\n\n<b>          MOHR\n</b>          (indicating the\n          approaching Villistas)\n          It is important this news be kept\n          from Villa until the guns are in\n          our hands.\n\n<b>          ZAMORRA\n</b>          (beginning to panic\n          as the firing grows\n\n<b>          HEAVIER)\n</b>          We must go:\n\n<b>          MAPACHE\n</b>          (shouting towards\n          the mountain in\n\n<b>          SPANISH)\n</b>          The next time I will. destroy you\n          (turning to Herrera;\n          in Spanish)\n          Send men immediately to meet the\n          guns on the road to Agua Verde --\n          take possession and return here.\n\n<b>          HERRERA\n</b>          And if the gringos object --?\n\n<b>          MAPACHE\n</b>\n<b>          (SIMPLY)\n</b>          Kill them.\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          88,\n</b>\n<b>          347 CONTINUED\n</b>\n<b>          MOHR\n</b>          (in English)\n          My General -- if they are success\n          ful in this venture possibly they\n          can be useful in others,\n          Mapache thinks this over, turns to Herrera. Nearby another\n          man is hit and falls.\n\n<b>          MAPACHE\n</b>          (in Spanish)\n          Bring them back with you -- over-\n          come their objections -- reason\n          with them - convince them of our\n          good intentions.\n          HERRERA in Spanish)\n          And if they still object?\n          MAPACHE. (in Spanish)\n          Kill them;\n          3?+8 HERRERA SALUTES AND LEAVES. Mapache gestures:and the others.\n          quickly jump aboard the train. Mapache is the last, looking,\n          back at the hills with hatred as the Villistas charge and\n          we:.\n\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT. ROCKY HILL NEAR BROKEN ARROYO COUNTRY - DAY\n</b>\n\n<b>          R\n</b>          349 DUTCH IS LYING PRONE BEHIND SOME ROCKS trying a paper cone\n          over the front of a pair of U.S. Army binoculars. Pike\n          stands beside him, With the cone adjusted he rolls over and\n          looks out across the valley plain broken with arroyos.\n\n<b>          DUTCH\n</b>          Still heading east.\n\n<b>          PIKE\n</b>          Are they bluffing. or did they\n          really miss it?\n\n<b>          DUTCH\n</b>          I'd say they missed it..\n\n<b>          350 THROUGH THE BINOCULARS THE BOUNTY HUNTERS ARE WINDING ACROSS\n</b>\n<b>          THE ARROYOS\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          89.\n</b>          (i 351. DUTCH AND PIKE SNAKE BACK FROM THE LIP OF THE ROCKY hill that\n           dominates the area.\n\n<b>           I\n</b>          352 THE WAGON IS BELOW THEM hidden in a gully. The other men\n          are lounging underneath it. Pieces of brush are tied behind\n          the rear wheels of the wagon to brush away the trail. Pike\n          and Dutch stand and move back toward the wagon.\n\n<b>          DUTCH\n</b>          Only five left -- didn't figure\n          them to come down after us. How\n          much can we be worth?\n\n<b>          PIKE\n</b>          A lot depends on how hungry they\n          are...\n\n<b>          (THEN)\n</b>          You- stay up there and look for\n          bighats.,..I'm going to start.\n          ..'rigging the fireworks.\n          Dutch: turns, crawls back and lifts the glassese Pikewalk\n          down near the wagon and. prods. Angel., who.is sleeping _:\n          his boot.\n\n<b>          PIKE\n</b>          1. need some-help.\n          353 ANGEL QUICKLY GETS TO HIS FEET and follows Pike. to the\n          wagon. Pike reaches into a box near the seat and removes\n          a piece of fuse.\n\n<b>          PIKE\n</b>          Get that case of explosives near\n          the back.\n          Angel climbs on the wagon. Lyle, hearing him,.crawls out\n          from underneath. His brother also awakens and starts moving\n          around. Sykes, hat. over his eyes, looks up but doesn't move..\n\n<b>          LYLE\n</b>          Whatta you want with the dynamite?\n\n<b>          PIKE\n</b>          Protection.\n          (as they look at\n\n<b>          HIM)\n</b>          I figure the General will plan to\n          collect without payment, then kill\n          us if we have. any objections. The\n          only reason he might change his\n          mind is if something could happen\n          to these guns.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          90.\n</b>\n<b>          353 CONTINUED\n</b>          Angel hands Pike a case of explosives.\n\n<b>          PIKE\n</b>          Now I'm goin' to make it real\n          easy for something to happen.\n          35L PIKE SETS THE BOX ON THE GROUND and pries open the lid. He\n          begins setting the sticks on the ground next to the box.\n          Angel gets down and Pike hands.him a coil. of baling wire.\n\n<b>          PIKE\n</b>          Wrap these in pairs and put a\n          fuse cap between them.\n          Angel takes the first two and starts to work on them.\n          355 LYLE WATCHES FOR A MOMENT THEN NUDGES HIS BROTHER and climbs\n           on the wagon and begins looking over the.boxes... One is much\n           bigger than the others and of a different shape.\n          356 ANGEL AND PIKE ARM THE DYNAMITE STICKS in the shade of the\n          wagon..\n\n<b>          ANGEL\n</b>          Men from my village will meet\n          us tomorrow.\n          Pike looks up, angered.\n\n<b>          PIKE\n</b>          You told them about our trail?\n\n<b>          ANGEL\n</b>          I. don't need to tell them...They\n          know where we are.\n\n<b>          Q.\n</b>\n<b>          PIKE'\n</b>          How?\n          Angel puts the charge down and looks off at the horizon.\n\n<b>          ANGEL\n</b>          This country has many people, but\n          they have learned to live without\n          being seen.\n          (aftera moment)\n          Anyplace where a farmer has a field\n          ...or a man has sheep in the moun-â\u0080¢-\n          .tains..or a boy watches a herd of\n          goats.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          91.\n</b>\n<b>          356 CONTINUED\n</b>          - There is a noise off screen and they both look up,\n          357 TECTOR AND LYLE, using the heavy-bladed Bowie knives, have\n           pried open the strange shaped box. Lyle, his eyes bright,\n           reaches in..\n\n<b>          TECTOR\n</b>          Pike -- take--a look --\n\n<b>          358 LYLE STRUGGLES, LIFTS UP A MACHINE GUN OF THE PERIOD.\n</b>\n<b>          LYLE\n</b>          -You know how to work one of\n          these things?\n          Pike stands,,then grins a little-and crosses to the wagon.\n\n<b>          PIKE\n</b>          .Whatever I don't know, I'm\n          going to learn.\n\n<b>          CUT TO:\n</b>\n<b>          EXT. VALLEY DAY\n</b>\n          359 THE BOUNTY HUNTERS NOW IN AN AREA OF BADLANDS have stopped\n          on a small rise and are looking out over miles of the same\n          type of country.\n\n<b>          JESS\n</b>          I don't know how we lost 'em\n          except maybe in that big valley\n          where the ground was. so hard.\n\n<b>          COFFER\n</b>          There wasn't but one way they\n          could have taken a wagon out\n          of there, this here is it.\n\n<b>          THORNTON\n</b>          They didn.'t take it out...\n\n<b>          T.C.\n</b>          We, ain't gonna make it too much\n          further without something to eat.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          92.\n</b>\n<b>          359 CONTINUED\n</b>\n<b>          THORNTON\n</b>\n<b>          (QUIETLY)\n</b>          We didn't lose them -- I could\n          point to them now.\n          (as they whirl,\n          looking around)\n          Sit still, dammitl\n          (as they quiet)\n          You think Pike and old Sykes haven't\n          been watching us -- you think if we\n          hadn't.turned off they wouldn't just\n          have sat back and let us walk into\n          it -- six of them hid and all the.\n          guns.and ammunition they need -- you\n          think I wasn't sweating blood they\n          wouldn't try and hide their trail!\n          They look at him silently, almost frightened by his vehemeno e\n\n<b>          THORNTON\n</b>          They know what this is all about --\n          and. what. do I have -- nothin' but\n          you damned egg sucking chicken\n          stealing gutter rats -- with less\n          than 60 rounds of ammunition be-\n          tween you,\n\n<b>          T.C.\n</b>          Listen, Mr. Thornton -- I don't\n          have to take any talk like that.\n\n<b>          JESS\n</b>          I don't neither;\n\n<b>          THORNTON\n</b>          You'll take it! You don't even\n          have enough sense to keep your\n          damned boots on.\n          (then, quietly)\n          We're after men' -- and I wish to\n          God I was with them.\n          (after a moment)\n          You make any more mistakes and\n          I'm going to ride off and let\n          you die.\n          They are silent looking at the ground -- after a moment,\n          Thornton turns his horse and rides off slowly. They follow.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          '93 -\n</b>\n<b>          360 A SERIES OF ANGLES\n</b>          Showing the wagon moving into a deep arroyo. Pike is now\n          driving.\n\n<b>          EXT... BOTTOM OF DEEP ARROYO\n</b>\n          361 SYKES IS AT THE REINS OF THE WAGON, PIKE BESIDE HIM. The\n          horses are at a walk. Angel, Dutch'are mounted,. the Goruh\n          brothers are lying on top of the wagon, one on each side of\n          a bulky tarp-covered object.\n\n<b>          PIKE\n</b>          (looking off)\n          Hold up 1..\n\n<b>          362 TWENTY-MEXICAN SOLDIERS RIDING OUT FROM A BEND IN THE ARROYO\n</b>          SOME DISTANCE AWAY. Seeing the wagon, they pull up.\n          363 PIKE SLIDES INTO THE FRONT SEAT NEXT TO..SYKES.. Without a\n          word,. Sykes lights his cheroot and Pike. reaches behind him\n          and takes the end of a fuse.\n          Angel and Dutch let their rifles drift over.\n\n<b>          DUTCH\n</b>          Mapache' s?\n\n<b>          PIKE\n</b>          Just hope. they don't belong to\n          Villa.\n\n<b>          3614. HERRERA, THE LEADER OF THE MEXICANS, WALKS HIS HORSE A FEW\n</b>           steps forward and waves his hand.\n          (Note: He speaks English, but. badly, very badly)\n\n<b>          HERRERA.\n</b>          Ho.lal...We are friends...We are\n          from. -el generalisimo Mapac hie;\n\n<b>          PIKE\n</b>          Tell that one in front to come. over\n          here ...Alone!\n\n<b>          DUTCH\n</b>          Oyel Jefe, ven to solitol\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          94.â\u0080¢\n</b>\n<b>          364: CONTINUED\n</b>          The Mexican turns to his companions for a short discourse.\n          Then he turns and. rides toward the men on the wagon.\n\n<b>          HERRERA\n</b>          I.coming,..We are friends...\n          all of us...I bring love and\n          affection from el general --\n          We are comrades -- you and he\n          -- all of us.\n          365 PIKE, DUTCH AND THE OTHERS watch silently as he rides up to\n          the wagon.\n          366 HERRERA STOPS AND REMOVES HIS HAT', smiles, looks at. the\n          heavily loaded wagon.\n\n<b>          HERRERA\n</b>          Que bueno -- What bravery you.\n          have.to have done this magnifi\n          cent act for the liberty of\n          Mexico.\n          Angel laughs, spits, Herrera.looks at him for a moment,\n          smiles, shrugs, turns to Pike.\n\n<b>          HERRERA\n</b>          I am to escort you to the general.\n          367 NOBODY ANSWERS AND NONE OF THE GUNS pointed at him are\n          lowered, he seems undisturbed.\n\n<b>          HERRERA\n</b>          Tell me what is you wish?\n\n<b>          366 PIKE LIFTS THE END OF THE FUSE\n</b>\n<b>          PIKE\n</b>          (to Dutch)\n          Tell him to-come closer!\n\n<b>          HERRERA\n</b>          I hear -- I am coming,- my friend.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          95Â\u0080¢\n</b>          369 HERRERA STILL GRINNING BROADLY edges his horse closer to\n          the wagon.. Pike holds the burning end of the cheroot about\n          an inch from the fuse.\n          370 HERRERA SEES THE FUSE AND QUICKLY follows it back to the\n           wagon with. his eyes.\n          371 THE WHOLE WAGON IS RIGGED TO BLOW, dynamite and fuse all\n           over it.\n\n<b>          372 PIKE LIFTS THE CHEROOT AND THE FUSE\n</b>\n<b>           PIKE\n</b>           You see this?\n           He tickles. the end of the fuse-with the dead ash on his\n           cigar.\n\n<b>           HERRERA\n</b>           , Q uidado.1\n\n<b>          PIKE\n</b>          Itts-a: very fast fus.e..,any\n          trouble and no guns for the\n          general.\n          Herrera is solemn as he ponders for a moment, then begins\n          to 'smile.\n\n<b>          HERRERA\n</b>          Heyl...very smarts:: That's\n          very smart for you-damn gringos...\n          So nobody can rob the guns!\n\n<b>          PIKE\n</b>          Nobody:..nunca nadiel\n\n<b>          DUTCH\n</b>          (after a moment)\n          Don't you think you should tell\n          your soldiers?\n          The Mexican makes a face as if he doesn't understand.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          96.\n</b>\n<b>          372 CONTINUED\n</b>\n<b>          HERRERA\n</b>          Why? I am not afraid,,,they\n          are not afraid -- you blow up\n          the wagon you die -- or we\n          kill you pretty soon -- but\n          we are amigos __\n\n<b>          PIKE\n</b>\n<b>           (QUIETLY)\n</b>          Now,\n\n<b>           DUTCH\n</b>          Show.him&amp;\n          373 TECTOR AND LYLE JERK THE TARP OFF. TI MACHINE GUN. Lyle\n          arms it.\n          371k. HERRERA. LOOKS AT THE GUN and his eyes widen. He. turns,\n\n<b>          HERRERA\n</b>          Oyen muchachos3,.,Tienen la\n          .caretta como bomba.con unfisible;\n          ,,.y machina38\n          Still smiling he turns back to Pike and Dutch.\n\n<b>          HERRERA\n</b>          El general. waits an Agua-Verde..,\n          to meet with you,\n\n<b>          PIKE\n</b>          Go on back-and tell the General\n          that one of us will. be there\n          tomorrow for-the trade..1,any\n          trouble -- no gunsb\n          Herrera takes one last look at the guns. then he wheels his\n          horse and. rides off.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHA\n</b>\n<b>          X/1298\n</b>\n<b>          97.\n</b>          375 PIKE TURNS. TO THE OTHERS AS THEY begin to relax.\n\n<b>          PIKE\n</b>          This isnÂ°t over yeti\n          376 HERRERA RIDES HIS HORSE TO THE BEND IN. THE RIVER then,\n          reaching his men,â\u0080¢reins his horse up and-turns him around.\n          He whistles loudly and calls out :\n\n<b>          HERRERA\n</b>          Muchachos...\n          377 FIFTY SOLDIERS FROM HIDDEN POSITIONS ON TOP OF BOTH sides of\n          the arroyo ride out and look down.\n\n<b>          378 BEHIND THE WAGON 30 MORE APPEAR,. STOP.\n</b>\n<b>          HERRERA\n</b>          (after a.moment, laughing)\n\n<b>          YAMOSI\n</b>          All the soldiers whirl and ride away.:\n          379 PIKE AND THE MEN breathe a sigh'of relief as. the Mexicans.\n          ride off . ,\n\n<b>          PIKE\n</b>          (to Angel and Dutch)\n          Ride ahead a hundred yards and check\n          the washes...\n          (to Tector)\n          You and I will cover the flanks --\n          (to Lyle)\n          Keep on the gun -- watch the rim.\n\n<b>          SYKES\n</b>          (as Pike steps off the\n\n<b>          WAGON)\n</b>          Give sue that cigar --\n          (.as Pike does)\n          Anything moves, I blow her sky high.\n\n<b>          LYLE\n</b>          (sittinâ\u0080¢g up)\n          Listen, old man\n\n<b>          PIKE\n</b>           (grinning at Sykes)\n          I'll tell you when --\n\n<b>          CUT TO:\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          98.\n</b>\n<b>          380 EXT. BLUFF - DAY\n</b>\n          THORNTON 9 COFFER AND T . C. are down behind some rocks.\n          Thornton is looking DOWN THE ARROYO with binoculars while-\n          Coffer covers the glasses with his hat.\n\n<b>          THORNTON\n</b>          Movin' fast -- looks like they bluffed\n          off about 50 federal es --\n          (then sliding back)\n          Why due east?\n          (as Coffer shrugs)\n          Well, let's go find out.\n\n<b>          T.C.\n</b>          (trying to conceal his hate)\n          Beggin' your pardon, Mr. Thornton --\n          but our stock needs water and grain --\n          and. so do we.\n\n<b>          THORNTON\n</b>          (after a moment)\n          I don't give a damn about you -- but\n          I.. do about the stock.\n          He turns and slides down. the bluff. Coffer and T.C. look at\n          each. other, then follow.\n\n<b>          EXT. BANDITS' CAMP,- NIGHT\n</b>\n\n<b>          381- ANGELS CROUCHING NEAR THE W EEL. 0F' THE WAGON RESPONDS\n</b>          382. SUDDENLY TO AN OWL.'S CALL. He rises and crosses to Pike,\n          who is sitting near a tree with a rifle across his lap.\n          There is rjo fire, but enough. moonlight to see.\n\n<b>          ANGEL\n</b>          My people are here for the guns.\n          Pike looks at him then looks around the camp.\n\n<b>          PIKE\n</b>          Where?\n          Angel smiles, then turns and calls softly.\n\n<b>          ANGEL\n</b>          Ignacio?...Quien hablas por mi pueblo?\n          Distinctly Indian voices answer from the surrounding tangled\n          undergrowth.\n\n<b>          VOICES\n</b>          Si Angeleit o ...Soy Ignacio -â\u0080¢- Ya estamos 1\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          99.\n</b>          383 PIKE AND THE OTHERS MOVE INTO COVER, their guns coming out.\n          Lyle in the wagon traverses the machine gun.\n\n<b>          ANGEL\n</b>          (to the others)\n          They have come for the guns.\n\n<b>          DUTCH\n</b>          We haven't heard from Tectnr..\n\n<b>          â\u0080¢ â\u0080¢ PIKE\n</b>          (from the shadows.)\n          Call-'em in.\n\n<b>          ANGEL\n</b>          Vengan, Muchachos\n\n<b>          384. THE MEN LOOK AROUND. IT IS STILL, SILENT,... NOTHING MOVES, ..ï¿½.\n</b>          then suddenly:\n          385 A PEASANTS DRESSED IN WHITE is standing near the thicket.\n          Lyle and Sykes turn.\n          386 ANOTHER IS STANDING BEHIND THEM. Then:\n\n<b>          387 THREE MORE ARE CROSSING TO THE WAGON, TECTOR GAGGED AND\n</b>          BOUND BETWEE[1 THEM. As they enter the clearing, they\n          politely remove their hats. Soon there are five, two of\n          them are leading a 'small donkey. Angel crosses to them as\n          they group in the center of the clearing. All carry\n          machetes.\n\n<b>          PIKE\n</b>          (his gun out, still\n          hidden in the shadows)\n          Cut him loose\n          388 ANGEL SPEAKS, LED BY IGNACIO, THEY QUICKLY FREE TECTOR and\n          hand him his weapons with murmured apologies. Tector looks\n          at them, whistles, softly.\n\n<b>          TEC TO R\n</b>          Never saw anything like it -- never\n          heard Iem, never saw 'em..\n\n<b>          ANGEL\n</b>          (to Pike)\n          They apologize and ask you to forgive\n          them for their lack of trust but only\n          by caution do they remain alive --\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          100.\n</b>\n<b>          388 CONTINUED\n</b>\n<b>          TECTOR\n</b>          Hell, I forgive them! I just want to\n          join 'em!\n          389 PIKE JOINS DUTCH AND THEY WATCH quietly.. They have mis-\n          trusted people for so long themselve,g they can understand\n          mistrust in others. Freddy Sykes laughs s.oi'tly.\n          390 ANGEL AND THE INDIANS cross to the wagonE:\n\n<b>          ANGEL\n</b>          (climbing on the -wagon)\n          Lievasâ\u0080¢una caja de rifles.\n          (Take a case of rifles.)\n\n<b>          PIKE\n</b>          (crossing to him)\n          Don't break that fuse...\n          Angel lifts a crate.\n\n<b>          ANGEL\n</b>          I won't.\n          Pike looks at Ignacio waiting to take the crate, the man's\n          machete glints in the moonlight.\n\n<b>          PIKE\n</b>          They part of your village?\n\n<b>          ANGEL -\n</b>          They are part of the village but not\n          from it -- they are puro indio --\n          and these mountains belong to them.\n\n<b>          PIKE\n</b>          How long have they been around?\n\n<b>          ANGEL\n</b>          What ?\n\n<b>          PIKE\n</b>          How long have they been following us...\n          close?\n          391 ANGEL EASES THE RIFLE CRATE DOWN, TWO PEONS TAKE IT. He\n          turns to Ignacio.\n\n<b>          ANGEL\n</b>          Cuanto tiempo nos sigas?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          101.\n</b>\n<b>          391 CONTINUED\n</b>          The Indian begins a big explanation in a dialect only Angel\n          understands.\n\n<b>          IGNACIO\n</b>          Desde ante ayer, cuando salli-eron de la\n          llanura grande. Hey otros.grupo de\n          gringos... ellos se fueron a uno Ranchito.\n          Pike looks at Angel.\n\n<b>          ANGEL\n</b>          They've been. with us since we left the\n          big plain...He says those others went\n          to a little. Ranch.\n\n<b>          DUTCH.'.\n</b>          (joining them)\n          Ever see anyone that could sneak around\n          , like these S\n          Angel uncovers a case of munitions and hands it down,\n\n<b>          SYKES\n</b>          They fought-'paches for a thousand\n          years -- that's a sure way to .learn..\n\n<b>          PIKE\n</b>          If they ever get armed and led, this\n          whole country'll go up in smoke.\n\n<b>          SYKESS\n</b>\n<b>          (SOFTLY)\n</b>          That it will, son, that it will.\n          392 THE INDIANS ROPE THE TWO CASES ON THE BURRO. They work\n          smoothly, each man knowing his job. Angel. climbs down off\n          the wagon, murmurs a farewell to Ignacio and the others, and\n          they disappear into the shadows.\n\n<b>          DISSOLVE TO :\n</b>\n<b>          EXT. SQUARE (AGUA VERDE) - DAY (LATE AFTERNOON EFFECT)\n</b>\n\n<b>          393 THE FUSE BURNS DOWN ON A SKY ROCKET AND THE MISSILE SHOOTS\n</b>           INTO, THE AIR AND EXPLODES. A burst of laughter follows.\n          39LE. MAPACHE AND HIS MEN are playing with fireworks while they\n          wait for the guns.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          102.\n</b>\n<b>          395 TWO SOLDIERS DRAG FORWARD A PEON (SEEN BEFORE WITH DUTCH IN\n</b>          ANGEL'S VILLAGE). One of them waves aloft a shotgun and\n          tells Mapache that it belonged to the man.. Mapache, com-\n          pletely absorbed in lighting a Roman candle, answers without\n          turning.\n\n<b>          MAPACHE\n</b>          Matalo l Pues l.. .\n          -(Then kill him!)\n\n<b>          396 MAPACHE LIGHTS THE FUSE AS THE TWO SOLDIERS THROW THE MAN\n</b>           .down on the ground and shoot him.\n          As he dies, Mapache lights the Roman candle and shoots it\n          into the air, then at tha soldiers who run for cover,\n\n<b>          REVEALING:\n</b>\n<b>          397 PI KE . RIDING IN THROUGH THE MAIN GATE.\n</b>          398 THE GENERAL SEES PIKE AND CROSSES TO HIM IMMEDIATELY, laugh-\n          ing with pleasure. Mohr and the other-.Germans run to: join\n          him: as does Zamorra and Herrera.\n\n<b>          MAPACHE\n</b>          Gringo 1. You bring the- guns l\n           (s houting to his men)\n          Ya estan los gringos y las armas l`\n          (The gringos are here with the guns i)\n          (then noticing the wagon\n          is nowhere in sight)\n          (to Zamorra).\n          Donde estan las arthas?\n          Zamorra looks up at Pike.\n\n<b>          ZAMO RRA\n</b>          The guns?\n\n<b>          PIKE\n</b>          Don't worry we got ' em...hidden. As\n          soon as I. get 'my share of the gold\n          I'll tell you where four cases are...\n          $2500 worth..\n\n<b>          (THEN)\n</b>          The others are waiting at the wagon\n          and unless I r eturn pretty damn quick\n          they. blow it.\n          'Zamorra smiles, admiring Pike's caution.\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          103.\n</b>\n<b>          CONTINUED\n</b>\n<b>          MAPACBE\n</b>\n<b>          (LAUGHING)\n</b>          You fix it pretty damn good. You\n          fool Mel\n\n<b>          ZAMORRA\n</b>          Our accountant will pay you immediately.\n          Zamorra turns and yells to Herrera.\n\n<b>          ZAMORRA\n</b>          Trae la caja!\n          (Bring the strong box!)\n\n<b>          MAPA CHE\n</b>          When you come with all my guns?\n\n<b>          PIKE\n</b>          Quicker I get back, the quicker the\n          next load'll get here.\n          399 HERRERA BRINGS A SMALL WOODEN STRONG BOX. Kneeling on the\n          ground he opens it and counts out two small bags of gold,\n          and hands them to Zamorra. Zamorra hands them to Pike.\n\n<b>          PIKE\n</b>          About two.. miles up the arroyo ... three\n          cases of rifles, one of ammunition,\n          are in the brush behind it.\n\n<b>          ZAMORRA\n</b>          (to Herrera)\n          Trae las armas\n          Herrera runs for his horse.\n\n<b>          MOHR\n</b>          I understand you have a machinegun\n\n<b>          PIKE\n</b>          Our contract was 16 cases of rifles\n          and 8 of ammunition -- for $10,000 --\n          not a machine gun.\n           (then, as Maps the frowns)\n           It is our gift to the General.\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          104.\n</b>\n<b>          I\n</b>\n<b>          399 CONTINUED\n</b>          Zamorra translates this for Mapache who beams at Pike. with\n          genuine pleasure.\n\n<b>          MAPACHE\n</b>          (meaning it)\n           You fight con Mapache,h, g macho\n          _dinero -- muchachas bonitas --\n          la vida dulcet\n\n<b>          .ZAMORRA\n</b>          The General wishes you to join\n          him. -- and become rich he\n          respects you.\n\n<b>          PIKE\n</b>          (turning to go)\n          I'll think it over.\n\n<b>          ZAMORRA\n</b>          Esperate.\n\n<b>          (SMILING)\n</b>          'Wait, por favor...In case he\n          cant find them.\n\n<b>          400 PIKE LOOKS AT HIM, LOO KS AT MAPA CHE\n</b>\n<b>          MAPACHE\n</b>          (to Pike in\n\n<b>          SPANISH)\n</b>\n<b>          GO\n</b>          (to Zamorra)\n          I trust him.\n          Zamorra shrugs, Pike grins then turns and rides out..\n\n<b>          = . CAMP (NEAR AGUA VERDE) - DAY.\n</b>\n<b>          401 A BOTTLE SLAMS AGAINST A ROCK AND THE CAMERA WHIP PANS TO\n</b>          SHOW Tector Gorch leaning on the wagon grinning.\n          They are in,.a small shallow depression\n          between two hills.. High enough to provide a vantage\n          point of the village and the surrounding area--- hidden\n          enough by brush and broken country to provide maximum\n          cover.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          105.\n</b>          402 SYKES SEATED NEAR THE ROCK picks glass shards from his\n          clothes, turns to Tector.\n\n<b>          SYKES\n</b>          (after a moment)\n          Pike must have found you. under a\n          rock somewheres.\n\n<b>          TECTOR\n</b>\n<b>          (GRINNING)\n</b>          You going to whip me?\n\n<b>          SYKES\n</b>          Nope - But you better hope I don't\n          get riled enough to start . ggin'\n          you when this is over.\n\n<b>          TECTOR\n</b>          You'll never get a chance to dry\n          gulch me, old man.\n\n<b>          SYKES\n</b>          (grinning at him)\n          We'll see.\n\n<b>          LYLE\n</b>          (to' Tector)\n           Take the watch. --\n          403 DUTCH, CAREFULLY EXAMINING TWO GRENADES, looks up as Te c for\n          Gorch. moves up the bank of the wash.\n\n<b>          LYLE\n</b>          (crossing to Dutch)\n          He's been gone a 1 ong time\n          (then.)\n          What's t ha t? .\n\n<b>          DUTCH\n</b>          Grenade -â\u0080¢ you pull this pin then\n          throw it and find a hole- From\n          what. I hear it gets the job done.\n\n<b>          LYLE\n</b>          We could have used a fear of them\n          in San Rafael..\n\n<b>          TECTOR\n</b>          (calling).\n          Pike's co min 1\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>          404 DUTCH GETS TO HIS FEET, putting the grenades in his jumper\n          pocket and crosses. to meet Pike, as he rides in.\n\n<b>          DUTCH\n</b>          {.calling)\n          Any trouble?\n\n<b>          PIKE\n</b>          Just carryin' all this weight.\n          He hold's up two bags of gold.\n\n<b>          TECTOR.\n</b>          He' gate it a...Look,. Lyle, he's carryin'\n          golds Pike -- I want to go next..\n\n<b>          405 PIKE RIDES HIS HORSE INTO THE: CAMP AND DISMOUNTS\n</b>\n<b>          PIKE\n</b>          (to Lyle)\n          You and your brother take in the\n          next' load, and the machine gun -\n          'then Dutch and Angel. Sykes,. you\n          follow them and pick up the pack\n          horses...leave the wagon.\n\n<b>          DUTCH\n</b>          How's the, generalis imo?\n\n<b>          PIKE\n</b>\n<b>          ( DISMOUNTING)\n</b>          Openin' boxes. like he thinks it's\n          Christmas.\n\n<b>          EXT. AGUA VERDE - DAY.\n</b>\n          406 MAPACHE WAITS AS TWO MEN BRING HIM THE MACHINE GUN, the\n          weapon cradled between them. Zamorra awkwardly feeding a\n          belt into the breech,. finally gets it ready to fire. The two\n          Germans are watching with amusement and disdain. In the b.g,f\n          Lyle and Te.ctor are. riding out the gate.\n\n<b>          MOHR\n</b>          It must be mounted on the tripod...\n          Mapache ignores them,.' grabbing the butt of the gun.\n\n<b>          MOHR\n</b>          Er ist dock verrukt\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          107.\n</b>\n<b>          407 ZAMORRA SHOVES HOME THE BOLT AND MAPACHE PULLS THE TRIGGER.\n</b>          The gun suddenly.comes alive and the two men holding it are\n          bounced around the area by the wild. reco it .\n          408. THE GUN SWINGS WILDLY, MAPACHE HANGING ON -= his finger\n          locked down. on the trigger.\n          409 THE GERMANS. AND OTHER BYSTANDERS DIVE FOR COVER as bullets\n          clatter- through the area-. Finally the two soldiers, 'unable-.\n          to support it, let it drop to the ground.\n\n<b>          BUT MAPACHE STIML HANGS ONTO THE TRIGGER AND THE WEAPON\n</b>          continues firing. Now like a rivet gun driving bullets\n          into the earth,\n\n<b>          DISSOLVE TO:\n</b>\n<b>          E= .. AGUA VERDE - DAY\n</b>          411 DUTCH AND ANGEL ENTER THE COURTYARD. Mapache, Zamorra and\n          Herrera watching the Germans mount the. gun on the tripod,\n          turn; then Herrera crosses to his horse and mounts, waiting.\n\n<b>          DUTCH\n</b>          We brought the last of it.\n           Mapache gestures. Zamorra hands two bags of coin to Dutch\n          who opens theca -- locks - it's gold.\n\n<b>           DUTCH\n</b>           At the head of the.arroyo -- in\n           the wagon.\n          Zamorra speaks to Herrera, who rides off with ten or twelve\n          soldiers.\n\n<b>          DUTCH ,\n</b>          (turning to go)\n          You can keep the wagon - we'll\n          take the horses.\n\n<b>          MAPACHE\n</b>          Como no...?\n\n<b>          I\n</b>\n<b>          412 SUDDENLY ANGEL, WATCHING HERRERA RIDE THROUGH THE ARCH,\n</b>          TENSES. A group of soldiers are beginning to slowly close\n          the massive iron gates.\n\n<b>          ZAMORRA\n</b>          How many cases did you take 'from\n          the train?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          108 .\n</b>\n<b>          412 CONTINUED\n</b>\n<b>          DUTCH\n</b>          Fourteen. We lost two on the trail.\n\n<b>          MAPACHE\n</b>          (laughing, points at\n          Angel; in Spanish)\n          He stole them. ..He stole them for his\n          people. The mother of his girl told us.\n          I lost the girl, so now she gives me an\n          Angel.\n\n<b>          413 ANGEL WHIRLS HIS HORSE AND SPURS FOR T GATEWAY, BUT AS HE\n</b>          APPROACHES,. THE HEAVY WROUGHT IRON DOORS begin to swing shut..\n\n<b>          MAPACHE\n</b>          No lo matez b...Lo quiero vivo\n\n<b>          414 AS ANGEL NEARS THE GATE, A SOLDIER SWINGS A LARIAT AND CATCHES\n</b>\n<b>          THE TWO FRONT FEET OF HIS HORSE.\n</b>\n<b>          445 THE - HO RSE GOES OVER JUST SHORT OF THE ARCH SLAMMING ANGEL\n</b>          into the wrought iron gate.\n          A group of soldiers pick him up and drag him back.\n          416 DUTCH SITS ON HIS HORSE UNMOVING, apparently unconcerned as\n          Angel is brought before Mapache.\n\n<b>          MAPACHE\n</b>          Supieron ellos?\n\n<b>          417 ANGEL LOOKS AT DUTCH, THEN SHAKES HIS HEAD.\n</b>\n<b>          ANGEL\n</b>          No S...Yo los robe mientras dormian.\n\n<b>          ZAMO RRA\n</b>          (.to Dutch)\n          Ee took two cases when you were asleep...\n          418 MAPACHE LAUGHS, highly pleased at the idea of a Mexican\n          robbing the Americans.\n\n<b>          MAPACHE\n</b>          (to Angel, in Spanish)\n          Next time be more careful who you shoot\n          -- the mother of your sweetheart became\n          angry when you killed her daughter. --\n          so she betrayed you -- que fam-ilia, eh? CONTINUED\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          109.\n</b>\n<b>          418 CONTINUED\n</b>\n<b>          DUTCH\n</b>          (interrupting him)\n          I'm wasting time here.\n\n<b>          MAPACHE\n</b>          (turning to him).\n          Y Angel?\n\n<b>          DUTCH\n</b>          He's a thief,-- you take care of him.\n\n<b>          MAPACHE\n</b>          (gesturing at the gold)\n          Dame lo.\n\n<b>          DUTCH.\n</b>\n<b>          (ANGRY)\n</b>          Wiat for? l We delivered.\n\n<b>          ZAMORRA\n</b>          Two cases short -- one bag, por favor.\n          419. DUTCH THINKS ABOUT THIS VERY. BRIEFLY, then tosses him a bag.\n\n<b>          MAPACHE\n</b>          Un vieje Bien..\n\n<b>          DUTCH\n</b>          Yeah.\n          He turns and rides off, Angel watching him.\n\n<b>          EM. ARROYO - DAY\n</b>\n<b>          120 SYKES IS HELPING HERRERA AND HIS SO LDIER S LOAD THE CASES ONTO\n</b>\n<b>          PACK ANIMALS AS DUTCH RIDES UP.\n</b>\n<b>          DUTCH\n</b>\n<b>          (QUIETLY)\n</b>          They got Angel... some people would betray\n          their mothers for two dollars and one drink.\n\n<b>          (THEN)\n</b>          Unhitch and bring the horses - leave the wagono\n\n<b>          SYKE S\n</b>          We got to get him out.\n\n<b>          DUTCH\n</b>\n<b>          (ANGRILY)\n</b>          How -- ?\n          But. Sykes can't answer and Dutch rides off.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          110.\n</b>\n<b>          EXT. BADLANDS - DAY\n</b>\n\n<b>          421 THORNTON, BELLIED DOWN ON A RIDGE TOP, WATCHES THROUGH BINOC\n</b>           ULARS AS DUTCH, better than a mile away, disappears in the\n          distance.\n          The others are. mounted at the bottom of a small ravine below\n          him.\n\n<b>          THO RNTO N\n</b>          (turning to them)\n          Dutch Engstrom...going from the village.\n\n<b>          COFFER\n</b>          $1000 dead or alive.\n\n<b>          T.C.-\n</b>          Bet they sold the guns.\n\n<b>          THORN TON\n</b>          ,,-Coming out one at a time.\n          i (then, crossing to his horse)\n          We'll get down at the bottom of the wash\n          and see if we can thin the odds a little.\n          He mounts and they ride off.\n\n<b>          EXT. CAMP - DAY\n</b>\n\n<b>          DUTCH HAS DISMOUNTED AND IS TALKING TO PIKE AND THE OTHERS.\n</b>          On a ridge above camp, using binoculars, they look across the\n          badlands below and at the town far in the distance.\n\n<b>          LYLE\n</b>          Well, he had guts --\n\n<b>          PIAE\n</b>\n<b>          (SOFTLY )\n</b>          We're just lucky he didn't talk.\n\n<b>          DUTCH\n</b>          Yeah - he played his string out right\n          to the end.\n\n<b>          TECTO R\n</b>          He loved that girl!\n\n<b>          LYLE\n</b>          Her own Mama turning him in -- just like\n          Judas --\n          423 PIKE LOOKS AT HIM A LONG MOMENT, then turns away.\n\n<b>           DUTCH\n</b>           Sykes says we got to go after him.\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          111.\n</b>\n<b>          423 CONTINUED\n</b>\n<b>          LYLE-\n</b>          How in hell. can we do that? They\n          got guns and 200 men.-.. Besides,\n          chances are he's dead by now.\n\n<b>          PIKE\n</b>\n<b>          (FINALLY)\n</b>          _-No wag... no' way at all.\n\n<b>          LYRE\n</b>\n<b>          (POINTING)\n</b>          There's Sykes.\n\n<b>          424 PIKE LIFTS THE GLASSES WATCHING:.\n</b>\n<b>          425 SYKES IN THE FAR DISTANCE RIDE TOWARD THEM.\n</b>\n<b>           EXT. BADLANDS - DAY\n</b>\n\n<b>          3 .26 SYKES, MOUNTED BAREBACK ON A HORSE AND LEADING THE OTHERS,\n</b>          trots up the dim trail. toward the hideout.\n          1 27 THORNTON AND HIS HUNTERS, THREE. M O WATCH from the\n           cover of brush-covered ridge some distance away, then:\n\n<b>          428 JESS CHANGING HIS POSITION TO GET A BETTER SHOT, STICKS HIS-\n</b>           BARE FOOT IN A SMALL CLUMP OF CHOLLA -- He. jumps at the fiery\n           pain and nearly falls, and for an instant:\n\n<b>          429 HIS RIFLE CAN BE SEEN OVER THE TOP OF THE RIDGE.\n</b>\n<b>          430 SYKES TENSES FOR A BRIEF INSTANT AS . THE SUN HITS THE BARREL\n</b>           OF THE RIFLE and he catches the reflection in his- eye.\n           Then he has spurred his horse into the brush at the side of\n          the trail.\n          431 THORNTON CURSES AND RUNS TO HIS HORSE as the bandits open\n          fire.\n\n<b>          432 PIKE AND THE OTHERS WATCH SYKES SPUR INTO THE BRUSH. TINY\n</b>          PINPOINTS OF LIGHT APPEAR IN THE ROCKS ABOVE HIM. After a\n          moment the noise of firingâ\u0080¢reaches them.\n          .Dutch takes the glasses, watching.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/6-8\n</b>\n<b>          112.\n</b>          433 THORNTON AND THE OTHERS SPUR after Sykes, firing.\n          434 THEN SYKES IS HIT and falls forward over the horse's withers.\n\n<b>          EXT. BADLANDS - MOVING SHOT - DAY\n</b>\n          435 THE BOUNTY HUNTERS THUNDER after Sykes.\n\n<b>          COFFER\n</b>          (yelling).\n          I got him -- I got him.'\n          Thornton is silent, his face bitter.\n          436 PIKE GRABS THE GLASSES,. WATCHES THE BOUNTY HUNTERS ride after\n          Sykes.\n\n<b>           LYRE\n</b>          ,Maps the ?\n\n<b>           DUTCH\n</b>          Thornton - they got Sykes. He's hit bad.\n           (then, turning away)\n          Daum Deka Thornton to hell..\n\n<b>          PIKE.\n</b>\n<b>          (SOFTLY)\n</b>          What. would you do in his place.\n          gave his word.\n\n<b>          DUTCH\n</b>          (turning on him,\n          almost yelling)\n          Gave his word to a railroad.\n\n<b>          PIKE\n</b>          It'-9 his word2\n\n<b>          DUTCH\n</b>          That ain.'t what counts -- it's who you\n          give it t o l l\n\n<b>          LYLE\n</b>          (as Pike doesn't answer)\n          We kin stay right up here and kick\n          hell out of 'em.\n          Pike turns and. looks over the camp.\n\n<b>          PIKE\n</b>          No water.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          113.\n</b>\n<b>          436 CONTINUED\n</b>\n<b>          DUTCH.\n</b>          Make a run for the border?\n\n<b>          PIKE\n</b>          They'd be after us every step of\n          the way -- I know Thornton. No,\n          I'm tired of being hunted -- we go\n          back to Agua Verde and let the\n          General take,.. care of those boys.\n\n<b>          LYLE\n</b>          You're'cra-zy:...He'd just as soon\n          kill us as break wind..\n\n<b>          PIKE\n</b>          He's so tickled with the guns\n          he'll be celebrating for a week\n          and happy to do us a favor.\n          Thornton ain't going after us in\n          there. While they're busy pick-\n          ing over Freddy) we'll.'\n          take the back trail off this\n          mountain and head for town.\n          The others look at him silently. Finally:\n\n<b>          DUTCH\n</b>          We take our gold?\n\n<b>          PIKE\n</b>          We take one sack to pay our way.\n           Bury the rest -- together.\n           They think this over, then nod.\n\n<b>          EXT. BADLANDS - DAY\n</b>\n          437 THE BOUNTY HUNTERS CRASH through the brush into a small\n          clearing, then split up, looking for tracks. The country\n          around them is a maze of rocks and thick mesquite and\n          chaparral. Sykes' horse, blood running. down its flanks,\n          is standing in the clearing,-grazing.\n\n<b>          T.,C.\n</b>          He can't be far.\n\n<b>          COFFER\n</b>          Lots of blood over here -- then\n          it stops and no tracks.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          437 CONTINUED\n</b>\n<b>          T. C.\n</b>          We'11 find him. Ten dollars says\n          he's dead by now.\n\n<b>          THORNTON\n</b>          .It'll take us a day to find him if\n          he is -- if he isn't, he's holding\n          a gun on us right now.\n          438 THE IAN TENSE,-THEIR WEAPONS coming up.\n\n<b>          THORNTON\n</b>          We'll go after the others.\n\n<b>          JESS\n</b>          Just leaving him here? He's worth\n          money.\n\n<b>          THORNTON\n</b>          (softly, bitterly)\n          Jess, you come back tomorrow and\n          watch the buzzards. They'll show\n          you where he is -- you might even\n          get a pair of. boots.\n          Jess thinks this over and grins, then the smile fades.\n\n<b>          JESS\n</b>          But what if he ain't dead?\n\n<b>          THORNTON\n</b>          Your problem..\n          He turns his horse and rides away,. the others following,\n          439 SYKES, HIDDEN IN THE ROCKS and brush above them,â\u0080¢slowly\n          lowers his rifle and sags back. His leg is dark with dried\n          blood and he's weak. Around the wound is a crude bandage\n          made from his shirt -- with a tourniquet twisted tightly\n          above it. After a moment, there is a noise and he looks\n          away at:\n\n<b>          440 THE FIGURE OF A MEXICAN PEON -- BLURRED AND INDISTINCT\n</b>          AGAINST THE RAYS of the late afternoon sun, a machete\n          dangling from his hand.\n\n<b>          EXT. CAMP AREA - DAY\n</b>\n          PIKE AND THE OTHERS NOW MOUNTED, look over the camp.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          115.\n</b>\n<b>          IT APPEARS UNTOUCHED\n</b>\n<b>          TECTOR\n</b>          If I. didn't bury it, I wouldn't know\n          where to look.\n\n<b>          P=\n</b>          Come on.\n          They ride off. Fora longmoment the clearing is quiet,then:\n          443. ENERO, A YOUNG MEXICAN BOY steps out of the brush.\n\n<b>          EXT. HACIENDA COURTYARD AGUA VERDE DAY\n</b>\n          MAPACHE'S SOLDIERS ARE HAVING A VICTORY CELEBRATION in:tha\n          courtyard of the hacienda. A fire:is burning and pigs and\n          goats are. being barbecued.\n          445 MAPACHE, ZAMORRA AND THE GERMANS are sitting at the table..\n          446 TWO SOLDIERS LEAD ANGEL (who has been badly beaten) down into\n          the courtyard. His hands are tied, and he is, stumbling with\n          fatigue. They tie a long rope from his neck to. the pack\n          saddle of a donkey. One of.the soldiers calls.to Mapache.\n\n<b>          1ST.SOLDIER\n</b>          Yaâ\u0080¢listo, mi General!\n          447 MAPACHE.GETS UP FROM THE TABLE and crosses to the area where.\n           he can. view the.whole courtyard. Zamorra and the Germans\n          join him.\n          448 THE. SECOND SOLDIER steps to the animal and leads it at a run\n          around the. courtyard, Angel dragging behind it. Mapache and\n          the'others watch without expression.\n\n<b>          EXT. PLAZA GATE.- DAY\n</b>\n          L. 4:8A PIKE' AND DUTCH AND THE GORCH BROTHERS dismount and enter,\n\n<b>          EXT. COURTYARD DAY\n</b>\n          449. THEY MOVE INTO THE COURTYARD AND STOP, watching the animal\n          dragging Angel around. Finally. the soldiers. and animal stop,\n          exhausted, in a\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          2 T1ï¿½2G68\n</b>\n<b>          116.\n</b>\n<b>          CONTINUED\n</b>          corner of the yard and the soldiers return to their party\n          atmosphere. Angel lies unmoving.\n\n<b>          PIKE\n</b>          I hate to see an animal treated like\n          that.\n\n<b>          DUTCH\n</b>\n<b>          (SAVAGELY)\n</b>          No more than. I do 0\n\n<b>          PIKE\n</b>          Maybe we- could buy him.\n          They are silent for a long moment. Finally:\n\n<b>          LYLE\n</b>          Just thinking about him is asking\n          .for trouble.\n\n<b>          PIKE\n</b>          We,could use another gun.\n          450 MAPACHE, ZAMORRA AND THE GERMAN ADVISORS NOW GROUPED around\n          the fire see the men.\n\n<b>          MAPACHE\n</b>          Los Bandi'dos Gringos...Come here,\n\n<b>          AMIGOS:\n</b>          451 PIKE AND THE OTHERS PUSH THROUGH the large group of festive\n          Mexicans towards the table. As they walk toward Mapache:\n          452 ANGEL IS DRAGGED PAST THEM by two soldiers and dropped in\n          front of the general.\n\n<b>          MAPACHE\n</b>\n<b>          (LAUGHING)\n</b>          You come for your friend?\n          Pike and the others stop.a few feet away.\n\n<b>          PIKE\n</b>          I want to buy him back...\n          Dutch and the others look at him surprised,\n\n<b>          PIKE\n</b>\n<b>          (CONTINUING)\n</b>          I,'11 pay you his share of the gold.\n\n<b>           CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          117.\n</b>\n<b>          452 CONTINUED\n</b>\n<b>          ZAMORRA\n</b>          We kept his share of the gold.\n\n<b>          MAPACHE\n</b>          Oyen muchachos...'.Quiere comprar\n          el traidor este ;\n          - (Listen boys...He wants to buy\n          this traitor)\n          The soldiers respond with laughter.\n\n<b>          MAPACHE\n</b>          How much?...He don't look. wotth too\n          much...Levantasel\n          Two men jerk Angel to his feet. He is groggy and unre=\n          sponsive.\n\n<b>          MAPACHE\n</b>          Maybe he won't live too long'.\n\n<b>          PIKE\n</b>          I'll give half my share to get him\n          back.\n\n<b>           MAPACHE\n</b>\n<b>           (LAUGHS )\n</b>           No, I don't. need gold... .I don't sell\n           that one.\n          453 MAPACHE TURNS AWAY and mumbles something to Zamorra.\n\n<b>          PIKE\n</b>          You've had your fun with him...\n\n<b>          ZAMORRA\n</b>          (cutting him. off)\n          El g3neralisimo is happy with victory!...\n          Zamorra grabs a bottle of tequilla ofd' the table and tosses\n          it to Pike.\n\n<b>          ZAMORRA\n</b>          Go and drink... .there are women in.\n          the village...But don't be foolish.\n          and change his mood.\n          454 PIKE HOLDS THE BOTTLE and looks at the table, seething with\n          anger. Then,. suddenly he calms.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          118.\n</b>\n<b>          454 CONTINUED\n</b>\n<b>          PIKE\n</b>          Want to go hunting, General?\n          Mapache looks at him confused.\n\n<b>          PIIE\n</b>          (pointing)-\n          Five government men out there -\n          Policio - they want the guns back.\n          Mapache turns to Zamorra who translates..\n\n<b>          MAPACHE\n</b>          (to Herrera happily,\n          in Spanish)\n          Five gringos want to take our guns\n          Maten los..\n\n<b>          HERRERA\n</b>          S , mi. General. f.\n          He turns,'barks orders to his men, then mounts and rides out,\n          followed by twenty soldiers.\n\n<b>          DUTCH\n</b>          Goodbye,. Thornton.\n          455 ZAMORRA GESTURES AND JUAN JOSE crosses. to them...\n\n<b>          3RD SOLDIER\n</b>          Quieren muchachas?\n          Pike looks at Angel for a moment, then turns away..\n\n<b>          PIKE\n</b>          Why not?.\n          The group moves through the celebration out the main gate\n          and into the village beyond.\n\n<b>          EXT. CAMP GROUND - DAY\n</b>\n\n<b>          456 THORNTON IS ON THE RIDGE TOP SEARCHING THE BADLANDS WITH\n</b>          HIS GLASSES as his men search the area behind and. below him.\n\n<b>          COFFER\n</b>          Don't look like nobody was ever. here,\n\n<b>          T'.C.\n</b>          (pointing at horse tracks)\n          Well, they was.\n          Then they look up as:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          119.\n</b>\n<b>          457 THORNTON RUNS DOWN THE SLOPE TOWARD THEM\n</b>\n<b>           THORNTON\n</b>           Army patrol -- coming this way.\n           Instantly the men mount and ride out.\n\n<b>           DISSOLVE TO :\n</b>\n<b>          INT. NATIVE HUT - DAY\n</b>\n          458 PIKE IS SPRAWLED OVER A NATIVE HAMMOCK, drunk.. He lifts a\n          bottle of mescale and takes a drink.\n          459 ON THE FLOOR OF THE HUT A SAD BUT NOT UNATTRACTIVE WOMAN is\n          sitting looking at a handful of silver in her hand. In one\n          corner a baby whines as the flies bother it.\n          Through an open door leading to another room,.the drunken\n          voices of the Gorch brothers can be heard as they bargain\n          with DELORES, a very reluctant prostitute.\n\n<b>          LYLE (OS)\n</b>          You said dos for two.\n\n<b>           TECTOR (O.S )\n</b>           And here's.your dos and one'to grow on\n          'cause y ou did real well, honey.\n\n<b>           DELORES (OS)\n</b>          Doce -- es mas que dos dace para cada\n          uno. _\n\n<b>          460 PIKE WATCHES THE WOMAN AND THE BABY FOR A MOMENT LONGER THEN\n</b>           SUDDENLY SWINGS OUT OF THE HAMMOCK and steps into the ad-\n          joining room.\n          461. LYLE GORCH LOOKS UP AT HIM BLEARILY FROM A HAMMOCK. Tector is\n          on the floor embracing the disheveled woman.\n          Pike watches them, weaving a little:\n\n<b>          PIKE\n</b>\n<b>          (FINALLY)\n</b>          Let's get Angel...\n          462 TECTORâ\u0080¢IMMEDIATELY REACHES.FOR HIS GUN and stands as if he\n          has just been given an important order by a commanding offi-\n          cer. Lyle rises more slowly, begins to check the.-loads in\n          his pistols.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          120.\n</b>\n<b>          462 CONTINUED\n</b>\n<b>          LYLE\n</b>          Why not?\n          Pike turns and moves through. his room. Tector and Lyle follow.\n          Behind them the.woaian begins her complaints again.\n\n<b>          EXT. NATIVE HUT - NIGHT\n</b>\n\n<b>          46.3 PIKE AND THE GORCH BROTHERS COME THROUGH'THE DOOR. DUTCH IS\n</b>          SITTING WITH A'BOTTLE BACK AGAINST THE WALL listening. to the\n          plaintive sound of a distant guitar.. He.looks up as they\n          come out.\n\n<b>          DUTCH\n</b>\n<b>          (RISING)\n</b>          Angel?...\n\n<b>          PIKE\n</b>          Yeah.\n          464 THEY CROSS TO THEIR HORSES, THEIR DRUNKENNESS LESSENING with\n          every step.\n          Pike and Dutch pull rifles. or shotguns from their saddle scab-\n          bards as do . Lyle.and-Tector,. then they move up the village\n          street..\n\n<b>          465 FOUR MEN IN LINE AND THE AIR OF IMPENDING VIOLENCE IS SO\n</b>          STRONG around them that as they pass through the celebrating\n          soldiers, the song and the laughter begin to die.\n\n<b>          INT. RUINED HACIENDA - NIGHT\n</b>\n          466 MAPACHE, THE GERMANS, ZAMORRA, HERRERA AND SIX OR SEVEN of\n          their officers and a handful of women are seated-at a long\n          center table.. Food and liquor bottles are spilled every-\n          where, the mariachi band plays for:\n          466A CHITA, A SCARED, NOT UNATTRACTIVE GIRL who is trying to\n          please the general by dancing on the table.\n          At other tables are more officers and perhaps thirty or so\n          enlisted men. The machine gun mounted on its tripod is in a\n          far corner..\n          467 ANGEL LIES ON THE FLOOR, nearly unconscious, almost unrecog-\n           nizable from. the beating he has taken..\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          121.\n</b>\n<b>          467 CONTINUED\n</b>\n<b>           F\n</b>           Mapache watches the dancer, then angrily kicks her off the\n           table. She falls heavily to the floor, then Mapache seeing\"\n          468 PIKE AND THE OTHERS ENTER THROUdH THE LARGE ARCHES and s. 'and\n          watching.\n\n<b>          MAPACHE\n</b>          (half angry)\n          Hey, bandidos? What you want?.\n\n<b>          ZAMORRA\n</b>\n<b>          (QUICKLY)\n</b>          Hey, this\n          (pointing to Herrera)\n          Dog lost those gringos you wanted -\n          but.we kill 'em tomorrow -- naw. you\n          go on and get out of here;\n\n<b>          PIKE\n</b>          We want Angel;\n          Mapache stares at them without answering.\n\n<b>          ZAMORRA.\n</b>          You are very stupid...very stupid!\n\n<b>          464 SUDDENLY MAPACHE LURCHES UP FROM THE TABLE, CROSSES TO ANGEL\n</b>           AND LIFTS HIM TO HIS FEET. Half dragging him, he steps in\n           front' of the Americans. Around him many of the soldiers are\n          rising. -\n          470 PIKE WATCHES UNMOVING AS MAPACHE PROPS up Angel from behind,\n          grins at them.\n\n<b>           MAPACHE\n</b>          You want him..,?\n           He takes a knife and cuts the rope binding. Angel's hands.\n          471. ANGEL-BARELY ABLE TO STAND, REACTS with disbelief..\n          472 PIKE AND DJTCH WATCH without a movement, without a sound.\n\n<b>           MAPACHE\n</b>\n<b>           (SOFTLY)\n</b>          Take him...\n          473 TECTOR AND LYLE IGNORE MAPACHE, THEIR eyes drifting over the\n          Mexicans who are slowly edging forward,some beginning to grin.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          122.\n</b>          474 ZAMORRA, STILL SEATED at the table pours himself a drink,\n          the clink of the glass against the bottle loud in the\n          silence. Beside him the.Germans rise slowly.\n          Mapache, still holding Angel from behind, leans over his\n          shoulder and whispers in his ear:\n\n<b>          MAPACHE\n</b>\n<b>          (GENTLY)\n</b>          Vete, Angelito:..te esperan. los.\n          gringitos...\n          475 ANGEL STANDS FAST, then curiously he takes a step forward.\n\n<b>          476 PIKE. AND THE OTHERS REMAIN MOTIONLESS\n</b>          477 ANGEL'S FACE BEGINS to brighten with hope and he takes\n          another step,. then:\n          478 MAPACHE GRABS HIM.BY THE HAIR and his other hand flashes\n          across the boy's throat as he shoves Angel-into the Americans,\n          the blood splattering them from his severed throat.\n          .479 AS PIKE STEPS BACK TO AVOID-Angel's falling body, he draws\n          his forty-five automatic and fires twice into Mapache.\n          480 THE BULLETS DOUBLE HIM AND HURL HIM INTO.HIS MEN. As he\n\n<b>          CRUMPLES:\n</b>          481 DUTCH.FIRES INTO THE TOP OF HIS. HEAD, then the room explodes\n          with gunfire.\n          ,482 ZAMORRA AND TWO OF THE OTHERS scramble for cover while\n          drawing.\n           Mohr runs for the machine gun. Rï¿½fle fire erupts from the\n           courtyard as the soldiers rush forward and die as:\n          483 ONE OF DUTCH'S GRENADES explodes amongst them.\n          484 PIKE, FIRING WITH AMAZING rapidity empties his ,45, shoves\n          it in his belt, cocks the lever on the rifle, moving slowly\n          but steadily into the shadowed corners of the room -- kill-\n          ing men, firing, being shot at and hit in return.\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          123.\n</b>          485 DUTCH EMPTYING his .44, throwing another grenade, is hit,\n           draws his .45, continues firing, moving with Pike, covering\n          his back.\n          486 THE SOLDIES HUNT COVER and die -- more pour in from the\n           courtyard and die caught in the cross fire.\n          487 TECTOR AND LYLE YELLING with the lust of battle charge toward\n           the table, emptying their guns.\n          488 MOHR.REACHES THE MACHINE GUN, begins firing. Kills a number\n           of soldiers as it gets away from him.\n          489 PIKE KILLS HIM with his last two rifle shots and the German\n           dies with his finger locked. on the trigger.\n          490 THE GUN SWINGS, cutting a swath of death across the room,\n           killing s.ix soldiers,wzunding Dutch.\n          491 PIKE: THROWS THE RIFLE. as he slips a. now clip in the .45,\n          whirls as:\n          .492 ZAMORRA PUTS three rounds into Dutch.\n          493 PIKE KILLS ZAMORRA AND HERRERA, then a soldier has driven a\n           bayonet through his gut and into the wall.\n\n<b>          494 DUTCH, ON THE FLOOR, KILLS THE SOLDIER\n</b>          495' MEXICANS CONTINUE FIRING AT THE AMERICANS from all sides and\n          the Gorch brothers, badly wounded,. but still on their feet\n          still are blasting away at them from the middle of the room,\n          then Tector, laughing, picks up. the screaming, terrified\n          Chita and, rushes the crowd, using the woman for a shield.\n          She tosses her head and dies as bullets slam into her soft\n          body, then he is.hit again and goes down on one knee.\n          496 A SOLDIER, UNSEEN BY.TECTOR', steps into a doorway. He aims\n          at Tecto'r with a revolver and fires Into him from several\n          feet away. The bullets tear into Tector and he drops the\n          woman and dances out into the room. As he is hit. from all\n          sides, he whirls around, seeing:\n\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>          12th.\n          497 THE MAN IN THE DOORWAY, he fires his last shot into the man's\n          body. The man plunges forward screaming. Tector stands up\n          straight as bullets pour into him. Finally, he crumples fast\n          and falls,\n          :; 498 LYLE., HIT SEVERAL TIMES, SCREAMING WITH RAGE, standing over\n          Tector is wild-eyed, firing madly into the crowd. A bullet\n          splashes into his cheek and he runs..at. the nearest of his\n          attackers, firing, scattering them, killing most,\n          499 TECTOR RISES, CLICKS HIS EMPTY pistol at. the mob. A soldier\n          rushes him from behind with a machete and the cross fire of\n          his own men kills him as he swings the weapon into TectorPs\n          back. Tector falls to the floor,. writhing in pain, cursing,\n          pulling down a soldier, strangling him as he dies,\n          500 LYLE STAGGERS, BULLETS PUMPING into him, then falls - dead\n           before he hits the ground. The soldiers continue to fire\n           into. his body,\n          501 DUTCH LIFTS A SOLDIER AND TOSSES him against the wall, then\n          falls as bullets cut into him. He rolls, then.crawls under\n          the tables dragging the useless lower half'of his body. Al-\n          thotgh in pain, he is grinning strangely. He removes a car-\n          bine from a dead soldier and. props himself on a bench. Taking\n          careful aim,, he fires and a 'soldier drops screaming-.and.\n          kicking. Methodically he aims and fires again, and again and\n          again, a man dying each time he pulls the trigger..\n          502. PIKE WATCHES AS HE TENSES, FINALLY JERKS THE BAYONET out of\n          his body, runs firing at five of the soldiers. who are rushing\n          the room -- kills two,. reaches the machine gun, pulls Mohr\n          away from the gun, ,jerks back the bolt. and staggers as a\n          soldier empties his pistol into him from behind, Pike him-\n          self turns and dies,\n          503 DUTCH SWINGS THE RIFLE, firing, crippling the soldier, then:\n          504 ANOTHER SOLDIER, HIS UNIFORM STAINED WITH BLOOD, draws his\n          knife and hardly able to move, falls on Dutch -- the weight\n          of the.fall-burying the weapon deep into Dutch's back.\n          Crumpled together, both.men die,\n\n<b>          EXT. COURTYARD - NIGHT\n</b>\n          505 FOR A FEW SECONDS THERE IS STILL sporadic gunfire as the re-\n          maining soldiers fire into the bodies of the wild bunch..\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          125.\n</b>\n<b>          505 CONTINUED\n</b>          Then it stops. A mortally. wounded man suddenly screams in\n          agony and writhes on the floor and dies. Another, pistol in\n          hand, rises, staggers to the gateway, teeters for a moment,\n          then falls, firing blindly into the. dust. Somewhere outside\n          the wall, a cur yelps and runs away into the night,\n\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT. AGUA VERDE - GATE..- DAY\n</b>\n          505A THE BOUNTY HUNTERS led by Thornton, ride through. It appears\n          deserted, _\n\n<b>          EXT. HACIENDA COURTYARD - DAY\n</b>\n          506 IN THE COURTYARD A SMALL GROUP OF WOMEN wrapped in. black\n          robosas are burning candles and moving. among the dead bodies.\n          that spill out of the large room of the hacienda and into the\n          yard. It is a scene of carnage, blood now black in.the sun,\n          a million flies and the walls lined with waiting vultures.\n          There is no sign of soldiers anywhere.. A few of the bodies\n          have been dragged into the courtyard. Most, including Pike,\n          Dutch and the others, including Mapache, lie where they fell.\n\n<b>          507 THE BOUNTY HUNTERS, LED BY THORNTON, RIDE UP TO THE ARCHES\n</b>          AND DISMOUNT, their horses snorting nervously at the smell of\n          blood and the stench of death. At-the end of the courtyard\n          where five corpses are heaped in a small Di13, a lone vulture\n          stands. patiently near them.\n          As the bounty hunters approach and the-.bird labors reluctantly\n          into flight, the men dismount.\n          Thornton, looking in through the broken wall, turns away.\n          Coffer and T.C. enter, whistle softly..\n\n<b>          COFFER\n</b>          It's them.\n\n<b>          THORNTON\n</b>          You'd have.one hell of a time proving\n          that.a week from now, in Texas.\n\n<b>          -COFFER.\n</b>          We could try...Hell, a pelt's a pelt,\n          it don't matter what condition it's in.\n\n<b>          T.C.\n</b>          Picked clean -- not a gun on 'em.,.\n          Thornton walks slowly among the bodies.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          126.\n</b>\n<b>          507 CONTINUED\n</b>\n<b>          T.C. '(OS)\n</b>          This boy here's got some gold in his\n          teeth... .Let me see your knife, Coffer.\n\n<b>          COFFER\n</b>          (crossing to Thornton)\n          em. _Hey, Thornton, should we load up?\n\n<b>          THORNTON\n</b>          (walking away)\n          Suit yourself,\n\n<b>          T.C.\n</b>          We going to wait here for Jess or\n          meet him on the way?\n          But Thornton doesn't answer; reaching his horse, he mounts\n          and. rides away.\n          Coffer and T.C,. and Ross look after him..\n\n<b>          ROSS\n</b>          (pointing to the bird\n          on the walk)\n          If Jess is counting on buzzards to.\n          lead him to. old Sykes, he's got a\n          long wait -- we got 'em all..\n          They laugh and go to work.\n\n<b>          EXT. GATE - AGUA VERDE - DAY\n</b>\n          508 THORNTON COMES THROUGH THE GATE, ties his horse, sits down,\n          his back against the wall. Except for a dog and two.silent\n          women, the village appears deserted.\n          Thornton rolls a cigarette, begins to smoke it.. waiting.\n\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT'. GATE AGUA VERDE AFTERNOON\n</b>          509 COFFER, ROSS AND T.C.-ride out leading four pack animals, each\n          carrying a body.\n          Thornton looks up, he doesn't move.\n\n<b>          COFFER\n</b>          You ain't comin'?\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          CHANGE\n</b>\n<b>          2/12/68\n</b>\n<b>          127.\n</b>\n<b>          509 CONTINUED\n</b>           Thornton shakes his head.-\n\n<b>           T. C..\n</b>\n<b>          (NERVOUS)\n</b>          Maybe we better wait here for Jess,\n\n<b>          COFFER\n</b>          ----.No we 9.11 pick him up on the way --\n          I -want to-get out. of this goddamned\n          place -- anyways these boys will start\n          going ripe on us by tomorrow --. we got\n          to' move --\n          (then; to Thornton)\n          You sure you ain't coming?\n          Coffer shrugs and drinking out ofa half-full tequi.lla bottle,\n          rides off, followed by the others who ignore Thornton as\n          completely as he does them,\n\n<b>          DISSOLVE TOï¿½\n</b>\n<b>          EXT. GATE - AGUA VERDE - LATE AFTERNOON\n</b>\n          510 THORNTON HASN'T MOVED. Then from the. distance come three\n          slow-paced rifle shots -- Thornton sits up -- waits, then\n          there is a fourth -- Thornton settles back,\n\n<b>          DISSOLVE TO:\n</b>\n<b>          EXT. GATE - AGUA VERDE - EARLY EVENING\n</b>\n          511. THE SUN HAS PASSED THE MOUNTAINS AND AS the light goes\n          a cold wind kicks dust across the empty street of the\n          village.. Thornton stands, looking off at:\n\n<b>          512 FREDDY.SYKES, DON JOSE, ENERO, THE YOUNG GOAT HERDER,\n</b>          IGNACIO;.and a handful of Angells compadres sit watching\n          him. They are leading the bounty hunters' horses, the\n          sacks of gold are tied to Sykes' saddle.\n\n<b>          SYKES\n</b>          Didn't expect to find you here,\n          Deke.\n\n<b>          THORNTON\n</b>          Why. not -- I sent 9 em.back -- that's\n          all I said I'd do.\n\n<b>          CONTINUED\n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          \n</b>\n<b>          128.\n</b>\n<b>          512 CONTINUED\n</b>\n<b>          SYKES\n</b>          They didn't et far --\n\n<b>          (THEN)\n</b>          You the one that shot me?\n\n<b>          THORNTON\n</b>          Don't know -- does.it make any\n          difference?\n\n<b>          SYKES\n</b>          (after a moment)\n          I reckon not.\n\n<b>          (THEN)\n</b>          What are;. your plans?\n\n<b>          THORNTON\n</b>          Drift around down here -- try and.\n          stay out of jail --\n\n<b>          SYKES\n</b>          Well,, come along -- we got some work\n          to do --\n          (riding away)\n          It ain't like it used to be,. but it's\n          better than nothing.\n          513. THORNTON TAKES A DEEP BREATH, THEN HALF GRINS, unties his\n          horse, then mounts and follows.\n\n<b>          FADE OUT.\n</b>\n\n\n<b>          THE END\n</b>\n\n\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\"><img border=\"0\" src=\"http://www.imsdb.com/posters/Wild-Bunch,-The.jpg\"/>\n</td><td><h1>Wild Bunch, The</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Walon Green\" title=\"Scripts by Walon Green\">Walon Green</a>  <a href=\"/writer.php?w=Sam Peckinpah\" title=\"Scripts by Sam Peckinpah\">Sam Peckinpah</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Western\" title=\"Western Scripts\">Western</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Wild Bunch, The Script.html#comments\" title=\"Wild Bunch, The comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:20:24.089561"}