{"title": "Willow", "film_link": "/Movie Scripts/Willow Script.html", "script_link": "/scripts/Willow.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>Willow Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"Willow Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/10-stars.gif\"/> (10.00 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=George Lucas\" title=\"Scripts by George Lucas\">George Lucas</a><br/>  <a href=\"/writer.php?w=Bob Dolman\" title=\"Scripts by Bob Dolman\">Bob Dolman</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a><br/>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a><br/>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a><br/>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/>\n<br/>\n<a href=\"/scripts/Willow.html\">Read \"Willow\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>\n\n<script>\n<b><!--\n</b>if (window!= top)\ntop.location.href=location.href\n<b>// -->\n</b></script>\n<title>WILLOW</title>\n\n<pre>                       \"WILLOW\"\n\n\n\n\n\n\n\n\n\n\n\n                       Story by\n                     George Lucas\n\n\n\n                      Screenplay\n                          by\n                      Bob Dolman\n\n\n\n\n\n\n                      First Draft\n                    Third Revision\n                   November 14, 1986\n\n\n(c) LFL 1986\nLucasfilm LTD.\nAll Rights Reserved\n\n                          Act I\n\n<b>FADE IN:\n</b>\n<b>EXT.. NOCKMAAR CASTLE - DAY\n</b>\nUnder gloomy sky a huge fortress looms on a volcanic\nmountainside.  From within WE HEAR the agonizing scream\nof a woman giving birth.\n\n<b>INT.. NOCKMAAR CASTLE - DAY\n</b>\nThe scream continues as WE MOVE THROUGH the grim corri-\ndors of the castle TOWARD stairs leading down to a\ndungeon.\n\n<b>INT.. DUNGEON - DAY\n</b>\nSilhouetted in sadows, three Nockmaar MINIONS stand\nguard.  In a jail cell, sex fully pregnant WOMEN watch\nfrom behind iron bars.  The screaming stops.  There's a\nmoment of silence.  As WE MOVE INTO another jail cell\nWE HEAR a slap and the first cry of a newborn BABY.\n\nIn the cell a black-robed DRUID watches intensely as\nETHNA, a midwife, leans over the MOTHER and wraps the\nbaby in swaddling.\n\n<b>                         DRUID\n</b>          Is it a girl?\n\n<b>                         ETHNA\n</b>          It is a girl.\n\n<b>                         DRUID\n</b>          Show me its arm.\n\nEthna peels back the swaddling.  On the baby's arm is a\nsmall marking.\n\n<b>                         DRUID\n</b>          It's true then.  I must tell Queen\n          Bavmorda.\n\nWith great urgency the druid hurries up the dungeon\nstairs.  Ethna gently places the baby on the mother's\nbreast.  The mother comforst the baby lovingly until it\nstops crying.  Then she reaches out and clasps the\nmidwife's wrist.\n\n<b>                        MOTHER\n</b>          Ethna, please.  Help me.  They're\n          going to kill my baby.\n\nEthna nervously looks out at the guards, then shakes\nher head at the mother.\n\n<b>                         ETHNA\n</b>          They'll kill you.\n\n<b>                        MOTHER\n</b>          Please save my baby.\n\nEthna hesitates.  Then decides.  She quickly wraps to-\ngether some rags and gives them to the mother.\n\n<b>                         ETHNA\n</b>          Pretend this is the child.\n\n<b>                        MOTHER\n</b>          Thank you, Ethna.  Thank you.\n\nThe mother kisses her baby and hands it to Ethna, who\nhides the baby inside the basket of rags.  Ethna car-\nries the basket past the guards and up the stairs.\n\nThe mother lies back and sighs with relief.  Then she\nhears clinking bootsteps and her eyes widen with fear.\n\nQUEEN BAVMORDA sweeps down the dungeon stairs, her\nblack robes flowing behind her.  The druid hurries\nalongside.\n\n<b>                       BAVMORDA\n</b>          We will start the ritual at dusk.\n          You're certain this is the one?\n\n<b>                         DRUID\n</b>          It bears the markings.\n\n<b>                       BAVMORDA\n</b>          I must see for myself!  Just as the\n          omen foretold!\n\nThe guards fearfully move aside as Bavmorda enters the\ncell.\n\n<b>                       BAVMORDA\n</b>          So.  You *were* the one.\n\n<b>                        MOTHER\n</b>          Yes.  But nothing you can do will\n          stop the prophecy.\n\n<b>                       BAVMORDA\n</b>          This child will have no power over\n          me....\n\nBavmorda grabs the rags away from the mother and anxi-\nously tears them apart.\n\n<b>                       BAVMORDA\n</b>                      (furiously)\n          Where's the baby!\n\nOne of the guards looks up the stairs.\n\n<b>                         GUARD\n</b>          The midwife!\n\nBavmorda flies into a rage.\n\n<b>                       BAVMORDA\n</b>          Find that baby!  Use the dogs!\n          Sorsha!\n\nTwo guards draw swords and charge upstairs.  Bavmorda\ngrabs the third guard and nods toward the mother.\n\n<b>                       BAVMORDA\n</b>          Kill her.\n\nBavmorda storms away with the druid.  WE SEE the shadow\nof the guard move over the terrified mother.  War drums\nbegin to beat out an alarm.\n\n<b>EXT. SNOWY MOUNTAINSIDE - DAY\n</b>\nTITLES BEGIN.  The midwife hurries through swirling\nshow, clutching the baby.\n\n<b>EXT. VILLAGE - DAY\n</b>\nNockmaar troops on horseback charge into a desolate\nvillage, driving ferocious DEATH DOGS into huts,\nviolently searching for the baby.  The oppressed, poor\nVILLAGERS are yanked into the street.  Some of them are\nbeaten.  One is killed.\n\nThe midwife hides behind a hut, still holding the baby,\nthen runs away from the village.\n\n<b>EXT. GRASSLAND - DAY\n</b>\nEthna treks across an open grass field.\n\n<b>EXT. WOODS - NIGHT\n</b>\nShe huddles by a fire, exhausted and hungry, her\nclothes filthy and torn, and she rocks the crying baby.\nShe hears dogs howling in the distance.  She clutches\nthe baby, kicks out the fire, and runs.\n\n<b>EXT. OCEAN CLIFFSIDE - DAY\n</b>\nShe scrambles over rocks on a windswept coastline.\n\n<b>EXT. FOREST - DAWN\n</b>\nEthna runs desperately for her life.  Chasing her are\ntwo vicious DEATH DOGS.  She scrambles across a shallow\nriver.  She claws at rock and tears away sticks and\ndriftwood matted together with weeds.  Into this she\nplaces the baby and sets it afloat downstream.\n\n<b>                       DEATH DOG\n</b>          Bordak!\n\nThe dogs lunge from the woods and splash across the\nriver.  The midwife claws her way up a steep bank, lur-\ning the dogs.  As they attack her:\n\n<b>                        MIDWIFE\n</b>          I don't have her!  No!  No!\n\nShe grabs a stick and tries to defend herself, thrash-\ning at the snarling dogs.\n\nFrom the baby's view, as it floats down the river, WE\nSEE the dogs kill the midwife beyond the distant trees.\n\n<b>EXT. DOWNRIVER - DAY - MONTAGE\n</b>\nThe little raft of sticks swirls precariously in the\ncurrent.  It glances off jutting rocks, tumbles over\nrapids, and scrapes under overhanging trees.\n\n<b>EXT. RIVERBANK - DAY\n</b>\nAt last the raft catches in some weeks, almost dumping\nthe baby.\n\n<b>TITLE SEQUENCE ENDS\n</b>\nSuddenly WE HEAR rustling leaves, possibly another\nDeath Dog.  Then WE HEAR giggling.  Two children, RANON\nand MIMS, watch in amazement from the riverbank.\n\n<b>EXT. UFGOOD FARM - DAY\n</b>\nHolding onto a plow, WILLOW UFGOOD struggles behind a\nhuge hog.  From a heavy sack slung over his shoulder he\ntosses seeds.\n\n<b>                         RANON\n</b>          Dada!  We found something in the\n          river!\n\nWillow beams with joy as his son and daughter race to-\nward him.  They grab his sleeves and tug him away from\nhis plow.\n\n<b>                        WILLOW\n</b>          I can't run off and play with you\n          now.  I've got work to do.\n\n<b>                      RANON/MIMS\n</b>          But Dada, you gotta see it!  Hurry!\n\nWillow drops his sack of seeds.  The ugly hog glares at\nhim like a guilty conscience.  The children squeal with\nexcitement as their father runs toward the river with\nthem.\n\n<b>EXT. RIVERBANK - DAY\n</b>\nWE SEE Willow from the baby's view.  His eyes pop open.\nHe quickly backs his children away.\n\n<b>                        WILLOW\n</b>          Back!  Don't go near it.  We don't\n          know where it's been.  It could be\n          diseased.\n\n<b>                         MIMS\n</b>          It's a baby!\n\n<b>                         RANON\n</b>          It's not a Nelwyn baby.\n\n<b>                        WILLOW\n</b>          No, it's too big to be a Nelwyn\n          baby.  It looks like a daikini...\n\n<b>                         MIMS\n</b>          Ooh, it's so cute...\n\n<b>                        WILLOW\n</b>          Mims!  Get back here!  It might\n          bite you.\n\nWillow drags Mims away.  Then the baby starts crying.\n\n<b>                         RANON\n</b>          Can't we keep it, Dada?\n\n<b>                        WILLOW\n</b>          Absolutely not.\n\n<b>                      BURGLEKUTT\n</b>          Ufgood!  Willow Ufgood!\n\nWillow, in a sudden panic, sees BURGLEKUTT in the dis-\ntance.  He splashes into the river, grabs the raft,\nplunks it on the bank and tries to hush the crying\nbaby.\n\n<b>                        WILLOW\n</b>          Shhh, shhh!  It's the Prefect --\n          that's all I need.  Mims, Ranon,\n          keep this thing hidden...\n\n<b>EXT. UFGOOD FARM - DAY\n</b>\nBurglekutt's beady eyes spot Willow making a mad dash\nfor his plow.  Swinging his fat stomach, he angrily\npoints his walking stick and goes after him.\n\n<b>                         KIAYA\n</b>          Mr. Burglekutt!  He hasn't done\n          anything wrong!\n\nWillow's wife KIAYA chases Burglekutt across the field,\nher beautiful long hair flowing behind her.  Willow\nquickly gets behind his plow like he's been there all\nday.\n\n<b>                      BURGLEKUTT\n</b>          Ufgood!  What do you think you're\n                doing!  I tell the planting seeds\n                in this village.\n\n<b>                         KIAYA\n</b>          I told him we didn't steal it, Wil-\n          low.\n\nBurglekutt furiously scoops a handful of seeds out of\nWillow's sack and shakes them under Willow's nose.\n\n<b>                      BURGLEKUTT\n</b>          You haven't paid your debts.  Where\n          did you get these seeds?\n\nWith pride, Willow puts his arm around his wife.\n\n<b>                        WILLOW\n</b>          In the forest.  My family's been\n          gathering them since last fall.\n          There's no law against that, Bur-\n          glekutt.\n\nSuddenly the children laugh in the distance.\n\n<b>                         KIAYA\n</b>          Willow!  You left the children\n          alone by the river??\n\nIn alarm she runs off before Willow can stop her.  Bur-\nglekutt sweeps the horizon with his walking stick.\n\n<b>                      BURGLEKUTT\n</b>          Too late, Ufgood.  You'll never get\n          your planting done before the rains\n          start.  You're gonna lose this\n          land.\n\nHe raises the seeds high above his head, then smashes\nthem down at Willow's boots.  He waddles away toward\ntwo of his MEN who wait by the road.  Then:  Kiaya\nSHRIEKS from the river.  Burglekutt stops in his tracks\nand shakes his head as if to say \"the whole family's\ncrazy.\"  Off he trudges.  Willow watches and waits.\nThen runs as fast as he can to the river.\n\n<b>EXT. RIVER - DAY\n</b>\nKiaya cradles the baby in her arms.  Willow runs up,\nand with patriarchal authority, puts his fists on his\nhips.\n\n<b>                        WILLOW\n</b>          Absolutely, under no condition, is\n          anyone in this family going to fall\n          in love with that baby.\n\nThey all fall in love as he speaks.  The children fol-\nlow Kiaya up on the bank, walking right past Willow.\n\n<b>                        WILLOW\n</b>          Kiaya!  We can't keep that baby.\n          Mims, Ranon.  Hey!  I will not be\n          ignored!\n\nIgnored, Willow huffs after them across his unplowed\nfield.\n\n<b>INT. UFGOOD HOUSE - DAY\n</b>\nWillow nervously paces as Kiaya pours water in a wood\ntub and the children entertain the naked baby with\nsticks and brightly colored cloths, apparatus for a\nmagic trick.\n\n<b>                        WILLOW\n</b>          This is bad.  If we're caught with\n          that little daikini it'll be the\n          end of us.  Careful, Ranon, I need\n          that for the festival.\n                (indicates magic cloth)\n          Kiaya, what are we going to do?\n\n<b>                         KIAYA\n</b>          We're gonna give this baby a bath.\n\nThe baby squeals with joy as Kiaya lifts her into the\nbath.\n\n<b>                        WILLOW\n</b>          Burglekutt's right.  There's not\n          enough time to finish plowing.\n          We'll lose everything and I'll end\n          up working in the mines.\n\nHe shudders at the thought.\n\n<b>                         KIAYA\n</b>          Willow, do you think we should take\n          her to the Village Council?\n\n<b>                        WILLOW\n</b>          No, no!  They'll think it's a bad\n          omen.  There'll be a flood or a\n          drought or a plague and\n          everybody'll blame me for it!\n\n<b>                         RANON\n</b>          Look.  What's that?\n\nWillow leans forward.  On the baby's shoulder is a\nsmall branded scar in a circular design.  It only adds\nto Willow's fears.\n\n<b>                        WILLOW\n</b>          I don't know.  This is trouble.\n          I'll talk to the High Aldwin about\n          it tomorrow at the Festival.\n\nThe baby kicks and splashes and giggles in the bath.\n\n<b>EXT. NELWYN VILLAGE - DAY\n</b>\nThe raucous BAND plays as NELWYNS dance and celebrate\namid brochs and wheelhouses garlanded with flowers.  A\ncrowd cheers wildly as MINERS battle FARMERS in a tug-\nof-war, finally yanking the farmers face-first into a\npuddle of mud.  On a stage a HARLEQUIN dances delight-\nfully.  While on a raised platform the five members of\nthe VILLAGE COUNCIL sit and observe, mildly amused.\nThe head councilman is Burglekutt.\n\nThe WE SEE Willow on another stage.  He flourishes his\ncolorful sticks and cloths.  In the audience WE NOTICE\nhis friend MEEGOSH, who wears a miner's apron, rooting\nWillow on.\n\n<b>                        WILLOW\n</b>          And now!  For our final amazing bit\n          of magic, I will make an entire pig\n          completely disappear!\n\nMeegosh applauds as Mims and Ranon trot out lugging a\ntiny baby pig in a crate.  As Willow takes the pig out\nit bites his hand and gets away.  Willow tackles and\nsquashes it.  The crowd laughs and half of them leave,\nand Meegosh covers his face.\n\nMims and Ranon rapidly wave a bright blanket.  Willow\ncleverly whips the pig under his legs and behind his\nback and suddenly it's gone!  Impresse, the crowd\ngasps.  Then the pig squeals and dashes through\nWillow's legs and leaps off the stage.\n\n<b>                         CROWD\n</b>          Aaww!  Booo!  Sssss!\n\nBurglekutt and the Council shake their heads as Willow,\nembarassed, picks up his things.  Meegosh trots up\nwith the pig under his arm.\n\n<b>                        WILLOW\n</b>          Meegosh, I'm in trouble.\n\n<b>                        MEEGOSH\n</b>          Hey, it wasn't that bad.  You need\n          a better pig, that's all.\n\nBut as they walk past the Village Council, and Bur-\nglekutt sneers down at Willow, Meegosh catches on.\n\n<b>                        MEEGOSH\n</b>          Now Burglekutt's got you in the\n          squeeze.  Soon you'll be down in\n          the mines like me.\n\n<b>                        WILLOW\n</b>          Mining.  I hate closed-in spaces.\n          That's the last thing I'd ever do.\n                     (he shudders)\n          I gotta get my crop planted.\n\n<b>                        MEEGOSH\n</b>          You know I'll help you as much as I\n          can, Willow.\n\nThe Village Council members stand up respectfully as\nthe wise old HIGH ALDWIN hobbles through the adoring\ncrowd.  Mims and Ranon rush up to Willow with several\nother children who are eating candy.\n\n<b>                         MIMS\n</b>          Dada, can we get treacle candy?\n          Can we, can we?  Please?\n\n<b>                        WILLOW\n</b>                     (preoccupied)\n          Meegosh, can you watch the chil-\n          dren?  I gotta talk to the High\n          Aldwin.\n\n<b>                        MEEGOSH\n</b>                    (truly amazed)\n          The High Aldwin??  Why?\n\nBut Willow has already wandered into the crowd, leaving\nMeegosh with a dozen sugar-charged children and a pig.\n\nWillow desperately pushes past people and finally\nreaches the High Aldwin.\n\n<b>                        WILLOW\n</b>          Sir!  I have to talk to you.\n\n<b>                      HIGH ALDWIN\n</b>          Not today, Willow.\n\n<b>                        WILLOW\n</b>          It's a matter of great importance\n          to me!\n\nBurglekutt stares angrily from his platform.  Slightly\nannoyed, the High Aldwin stops and places his hand on\nWillow's shoulder.\n\n<b>                      HIGH ALDWIN\n</b>          Intuition, Willow -- remember?  I\n          know you're eager to be my appren-\n          tice, Willow.  But today is the\n          spring festival.\n\nSuddenly a walking stick is pointed at Willow's nose.\n\n<b>                      BURGLEKUTT\n</b>          Apprentice?  To the High Aldwin!!\n          Willow Ufgood???\n\nHis belly shakes as he howls with laughter, encouraging\nhis councilmen to join in.  Willow shrinks away, em-\nbarassed.\n\nThen a terrified SHRIEK shatters the festivity.  Music \nstops and people grab their children and run for their\nlives.  A DEATH DOG rips a trail of destruction through\nthe village.\n\nMeegosh holds onto Ranon and Mims.  But when Mims sees\nWillow she runs right out into the open.  Willow\ncharges twoard her, tackling her and rolling away from\nthe beast's claws.\n\n<b>                       DEATH DOG\n</b>          Bordak!  Bordak!\n\nA loud war cry distracts the dog.  VOHNKAR, the\ntoughest warrior in the village, leads a charging army\nof miners and farmers wielding shovels and picks.  Wil-\nlow and Meegosh grab sticks.  The Nelwyns battle the\nDeath Dog.  At last, Vohnkar drives a spear through its\nchest and it dies hideously.\n\n<b>                        MEEGOSH\n</b>          What was it looking for?\n\n<b>                      A VILLAGER\n</b>          It said \"bordak\"!  What does it\n          mean?\n\n<b>                      COUNCILMAN\n</b>                      (scholarly)\n          Baby!  It means baby!  It was look-\n          ing for somebody's baby!\n\nMothers grab their children, people look around the\nwrecked village in terror.  There's a haunting silence.\n\n<b>                         MIMS\n</b>          Mommy?\n\nSuddenly alarmed, Willow races towrd his distant farm,\nhis children hurrying behind.\n\n<b>                        WILLOW\n</b>          Kiaya!  Kiaya!\n\n<b>INT. UFGOOD HOUSE - DAY\n</b>\nWillow bursts in and finds Kiaya calmly feeding the\nbaby.  Relieved, he throws his arms around her.\n\n<b>                        WILLOW\n</b>          We can't keep this baby, Kiaya.  We\n          must take her to the Council.\n\nThe children run in and they all huddle together, cher-\nishing their precious lives.\n\n<b>INT. COUNCIL BUILDING - DAY\n</b>\nArguing villagers pack the church-shaped room to the\nopen door at the back and into the balconies above.\nThe councilmen sit on a platform at the front, with the\nHigh Aldwin seated in a special chair above them.  Tak-\ning charge, Burglekutt stands and pounds the floor with\nhis walking stick.\n\n<b>                      BURGLEKUTT\n</b>          An evil beast from the outer world\n          has invaded our peaceful village,\n          looking for a baby!\n\nThis only adds to the frenzy.\n\n<b>                      A VILLAGER\n</b>          It's a sign!  An omen!\n\n<b>                   ANOTHER VILLAGER\n</b>          Our crops will die!\n\n<b>                      BURGLEKUTT\n</b>          Silence!  One beast we can kill.\n          But there may be more!  And they\n          won't give up their search till\n          they've found what they're looking\n          for!\n\n<b>                        MEEGOSH\n</b>          Whose baby is it!\n\n<b>                    OTHER VILLAGERS\n</b>          Who's to blame for this!\n\nAmid the chaos the High Aldwin slowly stands up.  As if\nhe senses something, he looks over the crowd toward the\nback.\n\nAt the back door, holding the baby, Willow tries to\npush his way through the jostling crowd.  The High\nAldwin raises his hand.  It flashes magically.  He\npoints as he speaks:\n\n<b>                      HIGH ALDWIN\n</b>          Willow Ufgood!  Come before me!\n\nThe crowd stands apart as Willow walks the length of\nthe room.  Kiaya and the children follow part way and\nthen stand aside next to Meegosh.  Burglekutt simmers\nas Willow approaches the platform.\n\n<b>                      HIGH ALDWIN\n</b>          Earlier today you tried to tell me\n          something, Willow.\n\n<b>                        WILLOW\n</b>                    (bows his head)\n          My family found this baby in the\n          river, High Aldwin.\n\nThe crowd stirs but the High Aldwin silences them with\na simple gesture.  He gazes down at the baby mysteri-\nously.\n\n<b>                      HIGH ALDWIN\n</b>          A daikini child...\n                   (his eyes close)\n           ...of some importance, I feel...\n\n<b>                      BURGLEKUTT\n</b>          That's what the beasts want!  Give\n          it back!\n\nThe crowd rumbles, many agree.\n\n<b>                        WILLOW\n</b>          They'll kill her!  We can't let\n          this baby die!\n\n<b>                      BURGLEKUTT\n</b>          What do we care!\n\nBurglekutt whips up the shouting crowd.  The High\nAldwin raises his hands, feeling the air above him.\nAlmost in a trance:\n\n<b>                      HIGH ALDWIN\n</b>           ...importance...yes...this child\n          is special...\n\n<b>                      COUNCILMAN\n</b>          What should we do?\n\nInstantly, the High Aldwin drops his arms and opens his\neyes.\n\n<b>                      HIGH ALDWIN\n</b>          This child must be taken beyond the\n          boundaries of our village.  All the\n          way to the daikini crossroads.\n\nThe room goes silent.\n\n<b>                      A VILLAGER\n</b>          Who will do that?\n\n<b>                   SEVERAL VILLAGERS\n</b>          Vohnkar!  Vohnkar!\n\nVohnkar the warrior elbows his way to the front and\npounds his chest once with his fist.\n\n<b>                      HIGH ALDWIN\n</b>          The outer world is dangerous and\n          corrupt, Vohnkar.  And this baby is\n          hunted by blood-hungry beasts.  Are\n          you willing to sacrifice your life?\n\nBrave Vohnkar swallows and shifts his weight doubtful-\nly.\n\n<b>                        VOHNKAR\n</b>          If I go, who'll defend you if other \n          beasts attack?\n\nThe crowd rumbles and shouts, and Vohnkar mops his brow\nand scuttles away from the platform.\n\n<b>                      BURGLEKUTT\n</b>          He's right!  It seems only fair\n          that the man to take this baby to\n          the crossroads...\n                  (walking stick up)\n           ...be the very man who plucked\n          it...\n                 (walking stick down)\n           ...out of the river!\n\nAll eyes turn to Willow.  Kiaya gasps and Meegosh holds\nher back.\n\n<b>                        WILLOW\n</b>          I can't do it!  I haven't put my\n          crop in!\n\n<b>                     A COUNCILMAN\n</b>          You caused this trouble.  You found\n          the baby...you get rid of it!\n\n<b>                      BURGLEKUTT\n</b>          I nominate Willow Ufgood!\n\nThe crowd cheers wildly.  The High Aldwin steps forward\nto the edge of the platform.  With a flourish he waves\nhis arms.\n\n<b>                      HIGH ALDWIN\n</b>          I will consult the bones!\n\nSomething rattles as he shakes his cupped hands.  The\ncrowd jumps away.  The High Aldwin scatters small bones\nacross the floor below him.  He leans down and studies\nthe bones.  Willow looks at Kiaya, who is worried and\nafraid.  The High Aldwin speaks softly to him:\n\n<b>                      HIGH ALDWIN\n</b>          The bones tell me nothing.\n                   (he eyes Willow)\n          But I must make a decision.  Is\n          there love in your heart for this\n          child?\n\nWillow hesitates.  He looks at the baby.\n\n<b>                        WILLOW\n</b>          Yes.\n\nThe High Aldwin bolts straight up, broadcasting:\n\n<b>                      HIGH ALDWIN\n</b>          The bones have spoken!  Willow?\n          The security of this village\n          depends on you!\n\nThe people shout and cheer and applaud and begin to\nleave.  Kiaya and Meegosh and the children push their\nway toward Willow, who stands there staring at the\nbaby.\n\n<b>INT. UFGOOD HOUSE - NIGHT\n</b>\nKiaya's hair hangs down her back in a long tight braid.\nNear the fire she packs supplies into a travel sack.\nOn the other side of the fire, Willow diapers the baby.\nThe house is quiet.\n\n<b>                         MIMS\n</b>          Dada?\n\nWillow sets the baby down.  He goes around an opne wall\nan sits on his daughter's bed, straightening her blank-\nets and toys.\n\n<b>                         MIMS\n</b>          Watch out for brownies, Dada.\n\n<b>                        WILLOW\n</b>          I will, Mims.  Goodnight.\n\nHe smiles and kisses her.  Then crosses over to Ranon's bed.\n\n<b>                         RANON\n</b>          Dada, what's a daikini?\n\n<b>                        WILLOW\n</b>          Daikinis are giant people who live\n          far far away.\n\n<b>                         RANON\n</b>          Are you scared?\n\nWillow shrugs.  Ranon sits up in bed.\n\n<b>                         RANON\n</b>          I could be you rguard!  I could\n          carry your spear!\n\n<b>                        WILLOW\n</b>                       (smiles)\n          What a great son you are, Ranon.  I\n          wish I could take you with me.  Now\n          go to sleep...\n\nRanon slides down under his blankets.  Willow kisses\nhim, looks at him a moment, then quietly withdraws to-\nward the fire.\n\n<b>EXT. SACRED HILL - SUNRISE\n</b>\nThe silhouette of a distant hill with druid stones on\ntop.\n\nCarrying the baby, Willow climbs the hill with his fami-\nly.  He wears a papoose rig, supply pack, and a dagger.\nHe hands the baby to Kiaya, then walks through the\ntowering stones.  The High Aldwin solemnly looks out at\nthe distant forest.\n\n<b>                      HIGH ALDWIN\n</b>          Now, you know where you're going?\n               (Willow shakes his head)\n          Down there, through those trees,\n          follow the river.  You'll know the\n          crossroads by a big daikini struc-\n          ture.  Willow, this is serious\n          business.  Don't waste any time,\n          the outer world is no place for a\n          Nelwyn.  Give the baby to the first\n          daikini you see, then hurry home as\n          fast as you can.\n\n<b>                        WILLOW\n</b>          If I'm not strong enough to be your\n          apprentice, how can I do this?\n\n<b>                      HIGH ALDWIN\n</b>          You're strong enough.  But you're\n          going to need courage, Willow.\n\n<b>                        WILLOW\n</b>          I don't want courage.  I don't want\n          to be a warrior.  All I've ever\n          wanted was to do magic, real magic,\n          like you!\n\n<b>                      HIGH ALDWIN\n</b>          Real magic, Willow, is simply the\n          art of controlling the reality of\n          others.  You lack faith in your-\n          self.  You must learn to trust your\n          intuition.\n\nThe High Aldwin picks up a rock.  With intense concen-\ntration he squeezes it in his outstretched hand.  Then\nthrows it in the air.  It changes into a bird and flies\naway.\n\n<b>                      HIGH ALDWIN\n</b>          Go in the direction the bird is\n          flying.\n\n<b>                        WILLOW\n</b>                       (amazed)\n          Oh, if I could do that I'd--I'd\n          turn Burglekutt into a toad!\n\n<b>                      HIGH ALDWIN\n</b>          Waste magic on revenge?  You have\n          much to learn, Willow...\n\nThe High Aldwin touches Willow's shoulder and turns\naway.  The children are playing tag among the stones.\nWillow hugs them.  Kiaya places the baby in the papoose.\n\n<b>                         KIAYA\n</b>          Willow, we've never been apart.  I\n          miss you already.  Take this.  It\n          will bring you luck.\n\nKiaya, whose head is covered with a kerchief, places a\nbraided necklace on her own hair around Willow's neck.\n\n<b>                        WILLOW\n</b>          You cut your hair, Kiaya?\n\nHe kisses her.  The adjusts the papoose and heads off\ndown the hill.  The others wave goodbye sadly.\n\n<b>                         KIAYA\n</b>          Willow!!\n\nKiaya rushes down the hill and passionately throws her\narms around Willow, tears in her eyes.  At last they\nbreak apart, and Willow begins the journey.\n\n<b>EXT. WOODS - DAY - MONTAGE\n</b>\nWillow hikes through strange and wondrous terrain,\namazed and frightened.  Animals rustle in the brush and\nhe stumbles into a thistle patch, jumping out picking\nburrs off his legs.  He hides from a fierce bear.  The\nbear sees him and runs away.  Willow hurries along,\nshifting the papoose, getting used to the baby's\nweight.\n\n<b>EXT. ROAD - EVENING\n</b>\nThe baby is fussing hungrily.  Willow impetuously digs\na bladder of goat's milk from his sack and struggles to\nfeed her.  Then he hears something.  Sensing danger, he\nclutches the baby and runs down a nearby riverbank.  He\nhides under a bridge.\n\nNOCKMAAR SOLDIERS on horseback thunder toward the\nbridge, led by the knight SORSHA whose face is hidden\nunder a black helmet and visor.  In the other direction\nWillow sees a LIEUTENANT and two DEATH DOGS.  They all\nmeet on the bridge.  The hideous soldiers are part hu-\nman, part beast.\n\n<b>                      LIEUTENANT\n</b>          We've patrolled the hills.  This is\n          where they killed the nursemaid.\n\n<b>                        SORSHA\n</b>          She must have done something with\n          the child.  Widen the search!\n\nOne of the Death Dogs is chewing on the Lieutenant's\nstirrup.\n\n<b>                      LIEUTENANT\n</b>          Get away from there!\n\nThe dog panics and gnashes at the Lieutenant's arm,\nripping away a piece of armor with its teeth.  Horses\nrear.  The Lieutenant draws his sword lightning-fast.\nHe slices and kills the Death Dog.  The baby begins to\ncry but the death-howl of the beast drowns her out as\nit does hurtling off the bridge into the river below.\nThe soldiers gallop off into the woods.\n\nWillow falls back against the riverbank, shrinking away\nfrom the murdered Death Dog which lies bloody and\ntwisted in the water.  The terrified baby cries in his\narms.\n\n<b>EXT. ROAD - MORNING\n</b>\nA harmless rabbit springs across Willow's path.  Willow\ntrips over a stone and almost falls flat on his face.\n\n<b>                        WILLOW\n</b>          I hate this.  Where am I?  I should\n          stick you in a tree and go back\n          home.\n                    (looks at baby)\n          I'm sorry.  I didn't mean that.\n\nHe hurries along the road, looking over his shoulder.\n\n<b>EXT. LANDSCAPE - DAY - MONTAGE\n</b>\nVarious VIEWS of Willow and the baby trekking across\nvast hills and valleys.\n\n<b>EXT. HILL - DAY\n</b>\nGasping with exhaustion, Willow staggers up a sloping\nhill and drops to his knees.  His eyes brighten.  In\nthe distance he sees a junction marked by a high wooden\nscaffolding.\n\n<b>                        WILLOW\n</b>          That's it.  The crossroads...\n\nHe stands and heads toward it cautiously.\n\n<b>EXT. CROSSROADS - DAY\n</b>\nThe place is disgusting.  Littered with junk, buzzing\nwith flies, plagued with rodents.  Willow creeps toward\nthe scaffolding, covering his face against the stench.\nFrom it hang two cages.  In one is a heap of filthy\nrags.  In the other a half-clothed skeleton with one\nbony arm dangling out.\n\nWillow unpacks the papoose and looks up the deserted\nroad.  He shivers with cold.\n\n<b>                        WILLOW\n</b>          I hate this.\n\n<b>EXT. CROSSROADS - DAY - LATER\n</b>\nWillow waits uneasily, brushing flies off his face.\nThe baby fusses and squirms.  He peeks inside her\ndiaper.\n\n<b>                        WILLOW\n</b>          I hate this.\n\nHe looks anxiously up and down the road.  The baby's\ncrying gets worse.  He begins to change her.\n\n<b>EXT. CROSSROADS - SUNSET\n</b>\nWillow finishes building a fire, lighting it with flint\nand blowing it into flame.  The baby lies quietly near-\nby in a kind fo porta-crib made of papoose and twigs.\nNightfall teems with spooky noises:  crickets, frogs,\nbats, owls and howling wolves.  Then a terrible moan\nfrightens him.\n\n<b>                        WILLOW\n</b>          I really hate this.\n\nNot sure where it came from. he backs away from the\nfire, under the rag-filled cage.  Suddenly a hand\nreaches down and yanks Willow up off the ground!  Wil-\nlow screams.  The baby cries.  And WE SEE the haggard\nunwashed unshaven face of MADMARTIGAN pressing against\nthe bars of the cage.\n\n<b>                      MADMARTIGAN\n</b>          Hey, Peck...get me some water...or\n          you'll diiiiie...!\n\nMadmartigan shakes Willow like a rag-doll until Willow\nnods his head yes.  Then drops him.  Instantly Willow\nraces around that fire, picking up everything he owns.\n\n<b>                        WILLOW\n</b>          I will--I'll getcha water--getcha\n          lotsa water--anything you say--!\n\nWillow grabs the baby and makes a beeline for the\nbushes.\n\n<b>                      MADMARTIGAN\n</b>          Peck!\n\nHe dives headfirst into the weeds.  Madmartigan rattles\nhis cage.\n\n<b>                      MADMARTIGAN\n</b>          You're a weasely little Peck!\n          Gimme some water!\n\nWillow peeks at him and shakes his head.\n\n<b>                        WILLOW\n</b>          I'm not coming near you!\n\nThey stare at each other across the fire.  Then, Mad-\nmartigan puts on a very phony smile.\n\n<b>                     MADMARTIGAN\n</b>          Please?  I'm dyin' of thirst in\n          here.\n\n<b>                        WILLOW\n</b>          Good.  How long will it take?\n\nMadmartigan drops the smile and spits at the fire.\n\n<b>                      MADMARTIGAN\n</b>          Don't make me angry, Peck.\n\n<b>                        WILLOW\n</b>          You be careful.  I'm a powerful\n          sorcerer.  I could turn you into a\n          toad just like that.\n\n<b>                      MADMARTIGAN\n</b>          Miserable Pecks.\n\nWillow throws a rock at him.  It bounces off the cage.\nMadmartigan sags down into a heap of rags again.\n\nEXT. CROSSROADs - NIGHT\n\nThe wind howls through the distant trees as darkness falls.\nWillow rocks the baby and eats some bread.  Madmartigan\nwatches him hungrily, sighing, forlorn, his eyes asking\nfor pit.  Willow glances at him.  Finally, he can't\ntake any more and he puts down the baby and pous some\ngoat's milk in a cup.  He reaches up on tip-toes and\noffers the milk to Madmartigan.\n\n<b>                      MADMARTIGAN\n</b>          That's more like it.\n\nMadmartigan snatches the cup and guzzles the milk,\nretching horribly at the taste.  Then he tosses the cup\nback.\n\n<b>                        WILLOW\n</b>          Do any other daikinis ever come by\n          here?\n\n<b>                      MADMARTIGAN\n</b>          Why.\n\n<b>                        WILLOW\n</b>          I have to give this baby to some-\n          body.\n\nMadmartigan grabs the bars and raises himself up.\n\n<b>                      MADMARTIGAN\n</b>          I'm somebody.  Lemme out and I'll\n          take care of your baby.\n\nHe makes little kissing noises to the baby, trying to\nbe sweet.  However, his teeth are filthy.\n\n<b>                        WILLOW\n</b>          No.  Somebdoy put you in there for a\n          reason.  I'll wait for somebody else.\n\nWillow retreats to the fire.  Madmartigan whacks the\ncage with the back of his hand.\n\n<b>EXT. CROSSROADS - NIGHT- LATER\n</b>\nBy the blazing fire Willow feeds the baby.  WE HEAR\nhoofbeats.\n\n<b>                        WILLOW\n</b>          Hey!  Somebody's coming!\n\n<b>                      MADMARTIGAN\n</b>          Peck!  Quick!  Douse the fire!\n\nExcited, Willow tosses more wood on the fire, picks up\nthe baby and waits.\n\n<b>                      MADMARTIGAN\n</b>          No, you fool!  Put it out I say!\n          Out!\n\nTorches appear up the road.  A horse-drawn wagon\nclatters full-speed toward the fire.  WE HEAR load\ndrunken voices, far from friendly.  Willow quickly\ndives into the bushes.\n\nFour boorish PICTS, with tatooed faces and arms, halt\nat the crossroads, yelling and waving their torches.\nMadmartigan is hidden under his rags.  For fun the\nPicts set fire to the skeleton cage.  Then head for the\nother.\n\n<b>                      MADMARTIGAN\n</b>          No!!\n\nHe rises up in the torchlight.  The Picts taunt him.\n\n<b>                         PICT\n</b>          Whose fire!\n\nThey jab their torches at Madmartigan.\n\n<b>                      MADMARTIGAN\n</b>          No!  Help!  Stop!\n\n<b>                         PICT\n</b>          Where are they?  Where did they go?\n\nMadmartigan points way up the road.  The Picts ride\naway.  As they go, they swing his cage and st fire to\nthe floor of it.  Madmartigan frantically geats the\nflames.  His sleeves ignite.\n\nWillow scrambles out of the bushes and scoops up hand-\nfuls of dirt, which he chucks at Madmartigan.\n\n<b>                      MADMARTIGAN\n</b>                  (spitting out dirt)\n          Thanks for your help, Peck.\n\n<b>                        WILLOW\n</b>          Are you okay?\n\n<b>                      MADMARTIGAN\n</b>          As if you care.  I saved your life,\n          Peck.  Those guys woulda killed us!\n                 (points dramatically)\n          You wanna give your baby to them??\n          They eat babies!\n\n<b>                        WILLOW\n</b>          I don't know.\n\nMadmartigan literally licks his wounds, dragging his\nparched tongue along the length of his forearm.  Willow\nbegins to walk away.\n\n<b>                      MADMARTIGAN\n</b>          The world's gone insane.  Good men\n          locked in cages, criminals running\n          free.  It doesn't pay to be honest,\n          Peck.\n\nWillow stops and turns around.\n\n<b>                        WILLOW\n</b>          Don't call me a Peck.  My name is\n          Willow.\n\nMadmartigan slinks down like a cat and slowly extends\nhis derty hand through the bars.\n\n<b>                      MADMARTIGAN\n</b>          Hello, Willow.  I'm Madmartigan.\n\nWillow stares warily at the hand.  Madmartigan smiles.\nWillow quickly shakes his hand and jumps away.  Madmar-\ntigan laughs in a harmless, friendly way.\n\n<b>                      MADMARTIGAN\n</b>          You a woodcutter?\n\n<b>                        WILLOW\n</b>          Farmer.\n\n<b>                      MADMARTIGAN\n</b>          Farmer!  I knew it!  You're a vic-\n          tim, Willow.  Yep, you and me:\n          victims of a rotten, corrupt, cor-\n          rupt, rotten world.\n\nA rat lumbers out of the darkness and sniffs toward the\nbaby in the porta-crib.  Madmartigan suddenly points.\nWillow screams and chases the rat away.  Madmartigan\nshakes his head as solemnly as an undertaker.\n\n<b>                      MADMARTIGAN\n</b>          Listen, Willow my friend.  I'm\n          really a good man.  Give me my\n          freedom, and I'll look after that\n          baby for you.  Trust me.\n\nAfter a moment, Willow takes out his dagger.  He stands\non his toes under a cage, reaches up, and hacks at the\nchain lock.  Madmartigan's eyes widen over-eagerly.  he\nrubs his hands together and licks his lips.\n\n<b>                      MADMARTIGAN\n</b>          That's it--good--good--like that,\n          yes, good, good, the chain--that's\n          it, come on--come on--!\n\nWillow suddenly steps away.\n\n<b>                        WILLOW\n</b>          Nooo, I don't think I should.\n\nMadmartigan goes berserk.  His arms flail and the whole\ncage shakes and swings and he bangs his head on the\nroof.\n\n<b>                      MADMARTIGAN\n</b>          Peck!!  Stupid Peck!  I'll kill ya!\n          Let me out!\n\nWillow scrambles back to the fire and scoops up the\nbaby and rocks her in his arms.\n\n<b>EXT. CROSSROADS - DAWN\n</b>\nMadmartigan is making something out of scraps of bark\nand cloth.  He smiles sweetly as Willow wakes up.\n\n<b>                      MADMARTIGAN\n</b>          Morning, Willow.\n\nWillow turns his back on him and tends to the baby.\n\n<b>                      MADMARTIGAN\n</b>          Sorry I yelled at you.  I've been\n          in this cage toooo long.  Can't\n          think straight anymore.  Owww...!\n\nWillow looks over.  madmartigan pats his arms in pain.\n\n<b>                        WILLOW\n</b>          You all right?\n\n<b>                      MADMARTIGAN\n</b>          These burns.  My arms.  Ouch...\n\nHe holds up his arms in agony.  Willow fishes some\ngooey jelly out of his sack and smears a gob of it on a\nleaf.  He hands it up to Madmartigan.\n\n<b>                        WILLOW\n</b>          See if this helps.\n\nMadmartigan wipes the goo all over his arms.\n\n<b>                      MADMARTIGAN\n</b>          Aaaaaahhhh.  Better.  Here, I made\n          something for the baby.\n\nHe holds out a ratlle and shakes it.  Willow accepts\nit.\n\n<b>                        WILLOW\n</b>          What's inside?\n\nMadmartigan sticks his finger in his mouth and pries it\nopen as wide as possible.\n\n<b>                      MADMARTIGAN\n</b>          A tooth.\n                   (Willow reacts)\n          I'm strving.  I got no used for it.\n\nNoise in the distance.  up the road Willow sees a\nMESSENGER charging on horseback.  He gallops right\npast, whipping his horse, almost knocking Willow off\nthe road.  Then another MESSENGER follows with the same\nurgency.  Willow grabs the baby and steps out to stop\nhim.\n\n<b>                        WILLOW\n</b>          Stop!  Wait!\n\nThe messenger screams a Willow who jumps aside as he\nthunders by.  The two horsemen disappear up the road.\n\n<b>                      MADMARTIGAN\n</b>                   (with authority)\n          Smells like a battle.\n\n<b>                        WILLOW\n</b>          Are you a warrior?\n\n<b>                      MADMARTIGAN\n</b>          The greatest swordsman that ever\n          lived.\n\nMadmartigan slices the air with an imaginary sword.\nWillow shakes his head and goes back to the baby.\n\n<b>EXT. CROSSROADS - DAY\n</b>\nWE SEE the empty road.  Willow's head pops INTO FRAME.\nHe grabs the baby.\n\n<b>                        WILLOW\n</b>          What's that?  I hear something!\n\n<b>                      MADMARTIGAN\n</b>          You hear trouble.\n\n<b>                        WILLOW\n</b>          What is it?\n\nThe horizon rumbles.  Madmartigan cups his ear.  Cyni-\ncally:\n\n<b>                      MADMARTIGAN\n</b>          A hundred horses...five or six\n          wagons...  and about six thousand\n          fools.\n\nTwo CAVALRY OFFICERS gallop into view, raising a plume\nof dust.  Then an enormous ARMY appears:  cavalry, foot\nsoldiers, assault wagons: shields, swords, spears,\nraised banners.\n\nThe two officers shout orders over the thunderous\nclamor of hoofbeats, marching boots and clanking armor.\nCharging back and forth, they shepherd the army through\nthe crossroads.  Willow holds the baby.  Fighting dust\nand noise he tries to get the officer's attention.\n\n<b>                        WILLOW\n</b>          Sir?  Sir!\n\n<b>                        OFFICER\n</b>          Out of the way!\n\nAn officer's horse nearly kicks Willow, who scurries\nout of the way.  Huddling with the baby, he notices\nAIRK THAUGHBAER, a large, muscular, bearded officer,\nclearly in charge.  On horseback, Airk breaks file and\nrides up to the other officers.\n\n<b>                         AIRK\n</b>          Push 'em harder!  No rest at mid-\n          day!  We need to make ten more\n          leagues by dark!\n\nShouting orders, the officers split up, charging to the\nfront and rear of the army.  Airk watches the army\npass.  Willow desperately scrambles up to him.\n\n<b>                        WILLOW\n</b>          Sir!  Sir!  I have this baby.  We\n          found her in our village.  Will you\n          take her...?\n\nHuge Airk looks down from his huge horse.  Little Wil-\nlow holds up the baby.\n\n<b>                         AIRK\n</b>          We're going into battle, little\n          one.  Find a woman to take care of\n          it.\n\n<b>                      MADMARTIGAN\n</b>          He thought you were a woman, Airk!\n\nAirk snaps hes head around and his eyes flash.\n\n<b>                         AIRK\n</b>          Madmartigan!  What did you do this\n          time?\n\n<b>                      MADMARTIGAN\n</b>          Nothing you wouldn't have done it my\n          place!\n\nAirk's horse prances menacingly around Madmartigan's\ncage.\n\n<b>                         AIRK\n</b>          I always knew you'd end up in a\n          crow's cage.\n\n<b>                      MADMARTIGAN\n</b>          Least I'm not down there herding\n          sheep!\n\nAirk laughs sourly and rocks the cage.\n\n<b>                         AIRK\n</b>          You're lucky somebody got to you\n          first, Madmartigan!  I'd've killed\n          you myself after that stunt at\n          Land's End!\n\nHe swings that cage and starts to ride away.\n\n<b>                      MADMARTIGAN\n</b>          Airk!  Come on, Airk.  Lemme outa\n          here.\n\n<b>                         AIRK\n</b>                  (really sarcastic)\n          Hey, remember?  You don't need my\n          help, Madmartigan.  Little rabbit\n          trap like this?  Come on!  I could\n          open it for you, but I wouldn't\n          wanna insult you!\n\n<b>                      MADMARTIGAN\n</b>          Gimme a sword, Airk.  I'll win your\n          war for you.\n\nAirk quickly drops the banter and glares at Madmartigan seri-\nously.\n\n<b>                         AIRK\n</b>          You're nothing but trouble, Madmar-\n          tigan.  And I got plenty of that.\n          Stay in your coffin and rot!\n\nAirk spurs his horse and smashes the cage as he charges\noff.\n\n<b>                      MADMARTIGAN\n</b>          I'll be around long after you're\n          dead, Airk!  You slime!  When I get\n          outa here I'll cut your head off\n          and stick it on a pig-pole!\n\n<b>                        WILLOW\n</b>          Friend of yours?\n\nMadmartigan snarls down at Willow as the army continues\nto march by.  But then he quickly gets cute again.\n\n<b>                      MADMARTIGAN\n</b>          Hello, little baby...\n\n<b>EXT. CROSSROADS - DAY - LATER\n</b>\nA ghostly wind hants the barren crossroads.  The road\nis pocked with hoofprints and wagon tracks.  Willow\nshakes his head at the ashes of his dead fire.\n\n<b>                      MADMARTIGAN\n</b>          Whatcha thinkin' about, Willow?\n\n<b>                        WILLOW\n</b>          I hate this.\n\nMadmartigan squeezes his face between the bars of his\ncage.\n\n<b>                      MADMARTIGAN\n</b>          Nobody's gonna take your baby.\n          Know why?  Nobody cares...\n                        (beat)\n          Except me.\n                      (wistfully)\n          You wanna go back to your farm.\n          You wanna go back to your family.\n          I could take care of that baby.\n          I'll look after her like she was me\n          own.\n\n<b>                        WILLOW\n</b>          You don't know anything about ba-\n          bies.\n\nMadmartigan kneels and straightens up and points up his\nfinger astutely.\n\n<b>                      MADMARTIGAN\n</b>          Ahhh!  But I know a lot of women\n          who do.  Why, if I had somebody in\n          my life--a little daughter for\n          instance--I'd have a reason to\n          live...\n\nHe clsps his hands together outside the bars, plead-\ning:\n\n<b>                      MADMARTIGAN\n</b>          Willow.  You can't let me die here.\n          Not when I wanna help you.\n\nWillow looks at the baby in the porta-crib.  Then looks\nup the empty road.  Then looks hard at Madmartigan.\n\n<b>                        WILLOW\n</b>          You gotta promise to feed her.\n\n<b>                      MADMARTIGAN\n</b>          I will.\n\n<b>                        WILLOW\n</b>          Fresh goat's milk.\n\n<b>                      MADMARTIGAN\n</b>          Absolutely!\n\nWillow draws his dagger and begins to hack at the\nchain.\n\n<b>                        WILLOW\n</b>          And give her a bath everyday, and\n          don't let her get cold.  And keep\n          her diaper changed.\n\n<b>                      MADMARTIGAN\n</b>          Of course!  I promise!\n\nWillow hacks and pries at the chain until it breaks\nopen.  The bottom of the cage falls out, dumping Mad-\nmartigan into a heap of rags and dust.\n\n<b>                      MADMARTIGAN\n</b>          Come to Daddy, little darlin'.\n                    (picks her up)\n          I think she likes me!\n\nKneeling on the ground, he plays with the baby.  Willow\nquickly hitches the papoose to Madmartigan's back and\nhands him supplies.\n\n<b>                        WILLOW\n</b>          Here are her diaper rags.  And this\n          is her milk bladder.  And when she\n          cries--she's either hungry or she's\n          tired--rock her on your left\n          shoulder.  She likes that.\n\n<b>                      MADMARTIGAN\n</b>          Don't worry, Willow.  She's in good\n          hands.  You haven't made a mistake.\n\nWillow takes the baby and kisses her.\n\n<b>                        WILLOW\n</b>          Bye.\n\nHe puts her in the papoose.\n\n<b>                        WILLOW\n</b>                   (to Madmartigan)\n          Please take good care of her.\n\nMadmartigan stands up.  He towers above Willow.  He\npats Willow on the head.\n\n<b>                      MADMARTIGAN\n</b>          You've done a great job.  Now you\n          go back to your family and get your\n          crop in.\n\nMadmartigan smiles, turns, and marches off down the\nroad.  Willow sighs with relief, his task accomplished.\nHe watches Madmartigan and the baby disappear over a\nhill.\n\n<b>EXT. ROAD - DAY\n</b>\nSwinging his arms and whistling a tune, Willow struts\nproudly up a gentle hill.\n\n<b>                        WILLOW\n</b>          Look, it's Willow Ufgood!  He's\n          come home!  Welcome back, Willow!\n          He deserves a medal:  he's quite\n          mystical.  For honor, for bravery,\n          for his intuitive powers...\n                     (he chuckles)\n           ...let's make him Apprentice\n          Aldwin.  Better still:  High\n          Aldwin!  Make way!  It's Willow Uf-\n          good, High Aldwin of---\n\nThe baby cries!  Willow spins around.  Flying towrd\nhim is an incredible VULTURE with enormous winds.  In\nits claws it carries the baby, papoose and all.  It\nswoops straight at Willow, buzzing him, and Willow hits\nthe dirt.  He looks up.  To add to the wonder:  riding\nthe vulutre is an ELF.\n\n<b>                        WILLOW\n</b>          Come back here, you!  That's my\n          baby!!\n\nThe vulture zooms off into the tall majestic trees of\nthe forest, with the baby crying.  Shouting and waving\nmadly, Willow gallops after it.\n\n<b>EXT. THROUGH THE FOREST - DAY\n</b>\nWillow tears after the vulture which vanishes in the\ntowering trees.  As the path narrows, something whis-\ntlse past his ear.  Finger-length arrows rain down on\nhim from every direction, peppering the surrounding\ntrees.  Some even hit Willow.  He plucks them out as he\nraces along.\n\nHe comes to a fork in the path:  Decision!  He starts\ndown one way, then slams on the brakes.  He sees ropes\nand nets.\n\n<b>                        WILLOW\n</b>          Oh no, it's a trap!\n\nHe hurries back to the fork and takes the safer route--\n\n<b>                        WILLOW\n</b>          Oh noooooo!!\n\n--and gets swallowed by a deadly pit.\n\n<b>INT. ELFIN THRONE ROOM - UNDERGROUND\n</b>\nWillow wakes up as a pail of water hits him in the\nface.  His feet and wrists are being bound.  Several\nlittle ELVES are gawking and laughing at him.  They\nwear samurai-type outfits and angry little haircuts.\n\n<b>                        WILLOW\n</b>                      (focusing)\n          Where am I?  Where's the baby?\n\nFRANJEAN, the Elfin king, struts forward arrogantly.\nHe speaks a haughty, nasal accent resembling French:\n\n<b>                       FRANJEAN\n</b>          I am Franjean, king of the world.\n\nWillow struggles against the ropes that bind him.\n\n<b>                        WILLOW\n</b>          That baby's my responsibility!\n\nOutraged, Franjean smacks Willow's nose with the\nback of his hand.\n\n<b>                       FRANJEAN\n</b>          I don't care.  We paid for her.  Go\n          back to sleep, monsieur...\n\nAs he leaves, Franjean nods to an intense-looking ARCH-\nER elf heavily armed with arrows and a spear.  The\narcher dips his spear in a bowl of purple liquid.  He\npricks Willow's arm.\n\n<b>                        WILLOW\n</b>          Yeow!\n                (he loses consciousness)\n          Madmartigan...I never should've\n          trusted you...\n\n<b>FADE TO BLACK\n</b>\n<b>INT. ELFIN THRONE ROOM - DAWN\n</b>\nWillow's eyes open.  A wild little face is looking at\nhim.  A wild little person is standing on his chest.\n\n<b>                         TEEMO\n</b>          Tongue.\n\nToo groggy to argue, Willow sticks out his tongue.\nTEEMO the brownie crushes a brittle leaf and tosses the\ndust into Willow's mouth.  Smacking his lips, Willow\ncomes around.  He sees, down between his legs, another\nbrownie named ROOL cutting the ropes.\n\n<b>                        WILLOW\n</b>          Who are you?\n\n<b>                         ROOL\n</b>          Quiet, you fool!\n\n<b>                         TEEMO\n</b>                       (formal)\n          We are emissaries of her majesty,\n          Queen Cherlindrea, of the land of\n          Coshairm.\n\n<b>                        WILLOW\n</b>          Queen Cherlindrea?\n\n<b>                         TEEMO\n</b>          She requests the presence of your-\n          self and the young princess.\n\n<b>                        WILLOW\n</b>          Who??\n\n<b>                         TEEMO\n</b>          You're the guardian, aren't you?\n\n<b>                         ROOL\n</b>          Quit yakking, Teemo.  We gotta get\n          outa here!\n\nWillow rolls onto his knees, stands up and bumps his\nhead on the ceiling.  The fuzzy-headed brownies creak\nopen the door and becon Willow to follow.  He squeezes\nthrough.\n\n<b>INT. ELFIN HALLWAY - UNDERGROUND\n</b>\nLike a rabbit warren, compartments branch off the main\ntunnel.  Willow scrunches along behind the tip-toeing\nbrownies.  They hear the baby crying.  They peek\nthrough the door.\n\nInside a cluttered room they see thebaby crying miser-\nably.  Her tears are being carried to a high level in\ntiny buckets on a mechanized wheel, operated by FOUR\n<b>ELVES.\n</b>\n<b>                         TEEMO\n</b>          Elves!  They're always tormenting\n          babies.  They make them cry and\n          take their tears.\n\n<b>                         ROOL\n</b>          Somebody has to do it.\n\n<b>                        WILLOW\n</b>          Why??\n\n<b>                         ROOL\n</b>          How else they gonna make dew drops?\n\nThe baby shrieks.\n\n<b>                        WILLOW\n</b>          I'm getting her out of there!\n\n<b>                         TEEMO\n</b>          No!  You let us handle this.  Come\n          along, Rool!\n\nTeemo ridiculously pushes Willow away from the door.\nWith a macho swagger he adjusts his dagger belt, and he\nand Rool open the door.\n\n<b>INT. ELFIN TEAR FACTORY\n</b>\nThey enter like gunslingers in a saloon.  The four\nelves, who are twice their size, turn and face them.\nTeemo draws his small dagger.  With confidence he\nsmiles at Rool.\n\n<b>                         TEEMO\n</b>          Watch this.  Right between the\n          eyes.\n\n<b>                         ROOL\n</b>                    (to the elves)\n          He never misses.\n\nArtfully Teemo poises the dagger above his head.  With\nall his might he throws.  His dagger flip-flops through\nthe air and lands at the elves' feet, plink-plunk.\n\n<b>                         TEEMO\n</b>          Ooops.  Was that right?  That\n          wasn't right.\n\nSuddenly the entire wall implodes.  The elves scream\nand panic as Willow comes crashing in like King Kong.\nHe grabs the crying baby and tucks her under his arm.\n\n<b>EXT. ELF HOLE - DAY\n</b>\nThe brownies scamper out of a hole in the ground where\nthe elves keep their vultures corralled.\n\n<b>                      ROOL/TEEMO\n</b>          Hyah!  Hyah!  Git!\n\nThey untie th evulture and send them flapping away in\nthe forest as Willow wiggles out of the elf hole with\nthe baby.  They run for their lives.\n\n<b>EXT. FOREST - CHASE - DAY\n</b>\nRool and teemo tear along at incredible speed, Willow\nbarely keeping up with them.  Little elf arrows shower\nthe forest as the angry elves chase after them, whoop-\ning and screaming.\n\n<b>EXT. DEEP GORGE - DAY\n</b>\nThey skid up to a perilously deep drop into oblivion.\nThe elves are shrieking toward them. The only chance\nof excape is a huge fallen tree spanning the gorge.\nThe brownies scamper out.  Willow looks down and reels\nwith vertigo.\n\n<b>                        WILLOW\n</b>          I can't go out there with the baby!\n\n<b>                      ROOL/TEEMO\n</b>                  (frantically point)\n          Elves!!\n\nThe elf army pours out of the forest.  Willow holds his\nbreath and ventures out onto the topmost branches of\nthe tree.  Arrows zing around him as he wobbles like a\ndrunken tightrope walker toward the middle.  The brown-\nies wait for him.\n\n<b>                        WILLOW\n</b>          Ohhh, I hate this.\n\n<b>                         TEEMO\n</b>          Take your time.  Don't worry about\n          the elves.  They won't come out\n          here.\n\n<b>                        WILLOW\n</b>          Why not?\n\n<b>                         ROOL\n</b>          Because of the trolls.\n\n<b>                        WILLOW\n</b>          Trolls?\n\nThe brownies console Willow with unworried laughter.\n\n<b>                         TEEMO\n</b>          Relax.  They only come out at\n          night.\n\nAn ugly TROLL snarls up behind Willow.  They all scream\nand race for the other side.  Another TROLL pops up to\nmeet them.  The trolls slink along like possums.  The\nbrownies dive through a hole in the hollow tree trunk.\n\nThe elves, meanwhile, flint-start a fire at their end\nof the tree.  One troll claws at the brownies inside\nthe trunk while the other chases Willow across gangling\nbranches.  Then the baby falls out of the papoose!  She\ntumbles and catches on a low branch and Willow races\nthe troll and grabs her just before she plummets into\nthe gorge.\n\nOne troll catches Rool but can't then get his claw out\nof the trunk.  The brownies finally excape.  The tree\nburns and breaks, dangling over the gorge by its roots.\nA troll howls as he falls to his death.  The other\nscrambles up the tree and grabs Willow's foot.\nWillow's boot slips off and down goes the second troll.\n\nFlames lick at Willow as he at last hauls himself to\nsafety, just as the roots snap and the blazing tree\ngoes crashing down in the gorge.\n\n<b>                        WILLOW\n</b>          This is not going well.\n\n<b>                         TEEMO\n</b>          Hurry!  Queen Cherlindrea will know\n          what to do.\n\nWillow bundles the baby and follows the brownies into\nthe forest.  Hobbling slightly on his bootless foot.\n\n<b>EXT. MAJESTIC FOREST - SUNSET\n</b>\nFading sunlight bleeds through awesomely beautiful\ntrees as Willow and the brownies trek into the magical\nFairy Kingdom.  Elora Danan falls into a peaceful\nsleep.\n\n<b>EXT. FAIRY KINGDOM - NIGHT\n</b>\nWillow comes to a halt.  His mouth drops open.  The\nforest is a luminous Milky Way of dancing, flying\nFAIRIES, like fireflies.  The brownies tug at his\npant-legs and whisper.\n\n<b>                         TEEMO\n</b>          Come on.  This is a privilege.  No-\n          body ever gets called before Her\n          Majesty.\n\nWonder-struck, Willow walks into a clearing where\ncolorful night-flowers bloom.  He lowers himself onto\nan enormous toadstool, testing it with his hand.  Other\nBROWNIES stand watching, like courtiers.  The tiny\nfairies fly up to Willow's face and giggle:  they look\nlike five-year-old girls, full of mischief and fun.\n\nSuddenly a strange LIGHT begins to throb behind the\ntrees, peircing the forest with helter-skelter beams.\nWillow throws up his arms as the bright light stings\nhis eyes.\n\n<b>                         ROOL\n</b>          Stand up!  It's the queen!\n\nCHERLINDREA, the Fairy Queen, materializes out of frag-\nments of moving light, diaphanous, sylph-like, beauti-\nful.\n\n<b>                      CHERLINDREA\n</b>          Willow Ufgood.\n\n<b>                        WILLOW\n</b>                       (blinded)\n          Yes...?\n\n<b>                      CHERLINDREA\n</b>          I hope you are comfortable here,\n          inside my kingdom...\n\nWillow says nothing, still batling the bright light.\n\n<b>                         TEEMO\n</b>          Talk!  Say something!\n\n<b>                        WILLOW\n</b>          I can't see anything--she's too\n          bright!\n\n<b>                      CHERLINDREA\n</b>          I'm sorry...\n\nThe light diminishes, enabling Willow to see the queen.\nShe is a beautiful vision, with flowing hair and lumi-\nnous eyes.  Her magical presence both stuns and\nimpresses Willow.  She turns to the brownies.\n\n<b>                      CHERLINDREA\n</b>          Broke-heart of nightingale for our\n          honored guest.\n\nAll the courtier brownies snap to attention and go into\naction, bustling about, going to work, some even trip-\nping over one another.  They bring Willow a drink in a\ndelicate cup-shaped leaf, and he takes a sip.\n\nThe queen dissolves and reappears near Willow.  She le-\nans down and opens the baby's swaddling and looks at\nthe mark on the baby's arm.\n\n<b>                      CHERLINDREA\n</b>          It is Elora Danan!  The prophecy\n          has come true.\n\nThe tiny fairies and the brownies stop work and sigh\nwith respect and amazement.  Cherlindrea seems to levi-\ntate the baby out of Willow's arms, floating her magi-\ncally onto a special cradle of stram and sticks.  The\nbrownies and fairies crowd around, with great rever-\nence.\n\n<b>                        WILLOW\n</b>          You mean, you know who this baby\n          belongs to?\n\n<b>                      CHERLINDREA\n</b>          She belongs to all of us.  She is\n          the future queen and ruler of all\n          kingdoms on earth.\n\nWillow starts to get up.\n\n<b>                        WILLOW\n</b>          What a relief.  Now I can go home.\n\nThe queen fragments and reappears right in front of\nWillow.\n\n<b>                      CHERLINDREA\n</b>          No, Willow.  Your journey has just\n          begun.  It has been foretold that\n          this child shall bring about the\n          downfall of Queen Bavmorda, whose\n          evil powers have darkened our\n          world.  Upon you depends this\n          princess's life.\n\n<b>                        WILLOW\n</b>          Me?\n\nThe Fairy Queen flashes and vanishes.  Willow lowers\nhimself back down again.  She reappears behind him.\n\n<b>                      CHERLINDREA\n</b>          You are the guardian, Willow.  You\n          must take her to Tir Asleen.\n\n<b>                        WILLOW\n</b>          What is Tir Asleen?\n\nWillow can't keep track of her.  She keeps changing her\nshape.  The brownies and fairies snicker at Willow's\nconfusion.\n\n<b>                      CHERLINDREA\n</b>          It is a distant castle, where a\n          great king and queen will look\n          after Elora Danan and keep her safe\n          until she is old enough to rule.\n\nShe is gone again.  Willow looks everywhere, frusturated\nby these riddles and mysteries.\n\n<b>                        WILLOW\n</b>          Where is Tir Asleen?  How far is\n          it?\n\nShe reappears again.\n\n<b>                      CHERLINDREA\n</b>          The way has been lost in time. But\n          there is one person, a druid sor-\n          ceress, who might guide you there.\n          She was exiled by Queen Bavmorda\n          many years ago.  Her name is Fin\n          Raziel.\n\n<b>                        WILLOW\n</b>          You need a warrior for this job.\n          I'm nobody.\n\n<b>                      CHERLINDREA\n</b>          You are very important, Willow.\n\n<b>                        WILLOW\n</b>          No I'm not.  Have you really looked\n          at me?\n                  (jumps to his feet)\n          I'm short!  Even for a Nelwyn!\n\nFrom down at his feet, Rool and Teemo stare up, insult-\ned.\n\n<b>                        WILLOW\n</b>                     (continuing)\n          Why can't you do it?  You have mag-\n          ical powers.\n\n<b>                      CHERLINDREA\n</b>          My prsence cannot extend beyond\n          this forest.  But I can give you\n          these...\n\nCherlindrea drops three small objects in Willow's hand.\n\n<b>                      CHERLINDREA\n</b>          They will protect you.  Use them\n          wisely.\n\nWillow looks at them for quite a while.\n\n<b>                        WILLOW\n</b>          They look like acorns.\n\n<b>                      CHERLINDREA\n</b>          Anything you hurl them at will turn\n          to stone.\n\nWillow looks closely at the acorns, then up at the\nqueen.\n\n<b>                        WILLOW\n</b>          They're magic?  Are you serious?\n\nThe forest light grows brighter.  The queen looms over\nWillow and he again has to shield himself from the\nbrightness.\n\n<b>                      CHERLINDREA\n</b>                       (sternly)\n          I am very serious, Willow.  There\n          is no time to lose.\n\nNow she intensifies her light so that Willow backs\naway, completely covering his face.\n\n<b>                        WILLOW\n</b>          But I've got a family to think\n          about!  They need me!\n\nThe queen swirls around him like a solar wind, blowing\nthe forest trees, scaring even the brownies.  And then\nall of a sudden:  silence.  And total darkness.  ALL WE\nSEE, in dim moonlight, is Willow's face, peeking out\nfrom between his fingers.\n\n<b>                        WILLOW\n</b>          Hello...?\n\nThe queen's voice echoes the forest.\n\n<b>                      CHERLINDREA\n</b>          Bavmord'a powers are growing like\n          an evil plague.  Soon she will con-\n          trol the lives of you children,\n          your wife, your village...everyone.\n\nVery gradually and beautifully the firey fairies begin\nto flicker, restoring light to the forest.  More light\ngenlty brightens, bathing the woods, and the Fairy\nQueen reappears.  She is holding Elora Danan in her\narms.  The brownies creep out from behind the trees.\nAll eyes are upon Willow.\n\n<b>                      CHERLINDREA\n</b>          The choice is yours.\n\nWillow takes the baby and looks at her for a moment.\nHe struggles with his conscience.  The fairies and\nbrownies wait in anticipation.  At last Willow looks up\nat them, resolved and determined.\n\n<b>                        WILLOW\n</b>          I'll do it.  Yes, I will, I'll do\n          it!\n\nThe fairy kingdom sends up a great cheer and applause.\nFairies giggle playfully around Willow's face, and\nbrownies hug his ankles.\n\n<b>                        WILLOW\n</b>          But I only have one shoe.\n\n<b>EXT. WOODED HILL - DAY\n</b>\nWE SEE Willow's feet as he walks along.  He has himself\na brand-new shoe.\n\nSpirits high, he treks in the sunshine, papoose\nstrapped to his back.  Teemo rides in his pocket, while\nRool straddles the papoose, tickling the giggling baby.\n\n<b>                        WILLOW\n</b>          Wait till I tell my children.\n          Stuff like this never happens in my\n          village.\n\nHe digs a magic acorn out of his pocket and tosses it\nhigh in the air.  The brownies gasp.\n\n<b>                         TEEMO\n</b>          Hey, careful there!\n\n<b>                        WILLOW\n</b>          How do these work I wonder?  I got-\n          ta save one to show the High\n          Aldwin.\n\n<b>                         ROOL\n</b>          Look!  Death below!\n\nRool points through the trees.  Willow hurries down the\nhill to the tree-line.  In the valley below, 200 NOCK-\nMAAR SOLDIERS and CALVALRYMEN battle a hundred ragtag\nREBEL TROOPS.  From this sage position high on the\nhillside, Willow watches in disgust.  Weapons clash and\nmen fall to their deaths.\n\n<b>                        WILLOW\n</b>          Daikinis...\n\nThey hear a CLANK behind them.  Willow slowly turns\naround.  There is movement in the trees.  The hillside\nwoods are full of Nockmaar HORSEMEN moving right up next to him.\n\nIn the valley, the oupowered rebels are being forced\nup the hill toward them.  Willow is suddenly standing\nunder several large horses and black-armored minions.\nHe is frozen in fear.\n\n<b>                       HORSEMEN\n</b>          Hyaaaaahh!!\n\nSwords flash and the horseman charge!  The brownies\njump and run for their lives.  Willow stumbles and\nspins as horse after horse thunders past him, nearly\ntrampling him and the baby to death.\n\nThe Nockmaar reinforcements descend upon the remaining\nrebels and crush them.  Willow falls and quickly digs\nthe baby out of the papoose.  She is shrieking in ter-\nror.  He holds her tight and runs along the tree-line,\nfollowing the brownies, while the bloody battle rages\nbelow.\n\n<b>                        WILLOW\n</b>          Let's get out of here.  Shhh, don't\n          cry, Elora.  Things can't get any\n          worse than this...\n\n<b>EXT. ROADSIDE TAVERN - DAY\n</b>\nBleak rain dribbles down Willow's miserable face.  Pro-\ntecting the baby, he hurries toward a tavern.  The bot-\ntom of the building is an open stable with several\nhorses.  Two burly IRON-WORKERS clank a red-hot wagon\nrim, fixing a nearby wagon hitched to a horse.\n\nIt's a rough place.  Rool and Teemo peek out of\nWillow's pockets.  Upstairs PEOPLE drink and shout.\n\n<b>                         TEEMO\n</b>          I'm not going in there.\n\n<b>                         ROOL\n</b>          Me neither!\n\n<b>                        WILLOW\n</b>          Don't worry--I'm a sorcerer.  What\n          could possibly happen?\n\nSuddenly there's a CRASH up above and two PICTS burst\nthrough a balcony and land in the mud, fighting vi-\nciously.  Rool and Teemo duck inside Willow's pockets.\nWillow steps around the Picts, dashes through the\nstable and up the stairs.\n\n<b>INT. TAVERN - MAIN ROOM - DAY\n</b>\nThe place is packed with tattooed PICTS, nomadic FAMI-\nLIES, MOTHERS wit BABIES, THIEVES and CUTTHROATS.\nWillow enters with the crying baby.\n\n<b>                        WILLOW\n</b>          Could you spare some milk for this\n          poor hungry baby?\n\nEveryone looks up.  Mopping a table is an ugly BARMAID\nas big as a wrestler.\n\n<b>                        BARMAID\n</b>          Get outa here, Peck!\n\n<b>                        PATRONS\n</b>          A Peck!  Get him out!  Beat it,\n          Peck!\n\nThey hurl stuff at him and threaten him with their\nweapons.  Willow runs along the wall and takes cover\nunder some stairs.  He pulls open his pocket and peers\ndown inside.\n\n<b>                        WILLOW\n</b>          I could use your help, boys.\n\nInstantly his pocket whips shut and trembles.  Willow\ncautiously looks out under the stairs.  He sees a pail\nof milk very near some ROUGHNECKS.  Willow puts his\nlittle finger in the baby's mouth, silencing her.  He\ncreeps out.  And bravely reaches for the milk.\n\n<b>                     TEEMO'S VOICE\n</b>          Willow?\n\nWillow slaps his pocket.  Then stretches his arm out\nvery, very slowly.  And gets the pail and zips back\nunder the stairs.\n\n<b>                        WILLOW\n</b>          This is not fun.\n\nHe soaks a rag with milk and feeds the baby.  Catching\nhis breath, he backs up and leans agains a woodplank\nwall.\n\n<b>                        WILLOW\n</b>          Woah!\n\nThe plank gives way and Willow falls through the wall.\n\n<b>INT. TAVERN - DAY\n</b>\nWillow somersaults into a bedroom near an unmade bed.\nPeeking up he sees two women getting dressed in a pan-\nic.  One is a plump-chested WENCH with a pretty face.\n\n<b>                         WENCH\n</b>          Hurry!  Hurry!\n\nVery frightened, she looks out the window.  The other\nwoman, who wears a kerchief over her hair, packs thick\npowder and make-up paint on her face.\n\n<b>                   THE OTHER WOMAN\n</b>                  (in a gruff voice)\n          How do I look?\n\nIt's Madmartigan!  Willow pops up like a jack-in-the-\nbox.\n\n<b>                        WILLOW\n</b>          You!!\n\n<b>                      MADMARTIGAN\n</b>          Where the hell did you come from?\n\nWillow strides toward Madmartigan, holding the baby\nlike a machine gun.\n\n<b>                        WILLOW\n</b>          I trusted you...\n\nThe brownies peek out.\n\n<b>                         ROOL\n</b>          Who's he?\n\n<b>                      MADMARTIGAN\n</b>          You're crawling with rodents.\n\nThe bedroom door explodes open.  In storms a big, mean,\nhalf-drunk raging lug named LLUG.\n\n<b>                         LLUG\n</b>          Where is he!!\n\nMadmartigan wraps a muffler around his throat.  The\nwench innocently curtsies.\n\n<b>                         WENCH\n</b>          There's nobody here except me and\n          my, um, cousin.\n\nLlug knocks his wife out of the way and glares susi-\nciously at Madmartigan, who bats his heavily made-up\neyelashes.  He speaks in a high feminine voice.\n\n<b>                      MADMARTIGAN\n</b>          How do you do.\n\nLlug sniffs at Madmartigan then fixes his gaze on\nMadmartigan's flat chest.  He goes to squeeze him\nthere, but Madmartigan ducks out of the way and\nsnatches the baby from Willow.\n\n<b>                        WILLOW\n</b>          Hey!  Give me that baby!\n\n<b>                      MADMARTIGAN\n</b>                     (high voice)\n          These Pecks make terrible nurse-\n          maids.\n\n<b>                        WILLOW\n</b>          Nursemaid?!\n\nWillow angrily jumps up and down, swiping at the baby.\n\n<b>                      MADMARTIGAN\n</b>                     (high voice)\n          They get too excited.\n\nWith a swing of the hip, Madmartigan butts Willow aside\nand maternally puts the baby against his chest.  Llug\nhoud-dogs him around the room, finally cornering him\nand staaring lecherously into his eyes.\n\n<b>                         LLUG\n</b>          Wanna breeeeeeed?\n\n\nMadmartigan protects himself by holding the baby up in\nfront of his face.  Then he smells the baby.  He winces\nand groans.\n\n<b>                        WILLOW\n</b>                   (mischievously)\n          Time to change her diaper.\n\n<b>                      MADMARTIGAN\n</b>          Time to leave.\n\nMadmartigan throws open the door and dashes out.  But\nhe doesn't get very far.  Several NOCKMAAR SOLDIERS\npush him back in.  Then they grab madmartigan and Wil-\nlow, and Llug and his wife, and haul them all outside.\n\n<b>INT. TAVERN - HALLWAY - DAY\n</b>\nMadmartigan is slammed against a wall.  The Willow.\nThen Llug and his wife.  In the b.g. Nockmaar troops\nare rousting the tavern, taking babies away from\nfrightened mothers and inspecting them.\n\nHeavy bootsteps thud toward them.  Willow looks out and\nrecognizes Sorsha, the black-helmeted knight from the\nbridge.\n\n<b>                        SORSHA\n</b>          You!  Are you the mother of that\n          child?\n\n<b>                      MADMARTIGAN\n</b>          No.\n           (looks at Llug; in a high voice)\n          I mean yes.\n\nSorsha strides over to Madmartigan, her sword drawn.\n\n<b>                        SORSHA\n</b>          Let me see it.\n\nMadmartigan looks at Willow then back at Sorsha.\n\n<b>                      MADMARTIGAN\n</b>                     (high voice)\n          I can't.\n\n<b>                        SORSHA\n</b>          Let me see it.\n\n<b>                        WILLOW\n</b>          No!  You can't!\n\nMadmartigan looks at Willow then back at Sorsha.\n\n<b>                      MADMARTIGAN\n</b>                     (high voice)\n          I can't.\n\n<b>                        SORSHA\n</b>          Why not?\n\n<b>                      MADMARTIGAN\n</b>                      (to Willow)\n          Why not?\n\n<b>                        WILLOW\n</b>          Because she's sick.\n\n<b>                      MADMARTIGAN\n</b>                      (to Sorsha)\n          Because she's sick.\n\n<b>                        SORSHA\n</b>          Give it to me!\n\nSorsha stabs her sword into the floor like a spike.\nShe grabs for the baby.  Instinctively, Madmartigan el-\nbows her away, whacking her hard and knocking her off-\nbalance against a nearby bench.  The soldiers tense up,\npointing their swords and spears.\n\nSorsha regains her balance.  She rips off her black\nhelmet.  Long wild red hair tumbles over her shoulders.\nShe is a young woman, and Madmartigan's eyes pop open.\nHe does his best to keep up his femal facade.\n\n<b>                      MADMARTIGAN\n</b>                     (high voice)\n          Gawd...you're...beautiful...\n\n<b>                        SORSHA\n</b>          You're not a woman.\n\nSorsha comes right up to Madmartigan, squinting into\nhis eyes.  The she rips away his kerchief and muffler.\n\n<b>                         LLUG\n</b>          Not a woman??!!\n\nAll hell breaks loose.  Llug charges for Madmartigan's\nthroat.  Madmartigna tucks the baby under his arm and\ndashes right out the window.  Llug bulldozes Sorsha and\nher Lieutenant, and the tavern patrons take advantage\nof the chaos and stampede for the stairs.  Willow dives\nout the window after Madmartigan.\n\n<b>                        SORSHA\n</b>          After them!!\n\nShe grabs her sword and waves it at her soldiers who\nclatter toward the stairs, flinging people out of their\nway.\n\n<b>EXT. ROADSIDE TAVERN - DAY\n</b>\nMadmartigna jumps off the upstairs balcony and lands in\nthe wagon below.  The two iron-workers look up with\nconcern.  Then they react with surprise as Madmartigan\nrips away his disguise.\n\n<b>                        WILLOW\n</b>          Madmartigan!  Wait!\n\nUp above, Willow charges along the balcony.  Madmarti-\ngan juggles the baby and whips the reins.  The wagon\npulls away, iron-workers scrambling after it.  Willow\nflings himself off the balcony.  The brownies tumble\nout of his pocket.  They all land in the back of the\nwagon as it takes off.\n\nIt has stopped raining.  In the stable under the\ntavern, horses smash together and people fall in the\nmud, and the Nockmaar soldiers get tangled up in the\ntraffic jam.\n\n<b>EXT. ROAD - CHASE - DAY\n</b>\nAs Madmartigan lashes the horse, Willow crawls up to\nhum and takes the baby.\n\n<b>                        WILLOW\n</b>          We could've been killed, Madmarti-\n          gan!\n\nIn the back, the brownies boucne all over the place\namid wooden kegs and other objects.  When they finally\nget their balane they look back in alarm.\n\nChasing them are two Nockmaar HORSEMEN plus a DEATH DOG\nand a war chariot.\n\nWillow ducks low and peeks out, protectively hugging\nthe baby.  The wagon bounces and flies along, but the\nminions are quickly gaining.  Rool and Teemo spring\ninto action.  They struggle with all their might and\nmanage to kck small wooden kegs off the back of the\nwagon.\n\nThe kegs bounce onto the road, and the minions lose\nsome ground trying to avoid them.  But soon the horse-\nmen flank the wagon.  One leaps off his galloping horse\nand climbs on board.  The other draws an arrow and gets\nready to fire.\n\nMadmartigan is about to be shot between the eyes.  He\nquickly rolls into the back.  The archer firse! and\nhits the other minion in the chest.  Madmartigna snaps\na wooden stake off the wagon side and smashes\nthe wounded minion off the wagon:  he crashes onto the\nroad.\n\nWillow harnesses the papoose to his chest and grabs the\nreins.  At the same time the minion archer leaps\naboard.  He and Madmartigan fight in the back.\n\n<b>                        WILLOW\n</b>          Heeyah!  Heeyah!\n\nThen there's a terrible howl right beside Willow.  The\nDeath Dog is leaping alongside the wagon, gnashing and\ntrying to board.  Willow yanks the reins and swerves\nthe wagon into the dog, which yelps furiously.  In the\nback, Madmartigan and the minion are thrown by the\nswerving jolt.\n\n<b>                        WILLOW\n</b>          Oh no!\n\nUp ahead Willow sees an exposed tree root in the road.\nThe wagon is headed straight for it!  The wheel hits\nthe root hard and Willow is dumped onto the wagon floor\nand very nearly goes overboard.\n\nIn the back, Madmartigan and the minion keep fighting\nas the wagon clatter along out of control.  The Death\nDog catches up again and this time spring aboard.\n\n<b>                         DEATH\n</b>          Bordak!!\n\nThe dog snaps at the baby.  Willow scurries under the\nwagon seat.  The dog stands up on its hind feet.\n\n<b>                         DEATH\n</b>          Bordak!!\n\nIt gets ready to attack.  But WHACK! an overhanging\ntree branch hits it and Willow looks up from under the\nseat and sees the mangled dog twitching and dangling\nfrom the tree, rapidly disappearing in the distance.\n\nIn the back, meanwhile, the minion draws a knife.  Mad-\nmartigan ducks out of his way, hanging onto a post at\nthe edge of the tailgate.  The minion comes after him.\n\nSuddenly the wagon wheel wobbles and the rim flies off.\nThe jolt throws the minion off balance.  Madmartigan\nkicks him.  The minion hurtles off the taligate but\nholds on, dragged by the wagon.\n\nRool and Teemo grab hold of a rope securing a large\nwooden keg.  Together they yank it.  Untying the keg and\nsending it tumbling off the back.  The minion looks up\nin horror as the heavy keg crushes him.\n\nBut the danger is far from over.  The wagon rocks along\nwith one wheel half-destroyed.  Willow whips the reins\nand looks over his shoulder.  Steam-rolling toward them\nis the war chariot!\n\nThe Nockmaar CHARIOT DRIVER stands up and stuffs the\nreins in his mouth.  He rasise his arm and begins to\ntwirl a deadly weapon, a kind of bolo-blade, over his\nhead.\n\nMadmartigan defends himself with a wooden wagon-post.\nThe chariot driver hurls the whistling blade:  CHONK!\nIt lodges in the post.  Madmartigan tugs.  So does the\nchariot driver.  Back and forth, the wagons smashing up\neach other.  At last Madmartigan lets go of the post\nand the chariot driver is sent tumbling through the\nairl, over a cliff to his death.\n\n<b>                        WILLOW\n</b>          Woah...woah...!\n\nWillow tries to stop the horse.  But the wheel col-\nlapses and he is thrown off into a ditch.  The brownies\ndive overboard.  Madmartigan jumps off and delibrerately\nsends the wagon up the road.  He scrambles down into\nthe ditch and lies flat beside Willow.\n\nSuddenly, hoofbeats thunder and Sorsha and the rest of\nher troops gallop past.  Lying flat, Madmartigna raises\nhis head and sees Sorsha's long flowing red hair.\n\n<b>                      MADMARTIGAN\n</b>          That girl is a vision.\n\nAs soon as the troops are gone, Willow jumps up.\n\n<b>                        WILLOW\n</b>          Where's the baby??\n\n<b>                      MADMARTIGAN\n</b>          I thought you had her!\n\n<b>                      ROOL/TEEMO\n</b>          Willow!!\n\nThe brownies are waving and gesturing madly, pointing\nat a heap of boards and rubble that broke off the\nwagon.  Willow and Madmartigan race over and start dig-\nging, flinging debris aside.\n\n<b>                      MADMARTIGAN\n</b>          Now Willow, I know you're gonna\n          blame me for this but it wasn't my\n          fault...!\n\n<b>                        WILLOW\n</b>          Elora Danan!\n\nWillow sees the battered, lifeless papoose.  He grabs\nit and rips it open.  Madmartigan kneels in the dirt\nremorsefully.\n\n<b>                      MADMARTIGAN\n</b>          When I left the crossroads, I got\n          ambushed by an elf!\n\n<b>                        WILLOW\n</b>          Madmartigan!  You saved her life!\n\n<b>                      MADMARTIGAN\n</b>          I did?\n\nWillow holds up the baby.  She giggles and smiles.\nMadmartigan switches gears, boasting:\n\n<b>                      MADMARTIGAN\n</b>          I mean, of course I saved her life.\n          She's almost my daughter, isn't\n          she?\n\nWillow bundles the baby and looks up the road.\n\n<b>                        WILLOW\n</b>          Let's get out of here before they\n          come back.\n\nThey hurry off into the darkening woods.\n\n<b>EXT. WOODS - NIGHT\n</b>\nA campfire blazes.  Willow tends the baby while the\nbrownies point up at the stars.\n\n<b>                         TEEMO\n</b>          Northeast is that way.  We've come\n          west and south.  I think.\n\nMadmartigan dumps a big log on the fire, spraying the\nbrownies with sparks.\n\n<b>                         ROOL\n</b>          Watch it!  You're gonna set us on \n          fire.\n\n<b>                      MADMARTIGAN\n</b>          Not a bad idea.\n\nMadmartigan terrorizes them with a flaming stick.  Then\nhe squats beside Willow and the baby.\n\n<b>                      MADMARTIGAN\n</b>          So you're on your way to Tir\n          Asleen, huh?  I hate to tell you\n          this, Willow, but Tir Asleen dosn't\n          exist.\n\n<b>                        WILLOW\n</b>          Yes it does.  The Fairy Queen told\n          me.\n\n<b>                      MADMARTIGAN\n</b>          The Fairy Queen?  And the baby\n          here's a princess?  And these two\n          rodents are your guides?\n\nHe shakes his head sceptically, stretches out and puts\nhis feet up on a log.\n\n<b>                      MADMARTIGAN\n</b>          Yeah well...in the morning I think\n          I'll be on my way.\n\nHe laughs sarcastically.  Willow sets down the baby.  He\ntakes off Kiaya's necklace and fingers it sadly.\n\n<b>                        WILLOW\n</b>          Madmartigan, I need your help.\n\n<b>                      MADMARTIGAN\n</b>          My help?  A great magician like\n          you?  You don't need any help.\n\nWillow stares at him angrily.\n\n<b>                        WILLOW\n</b>          But you're a great swordsman!\n\nHe jumps and starts pacing around the fire.  Rool and\nTeemo dive for cover.\n\n<b>                        WILLOW\n</b>                      (explodes)\n          You're not a warrior, Madmartigan!\n          A warrior wouldn't lie there and do\n          nothing!\n\nHe kicks Madmartigan's boot and knocks his feet off the\nlog.\n\n<b>                        WILLOW\n</b>          We're in trouble!  You've seen the\n          big army that's after us!  You're a\n          fake!  You're a bum!  You're a--\n          you're a coward!!\n\nHe picks up a rock and pitches it wildly at the fire,\nsending up a shower of sparks.  Madmartigan eyes him\nwith concern.\n\n<b>                      MADMARTIGAN\n</b>          What's with you, Peck?\n\nWillow lets it all pour out.  He begins to cry.\n\n<b>                        WILLOW\n</b>          I miss my wife!  I miss my chil-\n          dren!  My boy Ranon!  He's growing\n          up so fast, he even helps me on the\n          farm now!  And little Mims!  If you\n          ever saw her sweet little face\n          you'd *melt* Madmartigan, you'd\n          *melt*!\n                      (sniffles)\n          Or maybe you wouldn't.  You don't\n          know anything about love.  You\n          don't know anything about any-\n          thing...\n\nWillow sits on the ground, exhausted.  Madmartigan\npicks up the baby and sits with her in his lap.\n\n<b>                      MADMARTIGAN\n</b>          I was in love once, Willow.  She\n          had a hold on my heart.  I could\n          barely function.\n                       (a pause)\n          I *was* a great swordsman!  I was\n          knighted!  I could have been king!\n\n<b>                        WILLOW\n</b>          You?\n\n<b>                      MADMARTIGAN\n</b>          Yeah me.  King!  But she betrayed\n          me.  She robbed me of my dream.\n\nMadmartigan gently rocks the baby and stares at the\nfire.  Willow watches him curiously.\n\n<b>                      MADMARTIGAN\n</b>          I'll never fall in love again...\n\n<b>EXT. WOODS - MORNING\n</b>\nWillow wakes up and looks around.  The baby is gone.\nHe panics.  He scrambles a short distance through\nsome bushes.\n\n<b>                        WILLOW\n</b>          Madmartigan!  Madmartigan!\n\nThey've been camped all night near the shore of a LAKE.\nWillow finds Madmartigan and the baby bathing happily\nin the water.\n\n<b>                      MADMARTIGAN\n</b>          Relax, Willow.  We're having fun.\n\nThe baby squeals with delight as Madmartigan twirls her\naround.  He lifts her yp and carries her to Willow on\nthe shore.  The brownies crawl thorugh the bushes.\nRool points out at the lake.\n\n<b>                         ROOL\n</b>          That's it!  The sorceress lives\n          there!\n\nIn the middle of the lake is an island with a single\ntree.\n\n<b>                         TEEMO\n</b>          Are you sure?\n\n<b>                         ROOL\n</b>                       (excited)\n          Yes!  Raziel!  She lives out on\n          that island!\n\nMadmartigan lets out a sarcastic, sceptical laugh.\nTeemo scratches his head and squints out at the island.\n\n<b>                         TEEMO\n</b>          That tree dosn't look like gold to\n          me.\n\n<b>                      MADMARTIGAN\n</b>          Gold!!\n\nMadmartigan rubs his chin with sudden interest.\n\n<b>                         TEEMO\n</b>          Its branches are supposed to be\n          made of gold, solid gold.\n\n<b>                        WILLOW\n</b>          How are we going to get out there?\n\nMadmartigan is suddenly pacing and thinking.\n\n<b>                      MADMARTIGAN\n</b>          We'll find a way, Willow.  Look\n          over there--that looks like a\n          village--maybe they've got a boat.\n          Come on, what are you waiting for?\n\nMadmartigan runs along the shore toward a small village\nin the distance.\n\n<b>EXT. DESERTED FISHING VILLAGE - DAY\n</b>\nHalf a dozen decrepit huts sit rotting on the edge of\nthe lake.  There are no inhabitants, just a lot of dis-\ncarded junk, including a few battered fishing boats.\nBut Madmartigan, keeping one eye on the gold tree out\non the island, is undaunted.  He rummages through the\ndebris, hauling out a fishing boat and shouldering it\ntoward the water.\n\n<b>                      MADMARTIGAN\n</b>          Give me a hand here, Peck!\n\nWillow hoists the baby into the papoose and helps Mad-\nmartigan.\n\n<b>                          BOY\n</b>          What are you doing?\n\nThey turn around.  A golden-haired BOY is standing\nwaist-deep in th elake.  Madmartigan is instantly wary\nof him.\n\n<b>                      MADMARTIGAN\n</b>          It's nothing to do with you.\n\nBut the boy looks innocent and harmless, and Willow ap-\nproaches him.\n\n<b>                        WILLOW\n</b>          We need to get out to that island.\n\n<b>                          BOY\n</b>          The island is cursed.\n\nMadmartigan scoffs at this nonsense, grunting and push-\ning the boat into the water.\n\n<b>                        WILLOW\n</b>          We've traveled a long way.  We're\n          looking for Fin Raziel.\n\n<b>                         TEEMO\n</b>          The sorceress.\n\n<b>                          BOY\n</b>          She's there.  But you can't go\n          there.  The island is cursed.\n\n<b>                      MADMARTIGAN\n</b>                     (no patience)\n          Yeah?  Who cursed it?\n\n<b>                          BOY\n</b>          Queen Bavmorda.  Her powers govern\n          the elements.\n\n<b>                      MADMARTIGAN\n</b>          Ahh, he's trying to protect the\n          gold.  Come on, Willow.  Jump in.\n\nMadmartigan climbs into the boat and grabs an oar,\neager to go.  Willow looks down at the brownies for\nhelp.\n\n<b>                        WILLOW\n</b>          What would the Fairy Queen say?\n\n<b>                         ROOL\n</b>          She's not here.\n\n<b>                         TEEMO\n</b>                       (to Rool)\n          Obviously.\n\n<b>                        WILLOW\n</b>          Without Raziel we'll never find Tir\n          Asleen.\n                      (decision)\n          We'd better go.\n\nWillow marches to the boat.  Calmly accepting their\nchoice, the golden-haired boy dives into the lake and\ndisappears.  Willow and the brownies board the boat,\nand Madmartigan poles them away from the shore.\n\n<b>EXT. LAKE - DAY\n</b>\nThey row across the placid lake toward the island.\n\n<b>EXT. ISLAND - DAY\n</b>\nThey climb onto the rocky shore.  Flies buzz and swarm\naround them, and creepy bugs crawl around their feet.\nBroken skeletons litter the shore.  Handing the baby\nback and forth, Willow and Madmartigan claw their way\nup to the large tree.\n\n<b>                        WILLOW\n</b>          Raziel?  Hello?  Fin Raziel?\n\nMadmartigan greedily reaches up to touch a branch.\n\n<b>                        RAZIEL\n</b>          Get away!  Get away!\n\nA littel animal scurries down the tree and hisses vi-\nciously at Madmartigan, chattering its teeth.\n\n<b>                        RAZIEL\n</b>          You'll die!  You'll die!\n\nRAZIEL scampers over to Willow.  Her voice screeches\nlike a parrot.  She looks like an otter with a bush\ntail.\n\n<b>                        RAZIEL\n</b>          Who are you!  Who are you!\n\n<b>                        WILLOW\n</b>          I'm Willow Ufgood.  I'm here to\n          find Fin Raziel.\n\nShe springs right onto Willow's chest.\n\n<b>                        RAZIEL\n</b>          That's me!  Raziel!  Raziel!\n\nWillow looks down at the browines questioninghly.\n\n<b>                        WILLOW\n</b>          This can't be right.  This isn't a\n          sorceress.  This is some kind of\n          animal.\n\n<b>                         TEEMO\n</b>          Queen Bavmorda transformed her.\n\n<b>                        RAZIEL\n</b>          What do you want!\n\n<b>                        WILLOW\n</b>          We need your help.  To take this\n          baby to Tir Asleen.  She's a prin-\n          cess.\n\nStill sceptical, Willow shows Raziel the baby's mark.\nRaziel shoots up onto a branch and frantically flicks\nher tail.\n\n<b>                        RAZIEL\n</b>          Elora Danan!\n\nMadmartigan snaps a branch off the tree.  A flock of\nbirds suddenly screech and fly away.  His eyes bulge.\n\n<b>                      MADMARTIGAN\n</b>          Rool!  Teemo!  You were right!\n          This whole tree is made of gold!!\n\nHe strips away the bark, revealing a vein of gold.\n\n<b>                        RAZIEL\n</b>          Fools!  You should never have come\n          to this place!  We're all going to\n          die!\n\nThe wind begins to blow and the sky darkens.  Raziel\nzips over to Willow and whispers intensely.\n\n<b>                        RAZIEL\n</b>          We've got to get off this island\n          right now.  Hurry!  The boat!  It's\n          our only chance!\n\nThe wind howls.  they hurry down to the boat.\n\n<b>                        WILLOW\n</b>          Madmartigan!\n\nMadmartigan is greedily breaking branches off the tree.\n\n<b>                      MADMARTIGAN\n</b>          Wait!  Gold!  Gold!\n\nWaves lash at the boat as they jump aboard.  Madmarti-\ngan loads up with branches.  As they push off, he\nscrambles down the rocks.  Just in time he jumps into\nthe boat as the storm swirls it out into the frothy\nlake.\n\n<b>EXT. LAKE - DAY\n</b>\nWillow clutches the baby as the raging storm pitches\nthe boat.\n\n<b>                        WILLOW\n</b>          Help, Madmartigan!  The oar!\n\nMadmartigan hangs onto his gold, but pices of it drop\nand topple overboard.\n\n<b>                      MADMARTIGAN\n</b>          My gold!\n\nSuddenly a hand appears on the stern.  The water boy\nclimbs in.\n\n<b>                        RAZIEL\n</b>          Kill him!\n\n<b>                        WILLOW\n</b>          No!\n\n<b>                        RAZIEL\n</b>          Kill him!\n\nMadmartigna hesitates but then smashes the boy back\ninto the lake.  The boy surfaces like a dolphin.  His\nshape begins to change, becoming fish-like, diving and\nvanishing.\n\nThen:  he attacks the boat!  He is now a ferocious\nshark-like monster.  He chomps the boat and the gold\nbranches slide into the water.  Madmartigan bashes the\nmonster with the oar, then grabs an anchor.  The mon-\nster attacks again and Madmartigan jabs its gill with\nthe anchor.\n\nThe monster sinks into the lake.  They all sigh with\nrelief.  Madmartigan shrugs proudly.  Suddenly the an-\nchor line unravels, tangling Madmartigan's legs in\nfishing nets and yanking him overboard.\n\nUnderwater, Madmartigan swirls behind the monster.  He\npulls himself along the anchor line and finally cuts\nhimself free with his dagger.\n\nHe surfaces and madly swims toward the pitching boat.\nWillow reaches out to him.  The monster surfaces and\ncircles the boat.  Then it attacks Madmartigan.\n\n<b>                      MADMARTIGAN\n</b>          No!!  Help!!  Willow!!!\n\nWillow digs out a magic acorn.  But he drops it!  He\nfumbles in the leaking boat and finally finds it.  The\nmonster opens its jaws and goes to devour Madmartigan.\nWillow throws the acorn.\n\nThe monster miraculously turns to stone.  Madmartigan\ngrabs the boat and watches in amazement as the monster\nsinks.  Willow hauls him into the boat.\n\n<b>EXT. LAKESHORE - DAY\n</b>\nThe storm begins to die down as they jump to shore, ex-\nhausted.  Madmartigan wears nothing now but a ragged\nloincloth.  He falls to his knees, coughing and spit-\nting.\n\n<b>                      MADMARTIGAN\n</b>          Willow...you...you got...magic...!\n          Wait...we could team up...!\n\nHe pulls himself up and follows Willow.  Suddenly they\nall stop.  Sorsha and her men come out of the woods.\n\n<b>                        RAZIEL\n</b>          Flee!  Flee!\n\nThe brownies scurry into a hole.  Raziel makes a dash\nfor it but a soldier skewers her tail with his spear,\ndangling her in front of Sorsha.\n\n<b>                        SORSHA\n</b>          Raziel.  Did you think my mother\n          would allow you to escape?\n\nSorsha gestures, and the soldier takes Raziel away.\nThe lieutenant wrestles the baby away from Willow.  He\ngives her to Sorsha.\n\n<b>                        SORSHA\n</b>          This is what we're looking for.  It\n          bears the markings.\n\nWillow panics.\n\n<b>                      MADMARTIGAN\n</b>          Don't worry, Willow.  If there's\n          one thing I'm good at, it's charm-\n          ing a woman...\n\nHe swaggers forward.  Sorsha turns and looks at him.\n\n<b>                      MADMARTIGAN\n</b>          So.  Couldn't live without me, huh?\n\nSorsha looks up and down at his naked body.\n\n<b>                        SORSHA\n</b>          Lose your skirt?  How embarassing.\n\nMadmartigan looks down and adjusts his loincloth.\n\n<b>                      MADMARTIGAN\n</b>          Still got what counts.\n\nA pause as he smiles at her.\n\n<b>                        SORSHA\n</b>          Not for long.\n\nShe raises her fist and zap:  Madmartigan is instantly\nsurrounded by spears and swords.\n\n<b>                        SORSHA\n</b>          We'll join the column.  Bring them\n          with us.\n\nMadmartigan and Willow are roughly taken away.  Sorsha\nand her troops mount horses and ride off.  Rool and\nTeemo crawl lup from under a rock.\n\n<b>                         TEEMO\n</b>          We gotta follow them.\n\n<b>                         ROOL\n</b>          Us??  We'll never catch them.  Any-\n          way, we're all done, Teemo.  Let's\n          go home.\n\nRool walks off and Teemo grabs him, yanks him back.\n\n<b>                         TEEMO\n</b>          Get back here, Rool!\n\n<b>                         ROOL\n</b>          Ouch!  Let go of me!\n\nRool throws a punch, and the brownies somersault into\nthe bushes fighting each other.\n\n<b>EXT. ROAD - DAY\n</b>\nSorsha and her men now ride with a caravan of fifty\nNOCKMAAR TROOPS.  Chained by their necks.  Willow and\nMadmartigan walk behind a wagon.  Raziel sits trapped\nin a cage on the back of the wagon.\n\n<b>                        WILLOW\n</b>          I can't go on...\n\nWillow loses strength, falls and is dragged.  Madmarti-\ngan picks him up and carries him on his shoulders.\nSorsha sees this.\n\n<b>                      MADMARTIGAN\n</b>          Willow, why don't you use your mag-\n          ic to get us out of here?\n\n<b>                        RAZIEL\n</b>          He's no magician.\n\n<b>                      MADMARTIGAN\n</b>          He turned that monster into stone!\n\nRaziel peers sternly at Willow, who is eye-level with\nher cage.\n\n<b>                        RAZIEL\n</b>          Did *you* give that acorn its power?\n\n<b>                        WILLOW\n</b>          No.\n\n<b>                        RAZIEL\n</b>          A magician *makes* magic.  Any fool\n          can use it.\n\nMadmartigan shakes his head at her.\n\n<b>                      MADMARTIGAN\n</b>          Then you get us out of here.\n\n<b>                        RAZIEL\n</b>          I will!  But I need help!\n\n<b>                        WILLOW\n</b>          I'll help you...!\n\n<b>                      MADMARTIGAN\n</b>          I won't.\n\n<b>                        RAZIEL\n</b>          You must learn magic.\n\n<b>                        WILLOW\n</b>          That's all I ever wanted!\n\n<b>                        RAZIEL\n</b>          Then I will teach you.\n\nSorsha rides up from the rear of the caravan, carrying\nthe baby, who is crying.  Madmartigan, with Willow\nstill on his shoulders, straightens up and flirts with\nher.\n\n<b>                      MADMARTIGAN\n</b>          Nice horse...nice hair...real nice\n          hair...I'd say you've got the most\n          beautiful hair I've ever--\n\nShe flashes her eyes at him.\n\n<b>                        SORSHA\n</b>          Wolff wants to boil you in oil.\n\nShe nods toward her Lieutenant, who snarls viciously.\n\n<b>                        SORSHA\n</b>          Don't tempt me.\n\nShe turns away.  The baby squirms and cries.\n\n<b>                        WILLOW\n</b>          If you rest the baby on your\n          shoulder, she'll stop crying.\n\n<b>                        SORSHA\n</b>          Shut up.\n\nSorsha rides along.  She shifts the baby to her other\nshoulder, and she instantly stops crying.  Sorsha\nthrows a look at Willow.  Madmartigan takes a long deep\nbreath.\n\n<b>                      MADMARTIGAN\n</b>          Mmmm, I love the smell of a woman.\n\n<b>                        SORSHA\n</b>                    (angry threat)\n          My step-father's going to tear you\n          apart.\n\nMadmartigan pounds his chest and taunts her:\n\n<b>                      MADMARTIGAN\n</b>          I'm torn apart already.  I mean it!\n          Under all that armor is a \n          beautiful--\n\nCRACK!  Sorsha whips her horse and gallops ahead.\n\n<b>                      MADMARTIGAN\n</b>          Who is that girl, anyway?\n\n<b>                        RAZIEL\n</b>          Sorsha, Queen Bavmorda's daughter.\n\nMadmartigan snaps his finger and discourages himself.\n\n<b>                      MADMARTIGAN\n</b>          Forget that one, Madmartigan.\n\nRaziel leaps against the bars of her cage, chatters her\nteeth and whispers to Willow.\n\n<b>                        RAZIEL\n</b>          Willow.  To learn magic, first you \n          must make your own philosopher's\n          stone!\n\n<b>                        WILLOW\n</b>          What do I need for that?\n\n<b>                        RAZIEL\n</b>          We must start with feathers, dung,\n          and a lock of your hair.\n\nWillow pulls a strand of his hair out in front of his\neyes and frowns at it.  Madmartigan, meanwhile, can't\ntake his eyes off Sorsha.\n\n<b>                      MADMARTIGAN\n</b>          Now that's a woman...!\n\n<b>EXT. NOCKMAAR CAMPSITE - NIGHT\n</b>\nFires and torches burn around pitched tents.  Soldiers\neat and drink, and meat is thrown out to Death Dogs.\nFrom her cage, Raziel looks down at Willow, still\nchained to the wagon next to Madmartigan.  Willow is\ngrinding a substance with a rock.\n\n<b>                        RAZIEL\n</b>          Keep working at it.  Forget all you\n          know, or think you know.  A\n          magician's power depends on disord-\n          er of the mind.\n\nShe twists her head through the bars.  Madmartigan\nsquints up at her.\n\n<b>                      MADMARTIGAN\n</b>          You got that one covered.\n\nWillow hears the baby crying in a distant tent.\n\n<b>                        WILLOW\n</b>          I hope she's all right.  How much\n          more do I have to do of this?\n\n<b>                        RAZIEL\n</b>          Till it's in a powder.  The energy\n          exits within you...\n\n<b>                        WILLOW\n</b>                      (reciting)\n          I know, and the magician's goal is\n          to find his true self.  But what's\n          this got to do with it?\n\n<b>                        RAZIEL\n</b>          As below, so above.  You hold the\n          univers, Willow, in your hand.\n\nMadmartigan clasps his forhead.\n\n<b>                      MADMARTIGAN\n</b>          I'm beginning to think you two\n          *deserve* to be locked up.\n\n<b>                        WILLOW\n</b>          The universe is a living creature,\n          like you and me, Madmartigan.\n\nMadmartigan cynically gazes at the sky, gesturing wide-\nly.\n\n<b>                      MADMARTIGAN\n</b>          We're a tiny version of all that?\n\n<b>                        RAZIEL\n</b>          As above, so below.\n\nMadmartigan rolls his eyes.  Willow jumps to his feet\nand shows Raziel the substance.\n\n<b>                        WILLOW\n</b>          I'm all finished.  Now what?\n\n<b>                        RAZIEL\n</b>          Burn it to a fine ash.\n\nWillow looks around.  Heavily armed Nockmaar minions\nrip chunks of meat around a campfire.\n\n<b>                        WILLOW\n</b>          How am I gonna do that?\n\n<b>                        RAZIEL\n</b>          Patience.  Concentrate.  You will\n          find a way.\n\nSuddenly bootsteps clomp toward them.  Willow quickly\nfolds the powder inside some cloth and hides it in his\npocket.  The Lieutenant marches up and scrutinizes them\nsuspiciously.  He abruptly snatches Willow up, hacks\nthe chain and drags him off.\n\n<b>                        WILLOW\n</b>          What's going on?\n\nMadmartigan sturggles against his chains.  Angry and\nworried:\n\n<b>                      MADMARTIGAN\n</b>          Hurt him and you'll answer to me!\n\n<b>INT. SORSHA'S TENT - NIGHT\n</b>\nThe Lieutenant clamps irons on Willow's wrists, flings\nhim into a tent and exits.  Willow looks up and sees\nSorsha, still in her uniform, impatiently pacing wiht\nthe crying baby.\n\n<b>                        SORSHA\n</b>          This baby won't do what I say.  You\n          seem to know what to do.  Here!\n          Make it shut up.\n\nSorsha dumps the baby in Willow's arms and then backs\naway.\n\n<b>                        WILLOW\n</b>          She needs to be changed.\n\n<b>                        SORSHA\n</b>          I changed her already!\n\nWillow politely shrugs.\n\n<b>                        WILLOW\n</b>          She needs to be changed again.\nSorsha crosses her arms in a hugg and watches as Willow\nchanges the baby.  Soon the baby stops crying.  Re-\nlieved yet still anxious, Sorsha paces to a mirror.\nWillow rocks the baby gently, absently looking at the\nfire.  Then his eyes focus on the fire.\n\n<b>                        SORSHA\n</b>          Who is that horrible friend of\n          yours?\n\n<b>                        WILLOW\n</b>                  (watching the fire)\n          Madmartigan.\n\n<b>                        SORSHA\n</b>          Who is he?\n\n<b>                        WILLOW\n</b>          I don't know much about him.\n\nSorsha fiddles with her long red hair.  Willow creeps\ntoward the fire.\n\n<b>                        SORSHA\n</b>          He's very bold.  Do you really\n          think my hair is beautiful?\n\nShe turns and looks right at Willow.  He looks back.\nShe asks the question again by holding out strands of\nher hair.\n\n<b>                        WILLOW\n</b>          Uh, yes.  It's very nice hair.\n\nHe suddenly strides over to Sorsha.\n\n<b>                        WILLOW\n</b>          She's hungry.\n\n<b>                        SORSHA\n</b>          I know she's hungry.  I tried to\n          feed her but she wouldn't eat a\n          thing.  I'm not a wet nurse.\n\n<b>                        WILLOW\n</b>          Here.  Hold her.\n\nHe hands Sorsha the baby, then goes to the fire where\nthere's a stone crock of milk.  He carefully takes his\ncloth pouch out of his pocket and unfolds it.  At the\nother side of the tent Sorsha awkwardly paces with the\nbaby.\n\n<b>                        SORSHA\n</b>          I tried everything.  A spoon.  I\n          poured milk into her mouth, she just\n          spat it out.  I don't know what to\n          do, I'm not a mother.\n\nDuring this, Willow ignites his powdery substance.  It\nflares slightly then burns to an ash.  He gathers it\nup, then returns to Sorsha with the milk.\n\n<b>                        WILLOW\n</b>          Sometimes she likes it heated.\n\nWillow finds a strip of cloth, dips it in the milk, and\nfeeds Elora Danan in Sorsha's arms.  He looks up at\nSorsha and smiles.\n\n<b>                        WILLOW\n</b>          She's a good baby.\n\nSorsha looks down at the baby.\n\n<b>EXT. NOCKMAAR CAMPSITE - MORNING\n</b>\nThe caravan packs up to move on.  Soldiers drag Willow\nto the wagon and lift him on board, chaining him beside\nRaziel's cage.  Willow excitedly pats his pocker, and\nwhispers:\n\n<b>                        WILLOW\n</b>          I did it!  I got the ashes!\n\nWhen the soldiers leave, he digs out the pouch and\nproudly shows it to Raziel.\n\n<b>                        RAZIEL\n</b>          Good!  The first step is complete.\n\nChained behind the wagon, Madmartigan reaches forward\nand pokes Willow with his finger?\n\n<b>                      MADMARTIGAN\n</b>          Did she ask about me?\n\n<b>                        WILLOW\n</b>          Who?\n\n<b>                      MADMARTIGAN\n</b>          Come on, Peck, don't give me a hard\n          time.  You were in her ten all\n          night.  Did she say anything?\n\nWillow deliberately plays innocent.\n\n<b>                        WILLOW\n</b>          She said lots of thing.s\n\n<b>                      MADMARTIGAN\n</b>          Willow!\n\nWillow grins.  At last:\n\n<b>                        WILLOW\n</b>          She asked about you, Madmartigan.\n\n<b>                      MADMARTIGAN\n</b>          Well what did she say?\n\nSuddenly Sorsha gallops by on horseback, holding the\nbaby.  She flings a wad of clothes at Madmartigan.\n\n<b>                        SORSHA\n</b>          Here.  You're going to need these\n          where we're going.\n\nShe rides off.  Madmartigan looks down at the clothes.\nThe looks at Willow.\n\n<b>                      MADMARTIGAN\n</b>          She's in love.\n\n<b>                        WILLOW\n</b>          You're crazy.  I think you're in\n          love.\n\n<b>EXT. SNOW MOUNTAIN - DAY\n</b>\nThe Nockmaar caravan climbs into snow-covered moun-\ntains.  In the wagon, Raziel is grilling Willow.  He\nconcentrates hard, cramming, memorizing, straining.\n\n<b>                        RAZIEL\n</b>          We don't have much time left!  Go\n          on!  Go on!\n\n<b>                        WILLOW\n</b>          I must concetrate my\n          imagination...to creat a\n          new...reality!\n\n<b>                        RAZIEL\n</b>          What's the magician's weapon?\n\n<b>                        WILLOW\n</b>          The limitless power of...\n\nRaziel flips around in spasms of impatience.\n\n<b>                        RAZIEL\n</b>          Your will!  Your will!  What else\n          could it be?\n\n<b>                        WILLOW\n</b>                     (frustrated)\n          I can't remember all these things.\n          What am I learning?\n\n<b>                        RAZIEL\n</b>          The art of transformation!\n\n\n<b>                        WILLOW\n</b>                     (exasperated)\n          But what am I gonna transform??\n\n<b>                        RAZIEL\n</b>          Me!\n\nWillow and Madmartigan stare at Raziel.\n\n<b>                        WILLOW\n</b>          You?\n\n<b>                     MADMARTIGAN\n</b>          What are you gonna become, Raziel?\n          Queen of the rodents?\n\nSorsha rides up to the wagon.\n\n<b>                        SORSHA\n</b>          The baby's cold.  Take her.\n\nShe dismounts.  With care, keeping the baby bundled,\nshe hands the baby to Willow.  Madmartigan watches and\nlistens.\n\n<b>                        RAZIEL\n</b>          You remind me of your father, Sor-\n          sha.\n\n<b>                        SORSHA\n</b>          My father was a weakling.\n\n<b>                        RAZIEL\n</b>          He was a great king.\n                 (Madmartigan reacts)\n          Not like your step-father, not like\n          your mother.  He ruled Tir Asleen\n          with kindness, and a generous\n          heart.\n\n<b>                        SORSHA\n</b>          My mother calls that weakness.\n\n<b>                      MADMARTIGAN\n</b>          What do *you* call it?\n\nSorsha turns and glares at Madmartigan.\n\n<b>                        SORSHA\n</b>          I do what I'm told.\n\n<b>                      MADMARTIGAN\n</b>          Too bad you're not more like\n          your father.\n\nShe looks at him a moment, then abruptly mounts her\nhorse and rides ahead.\n\n<b>EXT. ROAD TOWARD SNOW CAMP - LATE AFTERNOON\n</b>\nThe caravan rides toward a large Nockmaar camp.  Death\nDogs howl and fires burn ominously in the distance.\nWillow and madmartigan watch as KING KAEL rides out to\nmeet the caravan.\n\nKael is huge, powerful and cruel, partbeast, part man,\nand he carries a terrible sword at his side.  Sorsha\ncarefully shows him the baby.  He grabs it from her.\n\n<b>                        SORSHA\n</b>          Be careful.\n\n<b>                         KAEL\n</b>          Don't tell me what to do.\n\nKael viciously hits Sorsha, knocking her off her horse.\nMadmartgian and Willow watch angrily.  Kail gallops to-\nward camp with the baby under his ar.  Sorsha shakes\naway the pain and, humiliated, mounts her horse.\n\n<b>                      MADMARTIGAN\n</b>          We gotta get the baby out of here.\n\nRaziel dashes around her cage.\n\n<b>                        RAZIEL\n</b>          Tonight!  Complete the\n          philosopher's stone!  I must be\n          turned back!\n\nLooking off into the camp, angry and resolute, Willow\ntakes out the ingredients for the stone.\n\n<b>                        WILLOW\n</b>          I'll do it, Raziel...\n\n<b>EXT. SNOW CAMP - NIGHT\n</b>\nNow in a kind of portable cell, Madmartigan clutches\nthe jail bars and looks out at the camp.  Fires and\ntorches burn, and Nockmaar soldiers patrol.\n\nShivering cold, willow sits cross-legged in the jail,\nmelting snow into a bowl.  On a nearby lean-to, where\nskins and shields are kept, Raziel hangs in her cage.\n\nSomewhere the baby is crying.  In the distance Sorsha\ngoes inside one of the tenst. There's a muffled yel-\nling between Sorsha and Kael.  Then Keal storms out of\nthe tent and goes inside the tent next door.\n\nWillow pours the ashes into the melted snow.\n\n<b>                        RAZIEL\n</b>          Let it settle.  Carefully, slowly.\n          Concentration and will.  Now pour\n          the water off.\n\nAs Willow works, Madmartigan binds together scrap\nsticks of wood, making a long pole.  He gingerly hooks\nRaziel's cage with this, lifting it from the spike.\n\n<b>                        WILLOW\n</b>          Oooh, this smells terrible.\n\n<b>                        RAZIEL\n</b>          That's the life spark.  Exxence of\n          magic and sorcery!\n\nMadmartigan angles the pole and the cage slide toard\nhim.  He grabs it with both hands and rips it apart.\nRaziel right away scurries down the cell bars, jumps\ninto the jail and bits Willow's hand.\n\n<b>                        WILLOW\n</b>          Ouch!!\n\n<b>                        RAZIEL\n</b>          Shhhhh!\n\nThey look out nervously at patrolling Nockmaar sol-\ndiers.  Willow sucks the back of his hand.\n\n<b>                        WILLOW\n</b>          What'd you bit me for!!\n\n<b>                        RAZIEL\n</b>          We need blood.  To nourish the\n          stone.  charge the stone with ener-\n          gy.\n\nWillow drips his blood into the concoction then stirs\nit with a twig.  It begins to glow from within.\n\n<b>                        RAZIEL\n</b>          The components of the stone are\n          fusing...\n\nWillow's eyes widen with anticipation.\n\n<b>EXT. SNOW CAMP - NIGHT - LATER\n</b>\nFires have burned down.  Most of the camp is sleeping.\nIt is nearing dawn.  Madmartigan stares out at Sorsha's\ntent, deep in thought.  Willow holds up the completed\nPHILOSOPHER'S STONE, a red ball of pliable putty.\n\n<b>                        RAZIEL\n</b>          Again:  what is the magician's\n          weapon?\n\n<b>                        WILLOW\n</b>          His will.\n\n<b>                        RAZIEL\n</b>          Now use it.\n\nWillow presses the philopher's stone against the\nchainlock.  He sheepishly looks over his hsoulder at\nRaziel.\n\n<b>                        WILLOW\n</b>          I just wanted to test it first.\n\n<b>                        RAZIEL\n</b>          No!  Change me back into a sor-\n          ceress, Willow.\n\nWillow goes to Raziel and concentrates with physical\nand mental intensity.\n\n<b>                        WILLOW\n</b>          Avaggdu, supriom, luwatha...\n\nIt starts to work.  Raziel curls into a ball of fur.\nThe fur changes to feathers.  She begins to squawk\nstrangely.  She emerges as a raven-sized bird.\n\n<b>                        WILLOW\n</b>          What did I do?\n\nHe sags with exhaustion and massages his blistered\nhands.  Then: CLINK!  The lock falls open.  They all\nlook over, and Madmartigan picks it up off the ground.\n\n<b>                      MADMARTIGAN\n</b>          Not bad, Peck.  I'm impressed.  You\n          busted the lock.\n\nWilow clutches Madmartigan's arm.  He holds up the\nstone.\n\n<b>                        WILLOW\n</b>          Madmartigan.  Let's go.  Let's get\n          Eloran Danan.\n\nWith coldness in his eyes, madmartigan stares across\nthe camp at Sorsha's tent.\n\n<b>                      MADMARTIGAN\n</b>          Let's get Elora Danan.\n\nThey sneak away.\n\n<b>                        RAZIEL\n</b>          Wait!  What about me!\n\nRaziel flaps her wings and flies up into the dark sky.\n\n<b>EXT. THROUGH THE CAMP - DAWN\n</b>\nWillow and Madmartigan sneak behind tents, hiding from\nthe patrolling guards.  Very quietly they creep up to\nKael's tent.  Madmartigan knocks out a guard and steals\nhis knife.  They crawl dangerously over to Sorsha's\ntent.\n\n<b>                      MADMARTIGAN\n</b>          You're a magician, Willow.  But I'm\n          a thief.  Wait here.  I'll get the\n          baby.\n\nMadmartigan slits the back of the tent open and slips\ninside.  Raziel flutters down and lands on Willow's\nshoulder.\n\n<b>                        RAZIEL\n</b>          I'm supposed to be a beautiful wo=\n          man.\n\nWillow shrugs apologetically.\n\n<b>INT. SORSHA'S TENT - DAWN\n</b>\nCrouched inside the large tent, Madmartigan calculates\nhis next move.  In the far corner, Sorsha lies asleep.\nHe steals the baby from a crib of straw.  Starts to\nleave.  But stops.  Willow pokes his head inside.\n\n<b>                        WILLOW\n</b>                      (whispers)\n          Come on, Madmartigan...!\n\nMadmartigan stares over at Sorsha.  Lured by her beau-\nty, he slowly walks toward her bed.\n\n<b>                        WILLOW\n</b>          What are you doing?  Get out of\n          there...!\n\nMadmartigan looks down at her.  Morning rushlight il-\nluminates her youthful face, and her long red hair is\nspread across her pillow.  Out of her armor, in soft\nnightclothes, she looks like a goddess.  Upon her\nbreast is a golden necklet, inlaid with ornate jewels.\nQuietly:\n\n<b>                      MADMARTIGAN\n</b>          I love you.\n\nHe kisses her lips.  Her eyes open.\n\n<b>                        SORSHA\n</b>          One move, and you really will be a\n          woman.\n\nHolding the baby, Madmartigan does not move a muscle.\nSorsha holds a knife at his crotch.\n\n<b>                        SORSHA\n</b>          You're a fool.  Now put her back.\n\n<b>                      MADMARTIGAN\n</b>          I'm not going to let this baby die.\n\nSorsha presses the knife.\n\n<b>                        SORSHA\n</b>          Don't make me kill you.\n\nWillow watches as Madmartigna carefully backs away from\nSorsha.\n\n<b>                      MADMARTIGAN\n</b>          I believe you would...\n\nSitting up, Sorsha waves her knife.  Madmartigan places\nthe baby in the straw crib.\n\n<b>                        SORSHA\n</b>          Why did you say that?\n\n<b>                      MADMARTIGAN\n</b>          Say what?\n\n<b>                        SORSHA\n</b>          I love you.\n\nMadmartigan walks back to Sorsha' bed.  Willow crawls\ninto the tent, behind Madmartigan's back.\n\n<b>                      MADMARTIGAN\n</b>          Because it's true.\n\n<b>                        SORSHA\n</b>          I don't believe you.\n\nSorsha defensively kneels on her bed as Madmartigan\nwalks toward her.  He shows no fear of her knife, com-\npelled instead by honest passion.  For once, he isn't\nconning anybody.  His feelings are genuine.\n\n<b>                      MADMARTIGAN\n</b>          I wish it weren't true.  I swore\n          I'd never let this happen.  I hate\n          you.  I hate your beauty, I hate\n          your innocence, I hate the feelings\n          you've awakened in me.\n\nThe knife trembles in Sorsha's hand.\n\n<b>                       MADMARTIGAN\n</b>          I'm in love with you, Sorsha.  I\n          don't want to be, but a power has\n          enchanted me and I stand helpless\n          against it.  It's torture.  Battle-\n          field or prison cell was never half\n          as cruel.\n\nHe kneels onto her bed.  Her hand falls, her knife\nfalls to the floor, her chest heaves with fear and emo-\ntion.\n\n<b>                      MADMARTIGAN\n</b>          I want you and I can't have you so\n          I want you all the more.  If this\n          were another time and another place\n          I'd--\n\nHe stops.  He looks into her eyes.  Willow dashes out of\nthe tent with the baby.\n\n<b>                        SORSHA\n</b>          You'd what?\n\nMadmartigan takes Sorsha in his arms and kisses her.\nHer trembling body surrenders to him.  Until:\n\nThey hear a SCREAM outside the tent.  It all happens\nquickly.  Kael rips open the canvas and catches them in\ntheir embrace.  In one hand he holds the baby.  In the\nother hand:  Willow.\n\n<b>                         KAEL\n</b>          What's going on here!!\n\nSorsha sees the baby, sees the empty crib, and smashes\nMadmartigan hard across the face.\n\n<b>                        SORSHA\n</b>          Deceiver!!\n\nKael hurls Willow across the tent and tosses the baby\nin the straw.  Growling horribly he lunges at Madmarti-\ngan.  Madmartigan rolls away and sees Sorsha's sword\nnearby.  Grabs it.  As Kael draws his sword, Madmarti-\ngan artfully slices away the center pole, and the en-\ntie tent collapses.\n\n<b>EXT. SNOW CAMP - MORNING\n</b>\nBodies writhe under the fallen mass of canvas, and Ra-\nziel hovers and screeches above.  Then, a silver blade\nslits through the tent, and out jumps Madmartigan\nwielding Sorsha's sword.\n\nAlarm!  Nockmaar soldiers and Death Dogs charge across\nthe snow.  Madmartigan battles them with incredible\nskill, backing toward the mountain slope.\n\nWilow crawls out from under the corner of the tent,\nclutchign the baby.  Madmartigan kills several so-\ndiers, littering the snow with bodies and weapons.\nWillow reacts, impressed by Madmartigan's swordsman-\nship.  Madmartigan makes the mistake of acknowledging\nit:  he bows, prod and cocky.\n\n<b>                      MADMARTIGAN\n</b>          Whoops!\n\nHe slips on the ice and catches himself.  Nearby a\nshield skids off along the snow.\n\n<b>                      MADMARTIGAN\n</b>          Willow!  Jump on the shiled!\n\nKael howls and thrashes inside the collapsed tent.\nThen he gashes it open with his huge black sword.  He\nsees Willow and the baby get on the large shield.\n\n<b>                         KAEL\n</b>          Bowmen!  Horses!  After them!\n\nMadmartigan runs toward the shield.  Archers draw their\nbows.  Madmartigan turns and sees Sorsha beside Kael.\n\n<b>                      MADMARTIGAN\n</b>          Sorsha!  I didn't betray you.  I\n          love you!\n\nAs arrows rain down around him, Madmartigan leaps onto\nthe shield behind Wuillow.  Sorsha watches them as they\nslide away down the mountain, Raziel flapping and\nshrieking overhead.\n\n<b>                         KAEL\n</b>          Kill them!!\n\nKael waves his sward and a crack squad of Nockmaar\nHORSEMEN gallop down the mountain after the sled-\nshield.\n\n<b>EXT. DOWN THE SNOWY MOUNTAIN - DAY\n</b>\nWillow hugs the baby while he sits between\nMadmartigan's legs, and the shield zooms down the moun-\ntain, zig-zagging through trees.  Madmartigan steers by\nusing Sorsha's sword as a ski pole.\n\nThe Nockmaar horsemen gallop after them.\n\nThe shield skips and flies over snowdrifts and bumps.\nRaziel squawks in terror above them.  Just missing\ntrees and rocks, they pick up speek.  Their eyes sud-\ndenly widen.  Dead ahead is a huge wall of ice!\n\n<b>                        WILLOW\n</b>          Nooo!!!\n\nWillow shuts his eyes.  the shield speeds toward the\nwall.  At the last moment Madmartigan steers them into\na small opening, little more than a crack.  Raziel,\nnearly smashing into the wall herself, soars up into\nthe sky and loses them.\n\n<b>INT. ICE TUNNEL - DAY\n</b>\nThey slide and sway down a long tube of ice, picking up\nincredible speed until they loop 360 degrees upside-\ndown and around and go shooting out a hole at the other\nend.\n\n<b>EXT. MOUNTAINSIDE - DAY\n</b>\nThey soar thorugh the air.  Madmartigan and Willow\nshriek in terror.  But Elora Danan giggles:  she's hav-\ning fun!  But in the air the shield goes one way and\nthey go another, flipping and hanging onto one another\nand landing on soft snow with a fffump.  Inertia keeps\nthem rolling.\n\nClumped together, they tumble down the mountain, gath-\nering snaw as they go, bouncing and rolling into a\nsnowball that gets bigger and bigger and bigger and\nbigger and bigger!\n\n<b>EXT. VILLAGE - DAY\n</b>\nThe snowball steamrolls toward a small village at the\nfoot of the mountain.  CHLDREN look up and squeal with\ndelight while the adult VILLAGERS run for their lives.\n\nIt plows through the middle of the village, scattering\npeole and animals left and right.  At last it smashes\nagainst a stone house and cracks open like an egg.\n\nRaziel flies down and lands on top of the snowball,\nflapping her wings frantically.  madmartigan crawls out\nas the villagers rush up.  They stand back in amaze-\nment:  the baby starts crying.\n\n<b>                      MADMARTIGAN\n</b>          Willow!  Willow!  Are you all\n          right?\n\nMadmartigan drags Willow and the baby out of the snow.\nWillow's body is limp, he's unconscious.  Then a VIL-\nLAGER points up at the mountain.\n\n<b>                       VILLAGER\n</b>          King Kael!\n\n<b>                   ANOTHER VILLAGER\n</b>          Nockmaar troops!\n\n<b>                      MADMARTIGAN\n</b>                    (to villagers)\n          Help us.\n\nIn the distance Kael and his squad of about 15 horsemen\ncharge toward the village.  The villagers flee into\ntheir huts and houses.  Madmartigan scoops up Willow\nand the baby.  Some villagers usher them around a\ncorner and into a house just as Kael's army invades the\ntown.\n\n<b>INT. HOUSE CELLAR - DAY\n</b>\nMadmartigan is bustled underground thorugh a cellar\ninto a hidden storage room and a disguised door shuts\nbehind him.  MEN, WOMEN and CHILDREN huddle here in\nsilence, like refugees or criminals.  Madmartigan hands\nthe crying baby to a WOMAN then lays Willow on the\nfloor.  Suddenly a huge hand clamps his shoulder:  his\nold friend and rival Airk Thaughbaer.\n\n<b>                         AIRK\n</b>          Madmartigan.  Settled down with a\n          family huh?\n\nMadmartigan knocks Airk's hand away.\n\n<b>                      MADMARTIGAN\n</b>          You left me to die, friend.\n\n<b>                         AIRK\n</b>          You managed alright.\n\n<b>                      MADMARTIGAN\n</b>          Is this what's left of your army?\n\nAmong the refugees is a handful of war-battered WARRI-\nORS.  One of them, an OFFICER looks out through the\nceiling beams.\n\n<b>                        OFFICER\n</b>          Keep that baby quiet.\n\nThey hear hoofbeats outside.  Airk gives Madmartigan a\nflask of whiskey.  He squirts whiskey into Willow's\nmouth and Willow coughs and shudders awake.\n\n<b>EXT. VILLAGE - DAY\n</b>\nRaziel flies onto a rooftop and looks down.  Nockmaar\nsoldiers flood the village, dismounting, kicking down\ndoors, searching houses.  Then Raziel sees Kael riding\nalongside Sorsha.\n\nIn her armor, at a distance, Sorsha looks fierce.  But\nCLOSER her eyes show confusion, hesitation.  Kael\nwatches her closely as he waves his sword at the vil-\nlage.\n\n<b>                         KAEL\n</b>          Where is it!  Tell us or we'll burn\n          your village!  Sorsha!\n\nHe shakes her roughly.  She dismounts.  Raziel watches\nas Sorsha and two other soldiers enter the house where\nMadmartigan and Willow are hiding.\n\n<b>INT. HOUSE CELLAR - DAY\n</b>\nWillow holds the baby tight.  Madmartigan, Airk and the\nOfficer watch through the cracks.  Boots pound above,\nshaking dust down on them.  A door opens.\n\nNobody breathes.  Willow buries the baby in his chest.\nMadmartigan peeks through the door.  Sorsha, alone,\ncomes down into the cellar.  They see her.  Searching.\nAirk's men reach for their swords, begin to draw.\nWhisper:\n\n<b>                        OFFICER\n</b>          Kill her.\n\nMadmartigam shakes his head.\n\n<b>                      MADMARTIGAN\n</b>          You'll draw the others.\n\nAirk looks at Madmartigan curiously.  Madmartigan\nwatches Sorsha. She is right there, inches away.\nInaudibly, be says her name.  At last she goes back\nupstairs.\n\n<b>INT. HOUSE - UPSTAIRS - DAY\n</b>\nSorsha comes up and begins to leave with the other two\nsoldiers.\n\n<b>INT. CELLAR\n</b>\nIn Willow's arms, the baby lets out a cry.\n\n<b>INT. HOUSE - UPSTAIRS\n</b>\nSorsha and the soldiers stop and draw swords.  The\nbaby's cry is suddenly drowned out by a loud SDRRECH.\nRaziel flaps in through a window and flies madly around\nthe house, cawing and shrieking insanely.  Sorsha and\nthe soldiers sheathe their swords and leave.\n\n<b>INT. CELLAR\n</b>\nEveryone sighs with relief.\n\n<b>EXT. VILLAGE - DAY\n</b>\nIn the distance the Nockmaar army is setting houses ab-\nlaze and Kael is terrorizing the fleeing people with\nhis sword.  Sorsha mounts her horse.  Her attention is\nmomemtarily caught by a MAN across the street who, from\nthe back, looks like Madmartigan.  She gasps.  The man\nturns around.  She sags with disappointment, spurs her\nhorse, and rides off.\n\nThe deadly squad of Nockmaar horsemen gallops out of\nthe village.\n\n<b>INT. HOUSE - UPSTAIRS - DAY\n</b>\nMadmartigan and Willow come upstairs with Airk and his\nmen.\n\n<b>                         AIRK\n</b>          It's you they're after, Madmarti-\n          gan.  What did you do this time?\n\n<b>                      MADMARTIGAN\n</b>          They're not after me.  They want\n          the baby.\n\nLiving in the house is a scrawny, shifty-eyed man named\nCUTH.  He watches and listens.\n\n<b>                         AIRK\n</b>          Who is this baby?\n\nWillow steps forward, both protective and proud.\n\n<b>                        WILLOW\n</b>          The princess, Elora Danan.\n\nThey all know of her.  They all sigh with respeck and\nawe, and they bow.\n\n<b>                        PEOPLE\n</b>          The prophecy has come true.\n\n<b>                         AIRK\n</b>          Give her to us.  We'll protect her.\n\nRaziel screeches from a ceiling beam.\n\n<b>                        RAZIEL\n</b>          Not safe!  Not safe!\n\nWillow looks up at Raziel hopefully.\n\n<b>                        WILLOW\n</b>          We're taking her to Tir Asleen.\n          She'll be safe there from\n          Bavmorda's powers.\n\nAirk looks up at Raziel.  Then down at Willow.  He\nclasps Madmartigan's arm.\n\n<b>                         AIRK\n</b>          Tir Asleen is a myth.  It doesn't\n          exist.\n\n<b>                        RAZIEL\n</b>          It does!  It does!  I will show\n          you!\n\nAirk impatiently waves the bird away and shoves Madmar-\ntigan in the chest.\n\n<b>                         AIRK\n</b>          You gonna be a hero, Madmartigan?\n          I've lost half my men fighting\n          Kael, and Bavmorda, and the Nock-\n          maar army.  Now you and this Peck,\n          and that magpie up in the rafters,\n          are gonna take 'em on alone?\n\n<b>                      MADMARTIGAN\n</b>                     (challenging)\n          Then come with us.\n\nAirk angrily stabs his finger at the floor.\n\n<b>                         AIRK\n</b>          The war is here!  In towns and vil-\n          lages like this!\n\nAirk crosses his arms and turns his back, looking out\nat the burning houses and the suffering families.\n\n<b>                         AIRK\n</b>          You're chasing a dream.\n\n<b>                      MADMARTIGAN\n</b>          Just get me some horses.\n\nAirk glares at him furiously.  Then he kicks open the\ndoor and storms out into the street.  Madmartigan and\nWillow hurry after him.\n\n<b>EXT. MOUNTAINSIDE - VILLAGE OUTSKIRTS - DAY\n</b>\nAirk and his men, plus some villagers, watch as Madmar-\ntigan mounts a large horse.  Then some villagers help\nWillow wiggle up onto a small pony.  They sling the\nbaby over Willow's back and stuff saddlebags with pro-\nvisions\n\n<b>                     MADMARTIGAN\n</b>          Once again, Airk, we say goodbye.\n\nSadly and cynically, Airk laughs.\n\n<b>                         AIRK\n</b>          One day one of us willl stand on\n          the other's grave.\n\nThey shake hands ruggedly.  Madmartigan nods at Willow\nand they head off.  Airk watches them go, clearly am-\nbivalent about staying behind.  They ride up the snowy\nslope, Raziel circling above.\n\nWE SEE Cuth.  He scratches his filthy beard.  He sneaks\noff through the village, in the direction of the Nock-\nmaar army.\n\n<b>EXT. MOUNTAIN - DAY\n</b>\nSnow circles around them as they climb.  Then, oddly,\nthe mountain becomes warmer, and the snow melts away.\nThey reach a slope of dark vitreous lava.\n\n<b>                        RAZIEL\n</b>          Nockmaar!  Nockmaar!\n\nFar away, at the top of the mountain, looms the ominous\nCatsle of Nockmaar.  The black lava flows from it\nlike a deadly shadow.\n\n<b>EXT. CAVE OF THE EBORSISK - DAY\n</b>\nTheir horses rear up as they approach the mouth of the\ncave.  Raziel waits for them, circling and cawing.\n\n<b>                        RAZIEL\n</b>          This way!  The cave!\n\nThey dismount and lead the horses.  But the horses pan-\nic, their frightened neighing voices echoing deep in\nthe gloomy cave, and they break away and run off.\n\nWillow swallows hard.  He and Madmartigan follow Raziel\ninside.\n\n<b>INT. CAVE OF THE EBORSISK - DAY\n</b>\nDaylight is soon replaced by the orange glow of molten\nlava.\n\n<b>                        WILLOW\n</b>          Madmartigan!  I can't stand being\n          in closed-in places.\n\n<b>                      MADMARTIGAN\n</b>          Want me to carry Elora?\n\n<b>                        WILLOW\n</b>          I'm used to her.  How's she doing?\n\nWillow wears the papoose on his back.  Madmartigan\nlooks in at the baby's face.\n\n<b>                      MADMARTIGAN\n</b>          She's doing a lot better than we\n          are, Peck.\n\nWillow and Madmartigan laugh, which breaks the tension.\nThen a geiser of steam hisses near them and a bat\nscreeches somewhere and the tension's back.  They keep\ngoing.\n\n<b>INT. DEEPER IN THE CAVE\n</b>\nHot liquid drips from the ceiling.  Hissing steam bub-\nbles from the floor.  they go single-file along a ledge\nover a foaming lava pit.  Raziel is squawking way ahead\nin the distance.\n\n<b>                      MADMARTIGAN\n</b>          Willow...this may be a bad time to\n          ask this question but...what if\n          Raziel's wrong?\n\n<b>                        WILLOW\n</b>          She can't be wrong.  She's a very\n          very very powerful sorceress.\n\n<b>                      MADMARTIGAN\n</b>          She's a bird, Willow.\n\n<b>                        WILLOW\n</b>          That's my fault, not hers.  I've\n          got to keep practicing.  I'm still\n          in the learning stage but magic,\n          Madmartigan, requires concentration\n          and--\n\n<b>                      MADMARTIGAN\n</b>          Watch it!\n\n<b>                        WILLOW\n</b>          Ahhh!\n\nMadmartigan lunges and grabs Willow just as he is about\nto fall into the lava pit.  He hauls him to safety.\nThey gasp with relief. Then they head deeper into the\ncave.  They stop.  They hear something.  Something\nstrange.\n\nThen, something moves on the wall.\n\n<b>                        WILLOW\n</b>          I hate this.\n\nThe cave walls come to life.  Down them crawl ugly ROCK\nPUFFERS, pillow-sized wall crabs that screech horribly\nlike bats.  Madmartigan fights them off with his sword.\nThe Rock Puffers bloat themselves up, tripling their\nsize.  Madmartigan stabs one and it hisses away like an\nuntied balloon.\n\nSuddenly, distant hoofbeats thunder and echo.  Madmar-\ntigan flashes his sword and turns around, ready to de-\nfend Willow and the baby against the army.\n\n<b>                      MADMARTIGAN\n</b>          Go, Willow!  Run!  Run!\n\nWillow listens as the hoofbeats get louder and louder.\nAt last he turns and runs deeper into the cave.  Mad-\nmartigan waits.\n\nThe Nockmaar soldiers, now increased to eighty, come\ncharging down the cave.  Kael rides in the lead along-\nside the turncoat Cuth.  As they gallop along the\nledge, Cuth makes the mistake of crowding Kael, who an-\ngrily elbos him, horse and all, into the boiling pit.\n\nThe army tramples over the Rock Puffers, which explode\nunderfoot.  Madmartigan braces himself as they stampede\ntoward him.  But suddenly the horseman all screech\nthir horses to a halt.  The horses rear and back away.\n\nMadmartigan stands there, wondering.  Then suddenly a\nshadow looms behind him.  He turns.\n\nThe EBORSISK roars and the cave shakes and thunders.\nIt's an enormous two-headed monster that doesn't like\nvisitors.\n\n<b>                      MADMARTIGAN\n</b>          Willow!  Willow!\n\nHe looks around frantically.  Willow is nowhere to be\nseen.  Then the baby cries out.  Madmartigan sees them,\ncowering behind a rock.  He runs toward them.  The\nEborsisk exhales flames over his head.\n\n<b>                         KAEL\n</b>          Go after them!\n\nSoldiers obey Kael and go after Madmartigan.  He fights\nthem, hacking down a few, while a few others are in-\ncinerated by the Eborsisk.  Sorsha's horse rears as she\nwatches Madmartigan battle for his life.  Archers shoot\narrows, which pierce the Eborsisk and make it even an-\ngrier.\n\nWillow digs one of his magic acorns out of his pocket.\nA head of the Eborsisk gnashes at Madmartigan.  Madmar-\ntigan looks to Willow for help.\n\n<b>                      MADMARTIGAN\n</b>          Hurry, Willow!  Throw it!\n\nWillow winds up and throws with all his might.  The\nEborsisk blasts a flame, which startles Willow, wreck-\ning his aim.  Madmartigan's eyes pop open and he ducks\nas the acorn whistles by his ear.  The acorn bounces\noff a rock and flies back, trickles along the ground\nand hits a Nockmaar soldier, who is already dead.  The\nsoldier's body turns to stone.\n\n<b>                        RAZIEL\n</b>          Look out!\n\nOne of the Eborsisk's heads lunges toward the baby.\nRaziel dives like a rocket and attacks the monster's\neye as Willow whisks the baby away.\n\nThen Madmartigan leaps up on the Eborsisk.  He climbs\nup over its flaming head and drives his sword down\nthrough its skull.  The Eborsisk howls horribly and its\nwounded head falls.  Madmartigan topples down its back\nand leaps onto a horse, knocking its rider off and, all\nin one swashbuckling move, scooping Willow and the baby\nup onto the back of the horse and galloping away.\n\n<b>                         KAEL\n</b>          After them!!\n\nBut as his horsement charge forward, the Eborsisk falls\nto its knees, half-dead.  The surviving head blasts the\nsoldiers with fire.  They rear back on their horses and\ncontinue to battle the monster with arrows and spears.\n\n<b>EXT. CAVE - TIR ASLEEN - DAY\n</b>\nThey ride out of the mouth of the dark cave into a lush\nvalley of flowers.  In the distance stands the beau-\ntiful CASTLE OF TIR ASLEEN.  Raziel zooms up out of the\ncave an flies above them as they gallop fullspeed to-\nward it.  She soars higher and higher and flies right\nover the castle wall.\n\n<b>EXT. TIR ASLEEN CASTLE - DAY\n</b>\nThe door of the castle is half open.  Madmartigan and\nWillow gallop inside.\n\n<b>INT. TIR ASLEEN - DAY\n</b>\nRaziel flies down to meet them as they ride into the\ncastle courtyard.  A haunting wind drones amont TWELVE\nPILLARS which look like stone from a distance.\n\n<b>                        RAZIEL\n</b>          Tir Asleen.\n\n<b>                        WILLOW\n</b>          There's nobody here.\n\nThey approach the twelve pillars.\n\n<b>                        RAZIEL\n</b>          The Knights of the Pacalcade.  The\n          king's bravest warriors.\n\nSuddenly they hear hoofbeats and a warcry.\n\n<b>EXT. TIR ASLEEN - DAY\n</b>\nKael and his army charge out of the cave and trample\nacross the valley of flowers.\n\n<b>INT. TIR ASLEEN\n</b>\nMadmartigan rushes to the heavy door and strains to\nshut it.\n\n<b>                        RAZIEL\n</b>          Turn them back, Willow!\n\nWillow stares at the twelve knights.\n\n<b>                        WILLOW\n</b>          How??\n\n<b>                        RAZIEL\n</b>          Use the philosopher's stone!  Hur-\n          ry!  Invocation!  Release them!\n\nThe castle door is rusted and old.  madmartigan heaves\nagainst it.  Outside he can see the army storming to-\nward him.\n\nWillow digs out his philosopher's stone.  He squints\nand strains, concentrating his energy.\n\n<b>                        WILLOW\n</b>          Beings within, beings without!\n          Danu danu walkail funfawtha!\n\nHe continues to chant and to concentrate.  One of the\nknights comes to life.\n\n<b>                        WILLOW\n</b>          I did it!  Madmartigan!  Come here!\n          Look!  You gotta see this!  I did\n          it!\n\n<b>                        RAZIEL\n</b>          More!  More!\n\nMadmartigan heaves the door shut just as the army\ncharges up, and he locks it with a huge bolt.\n\n<b>EXT. TIR ASLEEN - DAY\n</b>\nThe Nockmaar horsemen rear back form the locked door.\n\n<b>                         KAEL\n</b>          Assault!  Scale the walls!\n\nHe sends his men in all directions.  They leap off\ntheir horses and hack down trees from the nearby woods.\n\n<b>INT. TIR ASLEEN\n</b>\nWillow brings the knights to life, one by one.\n\n<b>                        WILLOW\n</b>          Tuatha tuatha danu!\n\nEach knight shakes himself into action.  Madmartigan\nfollows them in an armory.\n\n<b>                        WILLOW\n</b>          Raziel!  I transformed them all!\n          I'm a magician!\n\n<b>                        RAZIEL\n</b>          You didn't transform them, Willow,\n          you released them.  That was noth-\n          ing.  Now change me.\n\nWillow's on a roll.  He rubs his hands together.\n\n<b>                        WILLOW\n</b>          I feel like I could do anything!\n\nHe drops to his knees and stretches his philosopher's\nstone apart like an accordian.\n\n<b>EXT. TIR ASLEEN - ARMORY\n</b>\nMadmartigan and the knights grab weapons and armor.\nTwo knights wheel a catapult out ot the battlements.\nMadmartigan wees, displayed specially on a rack, a com-\nplete set of armor of shining silver.  He reaches out\nto touch it.\n\n<b>                        KNIGHT\n</b>          It belonged to our king.\n\n<b>INT. TIR ASLEEN - COURTYARD\n</b>\nThe knights light a fire and boil vats of oil.  Willow\nstruggles to transform Raziel, trying to remember all\nhe has learned.\n\n<b>                        WILLOW\n</b>          Capture the enery...limitless\n          power of the will...avvdachh doth\n          indicht rredd baerkinhaekin!\n\nRaziel begins to change.  From a bird, she expands,\nstretches, and turns into a GOAT.\n\n<b>                        WILLOW\n</b>          Raziel?  Is that you?  Oh-oh.  What\n          happened?\n\nRaziel tilts her goat head.\n\n<b>                        RAZIEL\n</b>          I hate this.\n\nSuddenly flaming arrows rain down over the castle wall.\nWillow scoops up the baby and he and Raziel run for cover.\n\n<b>EXT. TIR ASLEEN\n</b>\nFrom their horses Kael and Sorsha watch as the soldiers\nclimb the wall.  They suddenly hear a hacking noise\nabove and several Nockmaar men tumble down the ladders.\nSorsha looks up.\n\nHigh on the wall stands Madmartigan, magnificently\ndressed in the glimmering armor of the King!\n\nKael roars and points his deadly sword up at Madmarti-\ngan.  Then several soldiers attack the castle door with\na huge battering ram and smash it open.\n\n<b>                         KAEL\n</b>          Attack!!\n\nKael and Sorsha gallop into the castle with otehr Nock-\nmaar horsemen, while Madmartigan continues to battle\nattackers on the castle wall.\n\n<b>INT. TIR ASLEEN\n</b>\nWillow looks up as the horsemen charge into the court-\nyeard.  He makes a run for the hallway.  SIX HORSEMEN\nchase after him, jumping off their horses and drawing\ntheir swords.\n\nSorsha dismounts, draws a sword, and strides up the\nstairs toward teh top of the wall.\n\n<b>INT. ARMORY\n</b>\nWillow runs into the armory and sets the baby down in a\ncorner.  The six horsement run in and corner him.  He\ngrabs an enormous broadsword.  Swings it like a base-\nball bat.  The momentum of the heavy sword hurls Willow\nacross the room.  The blade pierces a Nockmaar man.\nWillow grunts and yanks the sword out.  The remaining\nsoldiers come after him.  Willow swings and flashes the\nsword as they close in on him.\n\n<b>EXT. TIR ASLEEN\n</b>\nIn the courtyard, Raziel the goat butts a few soldiers\nas the battle rages.\n\n<b>UP ON THE WALL\n</b>\nMadmartigan stabs a minion and sends him hurtlin down\nthe wall.  Then he turns around.  Five more enemy\nswordsmen slash at him.  Madmartigan is amazing:  spin-\nnig, lunging, ducking, he takes out one, two, three,\nfour of them with ease.  But not the fifth.\n\nIt's the Nockmaar Lieutenant.  He and Madmartigan\nswordfight.  The Lieutenant hacks the sword out of\nMadmartigan's hand: it clatters down into the court-\nyeard.\n\nMadmartigan throws up his arm.  The Lieutenant's sword\nclangs against his wrist armor, knocking Madmartigan\nonto his back.  With two hands the Lieutenant lifts his\nsword high and goes to kill Madmartigan.  madmartigan\nshuts his eyes.  But nothing happens.\n\nMadmartigan opens his eyes.  the Lieutenant stands\nthere, frozen, staring at him.  Then falls forward.\nRolls over Madmartigan.  And plummets off teh wall.  In\nhis place stands Sorsha, holding a bloodied sword.\n\n<b>                      MADMARTIGAN\n</b>          Sorsha.\n\n<b>                        SORSHA\n</b>          Madmartigan.\n\nHe props himself up on his elbows and smiles.\n\n<b>                      MADMARTIGAN\n</b>          Whose side are you on?\n\nShe reaches down and pulls Madmartigan to his feet.\n\n<b>                        SORSHA\n</b>          Yours.\n\nThey look into each other's eyes.  They go to embrace.\n\n<b>                        MINION\n</b>          Arrrggghhh!\n\nOut of nowhere a Nockmaar minion attacks them, his\nsword flashing over his head. Sorhsa hardly moves.\nShe simply dusts him off the wall with her sword.  She\nturns back to Madmartigan.\n\n<b>                        SORSHA\n</b>          I love you.\n\nTheir armor clanks as they throw their arms around each\nother and kiss, high up on the castle wall.\n\n<b>INT. TIR ASLEEN - COURTYARD\n</b>\nKael looks up from his horse.\n\n<b>                         KAEL\n</b>          Sorsha!!\n\nHe sees Sorsha and Madmartigan coming down the wall,\nfighting Nockmaar troops.  Kael holds up his great\nhand.  In it he holds the baby.\n\n<b>                         KAEL\n</b>          Bordak!\n\nKael waves his men after Sorsha and Madmartigan.\n\n<b>                         KAEL\n</b>          Kill them both!\n\nHe laughs viciously then gallops toward the castle\ndoor.  As he reaches it he abruptly stops.\n\n<b>EXT. TIR ASLEEN\n</b>\nTwo hundred HORSEMEN are charging straight toward Kael.\nLed by Airk Thaughbaer!\n\nCLOSER, riding in Airk's saddlebags, with their tiny\ndaggers flashing, are the long-lost brownies, Teemo and\nRool!\n\n<b>INT. TIR ASLEEN\n</b>\nKael stuffs the baby deep inside his tunic.\n\n<b>                         KAEL\n</b>          Troops!  To Nockmaar!  Ride with\n          me!\n\n<b>EXT. TIR ASLEEN\n</b>\nKael and his men gallop across the valley of flowers\nand hack their way through Airk's army.\n\n<b>EXT. TIR ASLEEN\n</b>\nKael and his men gallop across the valley of flowers\nand hack their way through Airk's army.\n\n<b>INT. TIR ASLEEN\n</b>\nMadmartigan and Sorsha mount horses.  Willow staggers\nout of the armory, wounded and bleeding.\n\n<b>                        WILLOW\n</b>          I'm sorry.  There were too many of\n          them.\n\nMadmartigan scoops him up.  With seven surviving\nknights, they ride out.\n\n<b>EXT. TIR ASLEEN\n</b>\nMany of Kael's men fall in battle.  But Kael and a\ndozen horsemen plow through and escape into the cave.\n\nMadmartigan rides up to Airk Thaughbaer and their\nhorses powerfully dance around each other.\n\n<b>                      MADMARTIGAN\n</b>          Out for a little ride in the coun-\n          try, Airk?\n\n<b>                         AIRK\n</b>          Thought you might get lonely, Mad-\n          martigan!\n\nThen they drop the bravado and clasp hands.\n\n<b>                      MADMARTIGAN\n</b>          Thank you, friend.\n\n<b>                         AIRK\n</b>          Let's go.\n\nThey charge into the cave.  The clamor of their\nhoofbeats echoes and then fades to silence.  The valley\nis littered with fallen soldiers.\n\nThen, Raziel trots out of the castle.  She clip-clops\nacross the valley and follows the others to the cave.\n\n<b>EXT. VOLCANIC MOUNTAINSIDE - DAY\n</b>\nThe Nockmaar horsemen race out of the cave and gallop\nup the obsidian mountain toward the dark castle.\n\nThe army of Tir Asleen thunders out of the cave in pur-\nsuit.\n\nArrows fire back and forth.  The Tir Asleen army stays\nright on the enemy's tail.  Willow hangs on to Madmar-\ntigan for dear life.\n\nAirk and Madmartigan ride side by side, perfect team-\nwork, and cut a few Nockmaar ment down.\n\nThen Madmartigan turns and sees Sorsha ride up past\neverybody.  What a rider she is!  She surprises a cou-\nple of Nockmaar soldiers, swordfighting as she rides,\nkilling them both.  But she can't catche Kael.  He rides\nahead of everyone else, whipping his horse at an in-\ncredible speed toward the castle.\n\nThe chase continues up the mountain.  The Tir Asleen\narmy keeps firing arrows at the enemy, or cutting them\ndown with their swords, until only two Nockmaar men\nride behind Kael.  At last Kael reaches the castle\ndrawbridge and leaps onto it as it begins to rise.  His\ntwo remaining horsemen leap after him but fall short\nand tumble into the dry craggy moat.\n\nThe drawbridge shuts with a loud echoing KLUNGG!  Mad-\nmartigan and Arik screech to a halt on the brink of the\nmoat.  They look up.  The castle loom, huge, dark,\npowerful, evil.\n\n<b>                      MADMARTIGAN\n</b>          Sorsha!  Any way in there?\n\nSorsha rides up to his side.\n\n<b>                        SORSHA\n</b>          No.  The fortress is protected on\n          all sides.\n\nThe Tir Asleen warriors, dwarfed by the huge black\nwall, look at one another with doubt and worry.\n\n<b>                         AIRK\n</b>          Make camp!  We'll assault at dawn.\n\nThe army dismounts and begins to unpack supplies.  It\nis late in the day and shadows lengthen toward evening.\n\n<b>INT. NOCKMAAR CASTLE - LATE AFTERNOON\n</b>\nKael carries the baby through the castle and climbs up\nthe gloomy narrowing stairs of the QUEEN'S TOWER.  He\ncomes to a large door and hesitates a moment, showing\nfear.  Then creaks the door open.\n\n<b>INT. QUEEN'T TOWER\n</b>\nBAVMORDA looks up.  Kael cowers, afraid of her evil\npower.\n\n<b>                       BAVMORDA\n</b>          Kael!\n\nCarved in the floor is a MAGICIAN's CIRCLE, and in the\nvery middle of this is a sacrificial altar made of\nshining copper.  Bavmorda stands over the altar, wear-\ning black robes.  Behind her stand two decrepit DRUIDS.\nKael bows.\n\n<b>                         KAEL\n</b>          Queen Bavmorda.  I have the child.\n\nThe baby squirms and cries.  Seething with hate, Bav-\nmorda reaches out her arms, then shrinks back.\n\n<b>                       BAVMORDA\n</b>          We must start the ritual!\n\nShe hears noise outside the castle.\n\n<b>                       BAVMORDA\n</b>          Who is that?\n\n<b>                         KAEL\n</b>          An army of rebels and traitors.\n\nBavmorda closes her eyes, holds out her hands and feels\nthe vibrations and energy around her.  Psychically:\n\n<b>                       BAVMORDA\n</b>          Where is Sorsha?\n\n<b>                         KAEL\n</b>          She has turned against you.\n\nBavmorda opens her eyes furiously.  to her druids:\n\n<b>                       BAVMORDA\n</b>          Purify the altar!  Arrange the im-\n          plements!  I'll deal with Sorsha!\n\nThe druids take the baby from Kael.  Bavmorda storms\nout the door.\n\n<b>EXT. NOCKMAAR CASLTE - DUSK\n</b>\nThe Tir Asleen rebels pitch tents and build fires.\nThen they feel a terrible presence and look up at the\ncastle wall.  Amid torches and hideous minions, Bavmor-\nda leers down at them and laughs.\n\n<b>                       BAVMORDA\n</b>          This is not an army!\n\nSorsha looks up, and her mother seems to laugh right at\nher.  Madmartigan steps forward.  Seeing him in the ar-\nmor of the King, Bavmorda stops laughing, taken aback.\n\n<b>                        RAZIEL\n</b>          Willow!  Get out of here!  Quick!\n          Hide!\n\nRaziel suddenly butts Willow into a tent.\n\n<b>INT. TENT\n</b>\nWilllow tumbles into the tent and Raziel follows him.\n\n<b>                        RAZIEL\n</b>          Get down!  The ritual chant!\n          Quick!  Protect yourself!\n\n<b>                        WILLOW\n</b>          Why?\n\n<b>                        RAZIEL\n</b>          Just do it!\n\nWillow takes out his philosopher's stone and begins to\nchant.\n\n<b>EXT. NOCKMAAR CASTLE\n</b>\nMadmartigan faces the queen.\n\n<b>                      MADMARTIGAN\n</b>          We've come for Elora Danan!  Turn\n          her over to us!\n\nBavmorda stabs her finger down at him.\n\n<b>                       BAVMORDA\n</b>          You dare to challenge me?  You are\n          not warriors.  You're pigs!\n\nShe waves her hand, casting a horrible spell over the\narmy.  Madmartigan's body begins to change its shape.\nHis armor breaks apart.  He grows hideous.\n\n<b>                       BAVMORDA\n</b>          You're all pigs!\n\nThe rebel soldiers panic and run.  Slowly, horribly,\nthey all expand and contort, ripping out of their armor\nand clothers, casting down their weapons and shields.\n\n<b>                        SORSHA\n</b>          Mother!  No!!\n\n<b>                       BAVMORDA\n</b>          You made your decision!\n\nBavmorda points at Sorsha, and Sorsha, too, begins to\nchange.  The mountainside becomes a sea of writhing\nflesh.  Every one of the Tir Asleen army is transformed\ninto a pig.\n\nINT. QUEEN'S TOWER - DUSK Bavmorda throws open the\ndoor.  Her druids are binding the baby in a leather\nthong.\n\n<b>                       BAVMORDA\n</b>          Begin the ritual.  Now!  Light the\n          first candle.\n\nA druid lights on of THIRTEEN ENORMOUS CANDLES.  Bav-\nmorda glares up at the roof.  In the middle of it is a\nlarge circular hole showing the starlit sky.\n\n<b>                       BAVMORDA\n</b>          Come, thunder.  Come lightning.\n          Touch this altar with your pwer.\n          Come into my tower...\n\nLightning flashes faintly and thunder rumbles in the\ndistance.  Bavmorda smiles with satisfaction.\n\nA druid places teh baby on the altar.  The other druid\nhits a loud gong, once.  Bavmorda enters the Magician's\nCircle.  Her face contorts as she recites:\n\n<b>                       BAVMORDA\n</b>          Dark runes, dark powers!  Blend and\n          bind, bind and blend, Universal\n          night!  And the might of Nockmaar!\n\nMagically she produces a razor-sharp knife.  Lightning\nflashes again, getting closer.\n\n<b>INT. TENT - NIGHT\n</b>\nWillow is crouched on his knees, chanting with her eyes\nclosed.\n\n<b>                        RAZIEL\n</b>          It's over, Willow.  You did well.\n          You protected yourself.\n\nWillow looks up.  He hears the grunting outside.  With\ngreat trepidation, he crawls to the tent door.\n\n<b>EXT. NOCKMAAR CASTLE - OUTSIDE TENT - NIGHT\n</b>\nWillow shudders in horror at the grotesque sight.  Amid\nhorses and tents and weapons, hundreds of pigs wander\nabout.  Willow stands and walks through them.  He looks\ndown at one point and sees Rool and Teemo:  two tiny\nbaby pigs.  Then he turns and runs back into the tent.\n\n<b>INT. TENT - NIGHT\n</b>\nWillow collapses to his knees beside Raziel.\n\n<b>                        WILLOW\n</b>          I've come all this way and now\n          Elora Dana's going to die!\n\n<b>                        RAZIEL\n</b>          No!  I can still defeat Bavmorda!\n\n<b>                        WILLOW\n</b>          She's too powerful, Raziel\n\nRaziel sternly stamps the ground with her hoof.\n\n<b>                        RAZIEL\n</b>          A true magician, Willow, never\n          surrenders.  She is a sorceress--I\n          am a sorceress!  Transform me now\n          and I will destroy her!  Hexagram!\n\nWillow grabs a sword and draws a hexagram around Ra-\nziel.  He steps outside of it, holds up his\nphilosopher's stone and begins his magic.\n\n<b>                        WILLOW\n</b>          Banish all disturbing forces from \n          this place.  Fire, water, above and\n          below.  Balance.  Balance.  Bal-\n          ance.\n\nRaziel begins to change.  Willow wrestles with his own\npowers of concentration and will, now and then losing\nstrength.\n\n<b>                        RAZIEL\n</b>                   (voice distorted)\n          Don't give up!  Willow!\n\nHe chants and strains.  Raziel momentarily changes into\na partly-formed grotesque creature.  Then into a deer.\nThen she becomes human.  At last she becomes herself, a\nonce-beautiful and now elderly woman.  Willow covers\nher unclothed body with a simple smock.\n\n<b>                        WILLOW\n</b>          Raziel!\n\nShe looks down at her old hands.  Then her eyes focus\nwith purpose.\n\n<b>                        RAZIEL\n</b>          We've got a lot of work to do, Wil-\n          low.  Bring in our brave men.\n\nWillow opens the tent.  Some pigs shuttle in, and Ra-\nziel begins to change them back into warriors.\n\n<b>EXT. NOCKMAAR CASTLE -NIGHT\n</b>\nStationed high on the castle wall, three Nockmaar MIN-\nIONS laugh and drink.  Then they hear the terrible\nSCREAM of the baby.  They look up at the Queen's Tower.\n\n<b>INT. QUEEN'S TOWER - NIGHT\n</b>\nA druid hits the ceremonial gong, twice.  The baby\nshrieks.  Standing over her, Bavmorda crushes a piece\nof glass with her bare hands and drops the fragments\ninto a Witch's Bottle.\n\n<b>                       BAVMORDA\n</b>          Black fire forever kindled within,\n          Let the second right begin!\n\nWith a pair of razor-sharp shears she clips the baby's\ntiny fingernails and sprinkles them into the Witch's\nBottle.  The bottle glows and sparks, and teh heavens\nasnwer with distant thunder.\n\n<b>EXT. NOCKMAAR CASTLE - NIGHT\n</b>\nIn the dark Tir Asleen camp some figures crouch low and\nhurry from tent to tent.  CLOSER, the faces of rebel\nwarriors, watching the castle wall.  Fear.\n\n<b>INT. TENT - NIGHT\n</b>\nWillow, Raziel, Madmartigan, Sorsha, Airk Thaughbaer\nand a dozen rebel warriors argue back and forth.\n\n<b>                         AIRK\n</b>          Uphill with our rough weapons,\n          we'll never make it!\n\n<b>                        SORSHA\n</b>          Elora Danan will die!\n\n<b>                        RAZIEL\n</b>          By dawn, upon thirteen tolls of the\n          runic drum!\n\n<b>                        WARRIOR\n</b>          Bavmorda is too powerful.  We need\n          more forces.  I say we retreat!\n\nThe other warriors agree.\n\n<b>                        RAZIEL\n</b>          Bavmorda cannot transform you.\n          I've protected this camp with a\n          spell.\n\n<b>                      MADMARTIGAN\n</b>          Can you use your magic to get our\n          men into the fortress, Raziel?\n\nRaziel shakes her head.\n\n<b>                        RAZIEL\n</b>          Bavmorda has shielded it with a\n          spell of her own.\n\nThe warriors grumble and protest.  In a corner, Rool\nand Teemo poke their heads in under the canvas.  Curi-\nously they look at Willow, who sits in silence and deep\nthough, scratching the ground with his fingernail.\n\nThe warriors rumble.\n\n<b>                        WILLOW\n</b>          Wait!!\n\nWillow jumps to his feet.  They all turn to him.\n\n<b>                        WILLOW\n</b>          I have an idea.  Back in my village\n          we catch a lot of hedgehogs.\n\n<b>                      MADMARTIGAN\n</b>          Willow, this is war, not agricul-\n          ture!\n\n<b>                        WILLOW\n</b>          I know, I know!  But this is a way\n          to get into that castle...\n\nThe all gather around Willow to listen.\n\n<b>INT. QUEEN'S TOWER - NIGHT\n</b>\nThunder rumbles.  Bavmorda looks up.  Her face is gra-\ndually becoming more grotesque as the ritual proceeds.\nA druid hits the gong three times.  Now three candles\nare lit.  The baby screams on the altar.\n\nWith a demonic laugh, Bavmorda digs her hands into a\ndeep vat of blood then raises them over her head.  The\nblood runs down her arms into the folds of her black\ncloak.\n\n<b>INT. TENT - NIGHT\n</b>\nThey all look at Willow.\n\n<b>                         AIRK\n</b>          It's too much work.\n\n<b>                        WARRIOR\n</b>          It can't be done.\n\n<b>                        SORSHA\n</b>          Kael will never fall for it.\n\nWillow looks hopefully at Madmartigan.\n\n<b>                      MADMARTIGAN\n</b>                      (doubtful)\n          I don't know, Willow.\n\n<b>                        WILLOW\n</b>          Madmartigan, you promised me you'd\n          take care of Elora Danan like your\n          own daughter.  She is all that\n          matters.  Are you going to abandon\n          her?\n\nMadmartigan turns away and scratches his beard.\n\n<b>                         AIRK\n</b>          Come on, Madmartigan.  you gonna\n          listen to a Peck?  You and I are\n          warriors.  You know this plan will\n          never work.\n\nFrustrated and torn, Madmartigan brushes Airk away.\nThe men rally with Airk.  Mdmartigan goes over to Sor-\nsha.\n\n<b>                      MADMARTIGAN\n</b>          We'll probably die here, Sorsha.\n\n<b>                        SORSHA\n</b>          I have no family.\n\nThe gong rings four time.  Raziel turns to Airk\nand his men.\n\n<b>                        RAZIEL\n</b>          If we do not fight, and the baby\n          dies, all hope for the future is\n          lost.  I shall face the danger\n          alone if I have to.\n\nThe men shake their heads.\n\n<b>                        WILLOW\n</b>          Me, too.\n\nMadmartigan, still torn by indecision, raises his arm\nand silences the protest.\n\n<b>                      MADMARTIGAN\n</b>          Time is running out.  We must now\n          decide who's going to leave and who\n          is going to stay...\n\n<b>EXT. NOCKMAAR CASTLE - NIGHT\n</b>\nLight pulsates in the Queen's Tower.\n\n<b>INT. QUEEN'S TOWER - NIGHT\n</b>\nThe druids cower behind Bavmorda, whose face has taken\non the hideous features of a hellish beast.  The baby\nhas been streaked with ritual paint.\n\n<b>                       BAVMORDA\n</b>          Ocht veth nockkthirth bordak!\n\nHer voice growls a sickening chant, and light shoots\nout of her claw-liek fingers, enveloping the baby.  The\nbaby levitates above the altar in a cocoon of light.\n\n<b>EXT. NOCKMAAR CASTLE - DAWN\n</b>\nThe sun rises over the volcanic mountain.  The gong\nstrikes twelve times.  PAN ACROSS the slope outside the\ncastle.  The Tir Asleen army is gone.  Littered across\nthe ground are flattened tents, borken wagons an dis-\ncarded shields.  The wind howls, taking bits of debris\nwith it.\n\nAlone on the deserted mounatinside stand Willow and Rz-\nziel.\n\n<b>                        RAZIEL\n</b>          Time is running out.\n\n<b>                        WILLOW\n</b>          Surrender!!\n\nNockmaar soldiers peer down and laugh.  Willow and Ra-\nziel trek closer to the castle wall.  Willow cups his\nmouth.\n\n<b>                        WILLOW\n</b>          We are all-powerful magicians!\n          Give us the baby or we will destroy\n          you!!\n\nThe Nockmaar soldiers roar with laughter.\n\n<b>                         KAEL\n</b>          Kill them!\n\nThe great drawbridge falls across the moat.  Willow\nclutches a spear and trembles nervously.\n\n<b>                        RAZIEL\n</b>          Patience, Willow.\n\n<b>                        WILLOW\n</b>          Courage, Willow.\n\nHoofbeats.  EIGHT HORSEMEN ride out of the castle with\nswords high.  Willow lifts his spear with two hands.\nTurns.  And smashes the spear on the ground, striking a\nloud war drum!\n\nSuddenly Madmartigan leaps out of the ground on horse-\nback!\n\nAnd the entire mountainside comes to life.  Tents and\nshields fly away and out of pits and trenches the Tir\nAsleen army charges with one loud warcry!\n\nThe eight Nockmaar horsemen are quickly cut down.  The\nrebels storm across the drawbridge into the castle.\nAirk Thaughbaer scoops Willow up on his horse, and Sor-\nsha scoops Raziel up on hers.\n\n<b>INT. NOCKMAAR COURTYARD - CONTINUOUS\n</b>\nMadmartigan leads the assault, cutting down Nockmaar\nminions as they run out to defend the fortress.  Sorsha\nslides off her horse with Raziel.  Airk sets Willow\ndown.  Sorsha leads Willow and Raziel into a dark hall-\nway.\n\nRebel warriors storm into the courtyard.  Madmartigan\ncircles behind Airk, their horses dancing handsomely.\n\n<b>                         AIRK\n</b>          Let's squah 'em!\n\nIn unison, their swords flash and they charge across\nthe courtyard chopping down the enemy.\n\n<b>ENT CASTLE HALLWAY - DAY\n</b>\nSorsha hurries Willow and Raziel down a dark hallway.\nThey come to a corner.\n\n<b>                        SORSHA\n</b>          No, Willow!!\n\nShe grabs him by the collar and yanks him back.  A huge\nDEATH DOG leaps out wiht a gnashing ROAR and Sorsha\nkills it with her sword.  Willow sags with relief and\nthe women grab his hands and haul him further down the\ntunnel.\n\n<b>INT. TOWER STAIRWAY - DAY\n</b>\nThey come to the gloomy stairs that corkscrew up into\nthe Queen's Tower.  Willow climbs nervously behind Ra-\nziel and Sorsha.  At the top in THE DOOR.  Light throbs\nbehind it.\n\nSuddenly they hear a loud SHRIEK and the door shakes\nand bangs.  Willow fals to his knees, frozen with\nfear.\n\n<b>                        SORSHA\n</b>          I will face my mother alone.\n\nWillow and Raziel stay back on the stairs.  Sorsha\nclimbs to the door.  Courageously, she opens it.\n\n<b>INT. QUEEN'S TOWER - DAY\n</b>\nBavmorda's monstrous face FILLS THE SCREEN.\n\n<b>                       BAVMORDA\n</b>          Sorsha!!\n\nSorsha recoils in horror.  Bavmorda looks barely human:\nshe has transformed into a grotesque witch.  She waves\nher gnarled hand and her druids attack Sorsha.  Sorsha\nkills them.  The baby lies under a deathlike spell on\nthe copper altar.\n\n<b>                        SORSHA\n</b>          I won't let you kill her!\n\nBavmorda's voice is a demonic growl!\n\n<b>                       BAVMORDA\n</b>          You are a weakling.  Like you fa-\n          ther!  Can you not see that I am\n          about to become all-powerful!\n\nLightning explodes overhead.  Sorsha lunges for the\nbaby.  But Bavmorda stops her with a powerful energy\nforce.\n\n<b>                        SORSHA\n</b>          No!!\n\nPulsating light lifts Sorsha, levitates her across the\nroom, and drives her toward a wall of spikes.  Just as\nshe is about to be implaes, another force stops her.\nBavmorda can sense the source of it:\n\n<b>                       BAVMORDA\n</b>          Raziel...!!\n\nThe door flies open.  The twelve burning candles all\nblow out.  There stands Raziel.  Sorsha falls to the\nfloor, unconscious.  Raziel raises her arms magnifi-\ncently.  The sorceresses face each other.\n\n<b>INT. CASTLE COURTYARD - DAY\n</b>\nBattle rages.  Madmartigan and Airk lead the assault,\nand the Tir Asleen rebels push back the Nockmaar min-\nions.  Down low, where weapons adn bodies fall and\nhorses clop and stamp, the brownies scurry along in\nterror, arms crossed over their heads, looking for\nshelter.\n\nLike mice, they dart up some stairs.  Then a huge boot\nnearly crushes them.  The dive away and look up.\nTowering high above them, Kael lets out a loud warcry.\nAnd brandishes two weapons, a huge sword and a huge\naxe.\n\nMadmartigan and Airk turn and see Kael.  They look at\neach other.  Like samurai warriors they stand ready.\nKael ralles his weapons and charges toward them.\n\n<b>INT. TOWER STAIRWAY - DAY\n</b>\nWillow creeps toward the door.  It suddenly throbs and\nflashes.  He jumps back.\n\n<b>INT. QUEEN'S TOWER - DAY\n</b>\nBavmorda and Raziel oppose each otehr, circling the al-\ntar.  The air between them crackles and sparks with the\nconcentration of energy between them.\n\n<b>                        RAZIEL\n</b>          The baby will be queen.  It has\n          been foretold, Bavmorda.\n\n<b>                       BAVMORDA\n</b>          My ritual will kill the prophecy!\n          Now the child dies with it, its en-\n          ergy exiled into oblivion!\n                  (lightning flashes)\n          You see?  I hold the power of the\n          universe!\n\n<b>                        RAZIEL\n</b>          Not until your ritual is complete!\n\n<b>                       BAVMORDA\n</b>          And who will stop me?  The elements\n          are slaves to my command!\n\nShe points at the sky.  As if oberying her, lightning\nflashes and thunder cracks.\n\n<b>                        RAZIEL\n</b>          There is no one who can match your\n          sorcery.  Except me!\n\nRaziel waves her arms and light suddenly swirls around\nthe room.  Bavmorda counters, and chairs come to life,\nturning into beasts.  Objects fly about.  The tower be-\ncomes a storm of chaos and witchcraft.\n\n<b>INT. CASTLE COURTYARD - DAY\n</b>\nKael swings his axe and sword at Airk and Madmartigan.\nHe roars at his army, and six Nockmaar swordsmen hurry\nover to fight with him.  Madmartigan and Airk split up.\nMadmartigan battles the six swordsmen.  Airk battles\nKael, who backs Airk up stairs on the castle wall.\n\nMadmartigan fights in the courtyard.  He hears a yell\nand looks up.  Kael strikes Airk down.\n\n<b>                      MADMARTIGAN\n</b>          Airk!!\n\nAirk falls down the stairs.  Madmartigan finishes off\nthe swordsmen, then runs to him, grabs his bleeding\nbody.\n\n<b>                      MADMARTIGAN\n</b>          Airk!  Airk!\n\n<b>                      MADMARTIGAN\n</b>          Madmartigan...you're a brave\n          warrior...a true friend...a good\n          man...\n\n<b>                      MADMARTIGAN\n</b>          We're gonna win this war, Airk.\n\nAn incredible smile lights up Airk's face as he dies.\nMadmartigan stands.  Picks up his sword.  And goes up\nthe stairs after Kael.\n\n<b>INT. QUEEN'S TOWER - DAY\n</b>\nThe sorceress continue their battle.  They change\neach other into various beasts.  They fight, physically\nand magically.\n\nIn the midst of chaos, the door opens.  Willow pokes in\nhis head, reacting in fear.  Then sneaks around the\nwall of the room and makes a dash for the baby.\n\n<b>                       BAVMORDA\n</b>          As above, so below!  Universe of\n          evil, Raziel!  It conquers even\n          you!\n\nBavmorda hurls a final spell at Raziel, crippling her,\nthrowing her into a corner.  Bavmorda laughs and goes\nto the altar.  The baby is gone.\n\nWillow races toward the door with the baby.  The door\nsuddenly slams shut.  Bavmorda's voice roars out:\n\n<b>                       BAVMORDA\n</b>          *Stop!  Bring back that child!!!*\n\nWillow stops.  He turns around.  Bavmorda towers over\nhim, grotesque, monstrous, poised to destroy Willow\nwith her magic.\n\n<b>                       BAVMORDA\n</b>          Who are you?\n\n<b>                        WILLOW\n</b>          I'm Willow Ufgood.  I'm a magician.\n\nBavmorda laughs.  Willopw slowly walks toward her.  he\ndigs into his pocket.  Takes out the last magic acorn.\n\n<b>                        WILLOW\n</b>          I'm a *great* magician.\n\nWillow throws the acorn at Bavmorda.  Her hand shoots\nout and catches it.  the acron begins to turn her to\nstone, petrifying her hand, her wrist, her arm.  Willow\nbacks away, feeling successful.  But with intense con-\ncentration of her evil will, Bavmorda fights off the\nacron's spell.  It reverses:  her arm, wrist and hand\nturn back to flesh.  She crushes the acorn in her\nfingers and lets the dust fall to the floor.\n\n<b>                       BAVMORDA\n</b>          Is that the extent of your power?\n\nWillow stands there helplessly.  Thunder cracks and\nlightning flashes through the open ceiling above the\naltar.\n\n<b>INT. CASTLE COURTYARD - DAY\n</b>\nThe Tir Asleen rebels, outnumbering and overpowering\nthe Nockmaar army, fight toward ultimate victory.\n\nMadmartigan battles Kael on the wall outside the\nQueen's Tower.  Up and up they go.  A spectacular\nswordfight.  Until finally, Madmartigan stabs Kael\nthrough the heart.  kael screeches and falls through\nthe air into the moat.\n\nMadmartigna hurries toward the top of the tower.\n\n<b>INT. QUEEN'S TOWER - DAY\n</b>\nBavmorda looks up at the sky then down at Willow.\n\n<b>                       BAVMORDA\n</b>          Place it on the altar.\n\n<b>                        WILLOW\n</b>          No.  You can't have her.\n\n<b>                       BAVMORDA\n</b>          By ritual, by sorcery, I well draw\n          the lightning and send this child\n          into the destructive realm.\n\nWillow straightens up, boldly, courageously.\n\n<b>                        WILLOW\n</b>          And with my magic I'll send her \n          into the...into the...\n\nHe gropes for a word.  Bavmorda laughs at him.\n\n<b>                       BAVMORDA\n</b>          You're no magician.\n\n<b>                        WILLOW\n</b>          Into the good.\n\nBavmorda instantly stops laughing.  her eyes flash.\n\n<b>                       BAVMORDA\n</b>          Even I don't have the power to do\n          that.  You're a fraud.\n\nWillow suddenly starts chanting, loudly and desperate-\nly.  Raziel opens her eyes and watches.  The chenting\nconfuses Bavmorda.  Then, Willow cleverly whips the\nbaby under his legs and behind his back and suddenly\nshe's gone!\n\n<b>                       BAVMORDA\n</b>          Impossible!  Bordak!  Bordak!\n\nBavmorda flies into a rage.  She lunges across the\ncopper altar.  Thunder and lightning!\n\n<b>                       BAVMORDA\n</b>          Aaaaahhhh!!!\n\nA bright fork of lightning, conjured by her own evil,\nshoots in through the ceiling and strikes her.  She\nhowls in pain.  Her body contorts then bursts into\nflame and burns into a shriveling pillar of ash.\n\nMadmartigan breaks open the door and stomrs in.  He\nscoops up Sorsha, reviving her with a kiss.\n\nAnd as if Bavmorda's death has ended evil and oppres-\nsion, Raziel stands up with renewed strength.\n\n<b>                        RAZIEL\n</b>          Willow...Willow...how...how did you\n          do that?\n\nWillow bends down under a nearby chair and picks up the\nsleeping baby.\n\n<b>                        WILLOW\n</b>          It was just the old disappearing\n          pig trick.\n\nElora Danan's eyes open.  And sunlight floods into the\ntower.\n\n<b>EXT. TIR ASLEEN - DAY\n</b>\nFlags fly hihg above the wondrous caslte.  The valley\nis lush with flowers, and the kingdom is once abain\nalive with happy activity.\n\nAt the door of the castle, Willow stnds beside a cute\nlittle white pony.  The court of Tir Asleen has gath-\nered to see him off.  Madmartigan, in robes and armor\nworthy of a king, stands proudly beside his queen, Sor-\nsha, who holds the baby princess, Elora Danan.\n\nA trumpet blares.  Raziel comes forward from inside the\ncastle, dressed in druid robes, carrying a sacred BOOK.\n\n<b>                        RAZIEL\n</b>          Willow Ufgood.  Take this Book of\n          Sorcery.  You are on your way to\n          becoming a great magician.\n\nWillow accepts the book.  Everyone applauds.  Willow\nsmiles gratefully and humbly.  He glances down and no-\ntices Rool and Teemo, who have been civilized to a de-\ngree with page boy uniforms, fuzzy haircuts, and nifty\nlittle swords.\n\nMadmartigan and Sorsha come forward, with Elora Danan.\n\n<b>                        WILLOW\n</b>          Your dream has come true, madmarti-\n          gan.\n\nMadmartigan smiles with thanks.\n\n<b>                      MADMARTIGAN\n</b>          Goodbye, Peck.\n\nWillow has one last look at the baby.  She smiles and\ngiggles at him.  He happily gives her a kiss.\n\n<b>                        WILLOW\n</b>          Farewell, Elora Danan.\n\nSuddenly Willow flies up in the air.  Madmartigan lifts\nhim onto the pony's back.  Willow and Madmartigan shake\nhands warmly.  And Willow rides across the valley of\nflowers, everybody waving goodbye to him.\n\n<b>EXT. NELWYN VILLAGE - DAY\n</b>\nMusicians stike up a welcoming march.  Willow rides\nthorugh his village on his little pony, proudly carry-\ning the sacred book.  The Nelwyn people swarm around\nhim, wild with excitement and celebration.  Meegosh\nruns up, deliriously happy.\n\nThe High Aldwin comes forward, beaming with pride, and\nhonors Willow with a nod of approval.  Willow presents\nhim with the book.  Old Burglekutt peers out.  His\nmouth drops open and he shrinks away from the crowd.\n\n<b>                         KIAYA\n</b>          Willow!!\n\nWillow stands up in his stirrups.  He sees Kiaya fight-\ning her way through the crowd to reach him.\n\n<b>                        WILLOW\n</b>          Kiaya!!\n\nHe jumps off his pony and runs to her.  They collide,\nkiss and embrace.  Then Ranon and Mims jump on their\nfather and hug him.  Family and friends smother their\nhomecoming hero with love!\n\n\n<b>                       *THE END*\n</b>\n\n\n\n</pre>\n</pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>Willow</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=George Lucas\" title=\"Scripts by George Lucas\">George Lucas</a>  <a href=\"/writer.php?w=Bob Dolman\" title=\"Scripts by Bob Dolman\">Bob Dolman</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Action\" title=\"Action Scripts\">Action</a>  <a href=\"/genre/Adventure\" title=\"Adventure Scripts\">Adventure</a>  <a href=\"/genre/Comedy\" title=\"Comedy Scripts\">Comedy</a>  <a href=\"/genre/Fantasy\" title=\"Fantasy Scripts\">Fantasy</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/Willow Script.html#comments\" title=\"Willow comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:20:30.393936"}