{"title": "World is not Enough, The", "film_link": "/Movie Scripts/World is not Enough, The Script.html", "script_link": "/scripts/World-is-not-Enough,-The.html", "info_raw": "\n\nWorld is not Enough, The Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Neal Purvis  Robert Wade  Bruce Feirstein  Ian Fleming\nGenres  Action  Thriller  Adventure\nScript Date :  1999\n\nRead \"World is not Enough, The\" Script\n\n\n", "script": "\n\t\t\n\n       T H E   W O R L D   I S   N O T   E N O U G H\n\n       (BOND 19)\n\n       --------------------------------------------------------------\n\n       GUN BARREL LOGO OPENS ON\n\n       GENEVA SWITZERLAND, an unnaturally clean city that melds old\n       Europe with new money of both dubious and legitimate source.\n\n       INT. HALLWAY OFFICE BUILDING - DAY\n\n       An engraved brass plaque announcing the name of the \"private\n       banking institute\" within.\n\n       INT. PENTHOUSE BANK OFFICE - GENEVA - DAY\n\n       JAMES BOND, dressed impeccably as ever, is being FRISKED by\n       three THUGS in Armani suits.  They remove A GUN from inside\n       his jacket, a well-concealed knife, a metal case, laying them\n       on the desk that separates Bond and...\n\n       LACHAISE...an extremely well-groomed gentleman. Behind him,\n       three floor-to-ceiling windows lead out to a rooftop garden.\n\n                           LACHAISE\n                 Not the usual Swiss procedure, Mr. Bond,\n                 but you understand, a man in my\n                 position..\n\n                           BOND\n                 Which is neutral, no doubt.\n\n       Lachaise takes the joke a little tight-lipped.  Gestures for\n       Bond to sit.\n\n       A GIRL ENTERS, a gorgeous Swiss bombshell in a pin-striped\n       suit.  She pushes a cart. On it are a BRIEFCASE and a box of\n       EXPENSIVE CIGARS, which she offers to Lachaise and Bond.\n\n                           LACHAISE\n                 It wasn't easy, but I retrieved the\n                 money.  No doubt Sir Robert will be\n                 pleased to see it again.\n\n       The efficient Cigar Girl brings the briefcase to Bond,\n       setting it in his lap and opening it up...inside is a good\n       deal of CASH in pound sterling.\n\n                           LACHAISE\n                 In the current exchange rate, minus the\n                 fees, of course, and certain\n                 unforeseeable expenses. Here is the\n                 receipt...\n\n       The CIGAR GIRL offers Bond a RECEIPT...\n\n                           CIGAR GIRL\n                 Would you like to check my figures?\n\n                           BOND\n                 Perhaps later.\n\n       She steps back. Bond reaches for the metal case on the\n       desk...the THUGS TENSE...\n\n                           BOND\n                 My glasses.\n\n       Lachaise nods.  Bond can have his glasses.\n\n       He puts them on, gives a cursory look at the receipt...an odd\n       number in pound sterling, calculated down to the penny:\n\n       3,030,303.03.\n\n                           LACHAISE\n                 It's all there.\n\n       Bond folds the receipt, slips it into his WALLET...then, he\n       removes the glasses, slowly, deliberately, eyeing Lachaise.\n\n                           BOND\n                 I didn't come for the money. The report\n                 you sold him was stolen from an MI-6\n                 agent, who was killed for it.\n\n       He takes a photo from his jacket and lays it on the desk.\n\n                           LACHAISE\n                 I did not get the report from an MI-6\n                 agent.\n\n                           BOND\n                 Who did you get it from?\n\n                           LACHAISE\n                 I am just a middle man. I am doing the\n                 honourable thing and returning the money\n                 to its rightful owner...\n\n                           BOND\n                 And we know how difficult that can be for\n                 the Swiss.\n\n                           LACHAISE\n                     (controlled fury)\n                 Your last chance. Take the money.\n\n                           BOND\n                 Your last chance. Give me the name.\n\n                           LACHAISE\n                 Stripped of all your weaponry, you still\n                 threaten me?\n\n       He nods.  An Armani thug steps up and takes out a gun...\n\n                           BOND\n                 Perhaps you failed to take into account\n                 my...hidden assets.\n\n       Bond's mouth edges into a smile.  A flicker of doubt on\n       Lachaise's face -- as Bond's finger finds a protrusion on the\n       tiny arm of his glasses and...\n\n       KABOOM!  The pistol on the table FLASHES...blinding those\n       around, they cover their eyes, stagger back...it is a brief\n       effect, just enough to disorient the thugs and give Bond his\n       opening...\n\n       He KARATE-CHOPS HENCHMAN #1 unconscious, taking his gun.\n       Kicks HENCHMEN #2 in the face and throws #3 OUT THE WINDOW\n       just as they're getting their bearings.  Now he nestles the\n       barrel of his borrowed hand gun into the hollow of Lachaise's\n       cheek.\n\n                           BOND\n                 The name?\n\n                           LACHAISE\n                 I can't tell you...\n                     (Bond cocks the gun)\n                 Alright, alright! But you must protect\n                 me!\n\n       And he freezes.  The handle of a THROWING KNIFE is sticking\n       out of his neck.  Bond looks up, catches sight of the CIGAR\n       GIRL as she vaults out the broken window and onto THE ROOF.\n\n       Bond rushes to the window...\n\n       EXT. VERANDAH - ROOFS - GENEVA - DAY\n\n       She swings on a WIRE across to another roof, quickly\n       disappearing into shadows.\n\n       Bond can hear sirens approaching. He returns to...\n\n       THE OFFICE...he grabs the money and moves fast for the door,\n       casually slipping that cigar into his pocket...\n\n       Except Henchman #1 has recovered, blocks his way, gun in\n       hand.  He starts to squeeze the trigger -- when a RED DOT\n       appears on his chest...another window SHATTERS as a bullet\n       zings through and pierces the henchman in the heart.\n\n       Bond looks back once at the shattered window, then heads out.\n\n       INT. BANK - GENEVA - DAY\n\n       Bond appears on the top floor of the grand old building, by\n       the elevator.  Looks over the balcony, sees figures on the\n       stairs.  Hears the elevator cage start from below.\n\n       Thinking fast, he wrenches open the steel gate, leans into\n       the lift shaft, watches the elevator COUNTERWEIGHT as it\n       comes down.  Almost nonchalant, he steps out...\n\n       INT. STAIRWELL/ELEVATOR SHAFT - DAY\n\n       As the cageful of police rises, Bond is now standing on the\n       counterweight, DESCENDING.\n\n       EXT. STREET - GENEVA\n\n       Lunchtime.  Faceless business crowds heading for their brief\n       moment of freedom, among them we spot BOND...one of them,\n       with a briefcase and a suit and tie...HOLD on his face,\n       troubled.\n\n       INT. HOTEL - GENEVA - DAY\n\n       The Cigar Girl enters a huge, high-ceilinged room. Edgy, she\n       approaches a BIG MAN standing on a balcony overlooking the\n       city.  Propped against the doorframe, an assassin's RIFLE\n       with LASER-SIGHT attached. BINOCULARS are on a tripod,\n       trained on the rooftop below where we can see cops examining\n       the shattered office windows.\n\n       The man turns. Powerful, deadly, with a military haircut.\n       There is a raised, red scar of an ENTRY WOUND at his temple.\n       It throbs and shifts with the slightest facial expression,\n       like an insect living just beneath his skin. One EYE seems\n       slightly drooping, deadened. The other eye is sharp and black\n       as anthracite.  It is a frightening face. This is RENARD.\n\n                           RENARD\n                 What's his name? Our friend from MI-6?\n\n                           CIGAR GIRL\n                 James Bond.\n\n                           RENARD\n                 One of M's more accomplished tin\n                 soldiers.\n\n                           CIGAR GIRL\n                 He could identify me.\n\n                           RENARD\n                 If it concerns you...kill him.\n\n       He touches her cheek and moves into the room, pouring two\n       glasses of wine.\n\n                           RENARD\n                 Let's toast this James Bond.  We're in\n                 his hands now...\n\n                                                            CUT TO:\n\n       EXT. RIVER THAMES - LONDON - DAY\n\n       A SEAPLANE swoops over the Millennium Dome, banks along the\n       snaking river.\n\n       EXT. MI-6 - LONDON - DAY\n\n       Tate Gallery in background, the seaplane moors beneath the\n       vast stepped cake that is MI-6.  Bond exits with the\n       suitcase.\n\n       INT. SECURITY, MI-6 - DAY\n\n       CAMERA MOVES with Bond as he enters this secret, hi-tech\n       world.  He passes through countless security procedures,\n       watched by an attentive staff.\n\n       Bond scoops the money out of the suitcase.  Three million\n       sterling in tightly bundled hundreds makes quite a sight.  He\n       flicks his finger through the last wad, tosses it down\n       wistfully.  A blue light scans it on three axis.\n\n       The money is bundled into a clear plastic bag, put on a tray\n       and wheeled through a series of barred enclosures into the\n       SECURE ROOM.  Bond hands the suitcase to a STAFF MEMBER.\n\n                           BOND\n                 Have this checked, see what you can get\n                 off it.\n\n       INT. MONEYPENNY'S OFFICE, MI-6 - DAY\n\n       Bond appears, hiding something behind his back.  Moneypenny\n       brightens.\n\n                           MONEYPENNY\n                 James.  Brought me a souvenir from\n                 Geneva?\n\n       He produces the cigar, now in a large phallic TUBE.  Stands\n       it end up on the desk.\n\n                           BOND\n                 Thought you might want one of these.\n\n                           MONEYPENNY\n                     (beat, deadpan)\n                 I gave up a long time ago.\n                     (nods to M's door)\n                 She's in with Sir Robert.\n\n       INT. M'S OFFICE, MI-6 - DAY\n\n       Bond enters.  SIR ROBERT KING is perched on the edge of M's\n       desk.  Two glasses, a bottle of scotch open.\n\n                           M\n                 Sir Robert King, James Bond.\n\n       King moves toward Bond with an easy, patrician smile. Bond\n       notes a TINY BADGE in his lapel -- like the glass eye of a\n       stuffed snake.\n\n                           SIR ROBERT\n                 Thanks for getting my money back --never\n                 expected to see it again.  You're the\n                 kind of man I could use.  Though I won't\n                 offend certain parties by asking you to\n                 join King Industries.\n\n       King looks to M, smiling.\n\n                           BOND\n                 Construction's not exactly my line.\n\n                           M\n                 Quite the opposite, in fact.\n\n       She couldn't resist. King smiles at Bond.  As he goes, he\n       gives M a respectful kiss on the cheek. The door closes.  M\n       turns.\n\n                           BOND\n                 Old friend?\n\n                           M\n                 Since Oxford. I knew him when he had\n                 nothing but a brilliant mind and enough\n                 guts to conquer the world. He's a man of\n                 great integrity.\n\n                           BOND\n                 Who buys classified reports for three\n                 million pounds.\n\n       M picks up the report from her desk.  Bond notices it is in\n       Russian, with a SEAL from a Russian military agency in the\n       corner: MIRATOM.\n\n                           M\n                 It's a report on weapons security in the\n                 former Soviet Union, which, as you know,\n                 is shaky at best.  He's had several\n                 instances of sabotage at the pipeline,\n                 and he's understandably concerned. He\n                 called me the moment he realized its\n                 sensitive nature.\n\n       She pours a scotch for Bond.  He drops some ice in,\n       thoughtful.\n\n                           BOND\n                 Someone was watching over me in Geneva.\n                 A guardian angel with a laser sight.\n\n       He stops, rubs his thumb and forefinger together -- a strange\n       SIZZLING where he touched the ice.  Realization sinks in.\n\n                           BOND\n                 King.\n\n       M sees the seriousness in his eyes -- stabs at the intercom:\n\n       INT. MONEYPENNY'S OFFICE, MI-6 - CONTINUOUS\n\n       Moneypenny's eyes shoot to the intercom console:\n\n                           M\n                     (filtered)\n                 Moneypenny, stop King leaving.\n\n                           MONEYPENNY\n                     (flicking switch)\n                 Security --\n\n       INT. CORRIDORS, MI-6 - CONTINUOUS\n\n       Sir Robert King and an MI-6 AIDE walk toward SECURITY.\n\n       INT. Q DIVISION, MI-6 - CONTINUOUS\n\n       Q and his men are working on a strange half-built BOAT\n       suspended over a water tank.\n\n                           Q\n                 ..the hydro boat can operate in three\n                 inches of water...\n\n       He looks up as Bond runs through...\n\n       INT. SECURITY, MI-6 - CONTINUOUS\n\n       THE MONEY lies on the tray, wrapped in plastic.\n\n       Sir Robert approaches, two rows of security bars between him\n       and the cash.  An official produces a bag and moves toward\n       it:\n\n                           SIR ROBERT\n                 Thanks, but I'll count it myself.\n                     (apologetic, smiles)\n                 Lifetime habit.  I'm Scottish.\n\n       INT. LOWER CORRIDORS/SECURITY AREA, MI-6 - CONTINUOUS\n\n       Bond shoots around the corner just in time to see Sir Robert\n       disappearing past the THICK STEEL DOOR of the secure room.\n\n                           BOND\n                 Stop!  King!\n\n       INT. SECURITY, MI-6 - CONTINUOUS\n\n       The shout is muffled, Sir Robert's more interested in the\n       money.\n\n       He continues toward camera, that PIN on his lapel emits a\n       serene HUM and we\n\n                                                            CUT TO:\n\n       CLOSE ON THE METAL STRIP IN ONE NOTE AS IT CRACKLES AND --\n       KABOOM!  A MASSIVE EXPLOSION.\n\n       INT. LOWER CORRIDORS/SECURITY AREA, MI-6 - CONTINUOUS\n\n       MAYHEM.  FIRE blasts out of the open doorway just as Bond\n       reaches it.  The STEEL DOOR flies toward him.  He dives --\n\n       EXT. MI-6/RIVER - CONTINUOUS\n\n       The building rocks.  SMOKE is pouring from a HOLE that's\n       appeared in a lower tier. A wall and a section of roof gone.\n\n       EXT. MI-6/RIVER - CONTINUOUS\n\n       A figure staggers out, shaken.  Catching his breath.  BOND.\n\n                                                            CUT TO:\n\n       ECU CIGAR GIRL\n\n       Lining up Bond with her infra-red telescopic sight.\n\n       ANGLE ON BOND\n\n       In the swirling dust and smoke, he suddenly sees a wand of\n       red light, pointing at his chest.\n\n       All instinct, he dives for cover.  Powerful, high velocity\n       bullet hits blanket the area.  Bond prepares to return fire,\n       scanning around for the source. Through the debris he spots\n       an unusual, hi-tech BOAT on the river -- long and narrow and\n       low.  A figure on board.  THE CIGAR GIRL.\n\n       ANGLE ON CIGAR GIRL\n\n       She FIRES OFF A ROUND OF SHOTS, forcing Bond back into cover.\n       Then she guns the engines and SPEEDS OFF down the Thames.\n\n       EXT. MI-6 - CONTINUOUS\n\n       Determined, Bond races back into the wreckage...\n\n       INT. MI-6 - CONTINUOUS\n\n       Bond races through the chaos that is MI-6 and into...\n\n       Q DIVISION\n\n       Where he leaps into the prototype BOAT.  Q protests...\n\n                           Q\n                 It's not finished!\n\n       Bond looks at the mystifying number of buttons and gadgets\n       ...presses something red and...THE BOAT LEAPS OUT, ENGINE\n       ROARING...\n\n       EXT. SLIPWAY - RIVER - DAY\n\n       THE 007 THEME KICKS IN AS:\n\n       JAMES BOND, in the Q boat, SHOOTS OUT of the MI-6 rubble and\n       onto the Thames.\n\n       EXT. RIVER THAMES - DAY\n\n       Bond can see the Cigar Girl up ahead...he is closing the\n       distance.  She catches sight of him in pursuit...\n\n       EXT. CIGAR GIRL - BOAT - DAY\n\n       She pushes the boat to its limit, it roars to a new level of\n       speed...the chase is on.\n\n       EXT. THAMES - DAY\n\n       Police speedboats, alerted by the commotion, trail Bond.\n\n       ON THE EMBANKMENT\n\n       Police cars scream alongside, sirens wailing.\n\n       ON THE THAMES\n\n       Bond is losing ground as he and the Cigar Girl weave through\n       traffic on the Thames. In a gutsy bid to keep pace, he\n       corrals the Q boat into a hair-raising SHORT-CUT, shooting\n       off...\n\n       UNDERNEATH A PIER\n\n       He maneuvers the boat under the low pier and emerges EVEN\n       CLOSER to his prey...\n\n       EXT. CIGAR GIRL - BOAT - DAY\n\n       The Cigar Girl stops her boat, moving to the back, manning\n       her large, rear-mountain MACHINE GUN and taking aim at\n       Bond...\n\n       EXT. RIVER THAMES - DAY\n\n       Bond continues at full speed, fearless in the hail of bullets\n       ricocheting off the vessel.\n\n       THE CIGAR GIRL Remains calm and cool, shooting with\n       precision.\n\n       BOND closes in...\n\n       CIGAR GIRL'S eyes widen as...\n\n       BOND STEERS HIS BOAT RIGHT OVER THE MACHINE GUN AND TURRET...\n\n       Cigar Girl dives out of the way, as her boat becomes a RAMP,\n       LAUNCHING the Q boat INTO THE AIR before it dives, nose-\n       first, into the Thames.\n\n       EXT. - CIGAR GIRL BOAT - CONTINUOUS\n\n       CIGAR GIRL gets up from the deck and sees BOND, turning his\n       boat to close in for the kill...\n\n       She scrambles to the helm and SPEEDS OFF, seeing ahead of\n       her...\n\n       TOWER BRIDGE\n\n       Just beginning to open, to allow for passage of a small\n       tanker.\n\n       EXT. CIGAR GIRL BOAT\n\n       She streaks toward the bridge, Bond lagging behind...\n\n       ON BOND\n\n       As he looses her boat in the distance, he makes a DESPERATE\n       MOVE...he cranks the wheel of his boat and veers off, UP A\n       SLIPWAY and into...\n\n       EXT. FISH MARKET\n\n       Where the boat hydroplanes on masses of surface water and\n       propels him into\n\n       EXT. LONDON STREET\n\n       The hurtling boat causes mayhem and panic as he wrestles with\n       the controls, jetting off the street and straight toward...\n\n       EXT. RIVERSIDE RESTAURANT\n\n       Bond's boat crashes right through it, sending diners LEAPING\n       in every direction. The Q boat SHOOTS OUT over the balcony\n       and splashes down once more into...\n\n       EXT. THAMES - DAY\n\n       Cigar Girl is now clearly in his sights.  She is amazed to\n       see that Bond has managed to overtake her.\n\n       The racing boats dice through an armada of lazy, over-loaded\n       BARGES, nearly crashing into the much larger vessels.\n\n       AT EVEN PACE NOW...Cigar Girl attempts to force her way past\n       him, but Bond, punching buttons on the console of the Q-boat,\n       releases a set of catapulting FLAME CANNISTERS which create a\n       massive WALL OF FIRE ahead of them...\n\n       CIGAR GIRL is forced toward the very edge of the river...the\n       jig is almost up, and then...\n\n       HER P.O.V.  She spots the launching of a HOT AIR BALLOON from\n       the base of the massive MILLENNIUM DOME.\n\n       She skids her vessel to a stop at a nearby pier and quickly\n       scrambles out of her boat.\n\n       EXT. MILLENNIUM DOME - DAY\n\n       ...A crowd around a RICHARD BRANSON-like figure about to\n       climb into his HOT AIR BALLOON.\n\n       The Cigar Girl, brandishing her gun, forces her way through\n       the crowd and LEAPS INTO THE BALLOON CARRIAGE, just ready to\n       lift off.  She cranks open the gas nozzles and the balloon\n       rises with surprising speed.\n\n       EXT. BOND'S BOAT - DAY\n\n       Bond steers his craft toward a slipway adjacent to the pier\n       and SHOOTS UP INTO THE AIR...\n\n       EXT. MILLENNIUM DOME\n\n       An amazing sight...Bond's boat sailing through the air just\n       beneath the balloon.  With split second precision he reaches\n       up and GRABS ONE OF THE ROPES dangling down from the balloon.\n\n       Bond finds himself being CARRIED THROUGH THE AIR as his boat\n       falls away from him, hitting the ground and ERUPTING into a\n       ball of flame.\n\n       EXT. HOT AIR BALLOON - CONTINUOUS\n\n       As Bond is carried higher and higher, the Cigar Girl begins\n       FIRING AT HIM over the edge of the carriage.\n\n       Bond, with ONE HAND, returns fire.\n\n       CIGAR GIRL then leans over the edge of the carriage and\n       begins to SLICE THE ROPE that Bond is hanging from.\n\n       The fibers split and fray away from each other as...\n\n       BOND FALLS, heading straight toward...\n\n       THE MILLENNIUM DOME, which the balloon has drifted over.\n\n       AS HE PLUMMETS DOWNWARD...Bond, never surrendering, still\n       FIRES HIS WEAPON up at the balloon. A bullet hits the gas\n       tank...\n\n       EXT. BALLOON - DAY\n\n       The BALLOON EXPLODES IN A MASSIVE FIREBALL taking the Cigar\n       Girl with it...\n\n       EXT. MILLENNIUM DOME - DAY\n\n       Bond lands with a spectacular thudding bounce, the roof of\n       the Millennium Dome breaking his fall.\n\n       EXT. MILLENNIUM DOME ROOF - DAY\n\n       He slides uncontrollably down the slope of the Dome as scraps\n       of burning balloon rain down all around, before he FALLS OFF\n       THE EDGE of the Dome and lands with a THUD ON...\n\n       THE GROUND BELOW\n\n       He struggles up, wincing in SEARING PAIN as his hand goes to\n       his INJURED SHOULDER. He hold it, and looks up, into the sky\n       as we zero in on the iris of...\n\n       HIS EYE\n\n       reflecting the massive smoke cloud from the explosion as the\n       screen transforms into...\n\n       THE MAIN TITLES\n\n                                                            CUT TO:\n\n       EXT. COUNTRY ESTATE, LOCH LOMOND - DAY\n\n       BAGPIPES.  A chapel atop a green slope overlooking the waters\n       of Loch Lomond.\n\n       A long line of mourners files out at the end of a memorial\n       service.  They mill about on the lawn, among them,  M, grim-\n       faced, BILL TANNER, CHIEF OF STAFF and JAMES BOND, his arm in\n       a black sling.\n\n       Bond, ever vigilant, scans the crowd...\n\n       HIS P.O.V.  It's like a state funeral.  Rich and powerful\n       people, government ministers, chief executives from around\n       the world...and then...\n\n       FAR OFF, on a DISTANT RISE, he sees a BIG MAN, not one of the\n       mourners but an isolated observer, standing alone, wearing\n       sunglasses and a military haircut.\n\n       The man seems to see Bond looking at him...\n\n                           M\n                 Bond, we'll meet you inside.\n\n       Bond looks at her for a brief second...when he turns back,\n       the man is gone, like an APPARITION.\n\n       Bond walks off, up the grassy slope, toward the rise.\n\n                                                            CUT TO:\n\n       THE VIEW ACROSS THE VALLEY\n\n       Bond stands on the hill, looking below.  He sees nothing but\n       a green carpet, not a tree to hide behind.\n\n       He hears a crunch of leaves...turns...\n\n       HIS P.O.V.  A WOMAN, in mourning black, coming up the hill.\n       Her china doll face is both fragile and proud.\n\n                           WOMAN\n                 Beautiful, isn't it?\n\n                           BOND\n                 Yes.\n\n       She steps up to the ridge with him.  A breeze blows her hair.\n       They stare out. The sun's rays have broken the clouds and\n       strafe the valley.\n\n                           WOMAN\n                 Today, of all days, the sun decides to\n                 shine.\n\n                           BOND\n                 Perhaps Sir Robert had a word with the\n                 Man Upstairs.\n\n                           WOMAN\n                 A word? I'm sure by now he's engineered a\n                 hostile takeover.\n\n                           BOND\n                 You knew him well?\n\n       The sun glints off her bejewelled earlobe.\n\n                           WOMAN\n                 He was my father.\n\n                           BOND\n                 I'm sorry.\n\n                           WOMAN\n                 He died before he could complete his\n                 lifelong dream.\n                     (beat)\n                 I intend to finish it for him.\n\n       A voice interrupts them, calling from the estate...\n\n                           OLDER MAN\n                 Elektra!\n\n                           ELEKTRA\n                 Excuse me.\n\n       She walks away, the wind pressing her dress against her\n       delicate figure.  She looks brave and vulnerable as she walks\n       back toward her father's grand house.\n\n                                                            CUT TO:\n\n       INT. LIMOUSINE - TRAVELING - DAY\n\n       M, Bond and Tanner in the rear of a limousine. The vehicle\n       swoops through the epic countryside of the Scottish\n       Highlands.\n\n                           M\n                 Elektra?  Running King Industries?\n                     (she broods)\n                 I've known that girl all her life. I'm\n                 not sure she knows what she's walking\n                 into.\n\n                           BOND\n                 She's not a girl anymore.\n\n       M looks at Bond. Eyes his sling.\n\n                           M\n                 I've scheduled a medical for you.\n\n                           BOND\n                 It's barely a scratch. The Dome broke my\n                 fall.\n\n                           M\n                 Well, at least it turned out to have some\n                 purpose.\n\n       Bond gives her a look.\n\n                           M\n                 No-one goes into the field on this unless\n                 they're 100%.  Dr. Greatrex is waiting.\n\n       EXT. CASTLE THANE - HIGHLANDS - DAY\n\n       The limousine swoops under the portcullis, into a courtyard.\n\n       ADJUST ANGLE to reveal huge antennae and satellite dishes\n       within.\n\n       SUPER:  MI-6 REMOTE OPERATIONS CENTRE, SCOTLAND\n\n       EXT. CORRIDOR - CASTLE THANE - CONTINUOUS\n\n       Bond walks through the corridors.  Just before he enters the\n       medical room, he removes his sling and casually drapes it on\n       a suit of armor.\n\n       INT. MEDICAL ROOM - CASTLE THANE - DAY\n\n       Bond sits on the couch, shirt off, awaits the results of his\n       medical.\n\n       The very attractive DOCTOR GREATREX looks at her notes.\n\n                           DOCTOR GREATREX\n                 Dislocated collar bone.  If any more\n                 tendons snap...\n                     (looks up)\n                 It won't just be two weeks out of action.\n\n                           BOND\n                 I need you to pass me fit now, Molly.\n\n       She moves to him, touches the scarred and bruised bone.\n\n                           BOND\n                 It's just a scratch.\n\n                           DOCTOR GREATREX\n                 James.  It wouldn't really be...\n\n       His hand comes up, rests on her waist.\n\n                           BOND\n                 Ethical?  Can't we just skirt the issue?\n\n       And he pulls down the zip on her skirt.  Flicks the clasp and\n       it drops to the floor.  She shakes her head -- as he starts\n       undoing the buttons on her shirt.  She's very business-like,\n       despite what's happening.\n\n                           DOCTOR GREATREX\n                 ...if you showed sufficient...willpower.\n                 Promised to slow down.  Cut out running,\n                 jumping...shooting.  All kinds of...\n\n       And he pulls her toward him, they kiss.\n\n                           BOND\n                 Strenuous activity?\n\n       Her shirt drops to the floor.  She pushes him back, lies on\n       him.  Just wearing knickers now.  Between kisses:\n\n                           DOCTOR GREATREX\n                 Then maybe I'd be... open to that.\n\n                           BOND\n                     (smiles)\n                 Perhaps after this ... test?\n\n                           DOCTOR GREATREX\n                 ...yes?...\n\n                           BOND\n                 I could come for a second opinion?\n\n       INT. BRIEFING ROOM, CASTLE THANE (MI-6 HQ)- LATER\n\n       A huge chandelier dominates the vast stone room. SEVERAL\n       AGENTS listen to the debriefing.  ROBINSON and M watch TANNER\n       explain things; he holds a FIFTY POUND NOTE and KING'S LAPEL\n       PIN (now blackened, fused, melted to expose electronics\n       beneath).\n\n                           TANNER\n                 ...The money was dipped in urea, dried,\n                 and packed tight. In one note the metal\n                 strip had been replaced with a\n                 combustible magnesium circuit -- in\n                 effect a tiny detonator. King always wore\n                 a pin in his lapel, an heirloom called\n                 'the Eye of the Glens'; but someone\n                 switched it for a copy, a ceramic micro-\n                 circuit emitting an electronic signature.\n\n       ANGLE\n\n       on BOND as he enters the room.  He hangs back in the shadows,\n       watches Tanner mime the pin moving to the note:\n\n                           TANNER\n                 When he came within range of the money --\n                 boom.  Ingenious.\n\n       M steps forward.  Her fury controlled.\n\n                           M\n                 We've been pawns in someone's game. They\n                 tricked us into bringing the money to\n                 King. Not just elaborate.  Cock-sure.\n\n                           TANNER\n                 And expensive.  Cost three million plus.\n\n       Suddenly the chandelier darkens, the floor brightens into a\n       VAST SCREEN, showing a satellite image of Central Asia and\n       the Mediterranean.  M and Robinson walk onto the screen.\n\n                           M\n                 Cheap, if it achieves your aim of de-\n                 stabilizing the Western World.\n\n       She causes the desired stir.  Bond steps forward from the\n       shadows to get a better view.  M sees the sling has gone.\n\n                           M\n                 007. What do you know of the Caspian Sea?\n\n                           BOND\n                 Caviar capital of the world. Matchless\n                 beluga. Firm, yet subtle.\n                     (M looks askance)\n                 Largest landlocked body of water on\n                 Earth.  Oil-rich.  Hitler wanted it.\n                 Stalin beat him to it.\n\n                           M\n                 And now it's up for grabs, a goldrush.\n                 Far more oil than anyone thought.\n\n                           ROBINSON\n                 Latest estimates, six trillion dollars.\n                 It'll make the Gulf look like a puddle,\n                 see us right through the new century.\n                 The problem is getting the oil out of\n                 there.\n\n                           M\n                 There are four pipelines in the works.\n                 Three to the Black Sea, shipping out\n                 through the Bosphorus. All vulnerable to\n                 unstable governments or Russian blockade.\n\n                           BOND\n                 So Sir Robert's goes through Turkey,\n                 direct to the Med...?\n\n                           ROBINSON\n                 A huge project. The most expensive of the\n                 pipelines, but the one supported by every\n                 Western leader. None of the American oil\n                 companies were willing to take it on.\n                 But King has connections to the region.\n                 He married into the Vavra family, rich\n                 local industrialists. He used those\n                 connections to hold it all together.\n\n                           BOND\n                 Kill the man, kill the pipeline.\n\n                           M\n                 Not necessarily.  Not with Elektra taking\n                 over.\n\n       Tanner notices a RED LIGHT start pulsing.  He moves to M:\n\n                           TANNER\n                 Your call to the PM.\n\n       M nods grimly.  As Robinson distributes sealed envelopes:\n\n                           M\n                 Our credibility has been hit hard.  We\n                 have to hit back harder. Your\n                 assignments.\n\n       They open their envelopes, but Bond received nothing.\n\n                           M\n                     (to Bond)\n                 I'm waiting for the report on your\n                 medical.\n\n       She leaves.  Bond is brooding.\n\n                                                            CUT TO:\n\n       INT. RESEARCH ROOM, CASTLE THANE (MI-6 HQ) - NIGHT\n\n       An ancient nook chock full of hi-tech equipment.  Bond\n       concentrates on a screen displaying PHOTOGRAPHS, NEWSPAPER\n       AND TELEVISION CLIPS -- all to do with King's life and times.\n\n       Bond touches the screen on a photo of...ELEKTRA.\n\n       INT. SCREEN\n\n       One story dominates -- the KIDNAPPING OF ELEKTRA KING. A\n       Polaroid of Elektra savagely beaten, ear bandaged, holding a\n       newspaper: beneath the photo is scrawled \"$5,000,000.\"\n\n                           NEWSCASTER\n                 ...somehow managed to shoot two of her\n                 captors and escape...\n\n       POLICE VIDEO: Elektra interviewed; bruised, emotional.\n\n                           VOICE\n                 ... the leader, the one who escaped.  Can\n                 you describe him?\n\n                           ELEKTRA\n                 He shouted.  He shouted all the time --\n\n       Bond touches Elektra's face, freezing her tears.\n\n       His eyes wander to the photo with the ransom demand:\n       $5,000,000.  A thought forms.  He takes out his wallet,\n       opening it and removing:\n\n       THE RECEIPT FROM LACHAISE.\n\n       E.C.U. The strange figure, in pounds: 3,030,303.03.\n\n       Bond taps some keys. The words EXCHANGE RATE appear on the\n       screen...pounds to dollars.\n\n       He enters '3,030,303.03 POUNDS STERLING' and through\n       multiplication by the exchange rate this becomes:\n\n        '5,000,000 US DOLLARS.'  He stares at it.\n\n                                                            CUT TO:\n\n       INT. PASSAGEWAY - CASTLE THANE (MI-6 HQ) - DUSK\n\n       Bond paces the flagstones, FOOTSTEPS ECHOING.\n\n       INT. BRIEFING ROOM - CASTLE THANE (MI-6 HQ) - CONTINUOUS\n\n       Bond opens the door on M who stands alone by the window,\n       looking out at the long shadows on the moors.\n\n                           BOND\n                 Tell me about the kidnapping of Elektra\n                 King.\n\n       She turns, her brow furrowing.\n\n                           M\n                 Who told you to look at Elektra's files?\n\n                           BOND\n                 I took the initiative.\n\n                           M\n                 You haven't been given an assignment in\n                 this case.\n\n                           BOND\n                 I was the one who brought that money\n                 in...\n\n                           M\n                 I'm well aware of your stake in this,\n                 007.\n                 If you have a point, get to it.\n\n                           BOND\n                 The amount of money that killed Robert\n                 King is the same amount as the ransom\n                 demand for Elektra.\n\n       He hands her a slip of paper.\n\n                           BOND\n                 Whoever kidnapped Elektra is the same man\n                 who killed her father.\n\n       M looks at the paper, a long time.\n\n                           M\n                 It's a message.  He wants us to know he's\n                 back.\n\n                           BOND\n                 Who?\n\n                           M\n                 Claude Serrault.  A.K.A...\n\n                           BOND\n                     (this is serious)\n                 Renard.\n\n                                                            CUT TO:\n\n       INT. BRIEFING ROOM, CASTLE THANE (MI-6 HQ)- NIGHT\n\n       A HUGE, TRANSPARENT 3-D IMAGE OF RENARD'S SKULL floats in the\n       centre of the room.  Other images of him on wall screens.\n\n                           M\n                 Sir Robert tried to deal with the\n                 kidnapping with his own...resources, at\n                 first. When Elektra's ear was delivered\n                 to him in the post, he came to me.\n                     (measured)\n                 I advised against paying the ransom. I\n                 knew it was Renard. I played it out as\n                 long as possible to get a fix on him.\n\n                           BOND\n                 Sacrifice the girl to take out the\n                 terrorist?\n\n                           M\n                 How many deaths is he responsible for?\n                 How many innocent people? You may only\n                 get one shot at a man like Renard. Same\n                 circumstances, I'd do the same again.\n\n       She turns to the hologram.\n\n                           M\n                 We sent 009 down to kill him.  Before he\n                 could, Elektra escaped.  A week later our\n                 man caught up with the target. Put a\n                 bullet in his head.\n                     (beat)\n                 That bullet is still there.\n\n       Bond moves toward the ghostly Renard. We now see THE BULLET\n       INSIDE HIS SKULL.\n\n                           BOND\n                 He survived?\n\n                           M\n                 The doctor who saved him couldn't get it\n                 out, so Renard killed him. When Interpol\n                 found the x-rays, there was mild\n                 jubilation. Effectively, he's a dead man.\n\n       She presses a button, the hologram turns...\n\n                           M\n                 The bullet is moving through the medulla\n                 oblongata, killing off his sense of\n                 touch. He feels no pain. He can push\n                 himself harder, longer than any normal\n                 man.\n\n                           BOND\n                 'That which does not kill me makes me\n                 stronger.'\n\n                           M\n                 Now Robert is dead. He got his revenge.\n\n                           BOND\n                 He's not through yet. Renard doesn't blow\n                 up five million dollars unless he knows\n                 there's more coming in. He's working for\n                 someone. Someone who wants to stop the\n                 pipeline.  And they hired the perfect\n                 killer. One with a vendetta against\n                 King...and you.\n\n       MONEYPENNY ENTERS with a file, which she hands to M.\n\n       M looks over the file: his medical report.\n\n                           M\n                 I see the good doctor gave you glowing\n                 testimonials. 'Exceptional stamina'...\n\n                           MONEYPENNY\n                 He's always been good at oral exams.\n\n       Moneypenny disappears out the door. M is all business.\n\n                           M\n                 Get out to the pipeline. Find the insider\n                 who switched the pin. If your instincts\n                 are right, Renard will be back. He hasn't\n                 completed the job. The pipeline is still\n                 going forward, and we have Elektra to\n                 thank for that.\n\n                           BOND\n                 The worm on the hook again.\n\n       They exchange a look. A look of recognition between two\n       professionals, who know the terrible price of what they do.\n\n       INT. Q'S LAB - NIGHT\n\n       A Scot in a kilt plays the bagpipes -- badly.  He spins\n       round, drops the pipe from his mouth, simultaneously fires\n       bullets from one pipe and a jet of flame from another.  The\n       target is a realistic dummy -- now a molten, bullet-ridden\n       mess.\n\n       We're in Q's laboratory.  He's walking Bond through.\n\n                           BOND\n                 Scottish heavy metal, Q?\n\n                           Q\n                 Oh pipe down, 007.\n                     (irritated, hands over a WATCH)\n                 Your 29th. Try not to lose this one. It\n                 has dual lasers and a miniature grappling\n                 hook with fifty feet of high-tensile\n                 micro-filament, able to support 800\n                 pounds.\n\n       In the background, we see a man in a sleek black jacket. The\n       man PULLS A STRING...the jacket becomes AN AIRBAG...it\n       envelopes him, he gets impossibly tangled in it.\n\n       Q ignores it, handing Bond a new pair of GLASSES.\n\n                           Q\n                 New refinement.  Sort of X-ray vision.\n                 For checking concealed weapons.\n\n                           BOND\n                 And other uses, no doubt.\n\n                           Q\n                 Abuses in your case. You destroyed my\n                 hydro-boat in less than seven minutes, as\n                 no doubt will be the case with this...\n\n       He presses a button and a section of ceiling lowers to reveal\n       a BMW Z7.\n       A MAN in a white coat is loading A MISSILE into one of the\n       headlamps, then steps off the platform.  Q gestures to him.\n\n                           Q\n                 007, my Deputy Assistant.  I'm grooming\n                 him to follow me.\n\n                           BOND\n                     (to Man)\n                 That would make you...\"R\"?\n\n                           R\n                 Ahh, the rampant 007 wit.  I, of course,\n                 am laughing inside.  But I dare say\n                 you've met your match in this machine.\n                     (touring the car)\n                 The absolute latest in intercepts,\n                 surveillance and countermeasures.\n                 Titanium plating and armor, a multi-\n                 tasking heads-up display. Completely\n                 indestructible.  All in all, rather\n                 stocked.\n\n                           Q\n                 'Fully loaded' I think is the term.\n\n       \"R\" pats the fender, he's pretty damned fond of his machine.\n\n                           R\n                 Do take good care of her.\n\n                                                            CUT TO:\n\n       EXT. CONSTRUCTION SITE, NEAR CAUCASUS MOUNTAINS - DAY\n\n       A hot day. CAMERA soars over tall trees. We can just make out\n       the sleek muscular car, beetle-black and far below, bouncing\n       over rough terrain.  Bond \"taking care\" of his new BMW Z7.\n\n       INT. BOND'S CAR - NR CAUCASUS MOUNTAINS - DAY\n\n       We join Bond at the wheel, driving hard, loving it, pushing\n       up extreme inclines, smashing through overhanging limbs.\n\n       EXT. PERIMETER FENCE, CONSTRUCTION SITE, NEAR CAUCASUS\n       MOUNTAINS - DAY\n\n       Bond reaches a PERIMETER FENCE, manned by a GUARD.  The guard\n       examines Bond's PASS and waves him through.\n\n       EXT. AIRSTRIP AREA NEAR CONSTRUCTION SITE, NEAR CAUCASUS\n       MOUNTAINS - DAY (OLD SC. 69)\n\n       As Bond drives on he passes an area where HELICOPTERS\n       trailing GIANT SAWS are trimming back trees.  Felled trees\n       are being dragged away, being replaced by huge metal sheets.\n       An incredibly fast and well-oiled operation -- but why?\n\n       EXT. CONSTRUCTION SITE, NEAR CAUCASUS MOUNTAINS - DAY\n\n       Bond pulls up at the CONSTRUCTION SITE, teeming with ultra-\n       modern robotic construction machines and vehicles.\n\n       He gets out, and is immediately surrounded by men with guns.\n       A man in a suit steps forward.  DAVIDOV is tall, blonde, with\n       a dangerous charm Bond instantly recognizes as ex-KGB.\n\n       He turns Bond around, hands on the car.  Pats him down.\n       Pulls out an ID, checks it:\n\n                           DAVIDOV\n                     (excellent English)\n                 Bond. A government man. I'm afraid since\n                 you English got the boss killed we've\n                 been a little...jumpy.\n\n       Bond stares ahead, watches a PRIVATE JET swoops past...\n\n       OMITTED\n\n       EXT. AIRSTRIP AREA NEAR CONSTRUCTION SITE, NEAR CAUCASUS\n       MOUNTAINS - DAY\n\n       The jet lands on a runway of the metal sheets Bond saw being\n       laid as he passed...\n\n       EXT. CONSTRUCTION SITE, NEAR CAUCASUS MOUNTAINS - DAY\n\n       Davidov pulls out Bond's gun.\n\n                           BOND\n                     (re:  gun)\n                 I'd rather you didn't play with that.\n\n       Davidov ignores him, looking the gun over.\n\n                           DAVIDOV\n                 Nice.\n\n                           BOND\n                 Quite stunning.\n\n       Bond turns to watch a LIFTING HELICOPTER swoop in and drop\n       down an air-conditioned office.  Military precision.\n\n       Davidov's radio crackles out a message and he tosses the gun\n       back to Bond.  They start walking:\n\n                           DAVIDOV\n                     (pleasant)\n                 Sorry about all that, comrade. Old habits\n                 die hard. I am Head of Security.\n                 Davidov.\n\n       Bond eyes him, but is distracted by a jet coming to a halt\n       ahead of them.\n\n       Stairs swing down and out steps ELEKTRA KING.  Beautiful,\n       elegant.  So out of place in this world of men.  She surveys\n       the worksite.\n\n       Impressed, Bond takes his ID back from Davidov.\n\n       INT. OFFICE, CONSTRUCTION SITE - CONTINUOUS\n\n       Bond and Davidov step into a fully functioning office.\n       Everything Elektra requires is here. Computer, phones, drinks\n       cabinet. She is in the middle of a group of workmen and\n       secretaries, looking at plans, talking, pouring herself a cup\n       of coffee.\n\n                           ELEKTRA\n                     (to Foreman)\n                 ...they should have been in place two\n                 days ago. That is the target my father\n                 set.\n\n                           FOREMAN\n                 We've had some trouble with the villagers\n                 at Ruan. Some sacred burial plot...\n\n                           DAVIDOV\n                 Miss King...James Bond here to see you.\n\n       She looks up...a brief moment of RECOGNITION...then back to\n       business.\n\n                           ELEKTRA\n                 Find me the research on the limestone\n                 deposits, go ahead and place these\n                 orders, and get the jeep ready. I will go\n                 to Ruan myself...\n\n                           DAVIDOV\n                 Miss King, I wouldn't recommend...\n\n                           ELEKTRA\n                 I said, I will go.\n\n       She signs some documents and the men file out. She gets up,\n       turning her back to Bond, hands on her hips.\n\n                           ELEKTRA\n                 Would you excuse us, Davidov?\n\n       Davidov nods and leaves. Elektra still keeps her back turned,\n       but he can see her physically change, her shoulders sag, her\n       arms cross in front of her. When she finds her voice, it has\n       a gravelly sound of emotion.\n\n                           ELEKTRA\n                 I met you at my father's funeral.\n\n                           BOND\n                 Yes.\n\n                           ELEKTRA\n                 I haven't been able to recall a single\n                 moment of that day...until now.\n\n                           BOND\n                 Funerals aren't exactly memorable.\n\n                           ELEKTRA\n                 God no. All those horrible loved ones and\n                 relatives. I don't want to talk to those\n                 people. I just want to...talk to my\n                 father.\n                     (beat)\n                 I loved him.  I'm not sure he knew that.\n\n                           BOND\n                 Is that why you want to finish the\n                 pipeline?\n\n                           ELEKTRA\n                 Partially, yes.\n\n       Her muscleman BODY GUARD appears, says briefly:\n\n                           GABOR\n                 The jeep is ready, Ma'am.  Will I be\n                 driving with you?\n\n                           ELEKTRA\n                 No, Gabor. We have a guest.\n\n       Gabor glares at Bond before he leaves.\n\n                           BOND\n                 Who is he?\n\n                           ELEKTRA\n                 My bodyguard. He follows me everywhere.\n                 He's decisive, vigilant.  And he makes an\n                 excellent omelette.\n\n                           BOND\n                 How long has he been with you?\n\n                           ELEKTRA\n                 Since the kidnapping. Why do you ask?\n\n       Bond takes something out of his pocket, he opens his palm,\n       shows it to her.\n\n                           BOND\n                 Does this look familiar to you?\n\n                           ELEKTRA\n                 It's my father's pin. He wore it everyday\n                 of his life.\n\n       She swallows back emotion. Looks in his eyes, with a sad half-\n       smile that unsettles him.\n\n                           ELEKTRA\n                 Are you trying to break my heart? Or is\n                 it just your way with women?\n\n                           BOND\n                 It's not the pin your father wore. It's\n                 an exact duplicate. Inside is a tiny\n                 electrical detonator. We have reason to\n                 believe the assassin had an inside\n                 accomplice, someone who worked at this\n                 company.\n\n                           ELEKTRA\n                 If you've come here to look after me, Mr.\n                 Bond, thank you, but no thank you.  I\n                 have two bodyguards, I don't need a\n                 third...\n\n       She starts to walk out.  He follows her...\n\n       EXT. CONSTRUCTION SITE - CONTINUOUS\n\n                           BOND\n                 The killer doesn't want to see this\n                 pipeline continue, doesn't want to see\n                 you take over...\n\n                           ELEKTRA\n                 That's every man within a five mile\n                 radius.  Including you.\n                     (off his look)\n                 That's why you're here, isn't it? You\n                 think I can't do it. You think I'm going\n                 to screw up. Or get myself killed.\n\n                           BOND\n                 I think running this pipeline would be a\n                 difficult job for anyone. Especially\n                 King's daughter.\n\n                           ELEKTRA\n                 You are wrong, Mr. Bond. In fact, I am\n                 the only person who can do it.\n\n                                                            CUT TO:\n\n       EXT. JEEP, TRAVELING - OILFIELDS - DAY\n\n       Elektra drives the all-terrain jeep with casual assurance.\n       Bond is beside her, cold-weather gear in the back.  They're\n       following a huge pipeline, passing a blighted petrified\n       forest of twisted iron:  derelict oil derricks.\n\n       Elektra gestures at the oil fields they're now leaving\n       behind.  Receding into the distance, a DELTA OF ROADWAYS\n       perched on rusting stilts juts out into the sea.\n\n                           ELEKTRA\n                 My mother's people discovered oil here\n                 ninety years ago.  The Bolsheviks\n                 slaughtered them for it.\n                     (beat)\n                 Some say oil is in my family's blood.  I\n                 say our blood is in the oil. This is the\n                 very heart of the planet.  Up here in the\n                 hills was Eden, literally.  Look what the\n                 Russians did to it.  Now we have a second\n                 chance and this time we'll do it right.\n                 When the other wells have all dried up,\n                 she'll still be pumping her lifeblood to\n                 the world.  And this\n                     (proudly, of pipeline)\n                 Will be one of the main arteries...\n\n       OMITTED 75-\n\n       EXT. POV FROM HELICOPTER - DAY\n\n       Bond and Elektra travel beside the vast pipe through\n       dramatic, beautiful, scenery...\n\n       INT. HELICOPTER - DAY\n\n       Davidov and Gabor, in the helicopter, watch the jeep below.\n\n       EXT. CONSTRUCTION CAMP, FOOTHILLS OF THE CAUCASUS MOUNTAINS\n       (CAPPADOCIA, THE VILLAGE OF ZELVE) - DAY\n\n       The jeep reaches a break in the pipe: a SURVEY CAMP, flags,\n       strings.  The SURVEY CREW cower behind a 4WD, local tribesman\n       are stoning them from a village carved into the rock.  A lot\n       of SHOUTING.\n\n       Before Bond can stop her, Elektra gets out, moves toward the\n       tribesmen.  The stoning ceases. They know who she is.  She\n       begins to speak quietly -- in their own tongue.\n\n       INT. CHAPEL, ZELVE - DAY\n\n       A stunning pre-Byzantine chapel hewn from the rock.  Flames\n       illuminate beautiful mosaics and paintings on the cavern\n       wall.  A COPTIC PRIEST proudly shows Elektra about, jabbering\n       in his mother tongue.  She answers in his language.\n\n       Bond watches her, impressed.\n\n       EXT. CONSTRUCTION CAMP - DISTORTED ELECTRONIC POV, FROM\n       ABOVE:\n\n       We hear the click of high-powered electronic binoculars,\n       zeroing in on Bond and Elektra as they return to the survey\n       team.  This can't be Davidov's view, as the helicopter has\n       settled down below.\n\n       EXT. CONSTRUCTION CAMP, FOOTHILLS OF MOUNTAINS - DAY\n\n       Bond is edgy.  Someone is out there.  He's sure of it.  He\n       sees Davidov and Gabor scanning the area as well.  Elektra\n       speaks to the foreman.\n\n                           ELEKTRA\n                 Send the pipe around.\n\n                           FOREMAN\n                 It will take weeks, cost millions.\n                 Your father approved this route.\n\n                           ELEKTRA\n                 Then my father was wrong.\n\n       The first time Elektra has asserted her own authority. The\n       foreman is surprised, angry. But he doesn't question her.\n\n       She moves toward the helicopter, says to Bond:\n\n                           ELEKTRA\n                 I have to check the upper lines.  Gabor\n                 will drive you back.\n\n                           BOND\n                 Always wanted to see the upper lines.\n\n                           ELEKTRA\n                 You don't take no for an answer, do you?\n\n                           BOND\n                 No.\n\n       She shrugs, mischief in her eyes.\n\n                           ELEKTRA\n                 Alright then. Do you ski?\n\n       Bond just smiles.\n\n                           BOND\n                 I've been known to.\n\n       INT/EXT. HELICOPTER - DAY\n\n       The chopper swoops over SNOWY WASTES.  It reaches a mountain\n       peak, hovers.  The wind is strong, buffeting.\n\n       Elektra and Bond are both now in ski suits, Bond wearing a\n       sleek black jacket.\n\n                           PILOT\n                 Can't land.  Wind's too strong!\n\n                           ELEKTRA\n                 Just hold her steady.\n                     (to Bond)\n                 You wanted to see it.\n\n       She steps into her skis, opens the door.  Wind rushes in.\n\n       EXT. MOUNTAIN TOP - DAY\n\n       Without a moment's hesitation, Elektra leaps out of the\n       chopper and falls fifteen feet, landing on the move.\n\n       INT/EXT.  HELICOPTER - DAY\n\n       Unbelieving, Bond quickly dons skis and leaps after her.\n\n       EXT. MOUNTAINS - DAY\n\n       Below him on the mountain, she is already a way ahead.  Her\n       skiing is fearless.  Bond likes a challenge...\n\n       They wind down the slope, competitive, testing one another,\n       enjoying it.\n\n       EXT. MOUNTAINSIDE - DAY\n\n       After an exhilarating run, she stops on the edge of a huge\n       drop.  Bond joins her.  They look down at the snowy valley\n       below.  A line of survey FLAGS visible through the middle.\n\n                           ELEKTRA\n                 We're building from both ends.  This is\n                 where they'll meet.  Fifteen hundred\n                 miles from the Caspian to the\n                 Mediterranean.\n\n       Bond and Elektra stand on the mountainside, feeling like the\n       only two people in the world, when they hear: THE DISTANT HUM\n       OF A PLANE.\n\n       EXT. SKY - DAY\n\n       They see FOUR OBJECTS falling out the back of the aircraft.\n       As the objects plummet silently toward the earth, they POP\n       PARACHUTES, their fall slows and then, as Bond and Elektra\n       watch in disbelief...\n\n       GUNFIRE echoes out from the black shapes, now visible as\n       PARASKIS, low-flying, sleek, deadly snow vehicles.\n\n       EXT. MOUNTAIN TOP - DAY\n\n       Bond turns to Elektra, he has to yell over the sound of the\n       approaching machines.\n\n                           BOND\n                 Head for that gully, I'll lure them into\n                 the trees!\n\n       He points her off to one side, where a shallow gully offers\n       cover...she skis off to shelter and he skis OUT...INTO THE\n       OPEN...where the paraskis trail after him...\n\n       He streaks toward the trees as the vehicles gain on him,\n       firing...\n\n       EXT. FOREST\n\n       He makes it to the woods, finding cover in the trees,\n       whipping in and out of sight as PARASKI #1 tries to follow,\n       sinking lower and lower until...\n\n       HIS SKIDS catch on some over hanging branches...the Paraski\n       is CATAPULTED into a tree and EXPLODES...\n\n       EXT. WOODS - CONTINUOUS\n\n       Coming in to pick up the pursuit of Bond is Paraski #2,\n       firing down at Bond, dropping bombs which explode just behind\n       him in the snow.  The other two paraskis LAND and eject their\n       chutes, now RACING THROUGH THE WOODS on the ground.\n\n       Bond looks behind him, sees them gaining...he zigzags through\n       the trees and suckers Paraski #3 to glance off one tree, hit\n       another and wipe out behind.\n\n       But the remaining predator on the ground, Paraski #4, is\n       gaining on him...Bond bursts out of the trees and finds\n       himself heading toward...\n\n       THE EDGE OF A PRECIPICE...\n\n       He cranks himself right, narrowly avoiding a tumble over the\n       edge.  Paraski #4 isn't so lucky and SAILS OFF THE CLIFF to a\n       hundred and fifty foot drop.\n\n                           BOND\n                     (smiling)\n                 Should have stuck to snowboarding.\n\n       But the smile is wiped off his face as...AN EMERGENCY\n       PARACHUTE deploys from the back...\n\n       The Paraski does a climbing turn and heads straight back for\n       him...\n\n       Bond skis for his life, away from Paraski #4 when PARASKI #2\n         appears in front of him...guns blazing...\n\n       One ahead and one behind, Bond turns back...he has nowhere to\n       go but...\n\n       OVER THE EDGE\n\n       He sails through the air and lands on the Paraski #4,\n       slashing the parachute with his ski pole before bouncing off\n       and doing an amazing tumbling hundred foot fall to the snow,\n       where he lands on his skis... Paraski four, the chute\n       tangling in the rotors of its propeller, struggles to\n       maintain control, his vehicle inexorably hurtling toward\n       PARASKI #2: both of them having set their course for Bond,\n       they are now on a collision course with EACH OTHER...\n\n       IN THE GULLY BELOW\n\n       Bond meets up with Elektra as above them...\n\n       The two Paraskis collide, crashing into the snowy hill above\n       and tumbling down, end over end.\n\n       Bond and Elektra huddle together as shards and debris rain\n       down on them.\n\n       Then...silence.  An eerie silence.\n\n                           ELEKTRA\n                 Are they gone? All of them?\n\n       Bond nods, ripping from his pole a PIECE OF THE PARACHUTE he\n       slashed and wiping his face with it...he looks at the piece\n       of fabric in his hand.  He sees:\n\n       CYRILLIC LETTERS...undecipherable to us...but there is a look\n       on his face, a look of recognition as...\n\n       AN EARTH RATTLING RUMBLE grows above them.\n\n       Bond stuffs the parachute fragment in his ski-suit as he\n       turns...\n\n       The exploding Paraskis have triggered AN AVALANCHE on the\n       slope above.\n\n       EXT. MOUNTAINSIDE/AVALANCHE AREA - DAY\n\n       They try to outrun it -- riding the sliding hill -- but they\n       haven't a hope... the rest of the snow is catching them,\n       they're going to get swallowed.\n\n       EXT. MOUNTAINSIDE/AVALANCHE AREA - DAY\n\n       The ground shudders, the THUNDER CLOSING...  Their ankles are\n       soon covered, Elektra falls.  Bond stops, pulls her up.\n       They're about to die.  He pulls her to him.\n\n                           BOND\n                 Hold on to me.\n\n       She's confused and frightened but does as she's told.\n\n       They hold one another tight as -- here it comes -- the white\n       fury hurtles over them, burying them...  At the last moment,\n       just as their heads vanish from view...\n\n       CLOSE ON BOND PULLING THE Q GADGET ON THE JACKET.\n\n       The AIRBAG slams open.  The snow covers it and them.  More\n       and more snow slides over...\n\n                                                            CUT TO:\n\n       INT. SNOW HOLE - MOMENTS LATER\n\n       Darkness.  The RUMBLING CEASES...\n\n       Light emanates from Bond's watch.  In the shadows he pulls a\n       knife, punctures the air bag. It deflates, leaving them\n       cocooned in an icy tomb.  Elektra looks around, staring,\n       unbelieving.\n\n                           ELEKTRA\n                 Oh my God...we're buried alive...\n\n                           BOND\n                 We're alright.\n\n       But her breath is coming in short, irregular bursts.\n\n                           ELEKTRA\n                 I can't stay here.\n\n                           BOND\n                 You're not going to.\n\n       Bond takes a knife from a sheath around his ankle.  Flicks\n       open the small blade.  He starts to cut a hole in the snow\n       above their heads. She stops him.\n\n                           ELEKTRA\n                 No!  It will cave in!\n\n                           BOND\n                 It's the only way out...\n\n       The snow CREAKS eerily, she gasps, terror mounting.\n\n                           ELEKTRA\n                 I can't breathe, I can't breathe...\n\n       Bond grabs her, holds her tight.  She resists, bucks.\n\n                           BOND\n                 Elektra, look at me, look in my eyes!\n\n                     (she does)\n                 You're alright. Everything will be\n                 alright.  Trust me.\n\n       Finally, arrested by the strength in his eyes, she calms...\n\n       EXT. MOUNTAINS - MOMENTS LATER\n\n       A beautiful expanse of smooth virgin snow.  All is quiet.\n       CLOSER\n\n       Bond's fist PUNCHES through the white.  He pulls the snow\n       away, climbs out.  Leans in, lifts Elektra out.\n\n       Bond and Elektra stand, lone figures in the perfect white.\n       They hear a sound...HELICOPTER ROTORS.  Rescue on its way.\n\n                                                            CUT TO:\n\n       EXT. ELEKTRA'S VILLA - DAY\n\n       An establishing shot of Bond's BMW parked outside the ornate\n       villa on the shore of the golden Caspian.\n\n       INT. ENTRANCE HALL, ELEKTRA'S VILLA - DAY\n\n       Palatial.  Hallway dominated by a LARGE PAINTING of a bearded\n       man in traditional Turkish garb, sitting proudly on a horse.\n\n       Davidov, Gabor, waiting, pacing.\n\n       Bond is sits in a chair, ON EDGE, writing something over and\n       over on a small pad of paper...THE CYRILLIC LETTERS on the\n       parachute fragment.\n\n       A DOCTOR comes down the grand staircase. The men stand.\n\n                           DOCTOR\n                 She's fine. Contusions. A slight strain\n                 to her ankle, but otherwise, fine.\n                     (to Bond)\n                 She wants to see you.\n\n       INT. ELEKTRA'S BEDROOM - SUNSET\n\n       Bond enters. Elektra is standing by the window watching the\n       golden ball of the sun sink into the sea. She wears nothing\n       but a silk embroidered robe; the sun shows through it,\n       outlining her naked body in soft, shadowy curves.\n\n                           ELEKTRA\n                 Are you alright?\n\n       He nods.  He is wound tight, she senses it.\n\n                           BOND\n                 I can't stay.\n\n                           ELEKTRA\n                 I know.\n\n       A moment.\n\n                           ELEKTRA\n                 I need to ask you something.  And I need\n                 you to tell me the truth.\n\n       He waits.\n\n                           ELEKTRA\n                 Who is it? Who is trying to kill me?\n\n       Bond looks at her; vulnerable, fragile, trying to be strong.\n       He cannot tell her the truth.\n\n                           BOND\n                 I don't know. But I will find him.\n\n       She stares at him, sensing he is withholding something. She\n       turns back to the window.\n\n       He approaches behind her.\n\n                           ELEKTRA\n                 After the kidnapping...I was afraid to go\n                 outside, to be alone, to be in a crowd,\n                 to do anything at all, until I\n                 realized...\n                     (pause)\n                 There's no point in living if you\n                 can't...feel alive.\n\n       She looks out at the fading sun.\n\n                           ELEKTRA\n                 I can't huddle in the shadows. I can't\n                 let fear run my life.  I won't.\n\n       She turns to him.\n\n                           ELEKTRA\n                 The way I acted, in the snow...you must\n                 think I'm a coward.\n\n                           BOND\n                 I think you're one of the bravest people\n                 I've ever met.\n\n       She looks up at him, into his eyes; they are so close. All\n       she has to do is tilt her mouth upward...she kisses him.  His\n       hands come up across her back, pressing her toward him, her\n       body melting into his, and then...\n\n       He pulls back. Has to physically step away from her.\n\n                           ELEKTRA\n                 What is it?\n\n                           BOND\n                 ...you should rest.\n\n       That was exactly the wrong thing to say. He sees the\n       rebellion flair in her eyes.\n\n                           ELEKTRA\n                 James...\n\n                           BOND\n                 I have to go.\n\n                           ELEKTRA\n                 Then take me with you.\n\n                           BOND\n                 No. You'll be safe here.\n\n                           ELEKTRA\n                 I don't want to be safe!\n\n                           BOND\n                 I have to go to work.\n\n       He starts toward the door.\n\n                           ELEKTRA\n                 Now who's the coward?\n\n       He stops, his back up...then heads out the door.\n\n       IN THE HALLWAY\n\n       He passes Gabor, standing faithfully outside.\n\n                                                            CUT TO:\n\n       EST. SHOT - EXT. CASINO NOIR D'OR, BAKU - NIGHT\n\n       Elegant, mysterious.  A modern day Casablanca.\n\n       INT. CASINO NOIR D'OR, BAKU - NIGHT\n\n       Bond in evening dress in the sumptuous casino. He takes out\n       the Q glasses, slips them on, surveys the room --\n\n       HIS X-RAY POV\n\n       He can see all the WEAPONS carried by the players.  All sizes\n       of pistol, even the odd grenade.  The obvious side-effect of\n       this view -- he can see through clothes.\n\n       His eyes alight on two girls walking away from him.  One of\n       them turns to look back, unaware that she is on display.  She\n       returns Bond's smile.  Her friend turns to look.  Bond's\n       smile grows:  she has a small pistol concealed over one\n       breast.\n\n       INT. CASINO NOIR D'OR, BAKU - NIGHT\n\n       He looks over the lenses -- and spies someone on the fringes.\n       His old adversary, ex-KGB, VALENTIN ZUKOVSKY, talking to some\n       suspicious types. Zukovsky looks across. Bond walks toward\n       him.\n\n                           BOND\n                 Valentin Zukovsky.\n\n                           ZUKOVSKY\n                 BondJamesBond. What brings you here?\n\n                           BOND\n                 You, of course. I need some information.\n\n                           ZUKOVSKY\n                 Bond, I'm a civilian. This is my place.\n                 Used to be the royal family's, now it's\n                 mine. I run my little business, I stay\n                 out of trouble...\n\n                           BOND\n                     (looking about)\n                 Mafia warlords, Diplomats and spies,\n                 consortiums from every country in the\n                 world.  A nice little rat's nest.\n\n                           ZUKOVSKY\n                     (offering hors d'ouevres)\n                 Have some of the rat's nest caviar.  From\n                 my own fishery.  They buy my caviar,\n                 drink my champagne, lose to my House.\n\n       He turns to a suspicious-looking Heavy.\n\n                           ZUKOVSKY\n                 Let me introduce you to a former\n                 colleague of mine at the KGB. Dmitri\n                 Palov, you may know him as...the Boa.\n\n       The Boa is completely bald, muscular; huge, deadly hands.\n\n                           BOA\n                 The great 007. For years I have dreamed\n                 of closing my hands around your neck.\n\n                           BOND\n                 Boa. Have you had any therapy since\n                 Perestroika?\n\n                           ZUKOVSKY\n                 Why am I suddenly worried I'm not\n                 carrying enough insurance?\n\n       The Boa leaves, glaring all the while.\n\n                           ZUKOVSKY\n                 See?  You're upsetting my customers.\n                 What do you want?\n\n                           BOND\n                 How does a terrorist like Renard supply\n                 his men with state-of-the-art Russian\n                 Army weapons?\n\n                           ZUKOVSKY\n                 What?  This is not possible.\n\n       Bond takes from his pocket the fragment of the PARACHUTE.\n       Zukovsky examines the letters.\n\n                           BOND\n                 If I remember my Cyrillic that says 101st\n                 airborne division.\n\n                           ZUKOVSKY\n                 Where did you get this?\n\n                           BOND\n                 Off a high-powered Paraski that was\n                 trying to kill me.\n\n       Zukovsky shakes his head. Sighs.\n\n                           ZUKOVSKY\n                 The Russian Army, they spend millions on\n                 flying skis, but they cannot afford to\n                 pay the soldiers. The men, they do what\n                 they have to do to feed their families.\n                 In this country, for the right price and\n                 a pack of cigarettes, you can get\n                 anything you want.\n\n       He notices Bond watching THE HOSTESS BAR...a dark alcove of\n       the casino, where slinky HOOKERS flatter the guests.\n\n                           ZUKOVSKY\n                 That too. Everyone does what they can to\n                 survive.\n\n                           BOND\n                 How high up does this...arms dealing go?\n\n                           ZUKOVSKY\n                 Bond. If someone wants you dead, it is\n                 Renard. Our government has nothing to\n                 gain by killing you.\n\n                           BOND\n                 But you would have something to gain by\n                 killing Robert King. And stopping his\n                 pipeline.\n\n       This hits Zukovsky. He closes down. A chill between them.\n\n                           ZUKOVSKY\n                 Poor Bond. The cold war is over.  What\n                 have you got left? Economic espionage.\n                 Murder in the boardroom.  So dull.\n\n       Bond's eyes catch something, someone entering the casino.\n\n       HIS POV:  ELEKTRA...more vibrant than we have ever seen her,\n       living up to her name. She is impossibly glamorous in a\n       sparkling dress that fits like second skin.  Her hair is full\n       and tumbling, her eyes are fiery and wild.\n\n                           BOND\n                 Oh, you'd be surprised.\n\n       Bond starts toward her, but she tosses her head, defiant, and\n       turns away, making her way to the Roulette tables.\n\n       Bond follows her across the casino. They are like two cats,\n       moving through this neon jungle, their energy dangerous and\n       sexy, all eyes on them. He takes note as she passes...MINIMUM\n       $100, then $500, $1000...\n\n       She finally stops at the 'No limit' table.  Crowded with the\n       nastiest and richest of the high rollers, Armenians, Turks,\n       South Americans, a computer nerd American and a Russian\n       industrialist's wife, heavy with jewelry and drink.\n\n       ZUKOVSKY is suddenly there, pulling out a seat for her in the\n       center.\n\n                           ZUKOVSKY\n                 We've kept your father's chair free.\n\n                           ELEKTRA\n                 And his account?\n\n                           ZUKOVSKY\n                 You have a credit line of a million and a\n                 half.\n\n       He gestures to the Dealer, who pushes ten towering stacks of\n       CHIPS toward her. A WAITRESS is right there to take her\n       order.\n\n                           ELEKTRA\n                 Vodka martini.\n\n                           BOND\n                 Two. Shaken not stirred.\n\n       He leans in, smiling his charming smile as he says:\n\n                           BOND\n                 What the hell are you doing here?\n\n                           ELEKTRA\n                     (smiling right back)\n                 Someone wants to kill me, I'd rather die\n                 looking him straight in the eye.\n                     (lightly)\n                 What are you doing here?  Looking for a\n                 woman a little more your type? How about\n                 that one?\n\n       She points to a SHOW GIRL in a feather headdress and pasties.\n\n                           BOND\n                 If this little show is for my benefit,\n                 I'll take you home right now.\n\n                           ELEKTRA\n                 You had your chance, James. Now I'm\n                 looking for a bigger thrill.\n\n       She pushes half her chips back onto the table, letting them\n       stand on her bet.  The whole table exhales. Then, it starts:\n       bets are placed, gamblers energized by her arrival.\n\n       Bond scans the room, vigilant, nervous...\n\n       HIS P.O.V.  He zeroes in on Davidov, sidling off, away from\n       the table, trying to look nonchalant, his eyes shifting this\n       way and that...he looks suspicious as hell.\n\n       Bond watches, his blood running, and then...\n\n       Davidov slips into the HOSTESS BAR.  A HOOKER is soon\n       wrapping herself around him. After a few words, she leads him\n       off toward the back.\n\n       Bond returns to the game, shaking his head.  He watches as\n       THE DEALER DEALS FROM THE SHOE.\n\n                                                            CUT TO:\n\n       INT. SALON PRIV\u0090 - NIGHT\n\n       A small room.  Lit by sconces that sport LIVE FLAMES.  Tacky-\n       luxurious, a refracted Eastern reflection on an old west\n       whore house.\n\n       Davidov undresses in the little bathroom alcove.  He faces a\n       small ornate mirror over the sink, in which he can see THE\n       HOOKER behind him, on the bed.\n\n                           HOOKER\n                 You want to be...on top, or not on top?\n\n                           DAVIDOV\n                 On top.\n\n       She slowly pulls a pair of SILK ROPES out from her bra and\n       DANGLES THEM.\n\n                           HOOKER\n                 Tied up, or not tied up?\n\n       Davidov smiles, struggling with his belt.  He looks down,\n       gets it, looks up...his heart stops...it is not the hooker in\n       the mirror but...\n\n       RENARD'S FRIGHTENING FACE.\n\n       Davidov spins.\n\n       HIS P.O.V.  Renard's henchman stands by the door, an\n       automatic rifle cocked at Davidov.\n\n                           RENARD\n                 Dead, or not dead?\n\n                                                            CUT TO:\n\n       INT. CASINO - THE BLACK JACK TABLE\n\n       Elektra with black king showing. A seven beneath.\n\n                           BOND\n                 I understand it's normally good practice\n                 to get the feel of the cards before going\n                 off the deep end.\n\n                           ELEKTRA\n                 Really?\n\n       And with a smile she scratches her cards on the table for a\n       hit.  The Dealer gives her an eight.  She reveals her cards.\n\n                           DEALER\n                 Bust.\n\n       He rakes in her chips. But Elektra is undeterred.  She pushes\n       another pile forward as the next deal commences.\n\n                           ELEKTRA\n                 I like the deep end, James.\n\n                                                            CUT TO:\n\n       INT. SALON PRIVE\n\n       The HENCHMAN holds Davidov against the wall with his huge\n       fist around his neck.  Near his head, the live flame of a\n       SCONCE hisses, burning blue and yellow, drawing their fuel\n       from the glass basin of hot oil attached beneath it.\n\n       The HOOKER, obviously one of Renard's gang, has finished\n       donning her khaki pants and combat boots and straps a gun\n       onto her shoulder.\n\n       Renard looks distastefully at the room.\n\n                           RENARD\n                 Is this how you spend the money I pay\n                 you? And with the rest you hire fools who\n                 shoot like blind men?\n\n                           DAVIDOV\n                     (croaks out)\n                 Bond...\n\n                           RENARD\n                 Should be dead as well. Your failure\n                 today is astonishing.  It is a disgrace.\n\n       He approaches close to him, stopping at the flaming SCONCE\n       near his head.\n\n                           RENARD\n                 Do you know why the color is blue at the\n                 wick?\n\n       Davidov starts to sweat.\n\n                           RENARD\n                 Because that is where the flame is the\n                 hottest.\n\n       Renard touches the glass well of oil.\n\n                           RENARD\n                 The temperature is close to five hundred\n                 degrees.\n\n       Renard uses his knife and POPS the seal from the lamp,\n       removing the well of oil...a DROP of the hot oil FALLS ON HIS\n       HAND and SINGES IT BLACK in an instant...\n\n       Renard does not even flinch.  Davidov starts talking, trying\n       to placate...\n\n                           DAVIDOV\n                 The plane...it's all been arranged...\n\n                           RENARD\n                 Then you are completely unnecessary...\n\n       Renard raises the container of oil over Davidov's head:\n\n                           DAVIDOV\n                 I have the documents, the landing\n                 authorizations, the security passes...\n\n       Renard stops, the oil tilted, just ready to pour...\n\n       His dead eye...has it drooped further since we last saw\n       him?...seems to glitter in the light...\n\n                           RENARD\n                 Bond is suspicious. We are moving sooner,\n                 tonight.  We understand each other?\n\n                           DAVIDOV\n                 Yes...yes...\n\n       Renard lets a TRICKLE OF OIL drop onto Davidov's head...\n\n       HE SCREAMS as his hair smokes and singes...\n\n       Renard makes a motion, the THUG releases Davidov, who falls\n       to the floor, clutching his head.\n\n                                                            CUT TO:\n\n       INT. CASINO - THE BLACK JACK TABLE\n\n       Another deal. ZUKOVSKY and others watch, as Elektra stakes\n       even more.  People move closer for a view.  The Dealer shows\n       a five. Elektra shows Bond her cards.\n\n       Elektra is holding two eights. Dealer's up-card is a six.\n\n                           BOND\n                 Stand or split them.\n\n       She smiles. He holds her gaze.\n\n                           ELEKTRA\n                 Surely you believe in living dangerously.\n\n                           BOND\n                 Not at that price. Time to surrender.\n\n       They eye one another a long while -- sex firmly in the air.\n       She smiles.  She moves ALL HER CHIPS forward.\n\n       Bond catches a look between the Dealer and Zukovsky:\n\n                           DEALER\n                 The House has no limit.\n\n       General kerfuffle.  Bond looks back toward THE HOSTESS\n       BAR...no sign of Davidov's return...\n\n                           ELEKTRA\n                     (to Dealer)\n                 Hit me.\n\n       The Dealer scoops a card from the shoe.  Tension.  Everyone\n       holds their breath...as he turns over...  -- a six.  Bust.\n       The audience inhale as one AS THE DEALER TAKES ALL HER CHIPS\n       AWAY.\n\n       Elektra stands.  She has dignity in defeat. She turns to\n       Bond, holding out a hand.\n\n                           ELEKTRA\n                 Time to surrender.\n\n       EXT. CASINO - NIGHT\n\n       Bond, Elektra, Gabor outside, Davidov soon joining them,\n       trying to look like he hasn't been through hell.  Bond\n       notices the burn on his head. Davidov touches it self-\n       consciously.\n\n                           DAVIDOV\n                 A little accident.\n\n                           BOND\n                 A night of burning passion?\n\n       Davidov scowls at him. Bond leads Elektra away...\n\n                                                            CUT TO:\n\n       A DISTANT P.O.V. FROM HIGH ABOVE.\n\n       Someone watches Bond and Elektra move toward his BMW.\n\n                           HENCHMAN (V.O.)\n                 What about Bond?\n\n       EXT. CASINO ROOF\n\n       RENARD and his henchmen, watching. Renard seems mesmerized by\n       the sight of Bond's HAND on the small of Elektra's back,\n       their easy sensuality as they both get into the car.\n\n                           HENCHMAN\n                 Sir?  Sir?\n\n                           RENARD\n                     (seething)\n                 I will take care of Mister Bond.\n\n                                                            CUT TO:\n\n       EXT. ELEKTRA'S VILLA - NIGHT\n\n       Bond and Elektra emerge from the BMW.  Behind them, Gabor and\n       Davidov get out of her car. Bond watches as Davidov slams his\n       door and marches off, angry, toward the SECURITY QUARTERS at\n       the side of the house.\n\n       Bond and Elektra walk to the front door, anticipation thick\n       in the air.  Gabor opens the door. Elektra sweeps through...\n\n       INT. ENTRANCE HALL, ELEKTRA'S VILLA - NIGHT\n\n       Bond pauses just inside the open doorway.\n\n       HIS P.O.V.  Two figures in the cavernous entrance hall,\n       Elektra having a brief word with Gabor, before he turns and\n       exits, leaving only...\n\n       ELEKTRA AND BOND.\n\n       She starts upstairs, Bond's eyes locked on her body, and\n       then:\n\n       SHE LOOKS BACK...just once.  But it says everything. She\n       continues upward.\n\n       Bond taps the front door closed with his foot.\n\n       INT. BEDROOM, ELEKTRA'S VILLA - NIGHT\n\n       Half-light.  They're entwined between the sheets.  This is\n       something slow, languorous, not to be rushed.  We can't make\n       out the mechanics, but they're beaded with sweat.\n\n       Her fingers trace the contours of his torso.  Linger on his\n       bruised collar-bone.\n\n                           ELEKTRA\n                 You knew when you first saw me.  You knew\n                 it would be like this.\n\n                           BOND\n                 Shush.\n\n       Her hand dips in an ice bucket beside the bed.  She rubs a\n       slither of ice down her chest, shudders with pleasure.  It's\n       a move Bond hasn't seen before.\n\n       Now she brings the ice to his shoulder.\n\n                           ELEKTRA\n                 Poor shoulder. Looks painful...\n\n       She kisses his purple flesh.  Licks.\n\n                           BOND\n                 ...needs constant attention...\n\n       She slides her tongue back and fore along the groove above\n       the tendon.  And he pulls the ice from her hand:\n\n                           BOND\n                 Enough ice for one day.\n\n       Tosses it across the room as passion takes over...\n\n       INT. BEDROOM, ELEKTRA'S VILLA - LATER\n\n       A puddle of water where the ice fell.\n\n       Post-sex on the bed. He traces a hand down her naked back.\n       The sweat glistens off the curve of her spine.  She turns.\n       The light glints off her jewelled earlobe...he touches it.\n\n                           BOND\n                 You never take this off?\n\n       Elektra looks at him.\n\n                           ELEKTRA\n                 Why do men always want to undress the one\n                 part of a woman's body she doesn't want\n                 to reveal?\n\n       She reaches to the large, diamond-encrusted earring and\n       gently plucks it away. Pulls her lush hair back...\n\n       The lower half of her ear is gone, reduced to a misshapen\n       clump of scar tissue. It is the only mark on her perfect\n       body. A physical reminder of her ordeal. It breaks his heart.\n\n                           BOND\n                 How did you survive?\n\n                           ELEKTRA\n                 I used my body on the guards.  It gave me\n                 control. I got to a gun and I took my\n                 chance.\n                     (beat)\n                 I've never told anyone that.\n\n       They are looking at each other, both suddenly feeling\n       something dangerously close to real connection.  It is not\n       what Bond expected.\n\n                           ELEKTRA\n                 Do you ever stop, James?  Do you ever\n                 think about...another kind of life?\n\n       He holds her gaze for a long time before he looks away.\n\n                           BOND\n                 I can't afford to.\n\n       She frowns, slightly.  Settles into his chest.\n\n                           ELEKTRA\n                 Don't worry. I know who you are.\n\n       He holds her, eyes full of conflict, staring into the dark.\n\n       EXT. VILLA - NIGHT - LATER\n\n       The lights of a car pulling up at the security office by the\n       perimeter wall of the property.\n\n       EXT. SECURITY QUARTERS - SAME\n\n       Bond's car, several of Elektra's vehicles, all parked around\n       the security office.  They have been joined by:\n\n       A WHITE ECONOMY CAR, a Russian make, with a familiar SEAL\n       painted on the door...we've seen it before, the seal on top\n       of the stolen report at the beginning...Miratom.\n\n       Out of the driver's seat steps...DAVIDOV.  He carries a\n       briefcase from the car to the front door of the security\n       office. He looks around furtively before he disappears\n       inside.\n\n       The parking area is dark and silent and then:\n\n       JAMES BOND sits up in the driver's seat of his BMW.\n\n       INT. BMW - SAME\n\n       Bond sticks his key in the ignition and activates the car's\n       various systems.\n\n       HIS P.O.V.  Davidov is a shadow in the office window.\n\n       Bond flicks a switch.  A NEEDLE-THIN BEAM is directed from\n       the BMW to the window of the office.  He can HEAR a synthesis\n       of Davidov's voice...\n\n                           DAVIDOV (V.O.)\n                 I'm running late...no, no, I'll make\n                 it...how will they know I'm your\n                 man?...romashka...romashka...alright.\n\n       Bond hears the click of a phone hanging up.  He flicks\n       another switch in his car, an infra-red tracking system\n       activates in his WINDSCREEN...\n\n       He can now see Davidov perfectly as he comes out of the\n       security quarters, carrying a briefcase and a large DUFFLE\n       BAG which he carries to the car and loads into the TRUNK.\n\n       He goes back inside.\n\n       BOND gets out of the BMW.  He moves stealthily to the Russian\n       vehicle and, using the laser beam on his watch, opens the\n       lock on the trunk.  It pops open.\n\n       Bond sees the briefcase, and the dufflebag, and...SOMETHING\n       ELSE...something beneath them...he moves the objects aside:\n\n       A MAN is folded into the back of the trunk, his head slumped\n       forward, dark hair on the back of his head slightly wet\n       ...blood? Bond tips the head back, revealing GLASSY DEAD\n       EYES.\n\n       Bond leans in and plucks a BADGE from his white shirt pocket.\n\n       It has a photo of the dead man and reads, in English and\n       Cyrillic: LEONID TASHKA - FIELD INSPECTOR.  On the corner of\n       the badge...THE RUSSIAN SEAL...Miratom. The one from the\n       report.  Bond touches it with his thumb, recognizing it.\n\n       AT THE OFFICE\n\n       Davidov is coming out...\n\n       Bond LOWERS THE TRUNK DOOR and crouches behind the car.\n\n       AT THE OFFICE ENTRANCE\n\n       Davidov pauses to lock the door. He walks toward the Russian\n       car...he is actually WHISTLING a happy tune and then...\n\n       HE STOPS. He has heard something. He draws his gun. He walks\n       AROUND the entire car.  When he gets to the rear...\n\n       THE TRUNK IS CLOSED.  Bond is not there.  No evidence he ever\n       was.\n\n       Davidov gets in the driver's seat and starts the car.\n\n                                                            CUT TO:\n\n       EXT. AIR STRIP - NIGHT\n\n       The Russian car drives onto the grounds of a small, deserted\n       AIRPORT consisting of one outbuilding and a crudely cleared\n       airstrip.\n\n       INT. CAR\n\n       Davidov pulls off the road and parks his car in a wooded\n       area.\n\n       EXT. CAR\n\n       Davidov's feet crunch in the dirt as he walks to the back and\n       opens the trunk.\n\n       He removes the briefcase.  Then the duffle bag.  He looks\n       down at the dead body,  head slumped forward, as before...but\n       something is different, the clothes not quite right and then:\n\n       THE DEAD BODY MOVES, the head turns, Davidov gasps...\n\n       It IS JAMES BOND.\n\n                           BOND\n                 Problem, comrade?\n\n       Davidov pulls his HAND GUN from inside his coat, but Bond is\n       quicker.  With a silenced pistol he shoots Davidov in the\n       head. One little red hole forms in his forehead as his eyes\n       go wide and he crumbles, dead.\n\n       Bond climbs out of the trunk.  Crouches to examine Davidov.\n\n                           BOND\n                 Old habits die hard.\n\n       He straightens.  Picks up the briefcase.  It is locked.  He\n       searches Davidov and finds a set of keys in his pocket.  He\n       opens the lock.\n\n       INSIDE THE BRIEFCASE:  FOUR STACKS OF MONEY.  Documents\n       headed with the official crest of Miratom.  A new security\n       tag, it looks just like the dead guy's, but has Davidov's\n       name and picture...some hologrammed (blank) security tags --\n       and a polaroid-type camera.\n\n       He picks up a blank security tag and inserts it in the\n       camera.  Points at himself, takes a shot.  Punches in\n       'Davidov' on the KEYPAD.  Out comes a brand new pass.\n\n       Bond goes to look in the dufflebag but...\n\n       A PLANE is approaching...HE LOOKS UP.\n\n       HIS P.O.V.  A Russian military jet appears over the trees,\n       flying low, its red landing lights blinking.\n\n       EXT. AIRSTRIP - NIGHT\n\n       A door opens on the sinister-looking plane.  A hydraulic step\n       unit folds out of it.  A BIG SOLDIER with a machine gun waits\n       in the doorway.\n\n       BOND, standing at the edge of the runway, clips on his badge\n       and picks up the briefcase.  He has NO IDEA what he's walking\n       into.\n\n                           BOND\n                 Here goes nothing.\n\n       He hoists the dufflebag over his shoulder and walks out to\n       the plane.  He starts up the steps:\n\n       THE SOLDIER POINTS HIS GUN DOWN AT HIM. Says something to him\n       IN RUSSIAN.\n\n       Bond pauses.  And then, thinking, says:\n\n                           BOND\n                 Romashka.\n\n       The soldier looks at him, then lowers his weapon.\n\n       INT. PLANE\n\n       Four soldiers. The first guy and a moustachioed PILOT and two\n       young men, a nasty-looking private, cadaverously thin, and a\n       big, thick-necked tough.\n\n       They all look at Bond, expectantly, waiting for him to say or\n       do...what? He decides to take the lead. He opens the\n       briefcase and hands over the STACKS OF MONEY.\n\n       The Pilot passes it out. But that isn't the end. They still\n       stare at him.  The Pilot says something IN RUSSIAN that\n       sounds like...\"where's the rest?\"\n\n       Bond swallows.  Thinks, without showing it.  He decides to\n       OPEN THE DUFFLE BAG.  He looks inside. Pauses, then reaches\n       in and takes out...A BOX OF NIKE SHOES.\n\n       The thin soldier smiles. That's the ticket. Bond hands out\n       shoes to the rest of the guys.\n\n                                                            CUT TO:\n\n       EXT. TEST FACILITY - KAZAKHSTAN - DAWN\n\n       A red dawn.  Dominating the landscape, a valley of weirdly-\n       shaped rocks. To one side, an airstrip.  The plane\n       approaching.\n\n       INT. PLANE - LANDING\n\n       The three soldiers wear their new shoes and smoke and chat\n       amongst themselves.\n\n       Bond sits in the rear of the plane, which is dominated by\n       heavily buffered receptacles, clearly awaiting some deadly\n       cargo. There is Russian writing everywhere, and one symbol he\n       clearly recognizes:  DANGER - RADIOACTIVE.\n\n       Bond looks out of the window.  Beneath a huge MESA, a huddle\n       of low buildings.\n\n       They come to a stop near the end of the runway.  A SMALL JEEP\n       is driving out to them.\n\n       One of the soldiers throws something to Bond. An ORANGE\n       JUMPSUIT that says Miratom on the breast.  He catches it.\n\n                           PILOT\n                     (subtitles)\n                 You have fifteen minutes.\n\n       EXT. AIRSTRIP/VALLEY/TEST FACILITY - KAZAKHSTAN - DAWN\n\n       Bond, in the orange overalls and wearing his ID tag, is\n       driving with a Russian soldier through the weird rock valley -\n       -\n\n       KABOOM!\n\n       A cloud of dust from a detonation rises up on the other side\n       of the hill.\n\n       EXT. TEST FACILITY - KAZAKHSTAN - DAY\n\n       They turn the corner and see trucks marked IDA, several\n       Kazakhstan army personal carriers, soldiers dotted around,\n       IDA (International Decommissioning Agency) scientists and\n       personnel quietly going about their business.  A vast\n       protective 'bubble' is inflated at the front of the building.\n\n       INT. 'BUBBLE' - TEST FACILITY - KAZAKHSTAN - DAY\n       (CHRISTMAS JONES') POV:\n\n       The sound of breathing LOUD, we're looking from inside the\n       visor of a protective suit.  It's hard to tell what's going\n       on, but our hands are removing a sphere of cobalt blue\n       plutonium from inside a corroding WARHEAD...\n\n       EXT. FACILITY - SAME\n\n       An officer eyes Bond's pass.\n\n                           COLONEL AKAKIEVICH\n                     (subtitles)\n                 You are late. The transport documents?\n\n       Bond shows him the case.  Akakievich examines the documents.\n\n                           COLONEL AKAKIEVICH\n                     (subtitles)\n                 They are waiting for you below.  It\n                 should be ready. Check with the IDA\n                 physicist.\n\n       He points toward the \"bubble.\"\n\n       Inside the transparent bubble, a protective-suited FIGURE\n       finishes placing a blue PLUTONIUM CORE into a box.\n\n       As Bond and the Colonel walks toward the bubble, the FIGURE\n       steps out, still enveloped in the white protective suit.\n\n       Moving fast, off comes the helmet to reveal a BEAUTIFUL\n       AMERICAN GIRL.  CHRISTMAS JONES is mid-twenties, shortish\n       hair, hot right now.  In one movement she unzips and steps\n       out of the suit, revealing a khaki sports bra, cut-off\n       shorts, heavy duty boots.  A nasty-looking hunting knife\n       strapped around her hips.  She has a deep tan and an\n       incredible figure.\n\n       She grabs a bottle of water, guzzles.\n\n       Bond tosses an arched brow to Akakievich, who nods bitterly,\n       also unable to take his eyes off her.  He spits on the floor\n       and speaks in ENGLISH, so Christmas can hear.\n\n                           COLONEL AKAKIEVICH\n                 Not interested in men. Take my word for\n                 it.\n\n       Akakievich isn't exactly what you'd call a looker.  Bond\n       offers a disappointed tut as Akakievich walks away.\n\n       Christmas approaches.  He notices her IDA tag -- and an\n       incongruous PEACE TATTOO just above her hip. She's checking\n       him out as well.\n\n                           CHRISTMAS\n                 You new?\n\n                           BOND\n                     (Russian accent)\n                 Yes. Viktor Davidov, Miss...?\n\n                           CHRISTMAS\n                 Doctor. Jones. Christmas Jones.\n                 No jokes, I've heard them all.\n\n                           BOND\n                 Don't know any doctor jokes.\n\n       She is wary.  It's been a long time since a man this\n       attractive stepped onto her beat. They walk toward the\n       building.\n\n                           CHRISTMAS\n                 What happened to Len Tashka?\n\n                           BOND\n                 Couldn't make it. Splitting headache.\n\n                           CHRISTMAS\n                 The soldiers may give you a hard time.\n                 Whatever. If we weren't around, they'd\n                 have their whole nuclear arsenal lying by\n                 the roadsides, rotting in the sun.\n\n       Bond looks at the ominous radiation WARNING SIGNS.\n\n                           BOND\n                 Will I need protection?\n\n       She squints at him, taken aback.\n\n                           CHRISTMAS\n                 There's no radiation danger down there.\n\n       Bond turns to go, knowing he misstepped.  Christmas then\n       speaks to him, asking a question, IN RUSSIAN.\n\n                           CHRISTMAS\n                     (subtitles)\n                 Where is this stockpile going?\n\n       Bond turns, answers IN PERFECT RUSSIAN.\n\n                           BOND\n                     (subtitles)\n                 To the nuclear facility at Penza 19.\n\n       She nods. Watches him disappear into the building.\n\n       INT. TEST CHAMBER MAIN ELEVATOR - MOMENTS LATER\n\n       Bond descends, going down deep.\n\n       INT. TEST CHAMBER ELEVATOR/CORRIDOR - LATER\n\n       The elevator creaks to a halt.  He slides the elevator doors\n       OPEN revealing...\n\n       TWO SOLDIERS waiting for the elevator. Bond shows them his\n       ID.\n\n                           SOLDIER\n                     (subtitles)\n                 See the corporal, at the end of the\n                 chamber.\n\n       The soldiers get into the elevator and disappear, leaving\n       Bond completely ALONE.\n\n       Dead silence in the shadows.  Bond's in his element, that\n       alert glint in his eye as he takes in his surroundings.\n\n       HIS P.O.V.  A long, dark corridor...leading off to a more\n       open circle in the distance, lights and an ominous humming\n       there.\n\n       Bond starts down the passageway.\n\n       INT. TEST CHAMBER - CONTINUOUS\n\n       Ahead of Bond, like a deadly spider at the centre of a web, a\n       NUCLEAR BOMB suspended over a pit.\n\n       Blast openings range around to channel its fury to measuring\n       equipment.\n\n       Bond is alone with the bomb. An eerie moment. Then, he comes\n       to notice a figure, across the expanse of the pit, on the\n       opposite side of the catwalk, a man, with his back to him, in\n       Russian Army fatigues.\n\n                           BOND\n                 Corporal?\n\n       The man turns...\n\n       IT IS RENARD.\n\n       He smiles.\n\n                           RENARD\n                 I see my friend Davidov ran into some\n                 difficulty.\n\n                           BOND\n                 Indeed.\n\n       Renard starts toward him.  Bond draws his gun.\n\n                           BOND\n                 Don't come any closer.\n\n                           MAN\n                 You can't kill me. I'm already dead.\n\n       He and Bond face off, the malevolent bomb between them, a\n       ROBOT DEVICE beginning to lower it into the pit.\n\n                           RENARD\n                 Go ahead.  Shoot.  My men will still\n                 steal the bomb, and the shot will bring\n                 them directly to you.\n\n       Renard gestures into the pit.\n\n       BOND'S P.O.V.  TWO OF RENARD'S MEN in the pit, unaware of\n       what is happening above, working directly with the bomb. One\n       of them is using a manual...IT IS JUST LIKE THE STOLEN\n       REPORT, the Miratom seal in the corner.\n\n       Bond aims his gun at Renard's head.\n\n                           BOND\n                 Who's paying you to destroy the pipeline?\n\n       Renard resumes walking, around the catwalk at the edge of the\n       pit, toward Bond, slowly, surely, totally fearless.\n\n                           RENARD\n                 To die by a man who can't even grasp what\n                 he's caught up in...\n\n       Bond, out of the corner of his eye, sees Renard's man remove\n       a SMALL DEVICE from inside the bomb.  It is the size and\n       shape of a credit card, black, with shiny transistors on\n       it...the man slips it into his pocket.\n\n                           BOND\n                 Revenge isn't so hard to fathom. What's\n                 clever is getting someone else to pay for\n                 it.\n\n                           RENARD\n                 Not many people in this world have that\n                 kind of fortune.\n\n       Bond cocks the pistol.\n\n                           BOND\n                 Who is it?\n\n                           RENARD\n                 You think I fear death? I welcome it. I\n                 get on my knees and pray for it. You, on\n                 the other hand, you have something to\n                 live for, no?\n                     (closer now)\n                 She's beautiful isn't she? You should\n                 have seen her before. Flawless, and still\n                 so innocent, not such a whore in bed...\n\n       Bond's eyes flare in fury.  He shoves Renard into the wall\n       and presses the gun to his temple.\n\n                           BOND\n                 You will never touch her. You will never\n                 get near her.\n\n                           RENARD\n                 Have you forgotten who saved your life in\n                 Geneva?\n\n                           BOND\n                 Consider me ungrateful.\n\n                           RENARD\n                 It's I who should thank you -- for taking\n                 that money back to MI-6.  So distressing\n                 for M.  An explosion inside her lair.\n\n                           BOND\n                 She'll get over it.\n\n                           RENARD\n                 You even brought the plane for us.  We\n                 really couldn't have done it without you.\n\n       Bond strikes him across the temple with his pistol.  Renard\n       drops to his knees.  He touches his temple, looks at the\n       blood curiously, feeling no pain.\n\n                           RENARD\n                 A man tires of being executed.\n\n       As Bond screws a silencer onto the muzzle of his gun:\n\n                           RENARD\n                 But then again...There is no point in\n                 living if you can't...feel alive.\n\n       Bond knows that, he's heard it somewhere before...IT FREEZES\n       HIM, just a beat, but it is enough...\n\n       SUDDENLY, the noise of footsteps -- CHRISTMAS JONES, with\n       COLONEL AKAKIEVICH and two armed soldiers.\n\n       We're with them as they turn the corner of the passageway and\n       see Bond with silenced pistol aimed at the kneeling Renard --\n       classic execution stance:\n\n                           COLONEL AKAKIEVICH\n                     (to Bond)\n                 Drop your gun.\n\n                           BOND\n                 Keep away, Colonel.\n\n       The soldiers' guns are trained on Bond.\n\n                           CHRISTMAS\n                 He is an impostor.\n                     (clutching a printout)\n                 There's no Davidov at Miratom.\n\n                           BOND\n                 Here's your imposter. He's paid off the\n                 men on the plane outside.  They're not\n                 taking the bomb to any Russian facility,\n                 they're flying it wherever he tells them.\n\n       Christmas is listening, but Akakievich cocks his rifle.\n\n                           COLONEL AKAKIEVICH\n                     (to Bond)\n                 I said drop it.\n\n       And he means business.  Bond delays ... but has no choice.\n       He pulls the clip from his gun, tosses it down.\n\n                           RENARD\n                     (to Christmas)\n                 Well done -- he would have killed us all.\n                 I suppose you\n                     (to Akakievich)\n                 were you the one who allowed him down?\n\n       Colonel Akakievich looks suitably stung.  But Renard is\n       looking past him now, as with a quiet WHIRR, the BOMB raises\n       into view on a trolley.  Renard's team is ready to move.\n\n                           RENARD\n                     (to Akakievich)\n                 Take him away, I don't want him around as\n                 we move the bomb.\n                     (whispered, to Bond)\n                 You had me.  I knew you couldn't shoulder\n                 the responsibility...\n\n       And Renard jams his hand onto Bond's shoulder, squeezing his\n       collar-bone hard...  Pain jolts through Bond, he drops to his\n       knees in agony. He shoves Bond down.  Bond's hand goes to his\n       shoulder, his mind now racing -- how did he know to hurt him\n       there?\n\n       Renard's men start to maneuver the bomb toward the curving\n       passageway.  It's all too much for Colonel Akakievich:\n\n                           COLONEL AKAKIEVICH\n                 No -- the bomb does not go anywhere until\n                 I am satisfied.  All of you to the\n                 surface, now...\n\n       Renard stops and turns.  Bond sees him nod to two of his men:\n       one quietly slopes off down the tunnel.  The other innocently\n       opens a container...\n\n       INT. CONTAINER\n\n       Camera shows the INSIDE of the container's lid; the man\n       releases a false lining to reveal several MACHINE GUNS...\n\n       INT. TEST CHAMBER - DAY\n\n                           RENARD\n                     (urgent now)\n                 Very well, Colonel. We will all go up.\n\n       One of Colonel Akakievich's men gestures with his gun that\n       Bond should get up.  Knowing it's now or never, Bond PUSHES\n       him away, yanks a PISTOL from his holster, GRABS Christmas,\n       LEAPS down into the bomb PIT just as\n\n       RENARD'S MEN open fire...  Akakievich dies straight away.  So\n       do two of his men.  The gunfire RICOCHETS around the chamber\n       and ceases.\n\n       Renard hangs back.  His radio crackles a message:\n\n                           RENARD\n                     (nods, into radio)\n                 Shut them.\n\n       THE GUY ON THE OTHER END OF THE RADIO\n\n       Right next to the ELEVATOR.  He turns a switch that activates\n       two sets of red buttons and two sets of green.\n\n       He punches one green button...\n\n       INSIDE TEST CHAMBER\n\n       Heavy doors close all exits but that to the tunnel.\n\n       INT. THE PIT\n\n       Bond and Christmas know they are being sealed in.\n\n                           CHRISTMAS\n                 Melt-down doors.  If he gets them closed,\n                 they won't be opened again for forty-\n                 eight years.\n\n       Bond peers over the edge -- sees Renard and his men working\n       the nuclear device into THE PASSAGEWAY.\n\n       INT. THE PIT\n\n       If Bond doesn't get through now, they're trapped forever.  He\n       points his wrist watch toward the cat walk above and presses\n       a button...THE TINY GRAPPLING HOOK shoots out, Q's super\n       filament wire that can hold up to 800 pounds is\n       attached...Bond uses the rope to RAPPEL UP THE SIDES OF THE\n       PIT and into\n\n       INT. TEST CHAMBER\n\n       Where he LEAPS ON TOP OF Renard's last man.  They fall\n       THROUGH THE IRIS, it SHUTS behind them.  The man swings his\n       machine gun at Bond -- it hits the wall next to him, breaks\n       apart.  Bond grabs a broken section and kills him with one\n       strike.\n\n       He pauses at his dead body and reaches into his jacket,\n       retrieving...THE CARD-LIKE DEVICE.\n\n       INT. PIT\n\n       Christmas looks around, desperate to help.  Using Bond's\n       wire, she climbs up to the CLOSED IRIS DOOR.  She pries open\n       a panel next to it and reveals complex WIRING...\n\n       INT. PASSAGEWAY\n\n       Up ahead of Bond, the bomb disappears down the passageway. He\n       can see it is attached to A PULLEY above, helping the men to\n       move quickly, Renard, pulling, the two men pushing\n\n       Renard signals one of them to drop back to cut off Bond...\n\n       Machine-gun fire turns the wall next to Bond to dust -- Bond\n       dives to a recess.  An overhead LIGHT SHATTERS.  His section\n       of the tunnel darkens.\n\n       INT. PASSAGEWAY - BOND'S END\n\n       Bond looks up at the broken LIGHT.  Takes careful aim at the\n       next one along.  BLAM.  It disintegrates.  Again...\n\n       INT. PASSAGEWAY - RENARD'S END\n\n       The other guy answers with another spray of bullets.  Watches\n       uneasily as Bond takes out light after light.  A funnel of\n       darkness coming to swallow him -- concealing Bond's approach.\n       Nervous, he fires, muzzle flash and sparks illuminating the\n       void.  To keep it lit, he keeps firing...\n\n       INT. PASSAGEWAY\n\n       WITH BOND as the bullets cease with a loud CLICK...  What\n       Bond was waiting for.  He moves.  The gunman frozen in the\n       light, grappling to fit another clip --\n\n       BLAM!  He goes down.  Bond not wasting bullets.\n\n       INT. OTHER END OF PASSAGEWAY\n\n       Renard is loading the bomb it into the ELEVATOR. He flicks a\n       switch on the panel by the elevator.  The IRIS starts closing\n       on Bond...\n\n       INT. PASSAGEWAY\n\n       Bond rushes for the door -- but he's shocked as the man he\n       shot lunges.  Clings to him.\n\n       Bond hits him away, he LEAPS for the cart blocking his way\n       and SHOVES IT INTO THE IRIS DOOR just as it almost closes...\n\n       Bond squeezes through...\n\n       INT. OTHER SIDE OF IRIS\n\n       Renard is getting in the ELEVATOR.  Sees Bond made it, fires.\n       Bond rolls into a corner.\n\n                           RENARD\n                 We have our fireworks.  Now you can have\n                 yours.\n\n       And he machine-guns some barrels.  Rocket fuel spills out.\n       He digs a finger into one of the holes, effortlessly rips the\n       metal so more fuel cascades out.\n\n                                                            CUT TO:\n\n       INT. CATWALK ABOVE PIT\n\n       Christmas cuts some wires together and with a hum, her IRIS\n       DOOR OPENS...\n\n       AT THE ELEVATOR\n\n       Bond fires at Renard, hitting his shin...\n\n       WITH RENARD\n\n       looking down at his shin, noticing the blood.  Inconvenienced\n       but not in pain.  He shuts the cage doors.  Pauses only to\n       fire off half a clip at the SWITCH PANEL.  Shreds it.\n\n       Bond leaps to his feet, racing forward, firing -- gets to the\n       elevator as Renard disappears upwards with a smile. He POINTS\n       DOWN...underneath him...\n\n       Bond looks down.\n\n       HIS P.O.V.  BENEATH THE ELEVATOR...A makeshift explosive\n       device...sticks of dynamite wrapped around a detonator, set\n       to explode\n\n       Eyes wide, Bond looks back to the doors -- then to the switch\n       panel -- now just a chaos of sparking wires.\n\n       INT. LIFT SHAFT\n\n       The pipe bomb ticking...\n\n       INT. PASSAGEWAY BY ELEVATOR\n\n       Bond is trapped.  He looks up...\n\n       THE PULLEY HOOK HANGS DOWN...\n\n       He jumps up, grabbing it, just as...\n\n       KABOOM!\n\n       The bomb ignites the spilled oil, A FIREBALL shoots along,\n       scorching after Bond, who is SAILING THROUGH THE PASSAGE WAY,\n       the force of the blast sending him hurling down the\n       passageway ON THE PULLEY...heading straight for:\n\n       A CLOSED IRIS DOOR which miraculously begins to OPEN as he\n       SHOOTS THROUGH...\n\n       Ahead, the next door is OPEN as well. He sees CHRISTMAS on\n       the other side...\n\n       HER P.O.V.  Bond hurtling toward her, ahead of a MASSIVE\n       FIREBALL...\n\n                           BOND\n                 Close the door!  Close the door!\n\n       But before she can, two of the FUEL BARRELS HURTLE through\n       the closing iris, clattering into the pit, starting a fire\n       below.\n\n       Flames licking up the sides of the pit toward them.\n\n       Bond looks up, sees the ARM OF THE ROBOT LIFTER, stretching\n       upward toward an old SHAFT t the top of the ceiling...\n\n       He and Christmas scramble up the robot arm, walk along the\n       spider-like web that supported the bomb and find...\n\n       AN OLD ELEVATOR...powered by a hydraulic system...\n\n       They get in...hear the rumbling of the fire below...the old\n       elevator moves slowly...the rumbling grows louder...\n\n                           BOND\n                 Shame you had to spot I wasn't the real\n                 thing.\n\n                           CHRISTMAS\n                 So who are you?\n\n                           BOND\n                 Bond --\n\n       Bond FIRES HIS GUN at the hissing hydraulic pulleys and...\n\n       THE ELEVATOR shoots through the shaft at breakneck speed as\n\n       BELOW THEM...THE PIT EXPLODES...\n\n       INT. ELEVATOR\n\n       Fire shoots up. Bond lunges to cover Christmas. As the smoke\n       clears:\n\n                           BOND\n                     (finishing)\n                 James Bond.\n\n                                                            CUT TO:\n\n       EXT. MESA - TEST FACILITY - KAZAKHSTAN - CONTINUOUS\n\n       Christmas and Bond climb out of the duct.  Through a cloud of\n       dust he can see people running about, panicked.  There's been\n       some shooting -- fresh corpses litter the ground.\n\n       Bond looks past them to a plane coming this way.  The plane.\n       It roars past, level with them.  He follows it with his eyes,\n       helpless as it gets smaller and smaller...\n\n                           CHRISTMAS\n                 They won't get far. Every warhead has a\n                 locator card.  A Miratom device.  Emits a\n                 high-pitched signal on Russian emergency\n                 frequencies. We can track the bomb.\n\n                           BOND\n                 With this?\n\n       Bond removes the locator card from his jacket and shows it to\n       her.  It flashes in the sun.\n\n       Christmas shakes her head, disgusted.\n\n       OMITTED 170 - 172\n\n                                                          DISSOLVE:\n\n       INT. BRIEFING ROOM, CASTLE THANE (MI-6 HQ) - DAY\n\n       Busy.  Analysts huddle over monitors showing satellite\n       images, trying to track the plane.\n\n                           M\n                 Do we have the range of Renard's plane?\n\n                           TANNER\n                 Anywhere in this circle.  Iran, Iraq,\n                 Pakistan, Syria, Afghanistan...\n\n                           M\n                 Marvellous.\n\n       Moneypenny enters...\n\n                           MONEYPENNY\n                 Elektra King is calling from Baku.\n\n       M is surprised.\n\n                           MONEYPENNY\n                 It's a video line.\n\n                           M\n                 Put her on the wide screen.\n\n       The face of ELEKTRA materializes on a large WALL MONITOR.\n\n                           ELEKTRA\n                 I'm sorry. I would never call you\n                 except...Bond's disappeared. He...he left\n                 my villa, some time in the middle of the\n                 night and...\n\n       M exchanges a look with Tanner.\n\n                           ELEKTRA\n                 My head of security has been found near a\n                 local airstrip, murdered...\n\n       M leans on the console in front of her.\n\n                           M\n                 I'll send someone out.\n\n                           ELEKTRA\n                 Could...could you come?\n\n       M looks up.\n\n       ELEKTRA, on the monitor, looks about as lost as she ever has.\n\n                           ELEKTRA\n                 I just can't help thinking...I'm next.\n\n       M stares at the girl's face, her whole sordid history written\n       there.  M turns away from the screen and says to Tanner...\n\n                           M\n                 Get me out there.\n\n\n       OMITTED:174 - 201\n\n       EXT. ELEKTRA'S VILLA, BAKU - STORM APPROACHING\n\n       Elektra's villa against blue-black storm clouds, the Caspian\n       choppy, wind blowing.\n\n       INT. ELEKTRA'S VILLA - BAKU - DAY\n\n       Elektra works in her father's STUDY, illuminated by a halo of\n       light from a single desk lamp. Pictures of her grandfather\n       and father stare down at her from the walls. The wind BLOWS A\n       WINDOW open.\n\n       She gets up, crosses the room, shutting the window.  She\n       stands there, listening to the silence and then...\n\n       SHE HEARS A THUD. A strange, unsettling thud.\n\n       She listens, a long time, to the silence.\n\n                           ELEKTRA\n                 Gabor...?\n\n       She goes to the door, opens it...it whines on its hinges.\n       She steps into...\n\n       INT. LIBRARY\n\n       A big room lined with books. Three french doors lead out to a\n       balcony.  She walks a few paces in...\n\n       THE DOOR SHUTS BEHIND HER, she whirls...\n\n       GABOR, propped up behind the door, stares, wide-eyed, before\n       he FALLS TO THE FLOOR.\n\n       Elektra gasps, she turns again...\n\n       A DARK FIGURE LOOMS, a shadow against the windows.  He moves\n       forward, his face becoming visible...IT'S BOND.\n\n                           ELEKTRA\n                 James!\n\n       She stares at him, shocked, hesitant.\n\n                           BOND\n                 You look surprised.\n\n       She moves to Gabor, gets down to help him.  He stirs, he is\n       alive, but unconscious. Elektra looks up at Bond.\n\n                           ELEKTRA\n                 What's wrong with you?  Are you crazy?\n\n                           BOND\n                 A little. Does it matter? After all,\n                 what's the point of living if you can't\n                 feel alive?  Isn't that right, Elektra?\n                 Isn't that your motto?\n\n                           ELEKTRA\n                 What are you talking about?\n\n                           BOND\n                 Or did you steal it from your old friend\n                 Renard?\n\n                           ELEKTRA\n                 ...what?\n\n                           BOND\n                 We had a run-in, he and I. He knew about\n                 us, he knew about my shoulder, he knew\n                 exactly where to hurt me...\n\n       Elektra stands...she begins to tremble.\n\n                           ELEKTRA\n                 Are you saying...Renard is the man who's\n                 trying to kill me?\n\n                           BOND\n                 You can drop the act, it's over.\n\n                           ELEKTRA\n                 I don't know what you're talking about!\n\n                           BOND\n                 I think you do.\n\n       He walks toward her, threatening...\n\n                           BOND\n                 At MI-6 we call it Stockholm Syndrome.\n                 It's common in kidnappings.  A young\n                 impressionable victim. Sheltered,\n                 sexually inexperienced. A powerful\n                 kidnapper skilled in torture, in\n                 manipulation. Something snaps in the\n                 victim's mind. The captive falls in love\n                 with her captor.\n\n       At the word \"love,\" Elektra explodes.  She SLAPS an\n       unsuspecting Bond hard across the face.\n\n                           ELEKTRA\n                 How dare you!  How dare you! That\n                 animal!?  That monster!? He disgusts me!\n                 You disgust me!  So he knew where to hurt\n                 you, is that it? You had a sling on your\n                 arm at the funeral! I didn't have to\n                 sleep with you to find that out.\n\n                           BOND\n                 He used your exact words.\n\n                           ELEKTRA\n                 You knew.  You knew all the time, that he\n                 was out there, that he was coming for me,\n                 and you lied. You used me, you used me as\n                 bait. You made love to me -- what, to\n                 pass the time as you waited for him to\n                 strike?\n\n       He has no answer.  He can't deny what she says.\n\n       The phone rings, cuts through the tension.  Bond and Elektra\n       staring at one another.  She lets it ring...  Then picks up.\n       Listens, looks to Bond.\n\n                           ELEKTRA\n                 He's struck again.\n                     (beat)\n                 Five men are dead at the pipeline.\n\n       He moves toward her.\n\n                           BOND\n                 I'm coming with you.\n\n                           ELEKTRA\n                 You do what you have to do, but I've\n                 called in M.  She's en route from London\n                 even now.\n\n                                                            CUT TO:\n\n       EXT. PIPELINE CONTROL CENTER, TURKEY - DAY\n\n       The MI-6 chopper lands.  We can see M through the window.\n       Face set hard.\n\n       EXT. PIPELINE CONTROL CENTER, TURKEY - MOMENTS LATER\n\n       SCIENTIFIC, MILITARY and TURKISH POLICE VEHICLES parked\n       around a medium-sized industrial plant.\n\n       Bond accompanies M and Tanner toward a clutch of offices.\n       All around, SOLDIERS, IDA personnel, POLICE scour the area.\n\n                           M\n                     (to Bond)\n                 Glad to see you've turned up.\n\n       He is moving fast, talking fast -- a sense of urgency.\n\n                           BOND\n                 They hit about 90 minutes ago. There's a\n                 scientist here from the International\n                 Decommissioning Agency, Dr. Jones.  She\n                 has ten crews combing the area.\n\n       They step out of the bright sunlight and into\n\n       EXT.\\INT. CONTROL CENTRE - CONTINUOUS\n\n       FIVE BODY BAGS are being carried out by soldiers.  M surveys\n       the scene; in an unlit corridor CHRISTMAS JONES and several\n       men sweep the area with CLICKING Geiger counters.\n\n       ELEKTRA is a distance away, listening to a Turkish policeman\n       explain what's happening.  She nods acknowledgement to M.\n\n       Tanner senses that Bond wants to talk to M alone:\n\n                           TANNER\n                 I'll see how they're coming with the\n                 power...\n\n       They watch him go.  M turns to Bond:\n\n                           M\n                 You had your hand on the bomb and you let\n                 Renard get away with it.\n\n       He draws her away, to a small alcove.  Takes something out of\n       his jacket...THE LOCATOR CARD.\n\n                           BOND\n                 The report King bought. It's a manual.\n                 Renard's men used it to remove this radio\n                 tracking device from the warhead.\n\n                           M\n                 Then Robert was right about a Russian\n                 connection.\n\n                           BOND\n                 They're getting their weapons from the\n                 Russians, but where are they getting the\n                 money to buy the weapons?  I can't help\n                 thinking...the person close to King, the\n                 one who switched that pin...\n\n                           M\n                 The inside man?\n\n                           BOND\n                 Is maybe...the inside woman.\n\n       NOW THE LIGHTS POWER UP, disrupt the intimacy and intensity\n       of their exchange.  The room is lined with MONITORS and a\n       huge SATELLITE MAP of the pipeline's meandering path.\n\n                           M\n                 A woman?\n\n       But before he can speak, ELEKTRA calls out, gesturing to A\n       DIM LIGHT flashing on a console in front of her.\n\n                           ELEKTRA\n                 That's not right.\n\n       A Technician comes over.  Tanner too, followed by Bond and M.\n\n                           TANNER\n                 What is it?\n\n                           ELEKTRA\n                 It's an observation and repair rig.\n                 Travels along the pipe, checks for broken\n                 seals.  But it's not supposed to be\n                 there.\n\n                           BOND\n                     (thinks)\n                 Stop it.\n\n       The Technician flicks two switches.  The light continues to\n       flash.  Confused, he tries others.  No change.\n\n                           TECHNICIAN\n                 I don't understand...\n\n                           M\n                 Where is the rig?\n\n       Harried, the Technician activates the wall schematic of the\n       pipeline.  A pulse of light travels along the line. And with\n       it, a sense of horror descends...\n\n                           M\n                 The parcel's in the post.\n\n                           TANNER\n                 It's heading for the oil terminal.\n\n                           M\n                 Where it can do the most damage.\n\n                           ELEKTRA\n                 My God.\n                     (to one of her men)\n                 Have the terminal evacuated.\n\n       The man gets on the phone...\n\n                           BOND\n                     (to Tech)\n                 Speed?\n\n                           TECHNICIAN\n                 Full on.  Seventy miles an hour.\n\n       He punches buttons. Christmas has come, stands next to Bond.\n\n                           TECHNICIAN\n                 One hundred and six miles from the\n                 terminal.\n\n                           BOND\n                     (quick)\n                 It'll reach the other end in seventy-\n                 eight minutes.\n                     (to Tech)\n                 Any more of these rigs?\n\n       The Technician checks his records, looks up, nods.\n\n                           TECHNICIAN\n                 There's one parked in the passageway\n                 ahead of it.\n\n       Decisive, Christmas heads for the door, turns to her team:\n\n                           CHRISTMAS\n                 I'll need some help...\n\n       Her IDA colleagues look sheepish.  Bond moves to her.\n\n                           BOND\n                 Come on.\n\n       For just a moment, Christmas looks wary:\n\n                           BOND\n                 Unless you'd like to see my ID first.\n\n       She almost smiles.\n\n       M nods to Tanner to follow them.  Bond doesn't look at\n       Elektra.  But she watches him go...\n\n                                                            CUT TO:\n\n       EXT. HELICOPTER - DAY\n\n       The MI-6 helicopter swoops along the pipeline...\n\n       Tanner is beside the pilot.  Bond and Christmas in the back.\n\n       They look at one another, the danger ahead melting the frost\n       between them.\n\n       INT. PIPELINE - LATER\n\n       Bond and Christmas climb through an access hatch down onto\n       the electric RIG.  Its lights blaze fifty yards into the\n       tunnel.  Then darkness.\n\n       Christmas takes the driver's spot, Bond the rear, nearest to\n       the approaching BOMB.  Tanner leans in:\n\n                           TANNER\n                     (sealing them in)\n                 Good luck.\n\n       Bonds nods, checks his watch.  Christmas looks nervously down\n       the pipe.\n\n                           BOND\n                 Be one along any minute.\n\n       And she starts the machine off...\n\n       INT. ELECTRIC RIG - PIPELINE (TRAVELLING)\n\n       It quickly picks up speed, its lights flooding the seemingly\n       endless pipe before them.\n\n       Christmas looks behind, apprehensive.  Waiting for the lights\n       of the explosive rig.\n\n       It's tense.  They travel along, expectant...\n\n                           BOND\n                 When this is over we should bury the\n                 hatchet. Celebrate. A champagne dinner?\n\n                           CHRISTMAS\n                 When this is over our bodies may be blown\n                 to smithereens.\n\n                           BOND\n                 Alright then, brunch.\n\n       His lightness relaxes her, she appreciates it.\n\n\n       INT. COMMAND ROOM - PIPELINE CONTROL CENTRE - CONTINUOUS\n\n       Elektra, M, and others. The room is crowded with concerned\n       personnel.  M watches the two blips on the schematic getting\n       closer together. One of her MEN approaches, a radio in his\n       ear.\n\n                           RADIO MAN\n                 Tanner reports Bond is headed for the\n                 rendezvous.\n\n                           M\n                 Excellent. Evacuate Miss King and the\n                 others.\n\n                           ELEKTRA\n                 You can evacuate my workers, but I'm not\n                 going anywhere.\n\n       M looks at her, then nods, impressed by her courage.\n\n       INT. PIPELINE (TRAVELLING) - DAY\n\n       Bond and Christmas waiting expectantly.  Tense silence.\n\n       Finally, a WHOOSHING NOISE, GETTING LOUDER.  Lights appear\n       behind, reflecting on a bend, then... here it comes, the rig\n       tearing through the pipe.\n\n       Bond looks over his shoulder at Christmas'\n       speedometer...she's only at fifty...\n\n                           BOND\n                 Faster! Get our speed up!\n\n       Christmas presses forward...Bond turns, his feet OUT toward\n       the approaching rig...the lights getting closer... closer...\n\n       Bond's rig jolts as the other makes contact.  He cushions the\n       blow with his feet.  Both rigs moving together now, he CLIMBS\n       ONTO THE BOMB RIG...Puts out a hand, helps Christmas across.\n\n       The bomb sits there, daunting, deadly.\n\n                           CHRISTMAS\n                 Tactical fission device.  Low yield.\n\n       They look at one another, then set straight to work.\n\n       INT. COMMAND ROOM - PIPELINE CONTROL CENTRE - CONTINUOUS\n\n       The room is quiet, tense.  M and her two men, Elektra, Gabor,\n       the King TECHNICIAN and three armed security guards at the\n       doors. They are the only ones left.  Going down with the\n       ship...if it goes.  M and Elektra watch the two lights now\n       together on the console.  A tense silence.  Everyone's edgy.\n       Elektra perhaps a little more than the rest.  She exchanges a\n       glance with Gabor.\n\n       INT. ELECTRIC RIG - PIPELINE (TRAVELLING) - DAY\n\n       CLOSE INSIDE THE BOMB:  the timer.  1:45 MINUTES.\n\n       Bond's face betrays the difficulty of what they're\n       attempting.  The digital clock ticks down... 1:30, 1:29...\n\n       OMITTED 217-218\n\n       INT. PIPELINE - DAY\n\n       The rigs speed through the tunnel. Nothing to see.  But\n       WHOOSH!  As the rigs hurtle past...\n\n       INT. ELECTRIC RIG - PIPELINE (TRAVELLING) - DAY\n\n       The pipe suddenly dips.  They cling on as the machine bucks\n       like a rollercoaster.  Back on a straight...\n\n       Her brow furrows.\n\n                           CHRISTMAS\n                 The plutonium is missing.  They've taken\n                 the core!\n\n                           BOND\n                 Then it's no longer a bomb?\n\n                           CHRISTMAS\n                     (back to work, urgent)\n                 It's a bomb alright. We're still dead if\n                 the trigger charge goes off...\n\n       Bond's mind races in the ghostly light of the tunnel.\n\n       He stares at the timer:  0:44, 0:43...  Makes a decision.\n\n                           BOND\n                 Let it blow.\n\n       Christmas shoots a look, astonished.\n\n                           CHRISTMAS\n                 But we can stop it.\n\n       Taking her arm...\n\n                           BOND\n                 Let it blow.\n\n       She can't believe what he's saying. His eyes shoot to an\n       INSPECTION HATCH the lights illuminate up ahead.\n\n                           BOND\n                 Trust me.  Leave it.\n\n       He grabs her, wrenches her away from the bomb.\n\n       INT. PIPELINE - DAY\n\n       The rig zooms past the exit hatch -- Bond leaps off, taking\n       her with him.  They tumble along the pipe.  Agile, Bond\n       springs to his feet, pulls her up.  They run like hell for\n       the hatch, into the darkness...\n\n       EXT. PIPELINE - DAY\n\n       The pipeline.  A long beat, then...\n\n       KABOOM!!  A section of the pipe explodes, debris rocketing in\n       every direction.\n\n       As the smoke clears we see a fifty yard section of pipe has\n       been destroyed.\n\n       OMIT 223\n\n       INT. PIPELINE CONTROL CENTER - SAME\n\n       On the consoles, red concentric circles pulse outward from\n       the point of impact, emitting one, monotone BEEP....\n\n       The watchers are frozen, stunned, shocked. Gabor, a radio\n       earpiece in his ear, reports information.\n\n                           GABOR\n                 It wasn't nuclear...the bomb was a dud.\n                 The trigger charge blew out a fifty yard\n                 section of pipeline...\n\n                           M\n                 And Bond?\n\n       An agonizing beat. The alarm beep sputters and dies.\n\n                           GABOR\n                 Nothing.\n\n       M and Elektra share a look.\n\n                           ELEKTRA\n                 Do you think he's dead?\n\n       M can't answer.  She shakes her head.\n\n                           M\n                 We just have to wait.\n\n       M shifts. The hi-tech room is eerily lit by the pulsing red\n       lights on every screen, showing the explosion.\n\n                           ELEKTRA\n                     (to M)\n                 I have a gift for you.  Something that\n                 belonged to my father. He would have\n                 wanted you to have it.\n\n       M feels uneasy.\n\n                           M\n                 Perhaps this isn't the time...\n\n                           ELEKTRA\n                 Please.\n\n       She hands M a small box.  M unties the ribbon.\n\n                           ELEKTRA\n                 He often spoke of how...compassionately\n                 you advised him on the best course of\n                 action during my kidnapping.\n\n       M opens the box.  It is THE EYE OF THE GLENS...the heirloom\n       pin, the original.\n\n                           ELEKTRA\n                 It's very valuable, you know. I just\n                 couldn't let it explode with the rest of\n                 him.\n\n       M looks up, horrified, when:\n\n       GABOR AND ANOTHER SECURITY MAN SHOOT M'S TWO GUARDS IN THE\n       HEAD...point blank, cold blood.  The men fall.\n\n       M looks back at Elektra, a blood-curdling glare.\n\n                           ELEKTRA\n                     (to her men)\n                 Take her to the chopper.\n\n       EXT. PIPELINE - DAY\n\n       From on high we follow the snaking pipeline ... until it\n       disappears in a VAST, SMOULDERING BOMB CRATER.  Beyond, the\n       pipeline continues unperturbed.\n\n       Two TINY FIGURES on the banks of the crater.\n\n       CLOSE ON THEM\n\n       Bond and Christmas, very much alive.  She's angry.\n\n                           CHRISTMAS\n                 What the hell were you doing?  You nearly\n                 killed us!\n\n                           BOND\n                 I did kill us. She thinks we're dead.\n                 And she thinks she got away with it.\n\n                           CHRISTMAS\n                 What the hell are you talking about?\n\n                           BOND\n                 It's part of some plan. She dresses it up\n                 like a terrorist attack.  The explosion\n                 covers up the theft of the plutonium.\n\n                           CHRISTMAS\n                 Who's she?\n\n                           BOND\n                 Elektra King.\n\n                           CHRISTMAS\n                 Elektra King?  Are you insane?  This is\n                 her pipeline.\n\n                           BOND\n                 Makes her look even more innocent.\n\n                           CHRISTMAS\n                     (skeptical)\n                 What would she want with weapons grade\n                 plutonium?\n\n                           BOND\n                 I was hoping you could tell me.\n\n       Christmas stares at him.  Wheels turning.\n\n                           CHRISTMAS\n                 You steal an old bomb, small by today's\n                 standards, about the size of the one that\n                 destroyed Nagasaki, take the plutonium\n                 core out of it, intending to use it...\n                     (beat)\n                 To make a bigger, better bomb.\n\n       They're both chilled by the thought.\n\n                           CHRISTMAS\n                 I have to get after that core.  This is\n                 my ass.\n\n       She starts fiddling with the radio. Suddenly there's a\n       CRACKLE.\n\n                           TANNER\n                 Tanner to 007, do you read?\n\n       Bond grabs the radio.\n\n                           BOND\n                 Loud and clear.  I have to speak to M.\n\n                           TANNER\n                 She's gone.\n\n                           BOND\n                 What?\n\n                           TANNER\n                 She's disappeared.  And two of our men\n                 have been killed.\n\n       It impacts on Bond.  His eyes harden.\n\n                           CHRISTMAS\n                 What is it?\n\n                           BOND\n                 She just upped the stakes. All her chips\n                 are on the table now.  And M's life is\n                 part of the bet.\n\n       He looks out at the long stretch of pipeline, like a deadly\n       snake with the world for its bed.\n\n                           BOND\n                 I know I promised you champagne, but\n                 would you settle for caviar?\n\n                                                            CUT TO:\n\n       EXT. MAIDEN'S TOWER - BOSPHORUS - ISTANBUL - TWILIGHT\n\n       A boat puts in at an ancient tower in the middle of a vast\n       body of water (in fact, the Bosphorus).\n\n       Renard disembarks with several of his retinue, heavily laden\n       with bags and cases.  They enter the tower...\n\n       INT. MAIDEN'S TOWER - CONTINUOUS\n\n       A fantastic space:  stained glass windows cast myriad\n       patterns over elaborate tile and marble surfaces.  Pillars,\n       iron lattices, velvet drapes and flowers embroider the huge\n       room.\n\n       As they enter, Elektra swoops across the floor and into\n       Renard's arms.  He holds her.  She pushes him away.\n\n                           ELEKTRA\n                 You're hurting me.\n\n       He senses something different between them.  She tries to\n       hide it.\n\n                           ELEKTRA\n                 Brought me something?\n\n       He smiles, grabs a case off one of his men, opens it up,\n       pulls out a sphere of cobalt blue metal.\n\n       She looks at it with wary fascination.\n\n                           RENARD\n                 Go on.  It's safe.  Touch your destiny.\n\n       She traces a finger along the metal.  A flicker of wonder:\n\n                           ELEKTRA\n                 Warm.\n\n                           RENARD\n                     (pointed)\n                 Is it?\n\n       She's sensitive to his buried frustration:\n\n                           ELEKTRA\n                 I've brought something for you as well.\n\n       INT. ROOM - MAIDEN'S TOWER - MOMENTS LATER\n\n       Elektra opens a heavy door, she and Renard past through to...\n\n       A SMALL ROOM...a window set in the stone on one side.  The\n       other side is divided off by a WALL OF BARS, creating a cell\n       which now contains: M\n\n       The cell is bare, except for a camp bed in the corner. M\n       betrays no fear.  A quiet defiance burns in her.\n\n                           ELEKTRA\n                 Just as I promised.\n\n       Renard steps forward.  Bars separate him from M.\n\n                           RENARD\n                 My executioner.\n\n                           M\n                 Over-praise, I'm afraid.  But my people\n                 will finish the job.\n\n                           ELEKTRA\n                 Your people? Your people will leave you\n                 here to rot just like you left me. You\n                 and my father. He didn't think my life\n                 was worth the chump change he spent on a\n                 day at the stock market.\n\n                           M\n                 Your father...\n\n                           ELEKTRA\n                 Is nothing.  His kingdom he stole from my\n                 mother. The kingdom I will rightly take\n                 back.\n\n       Elektra leaves.  Renard is left alone with M.\n\n                           M\n                 She's insane.  Is that what you did to\n                 her?\n\n                           RENARD\n                 No. I'm afraid it is what you did.\n\n       He crosses close to the bars.\n\n                           RENARD\n                 When I took her she was...promise itself.\n                 So clever, so vibrant, so...full of life\n                 force. And you left her there, at the\n                 mercy of a man like me. You ruined her.\n                 For what?  To get to me? She is worth\n                 fifty of me.\n\n                           M\n                 For once, I agree with you.\n\n       He shakes his head, amused by her pluck.\n\n                           M\n                 So she used all that brilliance to get\n                 revenge on her father, on me.\n\n                           RENARD\n                 No. I wanted you. I wanted you for\n                 myself.\n\n       He takes something out of his pocket.  A small TRAVEL CLOCK.\n       He sets it.\n\n                           RENARD\n                 Since you sent your man to kill me, I\n                 have been watching time tick slowly away,\n                 marching inevitably toward my own death.\n                 Watch these hands, M. At noon tomorrow,\n                 your time is up. And I guarantee you...I\n                 will not miss.  You will die. Along with\n                 everyone in this city and the future of\n                 the West.\n\n       He places the clock on a tall stool, just out of reach\n       through her bars.  He leaves.  We hold on the clock:\n\n       Eight p.m.\n\n\n       EXT. CITY OF WALKWAYS - BAKU - DUSK (OLD SC. 174)\n\n       Valentin Zukovsky in the back of his chauffeured Rolls\n       Royce...  We PULL BACK, to take in an amazing sight:  the car\n       is on a network of raised walkways and platforms that extends\n       as far as the eye can see.  A decaying legacy of the Soviet\n       years.\n\n       EXT. CAVIAR FISHERY - CITY OF WALKWAYS - DUSK (OLD SC.175)\n\n       Zukovsky limps purposefully away from his Rolls along a\n       walkway leading to a Beluga fishery built over the water.\n\n       INT. CAVIAR FISHERY - CITY OF WALKWAYS - DUSK (OLD SC.176)\n\n       Nailed on the battered old door, the lid of a caviar jar, a\n       label illustrated with a LINE DRAWING OF ZUKOVSKY. Zukovsky\n       opens the door and finds himself...\n\n       Staring straight down Bond's pistol.  Bond and Christmas are\n       silhouetted by the gold dusk light.  At their feet lies one\n       of Zukovsky's workers.\n\n                           ZUKOVSKY\n                 What are doing, Bond?  Trying to impress\n                 this innocent thing?\n\n                           BOND\n                 She's no innocent.  This is my nuclear\n                 consultant.\n\n                           ZUKOVSKY\n                 Ah, I see.  A purely...plutonic\n                 relationship.\n\n       Hands held clear of his body, Zukovsky enters, his evening\n       dress decidedly out of place here.\n\n                           ZUKOVSKY\n                 Really Bond, couldn't you find a nice\n                 Russian scientist with hair growing out\n                 of his ears?\n\n                           BOND\n                 What's your business with Elektra King?\n\n                           ZUKOVSKY\n                 I thought you were the one in her\n                 business.\n\n                           BOND\n                 She dropped a million and half dollars to\n                 the House -- your House. And you didn't\n                 even bat an eyelid.  She was paying you\n                 off.  What for?\n\n                           ZUKOVSKY\n                 As ever you are the spy who has to see a\n                 plot wherever he looks.\n\n       Bond SLAMS Zukovsky hard against a vat of caviar.  Wood\n       splits, roe spills onto the floor.  Zukovsky is appalled.\n\n                           ZUKOVSKY\n                 That is 5,000 dollars of Beluga ruined!\n\n                           BOND\n                 You are out of your league.  She's\n                 working with Renard.\n\n       Christmas moves in, intense but firm:\n\n                           CHRISTMAS\n                 They've stolen a nuclear device.\n\n       A subtle change in Zukovsky's countenance.\n\n                           BOND\n                 Tell us what you know, Zukovsky.  Tell\n                 us, before its too late.\n\n       But it may be already:\n\n       The SOUND OF A HELICOPTER.  Zukovsky frowns, the SOUND\n       GETTING LOUDER --\n\n       Bond is the first to move as --\n\n       INT. CAVIAR FISHERY - NIGHT (OLD SC. 177)\n\n       -- wood suddenly splinters everywhere -- the wall and roof\n       tear open behind them - GIANT VERTICALLY-SUSPENDED SAWS RIP\n       THROUGH, just missing them.\n\n       THE SPINNING TEETH (OLD SC. 178)\n\n       The blades churn through the corrugated roof, spraying CAVIAR\n       everywhere.\n\n       EXT. CAVIAR FISHERY - CITY OF WALKWAYS (OLD SC. 179)\n\n       Bond BURSTS OUT OF THE BUILDING...Zukovsky and his guards and\n       even the chauffeur are firing at the chopper...\n\n       EXT. RAMP TO LOWER WALKWAY (OLD SC. 180)\n\n       Bond makes for his BMW, running down a flight of steps, onto\n       a lower walkway when...THE SECTION AHEAD OF HIM\n       EXPLODES...the second chopper above hitting its mark with a\n       thrown grenade.  Bond is trapped by the fire and smoke, the\n       only way out is ALONG THE PIPELINES...he runs along a narrow\n       section of pipe and then JUMPS DOWN to another walkway.  The\n       PIPES are now above him...the chopper's relentless saws CUT\n       THROUGH THE PIPE...GAS JETS OUT...Bond HURLS HIMSELF up a\n       stairway.\n\n       INT. CAVIAR FISHERY\n\n       Zukovsky and Christmas watch in horror as Chopper One blades\n       away more roof above them.\n\n       EXT. LOWER WALKWAY\n\n       Bond takes something out of his pocket, a remote control\n       device...he presses some buttons...HIS CAR COMES TO\n       LIFE...lights on, it drives toward him.\n\n       He rushes to meet it. Chopper Two follows behind Bond,\n       slicing up the walkway just behind him.  Bond gets to the car\n       and JUMPS IN as the chopper veers away.\n\n       INT. CAR\n\n       Bond activates his missile device as he watches Chopper Two\n       pass behind the factory.  Suddenly there's a huge roar behind\n       him as the blades from Chopper One RIP THROUGH THE ROOF,\n       SLICING HIS CAR IN HALF.\n\n       But Bond is undeterred.  He sets off the missile toward the\n       disappearing Chopper One.\n\n       EXT. CHOPPER\n\n       A DIRECT HIT. Chopper One explodes and falls onto the walkway\n       setting the scene ablaze.\n\n       EXT. WALKWAYS - SAME\n\n       Zukovsky and Christmas see the explosion, then see Chopper\n       Two dropped FOUR ARMED MEN onto a nearby walkway.  The men\n       make their way toward the factory, firing at the guards.\n       Zukovsky and Christmas are forced inside.\n\n       ANGLE ON BOND\n\n       Who sees the danger to the others and runs off along the\n       walkways back to the factory.  The Chopper follows him,\n       shooting.\n\n       Bond outruns it, until, ahead of him A GRENADE EXPLODES,\n       destroying the walkway and hurling Bond into the water.\n\n       EXT. FACTORY\n\n       The gunfight continues as the armed men take out Zukovsky's\n       guards. Then, two of the assailants follow ZUKOVSKY and\n       CHRISTMAS into...\n\n       INT. FACTORY - NIGHT\n\n       The chauffeur is shot and killed.  The gunmen then turn their\n       attention to Zukovsky and Christmas, when suddenly BOND\n       APPEARS through a trap door in the floor boards.\n\n       Bond shoots one of the gunmen, then fires on the other...\n       Zukovsky grabs Christmas and they make their escape  Bond\n       sees a third gunman firing from the basement and takes him\n       out.\n\n       EXT. WALKWAYS - SAME\n\n       Zukovsky and Christmas make a dash for Zukovsky's Rolls.\n       They dive in...Zukovsky rams the car into reverse...behind\n       him, A CHOPPER SLICES the walkway to smithereens...Zukovsky\n       can't stop it as the car leaps backward and into THE WATER\n       BELOW....\n\n       INT. FACTORY\n\n       Bond finishes off the remaining two armed men in a furious\n       gunfight and exits.\n\n       EXT. WALKWAYS - SAME\n\n       Bond sees Zukovsky and Christmas swimming to safety.  The\n       chopper bears down on him.  He leaps back to what's left of\n       the building, picks up a flare gun.  He jumps down to a\n       walkway at water level and cranks open a rusted GAS JET...he\n       then waits for the Chopper to line up over it as it\n       approaches Bond for the kill....\n\n       Bond fires the flare gun...\n\n       THE GAS EXPLODES!\n\n       The Chopper tries to pull away, but it's too late.  The\n       flames engulf it, igniting a fireball.\n\n       IN THE WATER\n\n       Zukovsky pulls himself back onto a walkway and heads for the\n       factory, but speeding at him are to FREE-FLYING SAW BLADES\n       from the chopper that has just exploded!\n\n       OMITTED 231S to 231Z\n\n       EXT. WALKWAY\n\n       Zukovsky dives away -- into a CAVIAR PIT.  The saws embed in\n       the cabin behind him.\n\n       The caviar pit is like sinking sand, deep -- he's going\n       under.  Flounders, trying to cling to a crate blown in there\n       by the explosion.  Then he looks in horror:\n\n       EXT. SIDE OF CAVIAR PIT (OLD SC. 199)\n       POV ZUKOVSKY:\n\n       Bond appearing at the edge of the caviar pit, dragging\n       himself up, soaking wet.  He's holding another harpoon gun.\n       Points it directly at Zukovsky.  This time he really means\n       business.\n\n       EXT. CAVIAR PIT/SIDE (OLD SC. 200)\n\n       Zukovsky, on the point of being swallowed by the caviar,\n       clawing at the crate.  Bond, steely eyed, cold:\n\n                           BOND\n                 Now...where were we?\n\n                           ZUKOVSKY\n                 A rope!\n\n                           BOND\n                 No.  The truth!\n                     (beat)\n                 She thought I was dead -- those blades\n                 were meant for you.  What do you know\n                 that she would kill you for?\n\n       Zukovsky is sinking.\n\n                           ZUKOVSKY\n                 I don't know what you're talking --\n\n       Zukovsky sees Christmas appear beside Bond:\n\n                           ZUKOVSKY\n                 Help me, don't let me drown.\n\n       She looks to Bond -- sees he's serious.\n\n                           BOND\n                     (to Zukovsky)\n                 You're in this thing up to your neck.\n\n       Zukovsky sinks alarmingly -- he talks rapidly, staccato:\n\n                           ZUKOVSKY\n                 Alright, alright!  Sometimes I smuggle\n                 machinery for her.  Russian stuff.\n\n                           BOND\n                 And the payoff on the tables?\n\n                           ZUKOVSKY\n                 A special job.  A...a...a submarine.\n\n                           CHRISTMAS\n                 What?\n\n                           ZUKOVSKY\n                 To haul some cargo. My nephew, he is\n                 Captain of a sub in the Black Sea Fleet.\n\n                           BOND\n                 Where's the sub going?!\n\n                           ZUKOVSKY\n                 No!  Get me out!\n\n                           BOND\n                 This is too big for even you.  Where is\n                 it?\n\n                           ZUKOVSKY\n                 This is a family matter! If my nephew is\n                 in danger, we do it my way, or nothing!\n                 Now get me out!\n\n       But he looks more worried than ever as Bond takes aim with\n       the harpoon gun -- squeezes the trigger.\n\n                           ZUKOVSKY\n                 No! Bond!\n\n                           CHRISTMAS\n                     (alarmed)\n                 Bond!\n\n       Bond fires.  Zukovsky YELLS as the HARPOON SHOOTS TOWARD HIM.\n\n       It takes him a moment to realize he hasn't been hit -- the\n       harpoon splintering the crate, just missing him.  He clings\n       to the crate, exhausted, as Bond and Christmas drag him to\n       safety.\n\n                           CHRISTMAS\n                 Commander Bond, you are dangerous,\n                 unpredictable, and a hothead.\n\n       He just looks at her.\n\n                           CHRISTMAS\n                 But then again, explosive devices are my\n                 specialty.\n\n       Zukovsky scowls, wet, angry, looking from his ruined suit to\n       the devastation that was once his caviar factory as, behind\n       him, walkways CREAK, teeter, and CRASH into the sea.\n\n                           ZUKOVSKY\n                 So.  My way.  No MI-6, no Interpol.  Just\n                 you, me and my people.\n\n                           BOND\n                 Where?\n\n                           ZUKOVSKY\n                 Istanbul.\n\n       OMITTED:233\n\n       INT/EXT. BALCONY/MAIDEN'S TOWER - BOSPHORUS - NIGHT\n\n       Beyond iron balustrades we see one of the most fabulous views\n       in the world -- on one side the still waters of the Golden\n       Horn, on the other, the dancing waves of the unsheltered\n       Bosphorus -- and in between, the tumbling roofs, soaring\n       minarets and crouching mosques of the Pera district.\n\n       RENARD scans the water with night-vision binoculars.\n\n       EXT. BOSPHORUS - NIGHT - HIS GREEN POV:\n\n       A SUPERTANKER churns along...\n\n       ADJUST ANGLE\n\n       The CAMERA SINKS BENEATH THE WAVES, steals through the gloom -\n       - eventually comes upon something sitting just beneath the\n       belly of the tanker.  The silhouette of a SUBMARINE, hugging\n       the tanker's shadow, creeping undetected into the\n       Bosphorus...\n\n       INT. M'S CELL - NIGHT\n\n       M paces her cell.  Looks out, at the clock:\n\n       It is MIDNIGHT.  Twelve hours to go.\n\n       She crosses her arms.  Returns to pacing.  Puts her hands in\n       her coat pockets:\n\n       She feels something.  Takes it out.\n\n       THE LOCATOR CARD.  Black and shiny, with two copper terminals\n       on one end.\n\n       M taps it on her hand. She looks back out.  TO THE CLOCK.\n\n                                                            CUT TO:\n\n       INT. BEDROOM - MAIDEN'S TOWER - BOSPHORUS - NIGHT\n\n       Renard and Elektra.  She is on the bed, Renard stroking her,\n       worshipping her skin.\n\n                           RENARD\n                 So beautiful. So smooth, so warm.\n\n                           ELEKTRA\n                 How would you know?\n\n       It stings him. Elektra sits up, pulling a robe around her.\n\n                           RENARD\n                 Why are you like this?  Because Bond is\n                 dead?  It's what you wanted.\n\n                           ELEKTRA\n                     (beat)\n                 Of course...\n\n       Renard gets up.  Paces the floor.\n\n                           RENARD\n                 He was a...good lover?\n\n                           ELEKTRA\n                 What do you think?\n\n       Renard leans against her desk, closing his eyes, squeezing\n       out the images.  After a moment, he SMASHES HIS FIST through\n       the hand-painted wood.  Elektra looks up.\n\n       HER P.O.V.  A huge splinter of wood juts out of Renard's\n       hand.\n\n       Renard looks at it, curious, unfazed.\n\n                           RENARD\n                 Nothing.\n\n       Elektra comes to him. Leads him to the bed.  Sits. Gently\n       removes the splinter.  Then, she takes an icecube from the\n       bucket.  Runs it along his wound.\n\n                           ELEKTRA\n                 What about this?\n\n       And she runs the ice down his cheek.  He shakes his head.\n       Tormented.\n\n                           RENARD\n                 Nothing.\n\n       Now she runs the ice down her neck...\n\n                           ELEKTRA\n                 But surely...\n\n       ...her fingers becoming wet, she runs the ice down between\n       her breasts, leaving a trail.  Teasing...\n\n                           ELEKTRA\n                 ...You can feel this?\n\n       She's moving the ice lower on herself... We see her lips\n       open, enjoying the sensation.  A beat, then his smile slowly\n       grows.  As she does something else.\n\n                           ELEKTRA\n                     (sensual)\n                 Remember ... pleasure?\n\n                                                          DISSOLVE:\n\n       INT. MAIDEN'S TOWER - DEAD OF NIGHT\n\n       Eerily quiet.  The calm before the storm, except:\n\n       INT. M'S CELL - SAME\n\n       M is at the door of her cell.  Her arm is stretched out\n       through the bars.  She is using her high-heeled shoe to try\n       to HOOK the leg of the stool and drag it toward her.  She can\n       only jut tap the leg with the tip of the heel.  She swipes\n       out at the little three-legged stool, tapping it, tapping\n       it...\n\n       It scoots toward her a little...she taps it again, gets her\n       shoe HOOKED on the leg of the stool and starts to drag it\n       when...\n\n       The rickety stool hits a bump on the ancient stone floor and\n       SPILLS OVER...the clock HITS THE GROUND and SKIDS across the\n       stones, coming to rest ACROSS THE ROOM, on the floor near the\n       window.\n\n       M leans against the bars. SHE HEARS HER THE OUTER DOOR\n       CLANKING OPEN...\n\n       She hurries to her cot and lies down.\n\n       GABOR ENTERS...a burly shadow in the light from the hall.  He\n       walks in.  Looks at M.  Picks up the clock and sets it ON THE\n       WINDOW SILL.\n\n       He leaves, shutting the door behind him.\n\n       M sits up. Looks out to the clock, glowing in the dark.\n\n       IT READS TWO A.M.\n\n       She drops her head back on the wall.  She will not sleep\n       tonight.\n\n                                                       DISSOLVE TO:\n\n       OMITTED: 236 - 243\n\n       EXT. ISTANBUL - DAWN\n\n       ESTABLISH the vast city astride the Bosphorus.\n\n       EXT. ISTANBUL STREETS - SAME\n\n       The sun starting to rise.  Street vendors are the only people\n       about, moving their carts into place, getting ready to place\n       out their wares.  We hold on a BUILDING.\n\n       INT. DYE FACTORY - SAME\n\n       A multi-levelled, rickety old building full of colourful\n       fabrics drying high overhead; the light shafts through them\n       casting pools of different coloured light.\n\n       It is a working factory, bolts of fabric and vats of dye, but\n       it is also:\n\n       AN OLD KGB SURVEILLANCE CENTER\n\n       Pushed to one end of the large room are stacks of radio\n       equipment, old consoles, audio equipment and radar screens.\n       Once a high-tech surveillance center, it has gone to seed.\n       There are men and women here, smoking, using the equipment,\n       slightly dissolute, very sinister, where the only membership\n       card is an old KGB ID.  Zukovsky is here, leaning behind a\n       RADIO OPERATOR.\n\n                           ZUKOVSKY\n                 Any luck reaching Yevgeny?\n\n                           OPERATOR\n                 Negative, comrade.\n\n       He moves to CHRISTMAS AND BOND, pouring over a large MAP OF\n       ISTANBUL spread out on a table.\n\n                           CHRISTMAS\n                     (to Zukovsky)\n                 What is this place?\n\n                           ZUKOVSKY\n                 Former KGB surveillance post. The Dye\n                 Factory was just a front; now it turns a\n                 good profit.\n\n       Bond notices THE BOA in the corner with some others.\n\n                           BOND\n                 Your old friend Dmitri.\n\n       Zukovsky nods to his old friend.\n\n                           ZUKOVSKY\n                 Today, you are glad to have the Boa  on\n                 your side.\n\n       Zukovsky looks at the map.\n\n                           ZUKOVSKY\n                 In the good old days, the KGB had three\n                 or four spots where our submarines could\n                 surface without anyone knowing. But\n                 Yevgeny is supposed to be loading cargo.\n\n                           CHRISTMAS\n                 What class sub does your nephew run?\n\n                           ZUKOVSKY\n                 C-class.\n\n                           BOND\n                 Nuclear.\n\n                           CHRISTMAS\n                 Not just nuclear. Powered by a nuclear\n                 reactor.\n                     (the penny drops)\n                 He's not loading any cargo. They want the\n                 sub. The sub itself.\n                 Put weapons grade plutonium inside the\n                 sub's reactor: Instant, catastrophic\n                 meltdown.\n\n                           BOND\n                 Made to look just like an accident.\n\n                           ZUKOVSKY\n                 Mother of God.\n\n                           BOND\n                 The right kind of explosion in the right\n                 spot -- it would block the Bosphorus, cut\n                 off the Black Sea.\n\n                           CHRISTMAS\n                 But why? Eight million people would die,\n                 the land irradiated for a hundred years.\n                 A cloud of radiation the size of\n                 Europe...\n\n                           BOND\n                     (chilled)\n                 Because an explosion like that would kill\n                 all the other pipelines. There would be\n                 only one way to get the oil out of the\n                 Caspian and pump it to the world...\n\n                           CHRISTMAS\n                 The King pipeline.\n\n                           BOND\n                 Elektra would control it all.\n\n                           ZUKOVSKY\n                 If what you say it true...it may be too\n                 late for Yevgeny.\n\n                                                            CUT TO:\n\n       INT. SECRET QUAY (MAIDEN'S TOWER) - ISTANBUL - DAY\n\n       The ancient arched underbelly of a waterside building.\n\n       Something is disturbing a large expanse of water.  A black\n       shadow looms beneath the waves.  A SUBMARINE SURFACES.\n\n       INT. SECRET QUAY (MAIDEN'S TOWER) - ISTANBUL - DAY\n\n       Waiting at the newly excavated quay:  Renard and his men.\n\n       The submarine's hatch opens.  A YOUTHFUL CAPTAIN EMERGES,\n       vaguely resembling his uncle, Zukovsky.\n\n                           RENARD\n                 Captain...\n\n                           YEVGENY\n                 Sir. We are ready to load your cargo.\n                 We only have a few hours before we'll be\n                 missed.\n\n                           RENARD\n                 You came with a skeleton crew?\n\n                           YEVGENY\n                 That's all we can afford these days.\n\n                           RENARD\n                 Of course. We are grateful for your\n                 efforts.\n\n       One of his men comes forward with several bottles of brandy\n       and other food.\n\n                           RENARD\n                 We have brandy and other refreshments for\n                 your men.\n\n       The Captain nods, pleased.\n\n       INT. DYE FACTORY\n\n       Bond and Christmas and Zukovsky watch as the radio operators\n       scan the airwaves.\n\n                           ZUKOVSKY\n                 If we're not in time and something has\n                 happened to him... you must let me kill\n                 them.\n\n       Bond stares hard at him.  A long beat.\n\n                           BOND\n                 Whoever gets there first, Zukovsky.  They\n                 have M.\n\n                                                            CUT TO:\n\n       INT. SUBMARINE - DAY\n\n       Eerie, dark, the lights inside green and sickly.\n\n       CLOSE ON\n\n       A half-eaten sandwich. An empty glass of brandy on the floor,\n       just near the hand it fell from...\n\n       PULL BACK TO SEE\n\n       The dead face of Yevgeny, poisoned.  Others of his crew\n       around, also dead.\n\n       Renard and his men tour the grisly scene.\n\n                           RENARD\n                 Take them up and throw them in the sea.\n\n       As they drag Yevgeny away, his HAT falls on the ground.\n       Renard picks it up and PUTS IT ON HIS HEAD.\n\n                           RENARD\n                 We'll be underway in two hours.  Use that\n                 time to re-familiarize yourselves with\n                 your stations. Then ponder how rich\n                 you'll be.  The re-breathers for the\n                 escape are already on board.\n\n       A man appears holding a heavy lead box containing the\n       plutonium.  Renard takes the box as if it weighs nothing.\n       Stronger then ever.\n\n                                                            CUT TO:\n\n       INT. CELL - MAIDEN'S TOWER - MORNING\n\n       Elektra stands at the door looking in at M.\n\n                           ELEKTRA\n                 Now you know how it feels.  To be locked\n                 away, to wonder if they're coming for\n                 you, if anyone will ever come for you.\n\n                           M\n                 Someone will come.\n\n                           ELEKTRA\n                 Who?  Bond?  Bond is dead.\n\n       Elektra walks to the window.  She looks out.\n\n                           ELEKTRA\n                 Somehow, I find that strangely\n                 ...disappointing.\n\n       M watches her, her heart beating.\n\n                           M\n                 Elektra. What time is it?\n\n       Elektra picks up the little clock. Walks over to the cell\n       bars.\n\n                           ELEKTRA\n                 Time for you to die.\n\n       And she reaches through the bars and HANDS M THE CLOCK.\n\n       The two women's eyes meet.\n\n                           RENARD\n                 The reactor is secured.\n\n       She turns, sees RENARD in the doorway.  She crosses to him\n       and SLAMS THE DOOR SHUT behind her.\n\n       INT. OUTSIDE DOOR - MAIDEN'S TOWER - DAY\n\n       Their eyes lock.\n\n                           RENARD\n                 This is the end.\n\n                           ELEKTRA\n                 No.  It is the beginning. The world will\n                 never be the same.\n\n       He lays the Captain's hat down. Tries to mask his sorrow.\n\n                           RENARD\n                 It will be yours, and yours alone. Have\n                 fun with it.\n\n       Forces himself to leave, heads down the stairs.\n\n       INT. M'S CELL - SAME\n\n       M works quickly.  She pops open the back of the clock and\n       takes out the batteries.  She pries off the tops with a key\n       and connects the wires to the LOCATOR CARD...\n\n                                                            CUT TO:\n\n       INT. DYE FACTORY - SAME\n\n       The Radio Operator touches his earpiece...\n\n                           OPERATOR\n                 Comrade, it's faint, but I'm getting\n                 something. A signal. Transmitting at...37-\n                 19 degrees north...\n\n       He writes the coordinates down.  Bond picks them up.\n\n                           BOND\n                 The locator card. It's M.\n\n       He takes the coordinates over to the map and DRAWS A\n       CORRESPONDING LINE across it.\n\n                           BOND\n                 The rest?\n\n       Christmas reads them out as the Operator writes them down\n\n                           CHRISTMAS\n                 Forty, forty-three degrees East...\n\n       Bond draws another line across the map. At the point at which\n       the intersect...a small island in the Bosphorus.\n\n                           ZUKOVSKY\n                 The Maiden's Tower.\n\n                           BOND\n                 How appropriate.\n\n                           ZUKOVSKY\n                 I'd heard there were some renovations\n                 there...no one would look for a sub in\n                 that place in a million years.\n\n       Suddenly Bond's instinct are aroused.  Out of the corner of\n       his eye, he sees THE BOA set something on the ground and move\n       slowly UP THE STAIRS.\n\n       Bond looks at the pack he left on the ground...\n\n       He grabs Christmas and HURLS HER TO THE FLOOR.\n\n       KABOOM!\n\n       A MASSIVE EXPLOSION rips the place apart.  In half a second\n       the air is thick with coloured dust and drifting clumps of\n       burning silk.\n\n       Bond stands.  Christmas is stunned, but okay.  He looks\n       around at the others - few dead, all out for the count, among\n       them, Zukovsky.\n\n       Bond heads for the door after the Boa.\n\n                           CHRISTMAS\n                 Zukovsky...\n\n                           BOND\n                 If I don't get to the Boa before he gets\n                 to Maiden's Tower, M is dead.\n\n       Bond runs out, into\n\n       EXT. STREET - DAY\n\n       Teeming with people, his eyes scanning, he spots...THE BOA\n       climbing a ladder alongside a building to A ROOF.\n\n       Bond chases after him, clambering up, but when he gets to the\n       top of the roof...\n\n       Boa has now been joined by THREE THUGS.  One attacks Bond as\n       the Boa and the others move away...\n\n       Bond fights with the thug, they stumble across the roof,\n       gripping each other, until Bond gets the upper hand and\n       THROWS HIM DOWN through a thatched roof where he falls...\n\n       EXT. BAZAAR\n\n       Into the market below.\n\n       Christmas, just coming into the square, sees the body\n       falling...she runs to the thug, thinking it might be Bond...\n\n       But the thug raises up, smiling at her, blood on his teeth.\n\n       She turns and runs...the thug gives chase...\n\n       ON THE ROOFS ABOVE\n\n       Bond is following Boa and the other two men as they LEAP from\n       roof to roof. He sees them jump off onto the roof of...\n\n       EXT. MOVING BUS\n\n       Motoring rapidly away from him.  He makes a spectacular leap\n       to a wobbly FLAG POLE that swings him toward the bus,\n       dropping him on the roof before it SNAPS BACK, into the\n       overhead TRAM WIRES ABOVE and setting off sparks.\n\n       ON THE BUS\n\n       Bond barely gets to his feet before Thug #2 is upon him.\n       They grapple, struggling to maintain their footing as the bus\n       speeds through the rickety old streets. He throws the guy\n       over...\n\n       The thug desperately CLINGS TO THE SIDE OF THE BUS...\n\n       Bond now takes on the third thug, unaware that number two has\n       climbed back on and is about to WHACK HIM ON THE HEAD with\n       his gun when...\n\n       THE BUS TURNS onto a new street...THE WIRES AGAIN...Thug\n       Two's gun is caught up in them...he is instantly\n       ELECTROCUTED.\n\n       Thug three watches his friend's horrible death, giving Bond\n       time to slug him hard across the face and THROW HIM FROM THE\n       BUS...\n\n       EXT. STREET\n\n       Thug two's body goes SLAMMING INTO THE WINDSHIELD of a fast\n       moving van...BURSTS OUT through the back doors of said van\n       and tumbles out onto the street where it is HIT BY A CAR.\n\n       ON THE BUS\n\n       Bond turns back toward...BOA. Now it is just the two of them.\n\n       The bus is hissing to a stop.\n\n       The Boa leaps on to the bed of a passing truck.  Bond rushes\n       forward and leaps on to the top of a passing taxi.  The taxi\n       jams on his breaks and Bond rolls across the bonnet and on to\n       the street.  He springs to his feet.\n\n       Fifty yards ahead the truck carrying the Boa has stopped for\n       traffic.  The Boa jumps out and darts into an alley.\n\n       EXT. ISTANBUL - ALLEY - DAY\n\n       The Alley leads into a small CAFE where PATRONS smoke water\n       pipes and drink coffee.  The Boa is nowhere to be seen.\n\n       Bond slips out his gun holding it out of sight close to his\n       leg so as not to alarm the civilians.  He steps into the\n       cafe.\n\n       EXT. ISTANBUL - CAFE - DAY\n\n       Bond makes his way through the tables to the doorway in the\n       back.  He looks inside - just a few children  at play.  Bond\n       is suddenly blind-sided by a vicious kidney punch which\n       brings him to his knees.  He struggles to bring up his gun -\n       but the Boa knocks it out of his hand.\n\n       The Boa locks Bond's head in an unbreakable choke hold from\n       behind.  Bond pulls on the massive arms - but to no avail.\n       He glances down to his right - HIS GUN - just out of reach.\n\n       Bond reaches out for it - his fingers just graze it.\n       Suddenly the Boa's foot kicks out, knocking the gun across\n       the room.  He tighten his grip and speaks in Bond's ear.\n\n                           BOA\n                 For years I was told I could never take\n                 the great James Bond and his Walther PPK.\n                 What good is your gun now, Bond?\n\n       Bond can't breathe, his eyes start to dim.  He slumps\n       forward, his left hand touches something hot.  It's the iron\n       basket of coals used to keep the water pipes lite.  Bond's\n       fingers touch the wire handle that arches across the top.  He\n       grabs it and with his last reserves -\n\n       Swings it at the back of his head hitting the Boa on the side\n       of the head with the SOUND OF RAW BACON HITTING A HOT\n       SKILLET.\n\n       The Boa drops Bond and leaps to his feet holding the side of\n       his face.  Bond falls forward fighting for breath and trying\n       to clear his head.\n\n       The Boa runs out the back door.  Bond finds his gun, holsters\n       it and follows.\n\n       EXT. ISTANBUL - SIDE STREET - DAY\n\n       Bond comes out into a side street crowded with VENDERS AND\n       SHOPPERS.  Bond sees the Boa pushing his way through the\n       crowd to...\n\n       EXT. ISTANBUL - FERRY TERMINAL - DAY\n\n       RUSSIAN TRAMP STEAMER taking on cargo.  Bond enters square in\n       time to see the Boa making a Bee line for the Russian\n       steamer.\n\n       As the Boa, much the worse-for-ware, starts up the gangway to\n       the top deck of the steamer, Bond hitches a ride on a cargo\n       net that is being hoisted aboard by the ship's boom.\n\n       EXT. RUSSIAN STEAMER - DAY\n\n       Boa, breathing hard gets to the deck.  He lumbers across it\n       but before he can reach the other side he is tripped up by\n       Bond who has been waiting for him by the side of the deck\n       house.  The Boa goes sprawling.  As Bond comes for him he\n       scrambles to his feet, grabs a nearby bailing hook, and\n       swings at Bond.  But Bond is ready for him.  He wards off the\n       blow with a small wooden cover from a shipping crate.  He\n       traps the Boa's arm and gives him two quick devastating kicks\n       in the solar plexus.  He Boa stages back to the railing.  A\n       final kick from Bond sends him over the side...\n\n       THE BOA FALLS, LANDING ON HIS BACK ON THE DECK BELOW WITH A\n       SICKENING THUD.\n\n       Bond looks down, sees the Boa's body at a horrible angle, his\n       neck broken.\n\n       Bond sighs, turns...\n\n       GABOR is there. Gun trained on him.\n\n                           GABOR\n                 Welcome aboard, Mr. Bond.\n\n       BOND'S P.O.V.  A thug steps into sight below, holding\n       CHRISTMAS hostage as well.\n\n       EXT. MAIDEN'S TOWER - DAY\n\n       A magnificent ornate tower in the centre of the Bosphorus.\n\n       An innocent-looking launch coasts up to it.  A tarp is raised\n       and Bond and Christmas are revealed, hands bound.  They are\n       helped out, led inside by a number of henchmen.\n\n       INT. MAIDEN'S TOWER - DAY\n\n       Elektra crosses the hallway as the doors open.  Kisses Bond\n       on the cheek as she eyes Christmas.\n\n                           ELEKTRA\n                 James Bond and his amazing resurrection.\n                 If only you'd kept away, we might have\n                 met again in a few years, become lovers\n                 once more.\n\n       Christmas eyes Bond anew as Elektra leads him to an ornately\n       carved chair, covered in silk.\n\n                           ELEKTRA\n                     (to guards)\n                 Take her to Renard.\n\n       Bond and Christmas exchange a look as the guards start her\n       towards some steps.\n\n       Elektra indicates for him to sit.  Behind him, the whole of\n       Istanbul is visible through a large curved window.\n\n                           ELEKTRA\n                 Pretty thing.  You had her too?\n\n       Bond ignores her.\n\n                           ELEKTRA\n                 I could have given you the world.\n\n                           BOND\n                 Not interested.\n\n       This cuts. She casually reaches behind his neck, flips up a\n       wooden arm to which is attached a metal collar.  A GAROTTE.\n\n                           ELEKTRA\n                 They were digging near here and they\n                 found some very pretty vases.  They also\n                 found this...\n                     (meaning the garotte)\n                 I think we ignore the old ways at our\n                 peril, don't you?\n\n       Bond recoils as she fastens the collar...  She steps back.\n\n                           BOND\n                     (ignoring her)\n                 Where's M?\n\n                           ELEKTRA\n                 Soon she'll be everywhere.\n\n       Bond keeps his cool:\n\n                           BOND\n                 All this, because you fell for Renard?\n\n                           ELEKTRA\n                 Five more turns and your neck will break.\n\n       She moves to the back of the chair, twists the screw ONE\n       NOTCH.  The effect on Bond is instantaneous as a bolt jolts\n       into the back of his neck, tilts his head back.\n\n                           ELEKTRA\n                 Since I was a child, I've always had a\n                 power over men. When I realized my father\n                 wouldn't rescue me from the kidnappers, I\n                 knew I had to form a new alliance.\n\n                           BOND\n                     (realizing)\n                 You turned Renard.\n\n                           ELEKTRA\n                     (smiling)\n                 Just like you...only you were even\n                 easier.\n\n       She pulls the jewel from her ear, reveals the ugly scar:\n\n                           ELEKTRA\n                 I told him he had to hurt me, he had to\n                 make it look real. When he refused I told\n                 him I would do it myself.\n\n       She turns the screw again.\n\n                           BOND\n                 So you killed your father.\n\n                           ELEKTRA\n                 He killed me! He killed me the day he\n                 refused to pay my ransom.\n\n       A flicker of emotion.  Bond is getting to her.\n\n                           BOND\n                 Was this all about the oil?\n\n                           ELEKTRA\n                 It is my oil!  Mine and my family's!\n\n       Her eyes are shining.  She moves toward the view, gazing out\n       at this spectacular cradle of civilization.  Bond works his\n       wristbinds feverishly.\n\n                           ELEKTRA\n                 It runs in my veins, thicker than blood.\n                 I'm going to redraw the map.\n                 And when I am through the whole world\n                 will know my name, my grandfather's name,\n                 the glory of my people.\n\n                           BOND\n                 No-one will believe this melt-down was an\n                 accident.\n\n       She eyes him, impressed that he's worked out her plan.\n       Tightens the screw again.  Her confidence amazing.\n\n                           ELEKTRA\n                 They will believe.  They will all\n                 believe.\n\n       Tightening the screw again:\n\n                           ELEKTRA\n                 You understand? Nobody can resist me.\n\n       Now she straddles him.  She puts the jewel back on her ear.\n       All the time, he's working that wristbind.\n\n                           ELEKTRA\n                 Know what happens when a man is\n                 strangled?\n\n                           BOND\n                 Elektra, it's not too late.  Eight\n                 million people needn't die.\n\n       She smiles, twists the screw again.  A nasty, grinding sound.\n       Sweat trickles from his brow.  She licks it away.\n\n                           ELEKTRA\n                 You should have killed me when you had\n                 the chance.  But you couldn't. Not me.  A\n                 woman you've loved.\n\n       She pushes her hips into his.  Turns the screw.  The bolt is\n       jammed right into the back of his neck.  His face is angled\n       upwards.  Breathing is difficult.  He glares up:\n\n                           BOND\n                 You meant ... nothing ... to me.\n\n       She fingers the bolt.  Prepares to turn it the last\n       time...His hand strains at its binding...\n\n                           BOND\n                 One... last... screw?\n\n                           ELEKTRA\n                     (kissing his ear)\n                 Oh James.\n\n       She begins to turn the screw...\n\n       ... when SEVERAL GUNSHOTS are heard outside.\n\n       Bond is on the edge of consciousness.\n\n       Elektra freezes.  Gets off him.  Moves to a window.\n\n       EXT. MAIDEN'S TOWER - BOSPHORUS - DAY\n       HER POV:\n\n       Big, battered and bloody, Valentin Zukovsky is leaving a\n       boat, moving over the rocks toward the entrance with three of\n       his men.  Two bodies in his trail.  He's on course for\n       Elektra and nothing is going to stop him, even as his\n       henchmen are cut down by ferocious fire.\n\n       INT. MAIDEN'S TOWER - BOSPHORUS - DAY\n\n       Elektra moves to her gun.  Just then, Gabor crashes through a\n       stained glass window, neck broken.\n\n       TWO ELEKTRA HENCHMEN appear from below stairs as the doors\n       burst open.  Zukovsky stands there.  A bloody giant.\n\n       They open up with machine guns, but two shots from Zukovsky\n       take them out, though he takes one in the shoulder.  Right\n       now, he's unstoppable.\n\n       A shocked silence after the shooting.  He eyes Bond in the\n       chair.  To the room:\n\n                           ZUKOVSKY\n                 I'm looking for a submarine.  It's big\n                 and black, and the driver is a friend of\n                 mine.\n\n       Then his eye falls on the HAT Renard had brought up from\n       below.  He knows at once what it means.\n\n                           ZUKOVSKY\n                 Bring it to me.\n\n       She picks it up, walks to him (surreptitiously sliding a gun\n       beneath it).  She proffers the hat...\n\n                           ELEKTRA\n                 What a shame.  You just missed him.\n\n       BLAM BLAM BLAM -- she fires through the hat.\n\n       He staggers back.  Stares.  Slumps down.  Lowers his head to\n       the ground.\n\n       She walks over, puts her heel on his gun arm, presses down,\n       smiling a half-psychotic smile.  The gun is pinned.\n\n       Zukovsky is dying.\n\n       But he dredges up every last ounce of energy to raise his gun\n       a millimetre off the ground, his outstretched arm already\n       pointing at Bond. Elektra looks surprised, then amused as\n       Zukovsky's finger begins to squeeze the trigger:  he's going\n       to shoot Bond!\n\n       Bond stares back.  Zukovsky's eye narrows -- trying for\n       extreme accuracy...\n\n       BLAM! The SHOT hits the binding at Bond's wrist.  Splinters\n       the wood there.\n\n       ELEKTRA stares at Zukovsky.  She didn't see where the bullet\n       went, just that it missed Bond.  She watches his head slump\n       further, staring at Bond...\n\n       A look passes between the two men.  Comrades in arms.  The\n       merest of smiles.  Then the light fades from his eyes.  Dead.\n\n       ELEKTRA\n\n       turns back to Bond.  Smiles.\n\n                           ELEKTRA\n                 Excuse me.\n\n       She picks up a walkie-talkie, speaks into it:\n\n                           ELEKTRA\n                 Everything's under control up here.  Are\n                 you ready?\n\n                           RENARD\n                     (filtered)\n                 Yes.  Au revoir...\n\n       Lost for a moment, she breathes heavily.  She glances at\n       Zukovsky's corpse.  Slightly puzzled, to Bond:\n\n                           ELEKTRA\n                 Zukovsky really hated you.\n                     (beat)\n                 Time to say goodnight.\n\n       And she kisses him -- reaches behind to deliver the killer\n       twist...\n\n       One super-fast movement:\n\n       Bond's hand breaks free, grabs her throat, tight.  He holds\n       her, their faces close together, disdain in his eyes -- hurls\n       her backwards, her hand scratching at his face.\n\n       Ripping the collar from his neck, he gets to his feet.  Moves\n       to Zukovsky, checks his pulse, takes the bloody gun from his\n       fingers.\n\n       Turns back, to see Elektra disappearing upstairs.  A moment's\n       dilemma:  should he race below to the sub -- or up to\n       Elektra?\n\n       He takes off after Elektra, grabs the radio handset.\n\n                                                            CUT TO:\n\n       EXT. SUBMARINE - SECRET QUAY (MAIDEN'S TOWER) - DAY\n\n       The submarine's engines roar to life.\n\n       INT. TOWER - CONTINUOUS\n\n       ELEKTRA rises up one of the triple spiral stairways leading\n       to the various balconies of the minaret tower.\n\n       INT. TOWER/M'S CELL - DAY\n\n       Bond stalks up after her.  THEIR VOICES ECHO through the\n       intertwined stairs:\n\n                           ELEKTRA\n                 James.  You can't kill me.  Not in cold\n                 blood.\n\n       But Bond isn't wavering.  Clutches Zukovsky's bloody wet gun.\n\n       He heads up in the semi-darkness -- and suddenly swings to\n       his right, at an unexpected but familiar Voice:\n\n                           M\n                 Bond --\n\n       Bond kicks open a door and enters...\n\n       M'S PRISON ROOM\n\n       He fires at the lock on her cell door and frees her. Turns to\n       go, heading upward, after Elektra.\n\n                           M\n                 Go after the submarine, forget the girl.\n                 Bond!\n\n       INT. BALCONY/MAIDEN'S TOWER - BOSPHORUS - DAY\n\n       Elektra has reached a balcony.  It affords a spectacular view\n       of Istanbul.  Bond appears, has her cornered.\n\n                           BOND\n                 Call him off.\n\n       He holds the walkie-talkie to her mouth.\n\n                           BOND\n                 I won't ask again.  Call him off!\n\n       She looks at him seriously.  He's giving her a last chance,\n       willing her to save herself and the city.\n\n                           ELEKTRA\n                     (into walkie-talkie)\n                 Renard.\n\n       Bond waits...\n\n                           ELEKTRA\n                     (to Bond)\n                 You wouldn't kill me.  You'd miss me.\n\n       And her face breaks into a perverted grin and --\n\n                           ELEKTRA\n                     (into walkie-talkie)\n                 Dive!  Bond --\n\n       BLAM!  Bond shoots her.\n\n       She staggers back, shocked at her own mortality.\n\n                           BOND\n                 I never miss.\n\n       He looks out:\n\n       EXT. BOSPHORUS - DAY\n\n       Sees the nose of the sub heading into the Bosphorus, half\n       submerged.  The hatch is still open.\n\n       INT. BALCONY/MAIDEN'S TOWER - BOSPHORUS - DAY\n\n       He stares at her dead body a beat. And then, he crouches. He\n       touches her cheek, just once, before he goes.\n\n       Behind him, unbeknownst, M has seen it all.\n\n       EXT. MAIDEN'S TOWER - BOSPHORUS - DAY\n\n       He moves to the ledge. Composes himself -- and\n\n       DIVES ONE HUNDRED FEET to the water.  Amazing.\n\n       EXT. SUBMARINE, BOSPHORUS - DAY\n\n       He surfaces close to the exiting sub.  Grabs a ladder, pulls\n       himself up.\n\n       The hatch is closing...  He splashes through the water\n       flooding over the sub, appears in front of the amazed sailor\n       shutting the hatch.  WHACKS him with the hatch.  Gets inside.\n       Closes it.  Milliseconds before the hatch slides under the\n       water.\n\n       INT. SUBMARINE - CONTINUOUS\n\n       Bond down below. Renard's crew are spread throughout the sub.\n       He creeps through...\n\n       Approaches one man working some levers, smoking.  Bond holds\n       his gun to his head.\n\n                           BOND\n                 How do you want to die?\n                     (re:  cigarette)\n                 That?\n                     (re:  gun)\n                 Or this?\n\n       INT. CABIN, SUBMARINE - MOMENTS LATER\n\n       A few SOLID BANGS on the metal of Christmas' door.  It opens\n       and Bond lets the now unconscious man hit the deck.  That was\n       his head banging.\n\n                           CHRISTMAS\n                     (stunned)\n                 James!...\n\n       He takes her by the hand, they move through the shadows of\n       the sub.\n\n       INT. SUBMARINE - MOMENTS LATER\n\n       A man is operating the tanks.  Through the intercom:\n\n                           RENARD\n                     (filtered)\n                 Flood tanks 4 and 5...\n\n       The man does as told.  When he's finished -- Bond knocks him\n       out with the butt of his gun.\n\n       INT. SUBMARINE CONTROL ROOM - MOMENTS LATER\n\n       Several men occupy the central control room, Renard at their\n       centre.  Beyond, on the other side, the outer chamber of the\n       reactor.\n\n       INT. OTHER END OF CONTROL ROOM - SUBMARINE - DAY\n\n       From the other end of the control room, Bond and Christmas,\n       so near and yet so far -- they can't get to the reactor\n       because there are so many men in there.\n\n       Keeping behind cover:\n\n                           CHRISTMAS\n                 Is there another way?\n\n                           BOND\n                 We go down to the torpedo bay.\n\n       INT. TANK CONTROLS ROOM, SUBMARINE LOWER DECK - MOMENTS LATER\n\n       Bond and Christmas get attacked.  A vicious, silent fight...\n       Then the radio set sparks into life --\n\n                           RENARD\n                 Open the tanks.\n\n       Bond is throttling the man with the cable.  Speaks into the\n       handset.\n\n                           BOND\n                     (disguising voice)\n                 Tanks open.\n\n       But the man has stretched his hand to a fire alarm:\n\n       The KLAXON RESOUNDS.\n\n       INT. SUBMARINE CONTROL ROOM - CONTINUOUS\n\n       Renard looks up.\n\n                           RENARD\n                     (to self)\n                 Bond...\n\n       He flicks a switch;\n\n                           RENARD\n                     (into mic)\n                 Bond! You have decided to join me on this\n                 historic voyage.  Welcome to my nuclear\n                 family.\n\n       INTERCUT:\n\n       BOND ON AN INTERCOM:\n\n       His voice fills the control room.\n\n                           BOND\n                 You're really going to commit suicide for\n                 her?\n\n       Renard responds, into the microphone.\n\n                           RENARD\n                 In case you've forgotten.  I'm dead\n                 already.\n\n                           BOND\n                 Haven't you heard the news?  So is she.\n\n       Renard's face screws up in pain more searing than any he\n       could feel in his skin...he SCREAMS...\n\n       INT. SUBMARINE...\n\n       The scream, like a wounded animal, echoes throughout the\n       doomed craft.\n\n       BACK ON RENARD, gasping, spent.\n\n                           RENARD\n                 You will die for this.\n\n       He strides through to the\n\n       INT. REACTOR CHAMBER\n\n       Jams shut the hatch behind him.  Now moves through to the\n\n       INT. CHAMBER BEYOND REACTOR\n\n       Where he picks up the PLUTONIUM. Moves back into the\n\n       INT. REACTOR CHAMBER\n\n       Sealing the other door behind him.  And now he opens up the\n       cover of the glaring REACTOR...\n\n       INT. TANK CONTROLS ROOM, SUBMARINE - CONTINUOUS\n\n       Christmas sees a panel light up:\n\n                           CHRISTMAS\n                 The cover is off the reactor.\n\n       Bond reads off more lights...\n\n                           BOND\n                 He's sealed himself in.\n\n                           CHRISTMAS\n                 He's going to insert the plutonium.\n\n       Thinking fast, Bond moves to some controls.  Hits switches.\n\n                           CHRISTMAS\n                 Do you know what you're doing?\n\n                           BOND\n                 Like riding a bike.\n\n       INT. AIR TANKS, SUBMARINE - CONTINUOUS\n\n       The air tanks immediately filling with water.\n\n       INT. TANK CONTROLS ROOM, SUBMARINE - CONTINUOUS\n\n       Christmas and Bond shift to the side.  Everything not screwed\n       down starts sliding...\n\n       EXT. SUBMARINE - CONTINUOUS - LONG SHOT\n\n       The submarine is tilting, further and further, the nose\n       dropping down and down...\n\n       Pretty soon we have the strange and incredible sight of a\n       submarine hanging vertically, nose down.\n\n       INT. REACTOR CHAMBER, SUBMARINE - CONTINUOUS\n\n       Renard hangs on, swings, until he can get a footing on the\n       nearest wall.\n\n       INT. TANK CONTROLS ROOM, SUBMARINE - CONTINUOUS\n\n       Bond and Christmas hang on too, get a grip.  He helps her up.\n\n                           CHRISTMAS\n                 What kind of bikes did you ride?\n\n                           BOND\n                 Just wanted to put him on edge...\n\n       INT. REACTOR CHAMBER, SUBMARINE - CONTINUOUS\n\n       Renard is disturbed by the sub's position, but only\n       momentarily.\n\n       He moves to an intercom:\n\n                           RENARD\n                 Open the torpedo tubes.\n\n       INT. TORPEDO ROOM - CONTINUOUS\n\n       Bond hears a creak, turns to see the tubes open -- water\n       gushes up toward them at an incredible rate.\n\n                           BOND\n                 Climb!\n\n       He pulls Christmas up and they ascend to the next level.  No\n       chance to seal the chamber though, the water is already\n       through the hatch.\n\n                           BOND\n                 Keep moving.\n\n       INT. REACTOR CHAMBER - CONTINUOUS\n\n       Renard now struggles back up to the reactor, stares into the\n       violet blue heat...\n\n       He hits a button.  A ROD slowly rises out of the reactor.\n\n       INT. LOWER SUBMARINE - CONTINUOUS\n\n       Bond and Christmas are ahead of the water.  They have reached\n       a level where various systems are operated from.\n\n                           BOND\n                 There's one chance.\n\n       He punches buttons.\n\n       EXT. SUBMARINE, BOSPHORUS - CONTINUOUS\n\n       High up on the sub, a hatch opens.  Water floods into an\n       escape hatch.  An inner door stops it getting into the\n       submarine itself.\n\n       INT. REACTOR CHAMBER - CONTINUOUS\n\n       Renard slowly inserts the plutonium rod.  Immediately the\n       light around him becomes a deeper blue, a horrible\n       luminescence.  The staccato click of a distant Geiger counter\n       intensifies.\n\n       INT. SUBMARINE - CONTINUOUS\n\n       As Bond opens the inner door of an ESCAPE HATCH, he points\n       out a cabinet on the wall to Christmas.\n\n                           BOND\n                 Re-breathers.\n\n       She opens the box to find the RE-BREATHERS are ripped to\n       shreds.  No-one was ever meant to get off the sub.  She shows\n       Bond.\n\n                           BOND\n                 Never liked those things anyway.\n\n       He climbs into the escape chamber.\n\n                           BOND\n                 Count to twenty.  When you get to twenty\n                 open the hatch.  It can only be opened\n                 for a few seconds or we'll sink.\n\n                           CHRISTMAS\n                 But what if...\n\n                           BOND\n                 Count to twenty.  I'll be there.\n\n       She moves over and seals the door, wrenches a lever which\n       immediately floods the chamber with water.\n\n       INT. ESCAPE HATCH - CONTINUOUS\n\n       Inside the chamber, Bond holds his breath as water seeps in.\n       The most claustrophobic thing you've ever seen.\n\n       INT. SUBMARINE - CONTINUOUS\n\n       A green light comes on and Christmas punches a button...\n\n       EXT. SUBMARINE, ESCAPE HATCH - CONTINUOUS\n\n       The OUTER DOOR opens...  Bond burst out and starts the long\n       swim up the OUTSIDE OF THE SUBMARINE...\n\n       INT. SUBMARINE - SAME\n\n       Christmas is counting.\n\n                           CHRISTMAS\n                 One, one thousand, two, one thousand...\n\n       EXT. SUBMARINE - UNDERWATER\n\n       It's dark out here.  It would be very easy for Bond to get\n       disoriented.\n\n       He peers around, trying to get his bearings against the vast\n       vertical whale he's swimming up.\n\n       Passes the conning tower.\n\n       INT. SUBMARINE\n\n                           CHRISTMAS\n                 Fourteen, one thousand, fifteen, one\n                 thousand...\n\n       EXT. SUBMARINE - UNDERWATER\n\n       Bond is running out of air...\n\n       And then he sees it -- the open hatch of the rear escape\n       door.\n\n       He gets inside, yanks it closed...\n\n       INT. SUBMARINE - CONTINUOUS\n\n       Christmas, shivering in the rising water.\n\n                           CHRISTMAS\n                 Twenty.\n\n       She presses a button...\n\n       INT. CHAMBER BEYOND (NOW ABOVE) REACTOR - CONTINUOUS\n\n       The hatch opens and Bond collapses out in a gush of water.\n       The hatch closes.\n\n       The whole world is at a crazy angle here. Bond looks down at\n       the sealed door of the reactor chamber, curses.\n\n       INT. REACTOR CHAMBER - CONTINUOUS\n\n       Bathed in the horrible light of the over-heating reactor,\n       Renard looks upwards, aware of sounds on the other side of\n       the door...\n\n       KER-BLAM!  A BLINDING FLASH OF LIGHT.\n\n       The door shoots off its hinge, blasted by Bond.\n\n       Bond drops down into the chamber, takes one look at Renard,\n       now a crumpled heap in the corner.\n\n       Bond moves down to the next door, opens it:\n\n                           BOND\n                 Christmas!\n\n       And there she is, struggling, the water level way below still\n       rising...\n\n       He lowers an arm, pulls her up.\n\n       They clamber up to the reactor:\n\n       INT. REACTOR CHAMBER\n\n       BOND'S POV: in the intense glow inside -- the overheating\n       rod, protruding slightly.\n\n                           CHRISTMAS\n                 We have to get the rod out of the\n                 reactor!\n\n       INT. REACTOR CHAMBER\n\n       Bond looks at the gauges from behind a thick GLASS SHIELD.\n       Christmas comes up level with him:\n\n                           CHRISTMAS\n                 Melting down.  4000 degrees, the\n                 Zirconium casings on the rods crack.\n                 5000, the plutonium melts.  In ten\n                 minutes, a hydrogen explosion.\n\n       THE TEMPERATURE GAUGE READS 4500 AND RISING...\n\n       He starts toward the reactor when suddenly\n\n       RENARD IS BEHIND BOND, THROTTLING HIM.\n\n       CHRISTMAS grabs at him, is flung back, nearly falls through\n       the hatch but manages to grab a pipe, hangs on for dear life.\n\n       THE GAUGE HITS 4700\n\n\n       BOND AND RENARD\n\n       struggle...  Both slamming into switches and buttons.\n\n                                                            CUT TO:\n\n       OMITTED 314-316\n\n       INT. SUBMARINE - CONTINUOUS\n\n       THE GAUGE IS PASSING 4900, EDGING TOWARDS THE NO-WAY-BACK\n       5000 MARK.  Meltdown imminent...\n\n       He looks down the sub -- more water racing upward...\n\n       Back to the pile.  Scans the scene, searching for an idea.\n       Sees a HOSE, compressed air escaping from a fissure.  Thinks\n       fast.  Grabs the hose, snaps it free...\n\n       RENARD\n\n       is recovering, has found a FLARE GUN near him.  Raises it to\n       Bond...\n\n       BOND'S POV\n\n       in the reflection of the gauge (which is millimeters from\n       5000), we see Renard approaching from behind us...\n\n       BOND jams the hose into the reactor, ducks down -- as the air\n       blows the rod out - narrowly missing him as it shoots past --\n       impales Renard in the heart, just before he could shoot.\n\n       Renard stares at Bond in horror.  Bond calmly takes the flare\n       gun off him.\n\n                           BOND\n                 She's waiting for you.\n\n       And he lets him fall past Christmas, through consecutive open\n       hatches of the sub, crashing into the rising water.\n\n       Christmas looks down at the floating corpse.\n\n       Bond watches the gauge -- as it edges DOWN from 5000.\n\n       The nuclear disaster looks like it's averted.  But suddenly\n       water is gushing in from above, through splits in the sub's\n       shell; it's going to sink.\n\n                           BOND\n                 We're sinking.\n\n       But she won't come.  As water courses over them:\n\n                           CHRISTMAS\n                 Help me.  We have to seal it.\n\n       She moves to the reactor, closing the cover.  Bond uses his\n       strength to push the heavy locking mechanism into place.\n\n       Bond climbs upwards, dragging Christmas with him.\n\n                           BOND\n                 We've got to get out.\n\n                           CHRISTMAS\n                 We can't.\n\n       INT. CHAMBER BEYOND REACTOR - CONTINUOUS\n\n       They clamber into the next chamber up...\n\n       EXT. SUBMARINE, BOSPHORUS - CONTINUOUS\n\n       The submarine is slowly sinking, nose down.  Air is escaping\n       from the many seams that are creeping apart.  We can hear the\n       metallic GROANS through the water.\n\n       INT. TORPEDO ROOM\n\n       Bond and Christmas crawl into TORPEDO CHAMBERS...\n\n       Bond reaches out, setting a timer to FIRE...\n\n       The clock ticks down...\n\n       EXT. SUBMARINE - UNDERWATER BOSPHORUS - DAY\n\n       The Torpedo doors open and Bond and Christmas are SHOT OUT\n       INTO THE WATER, streaking through, as behind them...\n\n       THE SUBMARINE EXPLODES in spectacular fashion.\n\n       EXT. SURFACE, BOSPHORUS - DAY\n\n       Bond and Christmas reach the surface...  Look around them.\n       No boats coming to the rescue.  They wave to a tourist boat\n       passing.\n\n       The boat heads over to pick them up...\n\n                                                          DISSOLVE:\n\n       OMIT 324\n\n       EST. SHOT - MI-6 - NIGHT\n\n       The damaged wing is being repaired.\n\n       INT. BRIEFING ROOM - SAME\n\n       Tanner overseeing things, and then...\n\n       M walks in.  Efficient and steely as ever.  All eyes turn to\n       her.  She looks at everyone...makes the briefest of nods.\n       That is all the sentiment allowed as business resumes.\n\n       She scans the machines:\n\n                           M\n                 Any word from him?\n\n                           TANNER\n                 Still no contact yet.\n\n       EXT. ROOF, ISTANBUL - NIGHT\n\n       A magnificent rooftop garden looking out over Istanbul.\n       Christmas and Bond alone with some Bollinger.\n\n       FIREWORKS explode above. They clink glasses.  He looks out at\n       the cityscape.\n\n                           BOND\n                 I love Christmas in Turkey.\n\n                           CHRISTMAS\n                 So isn't it time you unwrapped your\n                 present?\n\n       INT. BRIEFING ROOM - NIGHT\n\n       Tanner and Q look at a SATELLITE THERMAL IMAGE OF ISTANBUL.\n\n                           TANNER\n                 That's strange.\n\n       The satellite image zooms in one particular car parked in a\n       side street.  We can just make out Bond's ASTON MARTIN.\n\n                           TANNER\n                 He must be nearby.\n\n       M comes over.\n\n       The image moves from the car, closes on the garden rooftop.\n       The thermal image is multi-coloured, difficult to decipher.\n\n                           M\n                 Where?\n\n                           Q\n                 This picks up body heat.  Humans should\n                 be orange.\n                     (searching)\n                 There.\n\n       And he points to ONE orange figure lying on the rooftop.\n\n                           M\n                     (to Tanner)\n                 I thought you said he was with Doctor\n                 Jones?\n\n       They all look back to the image.  The figure is turning RED,\n       almost glowing.\n\n                           M\n                 It's getting redder.\n\n       Tanner, Q and M realize as one that this is an image of two\n       people, one atop the other.  And getting hotter.\n\n                           M\n                 Bond.\n\n       Q switches the screen off, clears his throat.\n\n                           Q\n                 Could be a premature form of the\n                 Millennium Bug.\n\n       EXT. ROOF, ISTANBUL - CONTINUOUS\n\n       It's dark, we can't really see them.\n\n                           CHRISTMAS\n                 You know James...  I think Christmas is\n                 coming early this year.\n\n                                                           FADE OUT\n\n       THE END\n\n       --------------------------------------------------------------\n\n\t\n\t\t\t\n\n\n\n\nWorld is not Enough, The\nWriters :   Neal Purvis  Robert Wade  Bruce Feirstein  Ian Fleming\nGenres :   Action  Thriller  Adventure\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:39:04.255064"}