{"title": "X-Men", "film_link": "/Movie Scripts/X-Men Script.html", "script_link": "/scripts/X-Men.html", "info_raw": "\n\nX-Men Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (8.70 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Ed Solomon  Christopher McQuarrie  Tom DeSanto  Bryan Singer\nGenres  Action  Sci-Fi\nScript Date : February 1999\n\nRead \"X-Men\" Script\n\n\n", "script": "\n\n\n\"X-MEN\" -- early draft by Ed Solomon, Chris McQuarrie, Tom DeSanto & Bryan Singer\n\n\n\n   \n\n\n\n                                  X-Men\n\n\n\n                                    By\n\n\n\n                                Ed Solomon\n\n\n                                Revisions:\n                              Chris McQuarrie\n                                Tom DeSanto\n                               Bryan Singer\n\n\n\n\n\n                                                   February 24, 1999\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n       BLACK\n\n       Sounds of a train rolling to a halt, a shrill whistle.\n\n       EXT. CAMP - DAY\n\n       UP ON the door of a weathered cattle car as a German\n       soldier steps into frame wearing that familiar gray of\n       the all-too familiar era.\n\n       He throws the door to reveal a mass of huddled and\n       frightened people inside.\n\n       The words are not necessary.  The language is not ours\n       and the images say enough.\n\n       Men, women and children are herded off the train like\n       cattle toward a large open yard.  There they huddle until\n       the Germans begin to shout and shove through the mob.\n\n       EXT. FENCE CORRIDOR - DAY\n\n       We are looking up at rows and rows of fences topped with\n       barbed wire all designed to create a separator for the\n       thousands of Jew who pour through each day.\n\n       Then we see the eyes themselves that look up at them.\n\n       A LITTLE BOY.  A boy who will not die this day.  A boy\n       who will live to see the end of the war and the world of\n       the future.\n\n       He stares at the metal wire with an unusual fascination.\n\n       The boy looks up at HIS WORRIED PARENTS - a sturdy-\n       looking couple who try to smile and comfort him.\n\n       The corridor comes to a junction where it splits in\n       several different directions.\n\n       Soldiers here push the mob using rifles as pikes,\n       screaming and terrorizing the lot of them.  Suddenly it\n       is clear what they are doing.  They are dividing the mob\n       into smaller groups.\n\n       Soon, the groups themselves become evident.\n\n       Men from women.  Children from adults.\n\n       The family tries to stay together, clinging to one\n       another dearly, until finally, they are put upon by a\n       number of gray uniforms and pulled apart. The boy is\n       dragged screaming his feet no longer touching the ground.\n       Two soldiers carry him as they follow the back of a large\n       column of children being led through a gate of barbed\n       wire so dense, it resembles wool.\n\n       The gate closes and the boy looks back to see his parents\n       - along with many others - being restrained by a number\n       of soldiers.  The screaming is deafening.\n\n       And the boy's can be heard above it all.  The soldiers\n       seem to be having a hard time carrying such a frail\n       child.  The farther they get from the fence, the heavier\n       he seems to get, until they are literally pulling him as\n       though he were anchored to something.\n\n       His outstretched fingers claw at the thin air and he\n       screams until the blood in his face is blue.\n\n       The soldiers are literally pulled back a step and they\n       begin to slip in the mud. They look at one another and\n       then over their shoulders as they hear a sound.\n\n       A groaning, creaking sound.  And then the unmistakable\n       twang of wire stretched to snapping.\n\n       ANGLE ON:\n\n       The fence.  The gate that separates the parents.  It bows\n       toward them like iron filings to a magnet, and several of\n       the strands of barbed wire have given way.\n\n       The boy continues to scream as all the other faces simply\n       freeze and wonder.\n\n       One of the soldiers pulls a wooden baton from his belt\n       and brains the boy violently.\n\n       He slumps and the soldiers carrying him spring forward as\n       through a rope that was holding them back has been cut.\n       They nearly fall, looking at one another with some\n       concern, some confusion....\n\n       Then they follow the line of children that has gotten\n       ahead of them.\n\n       ANGLE ON:\n\n       The boy's parents watch him as he -- as they, are taken\n       away.\n\n       The rest of their story is as you would expect.\n\n       EXT. SKY - DAY\n\n       Bright, bright blue framing a blinding white sun.\n\n       PAN DOWN AGAIN TO REVEAL:\n\n       The cracked, drought-stricken soil of nowhere.\n\n       TITLES:\n\n       KENYA - 1978\n\n       A group of children at play.  Tribal children who,\n       without the help of the titles, could be from any age.\n\n       They run through a tiny village of tents, playing.  Every\n       child holds a long reed-like stick and they chase each\n       other playing their version of tag.\n\n       As each child is tapped, they chase the others.  Each\n       trying to avoid being \"it\", though never going far enough\n       away to miss the fun.\n\n       One girl in particular.  A PRETTY GIRL OF 12, with\n       unusual white hair, is tagged and immediately shunned.\n\n       She chases kids this way and that, but to no avail.  She\n       is not strong enough, nor agile enough, to win.\n\n       She tumbles and lands on her stick, snapping it.  She\n       stands and, when the children see that her stick is\n       broken, they begin to giggle.\n\n       The giggles become laughter and the laughter becomes a\n       taunt, and before we even realize, the inherent cruelty\n       of children let loose becomes evident.\n\n       They have now formed a circle, at first avoiding her\n       touch with distance, but now growing tighter with menace.\n       In the unspoken manner of children at prey, the group\n       begins to chant in their native tongue - a song we have\n       not heard but sung in a way none-too inviting.  They\n       begin to poke at her with the reeds, driving her back.\n\n       The girl now moves to the center of the circle, no longer\n       wishing to tag anyone.\n\n       ONE DEVIOUS CHILD seems to get an idea.  He takes his\n       stick and smacks it across her shoulder.  She turns to\n       face the child and another swings his stick across her\n       back with a solid THWACK.  Before long, mob rule gives\n       way and all the kids are swinging at her and laughing.\n\n       It grows to the brink of frenzy, the laughing and the\n       shouting not too unlike the noise of the previous scene.\n\n       So much so, we may miss the first flake of snow.  The\n       children certainly do.  It is snowing for a good ten\n       seconds before the last of them stops.\n\n       By then, the snow is thick as flies and wafting down to\n       melt instantly on the hot African soil that has never\n       seen snow before.\n\n       ANGLE ON:\n\n       Adults come out of their huts and in from the fields and\n       the whole of the village is soon gathered around the\n       little girl, staring up from the clear blue sky and the\n       snow that falls from nowhere.  From nothing.\n\n       One by one, all eyes fall on the little girl and the\n       looks of curiosity become looks of fear.  Of\n       superstition.\n\n       Punctuated by a solid thump.\n\n       And then another.\n\n       AN OLD MAN looks down at his feet and sees a tiny,\n       misshapen ball of ice, no bigger than his eye.  He looks\n       at it, bites it, then pops it in his mouth - breath\n       turning to steam.\n\n       Another such chunk of ice pops him on the head.  THE\n       CROWD LAUGHS.\n\n       They look up again and see that mixed with the snow are\n       tiny pellets of hail, seeming to increase in number as\n       the snow mysteriously wanes.\n\n       And the pellets are getting larger.  Until they land as\n       hunks.\n\n       The white haired girl drops to the ground and covers her\n       head as hailstones the size of baseballs plow into the\n       Earth.\n\n       Before long, tents are collapsing and panic ensues.\n\n       And all along the white haired girl sits huddled in the\n       dust, crying.\n\n       As hailstones fall in a circle around her, never coming\n       closer than then a few feet or so.\n\n       INT.  HIGH SCHOOL GYMNASIUM - NIGHT\n\n       ONE MORE SKY.  This one a backdrop.  Cheap paint and\n       tissue paper hung with hooks on a wall just behind the\n       basket on a full court.\n\n       As we pull back, we see the skyline of New York, crudely\n       made out with its silhouette buildings of dark gray and\n       black - windows of yellow.\n\n       Among the famous landmarks represented is the Statue of\n       Liberty, complete with a real light bulb burning in the\n       torch.\n\n       We are at a prom. The theme is RHAPSODY IN BLUE and the\n       decor has made tragic efforts to show it.  The\n       tablecloths are blue, the napkins are blue - far too many\n       of the tuxes are powder blue, and the blue eye shadow is\n       as heavy as expected.\n\n       Peter Gabriel's \"In Your Eyes\" gives painful indication\n       of the era, but here it is, nonetheless:\n\n       SOUTHERN CALIFORNIA - 1986\n\n       MOVE ACROSS THE FLOOR and through the swaying, clutching,\n       sweating dancers to the bathroom.\n\n       Through the door to the usual -\n\n       INT.  BOYS BATHROOM - NIGHT\n\n       Several boys are here, bow ties undone - unclipped in\n       most cases.  Smoking, drinking from whatever inventive\n       container was used to smuggle in booze.  Breath freshener\n       and Visine are the chaser.\n\n       Some of the guys are rolling joints while others make the\n       sad effort to wave smoke away.  Who are they kidding?\n       It's a fog in here.\n\n       MOVE DOWN THE ROW OF TOILET STALLS to one in particular.\n       Here we find A FRECKLED KID standing in front of mirror,\n       clearly holding himself up from the effect of God knows\n       what.\n\n       He talks to his friend in the he stall behind him.\n\n                           FRECKLED KID\n                 Man, what's the matter with you?\n\n       His friend is on the toilet with his head in his hands.\n       He seems to be in some pain.  He is SCOTT SUMMERS - AGE\n       17.\n\n                           FRECKLED KID (contíd)\n                 Dude.  Lighten up.  She's just a girl.\n                 You just gotta-\n\n                           SCOTT\n                 No, my eyes... my eyes are killing me.\n\n       The Freckled kid offers a small plastic bottle.\n\n                           FRECKLED KID\n                 You want some Visine, man?\n\n                           SCOTT\n                 My... eyes...\n\n       The freckled kid looks and sees that Scott's eyes are\n       watering so badly that tears are literally streaming\n       through his fingers.\n\n       He goes back to the mirror to look at his own.\n\n                           SCOTT\n                 ... they're burning...\n\n       The freckled kid turns back to him.\n\n                           FRECKLED KID\n                 Dude, how much did you smoke?\n\n                           SCOTT\n                 I didn't smoke anything.\n\n       Scott looks up, taking his hands away, revealing for an\n       instant that his eyes are merely bright red embers in his\n       head.  Featureless but for the color.\n\n       Freckles takes a step back.\n\n       INT. GYM - OUTSIDE BOYS ROOM - NIGHT\n\n       A blinding flash of light shows through the frosted glass\n       in the double door and cuts through the crack into the\n       dark of the gym.\n\n       All who see it are stunned. Frozen.  A lingering moment\n       of confusion, then:\n\n       BOOM, the doors to the Boys Room burst open and the\n       occupants scatter into the gym.\n\n       INT. GYM - STALL - NIGHT\n\n       Freckles is still there, legs locked.\n\n       FRECKLES' P.O.V.\n\n       He looks at Scott who is now crying meekly in the stall,\n       covering his eyes again -- afraid to open them.\n\n       The door of the stall across from him swings closed TO\n       REVEAL:\n\n       A HOLE, PUNCHED THROUGH THE STALL DOOR framing Scott's\n       face perfectly.  Pull back to reveal that the hole\n       continues through the wall, into the girl's bathroom next\n       door.\n\n       In the corner several girls huddle together, they are\n       afraid.\n\n       INT. SENATE HEARING ROOM - DAY\n\n       Packed with reporters and photographers.  There's a dais -\n       a raised panel of senators - and a second, lower panel.\n       This is where the \"experts\" are testifying.\n\n       Panning across the faces of several G.O.P. creeps as they\n       watch something with varying degrees of interest.\n\n       TITLES:\n\n       WASHINGTON D.C. - THE NOT TOO DISTANT FUTURE\n\n       A woman's voice holds over the proceedings.  It is the\n       voice of JEAN GREY - whom we will soon meet.\n\n       As she is speaking, we come to a large screen television\n       at one end of the room.\n\n                           JEAN (O.S.)\n                 In every organism on Earth there\n                 exists a mutator gene - the X-factor,\n                 as it has come to be known.  It is the\n                 basic building block of evolution -\n                 the reason we have evolved from homo\n                 habilus...\n\n       FOOTAGE REFLECTS THE VARIOUS STAGES OF HUMAN EVOLUTION.\n       Accompanying it is a GRAPH with a DIAGONAL LINE\n       indicating the ascent of the \"human being\" as we know it.\n       Accompanying the graph are evolving images of the\n       \"evolution of man.\"\n\n                           JEAN (O.S.) (contíd)\n                 ... to homo erectus, to homo sapiens\n                 Neanderthals, and, finally, to homo\n                 sapiens.\n\n       The animated demo on the screen zooms in on the lowest\n       order of human depicted - homo habilus - a primitive, ape-\n       like humanoid covered in hair.  As he is singled out, the\n       terrain of his time appears, along with the harsh signs\n       of his winter.\n\n                           JEAN (O.S.) (contíd)\n                 Taking it's cues from the climate,\n                 terrain, various sources of\n                 nourishment, the mutator gene tells\n                 the body when it needs to change to\n                 adapt to a new environment.  The\n                 process is subtle, normally taking\n                 thousands of years.\n\n       As the graphic changes and depicts WARMER CLIMATE, the\n       HAIR STARTS TO DISAPPEAR ON THE MAN'S BODY - gradually\n       evolving into the human we now know as ourselves.\n\n       Now the terrain is modern, the weather pleasant.  The\n       image pulls back and places this man back in line at the\n       front of evolution.\n\n                           JEAN (O.S.) (contíd)\n                 Only in the last few thousand years\n                 did mankind begin to make clothes for\n                 himself, build shelters, use heat and\n                 grow food in large quantities.  With\n                 this man-made environment remaining\n                 relatively stable, the X-factor became\n                 dormant.\n\n       QUICK SHOTS: early huts, early clothing; then early\n       homes, later homes, air conditioning, cars, modern high-\n       rises, etc.\n\n       PULL BACK WIDER\n\n                           JEAN (O.S.) (contíd)\n                 Until now.\n\n       On the room, the reactions, and on JEAN herself.\n\n       A strong, attractive woman in her early 30's.  A simple\n       placard before her:\n\n       JEAN GREY.  GENETICALLY ENHANCED RIGHTS ASSOCIATION.\n\n       The screen shows the words \"PRESENT DAY,\" where the\n       \"evolution line\" has resumed its rise.\n\n                           JEAN (contíd)\n                 For reasons still not known to us, we\n                 are seeing what some are calling the\n                 beginnings of another stage of\n                 evolution -\n\n       A MICROPHONED VOICE interrupts.  Bearing down is the\n       flamboyant SENATOR SCOTT \"FRANK\" KELLY, a conservative\n       from Florida, and the hearing's Chairman.\n\n       Just behind him sits his aide HENRY GUYRICH - mid 30's,\n       typical government cog.\n\n                           KELLY\n                 You're avoiding the question I posed\n                 to you at the beginning of the\n                 hearing, Ms. Grey.  Three words: Are\n                 mutants dangerous?\n\n                           JEAN\n                 I am avoiding a question that is\n                 decidedly loaded, Senator.  The wrong\n                 person behind the wheel of a car can\n                 be dangerous.\n\n       Another SENATOR (LUCINDA ROWEE) speaks into her\n       microphone:\n\n                           SENATOR ROWEE\n                 Well, we do license people to drive.\n\n                           JEAN\n                 But not to live.\n\n       Kelly raises a hand, continuing his tirade.\n\n                           KELLY\n                 Ms. Grey -- you work at a school for\n                 mutants in Westchester, New York.  Can\n                 you tell the members of this committee\n                 what exactly you are teaching these\n                 mutants?\n\n                           JEAN\n                 Math.  History.  Science.  English.\n                 Athletics --\n\n                           KELLY\n                 You wouldn't happen to be teaching\n                 them how to use their powers to --\n\n                           JEAN\n                 Control, Senator...  we teach them\n                 control.\n\n       Kelly raises a blown-up photograph: a grainy, super-\n       zoomed, somewhat obscured image of a CAR ON A FREEWAY\n       which appears to have \"melted.\"  Now he's really playing\n       to the crowd.\n\n                           KELLY\n                 This was taken by a state police\n                 officer in Secaucus, New Jersey.  A\n                 man in a minor altercation literally\n                 melted the car in front of him.  I\n                 don't know where you come from, Ms.\n                 Grey, but where I come from, you don't\n                 go melting people's cars when they cut\n                 you off.  You do it the old fashioned\n                 way -- you give 'em the finger.\n                     (laughs from the crowd)\n                 But what you presume to tell this\n                 committee -\n\n                           JEAN\n                 I presume nothing, I am here to tell\n                 you that in time, the mutator gene\n                 will activate in every living human\n                 being on this planet.  Perhaps even\n                 your children, Senator.\n\n                           KELLY\n                 I can assure you, there is no such\n                 creature in my genes.\n\n       The room LAUGHS.  Kelly mistaken thinks it is for him,\n       until the double meaning occurs to him.  He is\n       momentarily embarrassed, but he quickly recovers.\n\n                           KELLY (contíd)\n                 Ms. Grey, we are not here to weed out\n                 mutants.  The Registration Act is\n                 designed merely to assess their\n                 potential threat - if any - to\n                 national security.\n\n       The crowd reacts loudly in support of the Senator.  Some\n       cheer, some roar, some yell obscenities at Jean.\n\n       Jean stands and walks out, pushing her way through\n       reporters now moving in for her response. All the while,\n       Kelly is delivering his last words.\n\n                           KELLY (contíd)\n                 Mutants are very real.  They are among\n                 us.  We must know who they are.  And\n                 above all, we must know what they can\n                 do.\n\n       AS THE SHOUTS OF THE MOB RISE AND GIVE WAY TO:\n\n       EXT.  CAPITOL BUILDING - WASHINGTON D.C. - DAY\n\n       An angry mob outside the Senate hearing.  Voices roar in\n       dissent when Jean emerges, coming down the steps without\n       hesitation.\n\n       She sees signs condemning mutants, a scarce few\n       supporting them.\n\n       A group of reporters are behind her and more meet her in\n       front, closing her in.  Microphones are shove in her\n       face.\n\n                           REPORTERS/VARIOUS\n                 Dr. Grey, how do you feel about the\n                 Senator's Statement / How is the\n                 mutant community reacting?  Is it true\n                 that mutants are dangerous? / Is there\n                 a mutant plot to overthrow the\n                 government?\n\n       She ignores them all, trying to push through.\n\n       ANGLE ON:\n\n       A KID IN THE CROWD holding a full can of Coke.  Smiling\n       to his friend beside him.  He fires it over the heads of\n       everyone toward Jean.  Perfect trajectory.  Closing fast.\n\n       Suddenly:\n\n       Silence falls over the crowd.  A total silence.  An\n       absolute silence.\n\n       All eyes watch in awe at the can and its liquid trail,\n       frozen in mid-air a few inches from Jean's face.  It\n       simply hovers there.\n\n                           JEAN\n                 Weíre not the ones to be afraid of.\n\n       Using telekinesis she slowly lowers the can to the\n       ground.  She shakes her head, almost ashamed of the\n       display.  Almost as if to say ìI didnít want to do that.î\n\n       The can rolls down the steps.  People move away from it\n       as though the can itself were dangerous.\n\n       The crowd steps back in genuine fear.  Jean simply moves\n       ahead now, unimpeded, still shaking her head.\n\n       EXT. CABIN IN THE SNOW COVERED WILDERNESS - DAY\n\n       Smoke curling from the chimney, warm light emanating from\n       the window.\n\n       A well-worn pick-up truck parked axles deep in the snow,\n       the back filled with a cord of cut wood.  A hand painted\n       scrawl on the door reads:\n\n       Firewood for Sales\n\n       A slope, just behind the cabin leading to a frozen lake.\n\n       PUSH IN SLOWLY TOWARDS THE CABIN.  Ten beers sit cooling\n       in the snow outside the door.  We hear LED ZEPPELINíS\n       ìBLACK DOG.î\n\n       INT. CABIN - DAY\n\n       Music thunders, quite a contrast to the surroundings.  A\n       cosy little abode, showing signs of neglect, as though\n       decorated with a gentler touch that passed not too long\n       ago.\n\n       A large shelf replete with books.  An electric mix from\n       Sun Tsuís The Art of War to Mark Twainís The Adventures\n       of Huckleberry Finn.\n\n       A fire burns in the fireplace.  On the mantle sit a few\n       old black and white photos of a slightly younger Logan\n       posing with a group of HARD-CASE MILITARY TYPES in a\n       heavily wooded area.  We can not tell if they are true\n       Military or simply mercenaries.\n\n       In the wall above the mantle, a sketch of a beautiful\n       woman.\n\n       And finally we come to the occupant of the house, sitting\n       at the only table in the center of the room.  His back is\n       to us.  His hair is coarse and black, sprouting wildly\n       from his head.  He is LOGAN.  We will come to know him\n       well.  As well as we can.\n\n       Despite the loud, pounding music, he is working with the\n       meticulousness of a watch maker.  At the same time, he\n       smokes a thick cigar.  A tall bottle of beer on the floor\n       next to his chair.  A SINGLE, SILVER DOG TAG hangs from\n       his neck from a battered chain.  As we get closer, we\n       look over his shoulder and see what he is working on so\n       intensely.\n\n       Pencil rubs against paper furiously.  He is sketching,\n       what we cannot see.  But he is definitely caught up in\n       his own minds eye.\n\n       HIS HEAD SUDDENLY TURNS.  He listens to something we\n       cannot begin to hear.   A momentary pause, and he goes\n       back to sketching.\n\n       Just as he seems to be settling back into the details\n       again.\n\n       WHACK\n\n       He reaches over and shuts off the music coming from the\n       box beside him.  He listens.\n\n       He stands, turning around slowly in a circle.  He drops\n       the sketch pad on the chair.\n\n       Only the crackle of logs in the fire.\n\n       LOGANíS P.O.V.\n\n       We follow his gaze around the room.  Past the fire which\n       sounds suddenly like a blazing inferno, past the clock\n       which ticks as loud as clapping hands, past the simmering\n       tea-kettle which hisses like a seething cauldron.\n       Finally, he glances at the cigar which we hear crackling\n       nearly as loud as the fire.\n\n       Loganís senses are amplified many times more then ours,\n       he walks to the door.\n\n       E.C.U.\n\n       His nostrils flare.\n\n       He raises his fist beside his face.  For a moment, it\n       seems as if he is just chinking.  Then -- SHOOK - THREE\n       STEELY CLAWS some nine inches long, emerge inexplicably\n       from the skin just above Loganís knuckles.\n\n       Logan barley turns his head before.\n\n       BOOM\n\n       THE WINDOW EXPLODES, letting in freezing wind and\n       billowing snow.\n\n       Logan is hit from behind.\n\n       The attack is so ferocious that we are unable to make out\n       the attacker.  Whatever it is, it is HUGE.  We can hear\n       it snarling and see flashes of its claws as it slams\n       Logan back.\n\n       EXT. CABIN - DAY\n\n       The front door SMASHES OPEN.  The two combatants roll\n       madly down the hill obscured by flying snow.\n\n       Finally, we see Logan separate from his attacker and\n       CRASH THROUGH THE ICE of the frozen lake.\n\n       E.C.U. - A MASSIVE CLAW-LIKE HAND lifts into frame the\n       SHINING DOG TAG hanging from it.  The tagís chain slides\n       off and too the ground.\n\n       UNDER ICE\n\n       Logan struggles, already short of breath.\n\n       As he struggles -- water starts to fill his lungs.  His\n       skin goes pale.  He is drowning.\n\n       EXT. ABOVE ICE - DAY\n\n       We hear an angry grunt as the thing starts to hunt for\n       Logan.  It stalks across the ice, searching.  We catch a\n       glimpse of shoulder, a CLAWED FOOT, a MANE OF HAIR.\n\n       UNDER ICE\n\n       Loganís struggle has decreased somewhat as his strength\n       wanes.\n\n       CRACK\n\n       The ice above Logan shatters as a clawed hand reaches\n       through.\n\n       EXT. ABOVE ICE - DAY\n\n       A violent YANK.  The ice gives way to the soaked and half-\n       frozen Logan.\n\n       The creature picks Logan up by his face, CUTTING DEEPLY\n       into his cheek, and holds him up like a rag doll.  The\n       two are face to face.  This is called SABRETOOTH.  The\n       reasons are obvious.\n\n       Teeth like said animal and catís eyes to match.\n\n       A mutant, certainly a member of a class remote in the\n       extreme.\n\n       And then it speaks.\n\n                           SABRETOOTH\n                 Itís not gonna be that easy.\n\n       Logan, half-drowned, opens his eyes and looks right at\n       Sabretooth as though heís going to say something.\n       Instead, a LUNG-FULL OF WATER comes shooting out.\n\n       With that, Sabretooth ROARS, as he hoists Logan up and\n       throws him.  Logan flies nearly ten yards.  He lands head\n       first.\n\n       Sabretooth skulks over to him.\n\n       With the sound of Sabretoothís breathing comes the rising\n       of the wind...\n\n       Snow from the ground begins to swirl in the bitter cold\n       air.\n\n       Sabretooth is nearly upon Logan now and the wind rises\n       further, until he must shield his eyes from the bitter\n       icy air.\n\n       As he approaches, we see a fresh cut on Loganís face\n       HEALING BEFORE OUR VERY EYES, leaving not so much as a\n       scratch.\n\n       THEN:\n\n       A SUDDEN FLASH OF LIGHT\n\n       Lightning.  No.  Lightning is not red.\n\n       Sabretooth looks around, puzzled, then down at Loganís\n       motionless body.  Then to his feet where a hole in the\n       ice sprouts bubbling water.\n\n       The wind blows so violently now that he nearly misses two\n       figures standing only a few yards away - mere silhouettes\n       in the icy haze.\n\n       A closer look tells us it is a man and a woman, THEY WEAR\n       STRANGE UNIFORMS of form-fitting material - the man wears\n       a reflective visor that hides his eyes.  The womanís face\n       is care revealing dark skin, penetrating eyes and unusual\n       white hair.\n\n       ANOTHER FLASH - one that seems to come from the manís\n       visor itself.  An intense beam of red light.\n\n       Sabretooth looks down and sees the ice at his feet has\n       broken away.\n\n       He plunges through the ice like a mark in a carnival\n       dunking tank.  His massive weight and hairy coat quickly\n       suck him down.\n\n       The TWO FIGURES - CYCLOPS (Scott Summers) AND STORM\n       (Ororo Munroe) - obviously two of the children we saw\n       earlier now grown - move over the hole and calmly watch\n       Sabretooth gather himself and swim back to the surface.\n\n       Storm looks down at the hole, concentrating her intense\n       gaze.  The wind whips further and the water in the hole\n       begins to freeze over.\n\n       UNDER THE ICE\n\n       Sabretooth wisely concedes.\n\n       With one last look at the two mysterious figures now\n       nearly obscured by the ice, he turns his body and swims\n       away with the same agility he had on land.\n\n       ABOVE THE ICE\n\n       THE SNOW AND WIND ARE NOW VIOLENTLY RAGING\n\n       Cyclops and Storm walk over to Logan and look down at him\n       curiously.\n\n       LOGANíS P.O.V.\n\n       They look at one another, wondering.  Above them, a black\n       shape looms into frame, bringing with it the whining of\n       jet engines.\n\n       This is the X-JET and it is like no other plane we have\n       seen before.\n\n       Loganís eyes begin to close as they obscure the last of\n       all perceptible detail.\n\n       INT. CAVERNOUS ROOM - NIGHT\n\n       CLOSE UP ON:\n\n       The Periodic Table of Elements.  A chart made up of\n       blocks depicting the elements and their chemical symbols.\n\n       Among the standards like Gold (Au) and Iron (I) and\n       Oxygen (O2) is a new square on simple red construction\n       paper tacked to the top.\n\n       It contains simply a large letter ìA.î\n\n       TRACKING SHOT THROUGH:\n\n       We are in a laboratory of sorts, quite different from any\n       we have ever seen -- and so are its occupants.\n\n       MORTIMER TOYNBEE, a dim, loyal thug whose agile leaping\n       ability and superhuman strength have earned him the name\n       TOAD.\n\n       Across the room, JOHN ALLERDYCE, a wiry redhead whose\n       ability to control fire with his fingers has earned him\n       the name PYRO.\n\n       In the corner we see BLOB, no explanation needed,\n       devouring a BUCKET of cereal, preariously balanced on his\n       huge belly.\n\n       They are a bestial and sinister bunch.\n\n       Toad and Pyro are working on:\n\n       A MACHINE\n\n       A fantastic device which occupies a hallowed space in\n       this lab.  It is meticulously designed, and with its\n       intricate circuitry, wires, and power boards, it\n       resembles most closely (and only resembles, because truly\n       itís like nothing weíve ever seen before) a combination\n       of an upright torpedo and a fantastic light source --\n       only far more dark and foreboding.\n\n       Pyro holds a stick of solder in one hand.  He lights a\n       lighter with the other, then drops it.  Strange thing --\n       the flame remains hovering about his finger.  Quickly the\n       flame intensifies and turns blue, melting the solder over\n       a small circuit board.  Then, the flame is gone.\n\n       He sticks out his hand like a surgeon.\n\n                           PYRO\n                 Hand me the dykes.\n\n       Toad, both hands occupied, flicks his long tongue and\n       grabs a pair of pliers which he rests in Pyroís hand,\n       leaving them slicked with SLIME.  The flame in his finger\n       goes out.  The slimy coat over the pliers quickly\n       HARDENS, freezing their action.\n\n                           PYRO (contíd)\n                 I asked you not to do that.\n\n       Blob laughs.  Toad shrugs.\n\n       In the background, almost ignored by them, something is\n       on the television.  The news.\n\n                           NEWSCASTER (O.S.)\n                 Preparations are nearly completed for\n                 the upcoming anniversary gala\n                 celebrating the formation of the\n                 United Nations.  With nearly every\n                 invitation confirmed, the occasion\n                 promises to be the largest single\n                 gathering of world leaders in history.\n\n       The image in the screen is a helicopter shot of ELLIS\n       ISLAND, with Liberty Island and the famous Statue in the\n       background.\n\n                           NEWSCASTER (contíd)\n                 Ellis Island, once an arrival point\n                 for thousands of immigrants crossing\n                 the Atlantic with the hopes of a\n                 better life, will open its doors\n                 again.  Only this time it will be to\n                 leaders and their families from over\n                 200 nations.\n\n       Blob belches his skepticism deafeningly.\n\n       TRACK FURTHER THROUGH THE LAIR AND OUT THE DOOR as the\n       Newscast drones on.\n\n       INT. CORRIDOR/OFFICE - NIGHT\n\n       WE MOVE through subterranean corridors and past dozens of\n       projects that share some similarity to the machine we\n       have seen, including crude designs that have been\n       rejected or stripped of their good ideas.\n\n       FAINTLY we become aware of a clicking sound.  Almost like\n       a stopwatch very far away, always growing louder.\n\n       The newscast has faded and another voice is getting\n       closer from somewhere down the hall.\n\n       Sabretooth emerges around a corner heading towards us,\n       turning just as we get to him.  The clicking is loud and\n       clear now.\n\n       Sabretooth enters an office and we follow him.  Seated at\n       a desk in the center of the room is MAX LENSHERR - age -\n       somewhere after sixty, but strong and vital for his\n       years.  He is more often called MAGNETO.\n\n       The clicking is from the sound of an executive pendulum\n       thingy on his desk.  The six steel balls hang onto one\n       another from string supports in formation depending on\n       how many are let to fly from either end.  One ball\n       strikes one and one ball swings out from the other.  Two\n       balls and two, and so on.\n\n       Slight difference.  There are no strings supporting the\n       balls, thus defying gravity.\n\n       A chess set - all of its pieces made of beautifully\n       crafted iron - sits on the far end of the desk.\n\n       He is watching television, or more accurately listening -\n       his eyes looking off into space, deep in thought.\n\n                           INTERVIEWER\n                 ...and the leading voice in the call\n                 for Mutant registration is Senator\n                 Scott Frank Kelly, of Florida, who\n                 claims to support the constitutional\n                 rights of the genetically enhanced,\n                 but whose crusade to register mutants\n                 is gaining popularity.\n\n       Now Kelly is on the screen.  Magneto shakes his head.\n\n                           MAGNETO\n                 Not this one again.\n\n       When Sabretooth clears his throat, the clicking balls\n       instantly freeze and hover there.\n\n       The volume on the television drops, though no remote is\n       in sight.\n\n       Magneto notices Sabretoothís apparent exhaustion, his\n       torn clothing, including the slashes in his side.  His\n       look asks ìwhat happened?î\n\n       Sabretooth crosses the room and places the shining dog\n       tag on the table.  The one he ripped from Loganís neck.\n       He sits at the desk, puzzling over it.\n\n                           MAGNETO (contíd)\n                 Your expression tells me the news is\n                 not good, brother.\n\n                           SABRETOOTH\n                 I lost him.\n\n                           MAGNETO\n                 How?\n\n                           SABRETOOTH\n                 It was Xavierís people.  They knew.\n\n       Frustrated.  Magneto inspects the dog tag.\n\n                           MAGNETO\n                 I want him.  That is all they know\n                 because that is all you know.\n\n       Nothing odd about the tag at a glance, military dog tag,\n       weathered and beaten, but certainly plain, Canadian\n       Military, Loganís name, rank, and a faded serial number.\n\n       His thumb feels the indention of the word at the bottom\n       of the tag that does not seem to fit here.\n\n       WOLVERINE\n\n       We hear the voice of Senator Kelly on the TV.  Kelly is\n       on the screen giving good face.\n\n       As he turns up the television, and again, we donít see\n       how, he places the dog tag on his desk, thinking.\n\n                           KELLY\n                 I think the Presidentís pre-occupation\n                 with international affairs has drawn\n                 his attention away from this problem.\n                 Americanís deserve the right to decide\n                 whether they want their children to be\n                 in school with mutants.  To be taught\n                 by mutants.  They also have the right\n                 to know the dangers.  Thatís the\n                 purpose of registration.  And mark my\n                 words, if the President isnít strong\n                 enough to do what needs to be done...\n\n       As the Senator continues we PULL BACK and see Magneto\n       watching this.  He begins speaking over Kellyís diatribe.\n\n                           MAGNETO\n                 And you may mark my words, Senator\n                 Kelly.  All your plotting, all your\n                 hatred.  I have plans for you.  Iíve\n                 seen you come, and I will see you go.\n\n       As Magneto turns Loganís dog tag between his fingers, we\n       canít help but notice FADED PURPLE SERIAL NUMBERS\n       TATTOOED IN HIS ARM.\n       He then drops the dog tag on the desk, Magneto stands and\n       heads for the door, Sabretooth follows.  The television\n       shuts off and Magneto waves a hand as though beckoning\n       someone to follow.  Or some thing.\n\n       He stops and looks back at the dog tag on the desk and\n       waves again.  A paper clip just next to the dog tag skips\n       off the desk and into Magnetoís hand.  He drops it,\n       annoyed and tries again.\n\n       A slight rattle, then nothing more, as though the dog tag\n       were held down by an unimaginable weight.\n\n       He walks over and picks up the dog tag, inspecting it,\n       then trying to bend it.  Nothing.\n\n                           MAGNETO (contíd)\n                 Can it be..?\n\n       He puts it back on the desk.  Now Magneto concentrates -\n       sending a wave of magnetic force that ripples the air\n       around it.\n\n       The tag trembles, but does not budge.  He looks at\n       Sabretooth and smiles.\n\n                           SABRETOOTH\n                 Is that what youíre looking for?\n\n                           MAGNETO\n                 A piece.  Only a piece.\n\n                           SABRETOOTH\n                 Is it enough?\n\n                           MAGNETO\n                 Enough for a test.\n\n       And as Magneto looks up at Kelly on the television we:\n\n       PAN OVER TO A BULLETIN BOARD on the wall beside him.\n\n       To a periodic table, smaller than the first.\n\n       But still with that red square and added letter ìAî.\n\n       EXT. WHITE HOUSE - PARKING LOT - DAY\n\n       Kelly and Guyrich walk out of the White House on their\n       way to their limousine.\n\n                           KELLY\n                 I canít believe the President canít\n                 see it.  I wouldnít be surprised if he\n                 has a mutant on his staff.\n\n       Kelly and Guyrich climb into the limo and slump back in\n       their seats.\n\n       INT. LIMOUSINE - DAY\n\n                           GUYRICH\n                 Have you thought of a demonstration of\n                 some kind?  Maybe use the UN Summit to\n                 our advantage.  The whole world will\n                 be watching.\n\n                           KELLY\n                 Iím not interested in the whole world,\n                 Henry... Iím interested in America.\n                 Let the rest of the world deal with\n                 mutants their own way.\n\n                           GUYRICH\n                 Where to?\n\n       Kelly rubs his eyes.\n\n                           KELLY\n                 Home.\n\n       Guyrich leans to address the driver.\n\n                           GUYRICH\n                 Dulles Airport.\n\n       INT. LABORATORY - DAY\n\n       Medical monitors beep, keeping track of the vital signs\n       of -- Logan, who lies in a bed in the middle of a medical\n       lab.\n\n       In the wall beside Loganís bed is a light board on which\n       hang Loganís X-rays.  Loganís skeleton seems to be more\n       the creation of a Deco architect than of nature.\n       Streamlined, refined... almost manufactured.\n\n       He is asleep, recovering.\n\n       Jean Grey enters the lab.  She walks over and examines\n       the X-rays, fascinated by their unique structure.  She\n       notices what appears to be an unusually complex network\n       of bones in the forearm.  Jean looks down and runs her\n       fingers over the traces of three incisions on the backs\n       of Loganís hands.  Jeanís eye moves across his body.  His\n       rippling muscles.\n\n       Jean uncaps an IV needle and moves to the middle of\n       Loganís arm.  We cannot help but notice a diamond ring on\n       her left hand.\n\n       Jean starts to put an IV in Loganís arm.\n\n       Just as she is sticking the needle in his arm HE JOLTS\n       VIOLENTLY.\n\n       SNAP\n\n       Loganís hand reaches up quickly, breaking the needle off\n       in his arm.  He grabs a startled Jean by the throat.\n\n       He is out of bed.  She is unable to speak, choked silent\n       by his grip.\n\n       He places his fist near her face.  We see the three faint\n       scars just above his knuckles.\n\n       Hesitation.  Logan looks at her for a moment.  Taken by\n       her beauty.  Then he is on his feet.\n\n       Jean is on the floor, gasping for breath.\n\n       Logan realizes something is missing.  He reaches to his\n       chest and feels for the dog tag.  Gone.  He stifles a\n       curse.\n\n                           LOGAN\n                 Where is it?\n\n       He looks at Jean who recoils from him in terror.  Logan\n       thinks, then bolts.\n\n       INT. HALLWAY - DAY\n\n       Logan comes out into an empty hall.  Strange.  Deathly\n       quiet.  It is very sparse and modern, matching the lab we\n       have just left.  Logan runs and goes through the first\n       door he comes to, to keep Jean from seeing where he has\n       gone.\n\n       INT. READY ROOM - DAY\n\n       He looks around and sees he is in some sort of locker\n       room.  A row of lockers run along one side of the wall.\n       And hanging from the other side in a row, are UNIFORMS,\n       much like the ones Cyclops and Storm were wearing in the\n       snow.\n\n       He starts to rummage through the lockers, coming up with\n       a shirt and pants that almost fit.  A pair of sneakers as\n       well.\n\n       He hears the sound of approaching foot-steps coming from\n       the hallway.  He spots another entrance on the far side\n       of the room and, carrying his clothes, he staggers out,\n       still in considerable pain.\n\n       INT. HANGER - DAY\n\n       Logan rushes through the door, looking behind to see if\n       he has been seen.  He closes the door and leans back to\n       catch his breath... which stops momentarily as he looks\n       around the massive hanger he has entered.\n\n       The X-Jet, the stealth plane we saw in Alaska, now sits\n       parked and quiet.\n\n       Logan walks to the plane and stops -- listening.  We hear\n       a strange THUMPING.  He listens for a second.  The sound\n       picks up in speed and we realize that we are listening to\n       the SOUNDS OF A BASKETBALL GAME coming from above.\n\n       As Logan tries to digest this, the door that he had just\n       come through begins to open, letting in a shaft of light.\n       Logan looks around wildly for a moment, looking for a\n       place to hide when -\n\n       BING.\n\n       An elevator door opens in the wall of the hanger ten feet\n       from where Logan now stands.  He whips around and runs\n       for it.\n\n       There is a button marked ìG.î  He presses it.\n\n       INT. HALLWAY - DAY\n\n       The elevator opens on a hallway that doesnít match the\n       rooms we have already seen at all.  It is plush and\n       stately, the hallway of a great mansion.\n\n       He hears a voice coming from a room.\n\n       As he gets closer to it, we can begin to hear:\n\n                           VOICE\n                 ... until the Emperor Constantine\n                 converted to Christianity.  With that\n                 one act, history was changed.  The\n                 Christians who were once prosecuted\n                 and fed to the lions, became accepted.\n\n       Now the voice is clear as a bell, coming from a room with\n       the door slightly ajar.\n\n       INT. CLASSROOM - DAY\n\n       Logan peeks in and sees in front of a chalk board, a\n       massive blue furry creature called BEAST.  Besides two\n       arms and two legs, the only remotely human thing on his\n       ape-like face is a pair of wire spectacles.  He addresses\n       a class of kids between the ages of 16 and 17.\n       Besides the occasional physical alterations, there is an\n       overall oddness to the group, giving way to the fact that\n       in some way or another these are all mutants.\n\n                           BEAST\n                 So as their leaders went, so did\n                 follow the hearts and minds of the\n                 people of the Roman empire.  Which\n                 made for some very happy Christians.\n\n       Now he sees Logan standing in the door, looking back at\n       him in mute shock.\n\n                           BEAST (contíd)\n                 Can I help you?\n\n       All the students turn to see Logan, standing in a\n       hospital gown with a mean case of bed head.  They start\n       to giggle.\n\n       Logan turns and heads down the hallway to the left.\n\n       INT. HALLWAY - DAY\n\n       Logan hears footsteps and quickly does a one eighty back\n       down the hallway.  He turns a corner, hugging the wall.\n       He halts.  A large oak door stands down the hall.  He\n       smells something, taking in a deep breath, his head\n       cocking to the side - listening.\n\n       He turns and looks behind him.  More foot steps.  Someone\n       is about to enter the hall.\n\n       He turns again, ready to run the other way when he sees\n       the SHADOWS of two more people coming from the other\n       direction.  Logan is trapped.  He lunges for the large\n       oak door and bursts through.\n\n       INT. XAVIERíS OFFICE - DAY\n\n       Logan shuts the door and leans his head back against it,\n       exhausted.\n\n                           VOICE (O.S.)\n                 Good morning, Logan.\n\n       Logan, still clutching his stolen clothes, opens his eyes\n       and sees a man sitting behind a large mahogany desk --\n       PROFESSOR CHARLES XAVIER, an intense and intelligent man\n       just to look at him.\n\n                           XAVIER\n                 Would you like some breakfast?\n\n       Logan, who was prepared for anything but this, just\n       stares.\n\n                           XAVIER (contíd)\n                 Iím sorry, allow me to formally\n                 introduce myself -- I am Professor\n                 Charles Xavier.  This is my school.\n\n                           LOGAN\n                 How do you know my name?\n\n       Xavier taps the side of his head with his finger.\n\n                           XAVIER\n                 Youíre not the only one with gifts.\n\n       When he speaks, his lips do not move.  We realize Logan\n       ìhearsî the voice in his head.  In addition, the voice is\n       accompanied by the FAMILIAR SOUND OF FOOT STEPS\n       indicating that perhaps Xavier had herded Logan through\n       the mansion with his mind.  He does not like it.\n\n       Xavier comes out from behind his desk.  We see that he is\n       in a MOTORED WHEELCHAIR.  Realizing that he is safe for\n       the moment, Logan begins putting on his stolen clothes.\n\n                           LOGAN\n                 What am I doing here?\n\n                           XAVIER\n                 I brought you here so that you would\n                 be safe from Magneto.\n\n                           LOGAN\n                 Who?\n\n                           XAVIER\n                 A very powerful mutant who for some\n                 reason has taken an interest in you.\n                 Iím not sure why, but until we find\n                 out, I must ask you to stay.\n\n       Logan looks Xavier over.  He is obviously a kind man who\n       is offering his help.  Logan is silent for a moment.\n\n                           LOGAN\n                 No thanks.\n\n       Logan goes to the door.\n\n       Xavier, disappointed, just watches him go.\n\n       INT. FRONT HALL - DAY\n\n       Logan sees a grand entrance with two huge oak doors and\n       brightly-polished steel knobs that scream ìexit.î  He\n       starts in that direction when the doors begin to open.\n\n       A moment of traffic, laughing, chatter... then they are\n       all gone.\n\n       He gets to the doors and pushes them open.  Bright white\n       sunlight floods in, nearly blinding him.\n\n       EXT. MANSION - DAY\n\n       The first thing he sees through the haze is wings - GIANT\n       WHITE, FEATHERY ANGEL WINGS.\n\n       A young boy, no more than fourteen, has them sprouting\n       from his back.  He is stretching not only his limbs, but\n       his unusual appendages in the morning breeze.\n\n       Sensing something - the boy turns, and sees this\n       shambling ruin of a man in the doorway.\n\n       Off Loganís expression, we hear the flapping of wings and\n       see his awestruck face following the boy onto the sky.\n\n       This only holds his attention for a moment.  Logan looks\n       across an expanse of grounds that house the Mansion.  A\n       high, wrought-iron gate surrounds the entire property.\n\n       He watches as several children play basketball across a\n       large court.\n\n       Logan shakes his head and is out the closing door.\n\n       Xavier simply watches from his window.\n\n       EXT. MANSION - FRONT GATE - DAY\n\n       Logan heads for the gate.\n\n       SHOOK -- Logan pops his claws.\n\n       Suddenly, the gate slowly opens -- Inviting him to leave.\n       He pauses, momentarily confused.  He takes one long look\n       back at the mansion.  And then leaves.\n\n       Stay for a moment.  Watch him go.  Then pan across a sign\n       which reads --\n\n           PROFESSOR CHARLES XAVIERíS SCHOOL FOR THE GIFTED\n\n                        Westchester N.Y.\n\n       PANNING slowly across the road to the thick woods on the\n       other side of the street.\n\n       SOMETHING MOVES in the trees, catching our eye.  Someone\n       is watching.  It is Toad, camouflaged amidst the trees\n       and branches.\n\n       EXT. SKY - DUSK\n\n       A helicopter streaks across the sky.\n\n       INT. HELICOPTER - DUSK\n\n       Kelly sleeps fitfully in the large seat.  A bump of\n       turbulence.  He wakes suddenly and looks out the window\n       seeing the ocean below.\n\n       Kelly looks out the window again and sees water.  They\n       are flying low.\n\n       He looks at Guyrich, who sleeps as well.  He wakes him.\n\n                           KELLY\n                 Where the hell are we?\n\n       Guyrich looks out the window and looks at Kelly, puzzled.\n       He stands and goes to the door to the cabin of the\n       helicopter.\n\n                           GUYRICH\n                 Pilot?\n\n       No answer.  Guyrich tries to open the door.  Itís locked.\n\n                           GUYRICH (contíd)\n                 Pilot?\n\n       Kelly looks out the window now and sees the helicopter is\n       closing in on an island - where, is anyoneís guess.  What\n       is known is that the place is no pleasure resort.\n\n       It is in fact some sort of refurbished island fortress,\n       complete with turrets, built right into the side of the\n       cliffs.\n\n       EXT. ISLAND HELIPAD - DUSK\n\n       A clearing in the middle of a ring of trees at the base\n       of a rocky rise.  The helicopter touches down.\n\n       THE PILOT, wrapped from head to toe in a flight suit and\n       helmet, gets out and opens the side door, exposing Kelly\n       and Guyrich to the intense wind of the rotors.  They\n       cover their eyes, cowering.\n\n       KELLYíS P.O.V.\n\n       Two figures come out of a hole in the mountain.  One\n       seems extremely larger than the other.\n\n       Guyrich and Kelly step out.  As they get closer he can\n       make out Magneto and Sabretooth.\n\n                           KELLY\n                 Dear God... Dear... God.\n\n       The Pilot removes his helmet to REVEAL:\n\n       Pyro, smiling.\n\n                           KELLY (contíd)\n                 What the hell is this?\n\n       Kelly is utterly confused.  As Magneto nears, Guyrich\n       steps forward to greet him, putting arms around Magnetoís\n       neck and kissing him deeply.  Then Magneto looks deep and\n       lovingly into Guyrichís eyes.\n\n       And with that GUY SHAPE SHIFTS into a beautiful woman who\n       herefore will be known as MYSTIQUE.  Her body is covered\n       in iridescent blue scales, which complement her lovely,\n       solid yellow eyes.\n\n       Kelly, of course, is shocked.  Mystique shows a little\n       hip, raising the scales at her mid-section mockingly, as\n       the last of what we thought was Guyrich slips underneath.\n\n                           KELLY\n                 You... wha... Who are you... Where is\n                 Henry?\n\n                           MAGNETO\n                 Mr. Guyrich has been dead for some\n                 time Senator.\n\n                           KELLY\n                 You mutant bastards...\n\n       Pyro grabs the Senator as he runs back for the helicopter\n       in vain.\n\n                           KELLY\n                 Whatever you do to me... no matter\n                 what youíll make me right.  Every word\n                 I have spoken will be confirmed.\n\n                           MAGNETO\n                 Gosh, I hope so.\n\n       As Kelly struggles against all hope.\n\n                           KELLY\n                 People like you are the reason people\n                 like me exist.\n\n       And with that, Mystique walks up.\n\n                           MYSTIQUE\n                 And people like you are the reason I\n                 was afraid to go to school as a child.\n\n       With that, Mystique punches Kelly.  Knocking him out\n       cold.\n\n       BLACK\n\n       INT. MACHINE ROOM - MAGNETOíS LAIR - NIGHT\n\n       Kelly comes to.\n\n       Magneto walks past him, holding Loganís dog tag.\n\n       His thumb crushes one last time over the curious\n       ìWolverine.î\n\n       PULL OUT TO REVEAL:\n\n       Kelly is strapped to a metal chair, bound impossibly\n       tight.  He struggles.  Mystique watches from the far side\n       of the room.\n\n                           MAGNETO\n                 Are you a ìGod-fearing man,î Senator?\n\n       Kellyís reaction tells him he is certainly afraid of\n       something right now.\n\n                           MAGNETO (contíd)\n                 That term always confused me.  As if\n                 there were something to fear.\n\n       Kelly looks around wildly, terrified.\n\n                           MAGNETO (contíd)\n                 God after all, is often defined as all-\n                 forgiving.  A description I rather\n                 like.  I think what you really are\n                 afraid of...\n\n       Magneto uses his mind to move Kellyís chair a little\n       closer.  Kelly nearly loses it.\n\n                           MAGNETO (contíd)\n                 ...Is me and my kind.  The Brotherhood\n                 of Mutants.\n\n       He touches Kellyís face and Kelly recoils.\n\n                           MAGNETO (contíd)\n                 And this law.  Your mutant\n                 registration act is only the\n                 beginning.\n\n                           KELLY\n                 The intention of registration act -\n\n                           MAGNETO\n                 INTENTION?  Intention, Senator?  We\n                 are talking about mankind here.  His\n                 fear.  It is only a matter of time\n                 before mutants will be herded into\n                 camps.  Studied for weaknesses.  And\n                 eventually wiped off the face of the\n                 Earth.\n\n       Kelly shakes his head.  There is nothing he can say to\n       sway this man.\n\n       Magneto turns and admires his machine.\n\n                           MAGNETO (contíd)\n                 Well, weíre much more giving than\n                 that.  We simply want to share with\n                 you... To help you understand.\n\n                           KELLY\n                 What is it you intend to do to me?\n\n                           MAGNETO\n                     (smiling)\n                 Letís just say, God works too slowly.\n\n       Magneto moves to the machine.\n\n                           MAGNETO (contíd)\n                 Youíre a leader, Senator Kelly -- you\n                 set an example.  And if more of you...\n                 were like more of us?  Well, youíll\n                 see.\n\n       Kelly watches as Magneto takes Loganís dog tag and places\n       it atop a tube at the bottom of a large spire in the\n       center of the room some thirty feet high.\n\n       He walks toward the opposite side of the room and watches\n       as the tag is raised to the top of the device, through\n       the shaft.\n\n                           MAGNETO (contíd)\n                 Donít fear God, Senator.  And\n                 certainly - most certainly... donít\n                 fear me.\n\n       A beat.\n\n                           MAGNETO (contíd)\n                 Not any more.\n\n       ANGLE ON:\n\n       MAGNETO raises his arms and a series of metal rings up\n       from the machine platform that holds the dog tag.  With a\n       slight motion of his hand, the rings begin to spin slowly\n       gaining in speed as Magneto controls it with his power.\n\n       The air around it ripples, gaining in intensity.\n\n       WAVES OF MAGNETIC ENERGY POURS from Magnetoís hands\n       toward the machine.\n\n       Now, Magneto has the rings spinning around the dog tag at\n       such speed, the rings themselves are no longer visible -\n       merely a blur around the stationary tag.  Magneto lowers\n       his hands.  The machine is now working on its own.\n\n       Kellyís eyes grow wide with fear as the metal dog tag\n       begins to glow.  Dull at first... the brightly... too\n       brightly.\n\n       The deafening whine of the machine builds louder and\n       louder.\n\n       Suddenly -- SILENCE\n\n       FIVE SECONDS OF ABSOLUTE SILENCE.\n\n       The sphere vanishes, enveloped in a light so white, it\n       defies description.\n\n       But Iíll try:\n\n       A light that seems to ooze rather than radiate.  A light\n       that fills the room as it expands outward and engulfs\n       everything in sight.\n\n       It is liquid light.  Creeping and unstoppable.\n\n       From outside the room, Pyro and Sabretooth watch through\n       the window.  It comes through, first casting its shadows\n       darkly against the wall, then erasing them as it swallows\n       them -  as though they were never there.\n\n       INT. HALLWAY - NIGHT\n\n       From under a door, the light leaks in, filling the room.\n\n       All through the lair, air vents, keyholes, drainpipes and\n       the like, the liquid light fills the lair to the gills.\n\n       EXT. MAGNETOíS LAIR - NIGHT\n\n       THROUGH THE TURRET ATOP THE LAIR, the light beams up into\n       the night sky, shinning like a beacon for miles.\n\n       Then the white light obscures all.  Fueled by this tiny\n       piece of metal, the light extends like an ever growing\n       bubble, out and up over the ocean.\n\n       PULL BACK FROM THE SMALL ISLAND\n\n       The bubble of white light is easily five miles across.\n\n       INT. MACHINE ROOM - NIGHT\n\n       Kelly grits his teeth, barely visible in the whiteness.\n\n       Then it is gone.  He hangs his head in exhaustion.\n\n       Magneto himself is a bit overwhelmed.  He looks at his\n       own skin - no apparent change.  He shakes his head,\n       blinks his eyes.\n\n       Sabretooth and Pyro are also a bit struck by the display\n       and they also seem a bit dazed.\n\n       Magneto walks over and reaches into the still steaming\n       metal device.  His hand comes out holding the dog tag -\n       actually its remains.\n\n       A frazzled, blackened wire, warped and spent.  Nothing\n       more.  And this turns to dust in his fingers.\n\n       Magneto has amazed even himself this time.\n\n       The silence is shattered by a phone ringing.  Sabretooth\n       picks it up.  He listens, then hands the phone to\n       Magneto.\n\n                           SABRETOOTH\n                 Weíve found him.\n\n       Magneto puts the phone to his ear.  He smiles.\n\n                           MAGNETO\n                 Where?\n\n       ANGLE on Kelly, his skin glistening slightly, almost\n       luminescent.  Pinker (healthier?) then it was when he\n       came in.\n\n                           KELLY\n                 Oh... Oh God... what have you done to\n                 me?\n\n       Magneto hangs up the phone.  He crosses to Kelly, leans\n       in and whispers in his ear.\n\n                           MAGNETO\n                 Welcome to the future... brother.\n\n       Magneto stands, looks at his machine, then back at Kelly.\n\n                           MAGNETO (contíd)\n                 Now if youíll excuse me...  I have a\n                 train to catch.\n\n       EXT. TRAIN - NIGHT\n\n       The silver Amtrack moves speedily through the dark\n       countryside.\n\n       INT. TRAIN - NIGHT\n\n       A CONDUCTOR makes his way through a half filled car of\n       commuters taking tickets.  He passes a restroom and exits\n       the car.  He takes a seat.\n\n       Logan emerges from the restroom, having avoided paying\n       his fare.\n\n       A few seats in front of him, in a grouping of seats that\n       face one another, sit four large guys, early twenties --\n       Theyíre the guys from your college named Brad that used\n       to get drunk and try to drown freshmen in the toilets.\n       Weíll call them BRADS 1, 2, 3, and 4.  They are drinking\n       from beer cans in paper bags.\n\n       Across the aisle from them sits a lone oddly pretty\n       twenty year old girl.  Her name is ROGUE -- a dark-eyed\n       and somewhat distant creature.  From the shawl around her\n       head to her boots, layers of odd clothing wrap every inch\n       of her body, except her face and hands.  She looks worn,\n       it is the face of a runaway.  Next to her, a dirty duffle\n       bag.\n\n       The Brads are staring at Rogue, making lewd comments\n       about her.  They have obviously been drinking for awhile.\n\n                           BRAD 1\n                 Hey.\n\n       Rogue looks at him, then quickly looks away.\n\n                           BRAD 1 (contíd)\n                 Hey... Hey Iím talking to you.\n\n       The Brads laugh amongst themselves at her reaction.\n\n                           BRAD 2\n                     (looking at her duffle bag)\n                 Where are you going?\n\n                           BRAD 1\n                 Awww... look guys sheís shy.\n\n                           BRAD 3\n                 Maybe thatís why sheís alone.  Is that\n                 why youíre alone?\n\n       Brad 4, who is closest to Rogue, leans toward her.\n\n                           BRAD 4\n                 Iíll keep you company.\n\n       Rogue is silent and turns her back on him, trying to\n       ignore him.\n\n                           BRAD 4 (contíd)\n                 Hey...  Iím talking to you.\n\n       Rogue continues to ignore him.  This gets Brad 4 angry.\n       The other Brads watch his failure and laugh.\n\n                           BRAD 4 (contíd)\n                     (louder)\n                 I said Iím talking to you!\n\n       ANGLE ON: Logan, his ears picking up everything.\n\n       Rogue looks down trying not to look at them.\n\n       Brad 4 will not be ignored.  He reaches out to the one\n       place which is not covered by clothing that he can reach -\n       - Rogueís hand lying at her side.\n\n                           BRAD 4 (contíd)\n                     (louder still)\n                 I said...!\n\n       He grabs her hand.\n\n       Suddenly, Brad 4ís eyes open wide as if heís in shock, an\n       instant later, he COLLAPSES.\n\n       Rogue reels back.\n\n       Bradís 1, 2, and 3 stand up, they are angry.\n\n                           BRAD 1\n                 Hey, what did you do?\n\n                           ROGUE\n                 Donít touch me.\n\n       Rogue stands, frightened and confused.  Brad blocks her\n       in.\n\n                           BRAD 3\n                 Hey Brad, sheís a mutant!\n\n       Rogue moves to get away, but Brad 1 shoves Rogue.  Rogue\n       falls to the floor of the train, right next to Loganís\n       feet.  Brad 1 moves toward her.\n\n       Suddenly, Logan steps in front of Brad 1.\n\n                           LOGAN\n                 How about you sit down and leave the\n                 kid alone, alright?\n\n                           BRAD 1\n                 Sheís a mutant.\n\n                           LOGAN\n                 Yeah, well, nobodyís perfect.\n\n       ANGLE ON: Rogue, she gets up and huddles toward the rear\n       of the train.\n\n                           BRAD 1\n                     (who is considerably larger\n                      than Logan)\n                 I think you should take a seat little\n                 fella.\n\n       He shoves Logan backward.  Logan gathers himself.  Brad 4\n       is very weak but regaining consciousness.\n\n       Brads 2 and 3 stand to back their friend against Logan.\n       Itís now three against one.  All the passengers are\n       watching --\n\n                           LOGAN\n                 Listen -- I donít want any trouble.\n\n                           BRAD 1\n                 Well you got trouble.\n\n       Brad 1 slams his fist into Loganís stomach.  Logan grabs\n       the manís fist and lifts him up and over, slamming him\n       into the train floor.\n\n       Brad 2 grabs a commuterís briefcase and smashes it on\n       Loganís head.  Bursting open, its contents fly\n       everywhere.\n\n       Logan turns.  Brad 2 stares wide-eyed as the gash on\n       Loganís head starts to heal.\n\n       Suddenly, Brad 1 is up.  He grabs Logan around the neck\n       from behind.  He holds Logan in his head lock while Brad\n       2 and 3 start punching  him in the stomach and face.\n       Logan is taking quite a beating and naturally the entire\n       train of people are doing nothing.\n\n       ANGLE ON: Loganís eyes, his pupils are getting smaller.\n       His brow furrows like a wolf.  A low guttural GROWL.\n\n       Suddenly rage -- PRIMAL RAGE\n\n       Loganís feet kick out, his left foot strikes Brad 1 in\n       the face knocking him backward, while his right foot\n       hooks around Brad 2ís head dragging him forward.  With\n       his left hand Logan grabs Brad 2 by the throat, squeezing\n       the esophagus.\n\n       Brad 2 is paralyzed.  His eyes roll up as the oxygen is\n       cut off.  Brad 2 collapses.\n\n       ANGLE ON: Brad 3 running out of the car with the other\n       passengers.  A TRANSIT COP pushes past the fleeing\n       passengers, into the car.\n\n       Brad 1 still bear hugs Logan from behind.  Logan reaches\n       pushing his knuckles against Brad 1ís leg.  Suddenly:\n\n       SHOOK -- the sound of metal extending.  Brad 1 howls in\n       pain.  SHOOK -- the sound of metal retracting.\n\n       Brad 1 releases Logan and stares down at three punctured\n       holes in his leg.  Logan wheels around, kicks him to the\n       floor, and punches him.\n\n       All eyes in the train are on Logan, as he raises his\n       fist.\n\n       SHOOK -- Logan extends his claws.\n\n       Logan is at the peak of his rage.  The passengers stare\n       in disbelief.  Even Rogue is astonished.\n\n                           TRANSIT COP\n                 Freeze... transit police.  Drop your\n                 weapon.\n\n       Logan pauses, only for a second.  Brad 1 is wailing for\n       his life.\n\n       But rage has taken over.  Logan raises his blades to\n       finish what he started.\n\n       Suddenly, THE TRAIN LURCHES VIOLENTLY.  Logan goes flying\n       backward.\n\n       EXT. TRAIN - NIGHT\n\n       The train has been brought to a sudden stop -- but the\n       wheels are still turning.  Finally, they are shut down.\n\n       INT. TRAIN CAR - NIGHT\n\n       The lights are out.  Everyone gathers themselves.  Then\n       comes a low grinding creak.  The sound of metal bending.\n       Rivets popping.\n\n       EXT. TRAIN - NIGHT\n\n       Like the top of a sardine can, the entire side wall of\n       the train car is peeled off.  Revealing the terrified\n       passengers inside -- and Magneto, Sabretooth, Mystique\n       Toad and Pyro on the outside.  With a final thrust, the\n       air RIPPLES and Magneto tosses the car wall to the side.\n\n       Passengers from the other cars stare wide-eyed out their\n       windows.  The train has stopped at a railroad crossing,\n       the gates are down.\n\n                           MAGNETO\n                 You can come out now, Logan.  Youíre\n                 among friends.\n\n       The transit cop rises to his feet, brandishing his\n       pistol.\n\n                           TRANSIT COP\n                 Freeze!\n\n       With a turn of his finger, Magneto draws the pistol to\n       him.  The cop holds tight and is yanked off the train,\n       onto the ground.  With another twist of his hand, Magneto\n       makes the gun leap from the copís grasp and HOVER,\n       pointing at the copís head.\n\n                           MAGNETO\n                 You Homo Sapiens and your guns.\n\n       The gun cocks.\n\n                           XAVIER (O.S.)\n                 Thatís enough, Max!\n\n       All turn to see Xavier, seated in his wheelchair --\n       flanked by Cyclops, Jean and Storm.  All, save Xavier,\n       are in uniform.\n\n       THUNDER RUMBLES ACROSS THE SKY\n\n       ANGLE ON: Storm, a GUST OF WIND.\n\n                           MAGNETO\n                 Iíll never understand your regard for\n                 them, Charles.\n\n                           XAVIER\n                 And Iíll never understand terrorists.\n\n                           MAGNETO\n                 I am trying to save our kind, Charles.\n                 You should do the same.\n\n                           XAVIER\n                 Not at the cost of lives, Max.\n\n       Xavierís metal chair is gripped by magnetic forces.  It\n       shakes and begins to inch towards Magneto.\n\n                           MAGNETO\n                 Magneto.\n\n       The chair is pulled closer to Magneto.  Cyclops steps\n       forward.  Xavier need not turn to know help is coming.\n\n       Magneto sees and respects Cyclopsís power.  The chair\n       stops moving.\n\n                           XAVIER\n                     (to Cyclops)\n                 Itís alright... itís alright.\n\n       Magneto glances at Storm, then Cyclops.\n\n                           MAGNETO\n                 The two in Alaska.  Just how do you\n                 people manage to be in the right place\n                 at the right time?  Still tinkering\n                 with Cerebro?\n\n                           XAVIER\n                     (referring to Logan)\n                 What do you want with him?\n\n       Magneto smiles now, tapping his METAL HELMET.\n\n                           MAGNETO\n                 Canít read my mind?\n\n       Xavierís expression falters.  It appears as if the helmet\n       has been made to block Xavier from doing just that.\n\n                           MAGNETO (contíd)\n                 Iíll tell you something, Charles, we\n                 are more alike now than we were when\n                 we started.\n\n                           XAVIER\n                 Is that so?\n\n                           MAGNETO\n                 Still trying to make the world safe\n                 for our kind.  Still trying to find a\n                 way to introduce ourselves --\n                 definitively.\n\n                           XAVIER\n                 You definition of definitive was\n                 always a bit extreme for me, Max.\n                 What is it like these days?\n\n                           MAGNETO\n                 Letís just say that I am out to make\n                 some radical changes.  Now come on\n                 Charles.  For old times sake, for your\n                 sake...  Leave him to me.\n\n       Logan slowly rises from the huddled passengers.\n       Sabretooth fighting the urge to move on him.  Logan\n       glares back at Sabretooth.\n\n                           MAGNETO (contíd)\n                 Ahh... there you are brother.  I\n                 believe you possess something I am\n                 very much in need of.\n\n       Just then, SABRETOOTH ROARS UNCONTROLLABLY and punches\n       Toad in the stomach, doubling him over.  Oddly - Toad is\n       laughing.  He stands upright.\n\n                           TOAD\n                 Do it again.\n\n       Another roar and another punch.  Toad is crying and\n       laughing at the same time.\n\n                           TOAD (contíd)\n                 Oh God it hurts.  Do it again.\n\n       Magneto watches this, momentarily stunned.\n\n       Suddenly, Pyro grabs hold of his face.\n\n                           PYRO\n                 IíM BLIND.\n\n       And Mystique MORPHS into a small child and begins tugging\n       at Magnetoís pant leg.\n\n                           MYSTIQUE\n                 I have to go to the bathroom.\n\n       Magneto looks at the cause of it all: XAVIER, HIS EYES\n       CONCENTRATING, HAS ALL OF MAGNETOíS MINIONS UNDER HIS\n       PSYCHIC CONTROL.\n\n       Cyclops cannot help laughing.  Storm and Jean smile.\n\n       Magneto is furious.\n\n                           MAGNETO\n                 If I could make you understand.  If\n                 you could just be made to see it the\n                 way I do.  The way itís going to be.\n\n                           XAVIER\n                 The way what is going to be?\n\n                           MAGNETO\n                 Iím going to change the world with or\n                 without you as a witness, Charles.\n                     (Points to Logan)\n                 And this one gets a front row seat.\n\n                           XAVIER\n                 What do you mean to do?\n\n       And Magneto steps back a little further.  His oddly\n       behaving consorts follow.\n\n                           MAGNETO\n                 This checkmate goes to you.  I didnít\n                 want to hurt anyone.  But you leave me\n                 no choice.\n\n                           XAVIER\n                 WHAT DO YOU MEAN TO DO?\n\n       Sabretooth and Toad walk away, still with the punching\n       and asking to be punched.\n\n       Magneto takes the little girl/Mystique by the hand and\n       the blind Pyro by the arm and leads them away,\n       humiliated, to their waiting helicopter.\n\n       Xavier turns back to Logan, still standing in the train\n       car, amidst all the huddled passengers.  Suddenly, all\n       the passengers except Rogue lay on the floor and seats\n       and go to sleep.  A few of them even snore.\n\n                           XAVIER (contíd)\n                 Now will you come back with us?\n\n       A look crosses Loganís face.  Uncomfortable.\n\n                           LOGAN\n                 Look, I appreciate your concern.  But,\n                 I do better on my own.\n\n       Xavier indicates the wreckage of the train.\n\n                           XAVIER\n                 You got less than sixty miles today.\n                 Iíll make you a deal.  Two days.\n                 If we havenít figured out what Magneto\n                 wants with you by then...  Iíll bring\n                 you back myself.\n\n       Logan looks up at Xavier suspiciously, hating that he is\n       making sense.  Xavier moves closer.\n\n       Logan looks over at Rogue, covered in her layers of\n       clothes.  Storm is helping her off the train, yet taking\n       care not to touch her skin.\n\n                           LOGAN\n                 What are you going to do with her?\n\n       Xavier looks to Rogue.  A warmth comes over his face.  An\n       look of understanding.  At a glance he has read her mind.\n       He knows her pain -- her struggle.  Rogue looks to\n       Xavier.  Their eyes meet.\n\n                           XAVIER\n                 Rogue is a beautiful girl, with an\n                 extraordinary power.  One that even\n                 her own family isnít able to accept.\n                 Sheís been on her own for weeks now,\n                 searching for a home.  A place to\n                 belong.\n\n       Xavier turns to Logan.\n\n                           XAVIER (contíd)\n                 -- Weíre going to give her that.\n\n       Logan looks at rogue, contemplating this.  Then to\n       Xavier.\n\n                           LOGAN\n                 Forty-eight hours, old man.  But if\n                 you cross me, I wonít feel any guilt\n                 about what I do to you.\n\n                           XAVIER\n                 Deal.\n\n       Logan eyes the rest of the gang until he settles his gaze\n       on Jean.  He offers a faint seductive smile.  This is not\n       lost on Cyclops.\n\n       INT. MAGNETOíS LAIR - CELL - LATER - NIGHT\n\n       A cell with bars, but no visible door.\n\n       Kelly is hunched over his toilet, heaving.  His suit is\n       rumpled and dirty, showing signs that time has passed.\n\n       There is a television just outside the door:\n\n       We see SEVERAL NEWS HELICOPTERS circling a platform built\n       against the backdrop of the main entrance to Ellis\n       Island.  We see massive security measures, the likes of\n       which have never been attempted, being prepared.\n\n       (Voice plays over the rest of the scene)\n\n                           NEWSCASTER (V.O.)\n                 Is there such a thing as too much\n                 security?  A possible complication\n                 adding to the United Nations\n                 Anniversary is the sheer number of\n                 security personnel for what will be\n                 the largest single summit in the\n                 history of the planet.\n\n       He walks towards the cell and tries to look down the\n       hall, pressing his face to the bars.\n\n                           NEWSCASTER (V.O. CONTíD)\n                 While the Secret Service has never had\n                 difficulty handling one or even\n                 several world leaders, it has never\n                 had to handle the daunting task of\n                 watching over all of them.\n\n       It is only then that he hears a slight crack and his head\n       squeezes between the bars like a soft-shelled egg.  He\n       gasps in pain, but more from shock.  He pulls his head\n       back with some difficulty and POP, it squeezes right back\n       through.\n\n                           KELLY\n                 What have you bastards done to me?\n\n       Kelly is horrified.  Disgusted.  He paces the cell,\n       unable to comprehend what has happened to himself.\n\n       It is only when he hears the sound of a HELICOPTER IN THE\n       DISTANCE that he reacts.  He starts to panic, then\n       collects himself.  Then he goes over to the bars again.\n       He pauses, afraid... then:\n\n       He pops his head through again.  He turns his shoulder\n       toward the bars and begins to push.  His feet slip in the\n       floor and his fingers stretch and crack inside, then his\n       ribs begin to pop one by one with the brittleness of\n       undercooked spaghetti.  It is agonizing, but Kelly\n       finally manages to pull his horribly-altered body through\n       the bars.\n\n       INT. HALLWAY - NIGHT\n\n       Kellyís whole chest and pelvis are slightly flattened\n       beneath his clothes, but with a hideous crunching sound,\n       they seem to inflate again back to normal.\n\n       Kelly looks at his body with a mixture of fascination and\n       disgust.\n\n                           VOICE\n                 HEY.\n\n       Kelly turns and screams.  Blob has just walked into the\n       room and lunges, grabbing him by the arms.  Kelly is\n       enveloped in this fat, hulking mass.  He manages to keep\n       one hand free and all he can do is push it against Blobís\n       face.  It is futile.  Until...\n\n       Steam begins to come off Blobís face.  And Blob SCREAMS\n       IN PAIN.\n\n       EXT. HELIPAD - NIGHT\n\n       Senator Kellyís helicopter, which has obviously been\n       pilfered for Magnetoís use, lands.\n\n       Magneto, Sabretooth, Pyro, Mystique (no Toad) all climb\n       out, having returned from their ill-fated attempt to get\n       Logan.\n\n       INT. HALLWAY - ELSEWHERE - NIGHT\n\n       Kelly peers down the hall where we first went on our way\n       to meet Magneto.\n\n       Kelly, with only that way to go, does so, passing once\n       again the odd assortment of machines, very reminiscent of\n       the one he was exposed to.\n\n       He hears voices coming toward him and he looks around\n       wildly, wondering what to do.  Shadows foretell the\n       arrival of the brotherhood headed this way.\n\n       Kelly turns to run back from where he cam from.\n\n       INT. HALLWAY - ELSEWHERE - NIGHT\n\n       Magneto and Sabretooth come walking from the other end of\n       the hall and pass the very spot where we just saw Kelly.\n       No sign of him.\n\n       INT. CELL - NIGHT\n\n       From which Kelly has escaped.  The bars bend to make room\n       for Magneto as he walks into the room.\n\n                           MAGNETO\n                 How are we feeling today, Senator?\n                 Advanced, I hope...\n\n       But he freezes when he actually enters the room.\n\n       First, he sees that Blob is laying on the floor with a\n       purple, welt-like hand print across his face.  It is\n       blistered and hideous.  Blob is gasping for air.\n\n       Magneto looks and sees the cell is empty.  He looks at\n       Sabretooth.\n\n                           MAGNETO (contíd)\n                 I want him alive.\n\n                           SABRETOOTH\n                 Iíll find him.\n\n                           MAGNETO\n                 ALIVE.\n\n       And Sabretooth bolts back from where they came.\n\n       EXT. MAGNETOíS LAIR - NIGHT\n\n       Kelly hits the fresh air, looking around wildly.  He runs\n       for the edge of a cliff high over the ocean.\n\n       He raises his hands, we see his palms are covered with\n       those wicked spines and they are dripping a venomous\n       fluid not too different in color from the wound on Blobís\n       face.\n\n       But then suddenly, something is wrong.  Kelly buckles,\n       clutching his stomach again.  He squelches what would\n       have been a scream of agony.\n\n       He looks at his palms and the spikes are gone.\n\n       Kelly hears footsteps.  Suddenly out of the darkness\n       Sabretooth barrels toward him.\n\n       Kelly turns and LEAPS.  Sabretooth comes to the edge of\n       the cliff.\n\n       When he looks over, Kellyís body has vanished.  Swallowed\n       by the sea.\n\n       Only his clothes remain on the rocks below.\n\n       INT. LOGANíS ROOM - NIGHT\n\n       Jean shows Logan the simple dorm cube with a bed and a\n       small desk.  Jean opens the door for Logan and he\n       inspects the sparse surroundings grimly.  Cyclops stands\n       just outside the door - eavesdropping.\n\n                           JEAN\n                 Anything else I can get you?\n\n                           LOGAN\n                 Some cigars.  Case of beer.\n\n                           JEAN\n                 Thereís no smoking or drinking on the\n                 school grounds.\n\n                           LOGAN\n                 I wonít light the cigars - how about\n                 that?\n\n                           JEAN\n                 Iíll see what I can do -- You should\n                 get some sleep.  Even with your\n                 healing ability, youíre going to be\n                 hurting for a while.\n\n                           LOGAN\n                 What if I like the pain?\n\n       Jean doesnít know what to make of that.  She is about to\n       leave, then pauses.\n\n                           JEAN\n                 The Professor said you were a solider.\n                 Actually, I believe he used the word\n                 mercenary.\n\n                           LOGAN\n                 Yeah?  Well I donít like to talk about\n                 my past.\n\n                           JEAN\n                 Maybe, the Professor could help you\n                 with that.\n\n                           LOGAN\n                 By reading my thoughts?\n\n                           JEAN\n                 If necessary.\n\n                           LOGAN\n                     (smirks)\n                 What if theyíre naughty?\n\n       Jean smiles politely at his knowing glance.\n\n                           JEAN\n                 Get some shut-eye, slick.\n\n       She shuts the door.\n\n       INT. HALLWAY - NIGHT\n\n       Jean hesitates at the door, thinking.  Smiling.  She\n       turns and only then does she realize Cyclops is standing\n       there.\n\n       She is startled.\n\n                           JEAN\n                 Scott.. I -\n\n                           CYCLOPS\n                 I donít like him being here.\n\n                           JEAN\n                 What are you talking about?\n\n                           CYCLOPS\n                 You saw what happened tonight.  You\n                 think Magneto wonít come after him\n                 again.  You think he wonít come here\n                 if necessary.  This is a school, for\n                 Godís sake.\n\n                           JEAN\n                 If Magneto is planning to use Logan\n                 for some terrible purpose itís our\n                 responsibility to do something.\n\n       Cyclops shakes his head.\n\n                           JEAN (contíd)\n                 Whatís wrong?  Thereís something else\n                 bothering you.\n\n       Cyclops gets closer to Jean.  She puts her hand on his\n       chest.\n\n                           CYCLOPS\n                 I have a bad feeling about this.\n\n       Jean leans in slowly and kisses Cyclops just beside his\n       mouth\n\n                           JEAN\n                 You know I love you, Scott.\n\n       Cyclops pulls her close.  The hold each other.\n\n       INT.  LOGANíS ROOM - NIGHT\n\n       E.C.U. Loganís ear.  His super-sensitive hearing has\n       picked up the whole conversation.\n\n       Logan looks over on the bed and sees a new sketchbook and\n       several pencils.\n\n       A small note is attached.\n\n\n       \t\t\t\t\tI hope you donít mind.  I understand this\n       \t\t\t\t\thelps you relax.\n\n                                       - X\n\n       Logan shakes his head.\n\n       INT.  XAVIERíS OFFICE - LATER - NIGHT\n\n       A white light board.  Beastís blue furry hand slides a\n       long, full-body x-ray in place.\n\n       Beast is showing Loganís x-rays to Cyclops, Storm, Jean\n       and Xavier.\n\n                           BEAST\n                 Adamantium.  Until today I thought it\n                 to be a myth.  Impenetrable,\n                 unbendable, resistant to the most\n                 extreme heat, cold, indestructible.\n\n       Beast points to the x-ray.\n\n                           BEAST (CONT'D)\n                 Itís been grafted to his entire\n                 skeleton.\n\n                           XAVIER\n                 He also has accelerated healing\n                 abilities - uncharted regenerative\n                 capability, making his age impossible\n                 to determine.  He could very well be\n                 older than I am.\n\n                           STORM\n                 Is the Adamantium part of his\n                 mutation?\n\n                           XAVIER\n                 No.  Someone put it there, relying on\n                 his healing abilities to keep him\n                 alive.\n\n                           CYCLOPS\n                 What do you think Magneto wants with\n                 him?\n\n       Xavier wheels himself to the window, starring out, deep\n       in thought.\n\n                           XAVIER\n                 Iím not entirely sure itís ìhimî that\n                 Magneto wants.\n\n       ANGLE ON: X-ray of Loganís Adamantium skeleton.\n\n       INT. MANSION - NIGHT\n\n       Rogue.  The waifish young thing who hides so well in the\n       shadows seems more comfortable to be moving through the\n       mansion at night.\n\n       She passes through the halls and rooms not making a sound\n       in her strangely-swathed body suit.\n\n       INT. LOGANíS ROOM - NIGHT\n\n       She creaks a door open slowly, letting a shaft of dim\n       light slice the darkness.\n\n       The light shines across a nightstand.  Rogue stares down\n       at the notepad, a sketch it.  It is of an animal, small\n       but fierce - a wolverine.\n\n       She walks in to a figure laying in the bed and stands\n       over him.  Over Logan.\n\n       He lays under a single sheet, sweating, his eyes moving\n       quickly this way and that in R.E.M.  His hands twitch.\n\n       Rogue leans closer.\n\n       PUSH IN ON LOGANíS EYES AS THEY MOVE UNDER THE LIDS.\n\n       FLASH - DREAM SEQUENCE\n\n       INT. MILITARY LAB - THE PAST - NIGHT\n\n       Like none we have ever seen thus far.  In fact, judging\n       by most of the instruments here, we are looking at a\n       laboratory some fifty years old.\n\n       Logan looks down and we can see his body, naked, strapped\n       to a table.\n\n       A hand puts a mask over his mouth and -\n\n       BLACK\n\n       He awakens -\n\n       STILL LOGANíS P.O.V.\n\n       He struggles weakly with restraints as doctors in lab\n       coats and thick, red rubber gloves stand over him taking\n       notes, paying very little attention to him at all.\n\n       On the other side of the room is a huge vat filled with\n       some kind of molten metal.\n       At the base of the vat is a giant electromagnet\n       generating a huge gyroscope which created enormous\n       friction energy - the apparent source of the intense heat\n       for melting the metal in the vat.\n\n       AGAIN THE MASK PUTS HIM UNDER AND:\n\n       BLACK\n\n       Awake again, but this time sinking into water -\n       restrained completely now.\n\n       Logan looks down and gets only a glance of his body,\n       seeing that he is a series of incisions from head to toe -\n       literally split open - the flesh held back with hundreds\n       of clamps.\n\n       HE SINKS INTO THE STRANGE LIQUID - LIKE WATER BUT THICK\n       AND VISCOUS.\n\n       And the sound of a DROWNING SCREAM.\n\n       AND THE METAL IS POURED IN AFTER HIM.\n\n       THE SOUND OF MOLTEN METAL HITTING LIQUID IS UNNERVING.\n       Mixed with screams, it is unbearable.\n\n       INT. LOGANíS ROOM - NIGHT\n\n       SCREAMING\n\n       Loganís screaming as he comes to.\n\n       Loganís eyes FLASH OPEN.  He looks up and sees a figure\n       looming over him.  In a flash he reacts.\n\n       THUD.  Nothing more.  Then silence.\n\n       The door bursts open and Cyclops stands in the doorway\n       shocked.  Frozen.  Jean is next and finally Storm.  They\n       can only stare.\n\n       Logan sits upright in bed, CLAWS EXTENDED, INTO ROGUEíS\n       CHEST.  She is literally frozen at the end of his arm.\n\n       Finally, Cyclops breaks the silence and moves to grab\n       her.\n\n                           STORM\n                 DONíT TOUCH HER.\n\n       Cyclops freezes.\n\n       Logan finally pulls his claws free and retracts them.\n       Rogue staggers, she pitches forward and touches his face\n       gently with her hands, as though she would like him to be\n       the last thing she sees on this Earth.\n\n       Logan and Rogue, locked in a fatal moment of tenderness\n       snaring a look of loneliness that only they can\n       understand.\n\n       But suddenly, Logan seems to change.\n\n       And before he can say another word, he begins to tremble,\n       then he starts to howl in pain.\n\n       Rogue SNAPS BACK, mouth open in a gaping, silent scream.\n       What sound comes out does not match the expression at\n       all.  Merely a gasp, like steam escaping.  Through the\n       huge slash in her clothes, we see the wound on her chest\n       slowly vanish.\n\n       Before long, she transforms back into a healthy young\n       girl with no sign of injury.\n\n       Then, her escaping breath begins to accelerate, much in\n       the way Loganís did - too much like Loganís did.  It is\n       as if she has taken in his trait of berserker rage.  Soon\n       she is smashing things all around her.  One hand rakes\n       the wallpaper like claws.\n\n       Finally, she gets a hold of herself, becoming the\n       introverted Rogue we all know so well.\n\n       Then she stands slowly, looks at the others.\n\n       And she runs from the room.  Storm runs after her.\n\n       The rest turn to Logan, who lays on the floor,\n       convulsing.\n\n       Jean goes to help him.  She looks back at Cyclops.  His\n       expression makes it clear that his worst fears about\n       Logan have come to pass.\n\n       EXT. PUBLIC BEACH - DAY\n\n       A familiar scene of suburban escapism.  Crowded enough\n       that most people can move about unnoticed.\n\n       In fact, most people do not notice the very large\n       jellyfish shooting through the water at remarkable speed.\n       And only a few notice the COMPLETELY TRANSPARENT MAN\n       emerging from the water.\n\n       It is Senator Kelly, and he resembles in many ways a\n       jellyfish.  His skin and innards are clear and gooey.  It\n       is only when he comes completely and naked out of the\n       water that he returns to somewhat normal.\n\n       He walks up to the beach and people recoil from the very\n       sight of him.  Pointing, whispering.  Then just laughing\n       at the naked man.\n\n       Kelly grabs a towel off an empty chair, a Hawaiian shirt\n       off another.\n\n       Suddenly, he buckles, grabbing his stomach and lurching\n       away in terrible pain.\n\n       He barely pauses when he hears a childís voice in semi-\n       whisper:\n\n                           CHILDíS VOICE\n                 Mom, is that a mutant?\n\n       INT. HALLWAY - DUSK\n\n       Storm and Logan walk down the hall.  Logan is wearing\n       sweats.  He has obviously just woken up.  The sun is low\n       in the horizon and the hall is suffused with an orange\n       glow.\n\n       Students pass by them.  By now, the students have heard\n       rumors about what happened the night before.  They watch\n       Logan fearfully as they pass by him.\n\n                           LOGAN\n                 Why is everybody up at sunrise?\n\n                           STORM\n                 The sun is setting, Logan.  Youíve\n                 been asleep for nineteen hours.\n\n                           LOGAN\n                 What did she do to me?\n\n                           STORM\n                 She borrowed your power to save her\n                 life.  When she touches someone, she\n                 absorbs their strengths -- their\n                 gifts.  In your case -- your ability\n                 to heal.  Thatís why she keeps her\n                 body covered.\n\n                           LOGAN\n                 I felt like she almost killed me.\n\n                           STORM\n                 If she held on any longer she could\n                 have.\n\n                           LOGAN\n                 And you think it helps calling her\n                 Rogue?\n\n       Storm shakes her head, but remains patient.\n\n                           STORM\n                 Weíve learned to embrace what we are\n                 rather than hide it like an\n                 affliction.  For some, it has become\n                 their identity.  You mock the names\n                 these people choose but they wear them\n                 as badges of pride.\n\n       They arrive at the door to the gym.\n\n                           LOGAN\n                 Inspiring -- Now what am I doing here?\n\n                           CYCLOPS (O.S.)\n                 I wanted to talk to you.\n\n       Logan turns and sees Cyclops.\n\n                           CYCLOPS (contíd)\n                 Storm, would you excuse us please?\n\n                           STORM\n                 Of course.\n\n       She exits.\n\n                           CYCLOPS\n                 Letís take a walk.\n\n       Cyclops begins to walk away in the other direction.\n\n       Logan just watches him go.  After a moment, he decides it\n       might be more interesting to see where this is going.  He\n       follows.  They walk across the hall to:\n\n       INT. GYMNASIUM - NIGHT\n\n       On first glance, the gym looks really average.  A fairly\n       standard boxing ring in the middle.  A fairly standard\n       weight set nearby.\n\n       Then you notice the weights themselves are abnormally\n       large.\n\n       100.  200.  300.  400 pounds.  All the way up to 2000.\n       And that is just one stack.\n\n       Cyclops enters first with Logan coming in behind him.\n\n                           CYCLOPS\n                 How long have you been in Alaska?\n\n                           LOGAN\n                 I donít remember.  Is that what you\n                 wanted to ask me?\n\n       Logan is barely through the door when Cyclops whips\n       around on Logan and thumps his finger into his chest.\n\n                           CYCLOPS\n                 I just wanted to make you clear on\n                 something.  Personally, I donít care\n                 what Magneto wants with you.  He can\n                 take those claws of yours and use them\n                 for Barbecue skewers.  What I do care\n                 about is the safety of this group.\n                 The Professor is in charge, and after\n                 the Professor, thereís me.  So, for\n                 the remainder of your time here,\n                 youíre going to keep that killer\n                 instinct of yours locked down so no\n                 one else gets hurt.\n\n       Beat.\n\n                           LOGAN\n                     (smirks)\n                 Iíve served with men like you before.\n                 Methodical.  Systematic -- Naive.  You\n                 know what happens to those men in a\n                 real fight?\n\n                           CYCLOPS\n                 You know, you --\n\n                           LOGAN\n                 Shut up.  I got no interest in you,\n                 Xavier,\n                     (he points mockingly at the\n                      Xís on Cyclopsí uniform)\n                 or your... X-Men.\n\n       Logan takes him in for a moment.\n\n                           LOGAN (contíd)\n                 And I donít think this has anything to\n                 do with my ìkiller instinct.î  You\n                 just donít like the way Iím looking at\n                 your girl -- Or maybe you donít like\n                 the way sheís looking back.  And maybe\n                 you think youíre man enough to do\n                 something about it.\n\n       Cyclops is enraged.  A red light begins to glow around\n       the edge of his visor and the ruby-quartz lens brightens.\n       We can faintly hear the low hum of immense power that is\n       now barely contained.  Before Cyclops can even react,\n       Logan puts his fist against Cyclopsí throat.  SHOOK!\n       Logan extends one claw up one side of Cyclopsí neck.  He\n       smiles.\n\n                           LOGAN (contíd)\n                 Címon sport.  You think you can blow\n                 the meat off my bones before I gut\n                 you?  Letís find out.\n\n       The air is now charged with tension.  The two men are\n       about to attack when-\n\n                           XAVIER (O.S.)\n                 Cyclops!\n\n       Logan whirls and sees Xavier regarding them sternly.\n       Logan turns his building anger on Xavier.\n\n                           LOGAN\n                 I have a question for you, Chuck.\n                 Whatís the point?\n\n       Xavier sits calmly as Logan, claws still extended,\n       marches over to him.\n\n                           XAVIER\n                 The point of what?\n\n                           LOGAN\n                 This.  This whole God damn thing.\n                     (derisively, at Cyclops)\n                 Making yourselves into some sort of\n                 ìteamî of super-powered freaks.\n                 Teaching wayward mutants about\n                 classical literature.  For what?\n\n       Logan continues to advance on Xavier.  Cyclops moves to\n       stop Logan, but Xavier waves him off.\n\n                           XAVIER\n                 The point is to step into a more\n                 evolved position of social\n                 responsibility.  To recognize that\n                 there is a world out there and that we\n                 mutants are as much a part of it as\n                 normal human beings.\n\n                           LOGAN\n                 What if it never happens?  What if\n                 theyíre so afraid of us that we become\n                 the enemy? -- This place is gonna be\n                 one giant cemetery.\n\n       Xavier has heard this argument before.\n\n                           XAVIER\n                 Now thatís Magneto talking.\n\n                           LOGAN\n                 No.  Thatís me talking.  And you know\n                 what?  Itís only been thirty-two hours\n                 and you still have no idea what this\n                 guy wants with me.\n\n                           XAVIER\n                 I believe he wants you for your\n                 Adamantium.\n\n       Logan raises his hand to his chest grasping for something\n       that no longer hangs from his neck.\n\n                           XAVIER (contíd)\n                 Youíre thinking of your dog tag.  It\n                 was made of Adamantium wasnít it?\n\n                           JEAN (O.S.)\n                 Professor.\n\n       Logan turns and sees Jean walking towards them.\n\n                           XAVIER\n                 What is it?\n\n                           JEAN\n                 Rogueís missing.\n\n       Logan looks at Jean with concern.\n\n       INT. CORRIDOR - NIGHT\n\n       A long, dark subterranean corridor with gleaming walls\n       and floor.  Well lit and strangely echoless.\n\n       Logan follows Xavier, who are in turn followed by Storm,\n       Cyclops and Jean to a thick steel door at the end of the\n       hall.\n\n                           LOGAN\n                 Where are we going?\n\n                           XAVIER\n                 To find Rogue.\n\n                           LOGAN\n                 How?\n\n                           XAVIER\n                 The brainwaves of mutants are quite\n                 different than those of the average\n                 human being.\n\n       At Xavierís eye level is a black screen with a chin-rest\n       like you see at the eye doctor.  Xavier rests his head in\n       it and the screen lights up.\n\n                           XAVIER (contíd)\n                 Cerebro amplifies my power.  It allows\n                 me to browse the worldís consciousness\n                 and find the genetically enhanced.\n\n       A vertical beam scans across his eye and a picture of\n       Xavierís retina appears on the screen next to a\n       computerized image of the same.  The two images overlap\n       and match perfectly.\n\n                           XAVIER (contíd)\n                 This is how I found you.\n\n       A small beep and a loud KNOCK of tumblers rolling and the\n       vault door opens.\n\n       They walk inside.\n\n       INT. CEREBRO - CONTINUOUS - NIGHT\n\n       They come into a room with a high sphered ceiling -\n       entirely black.\n\n       In the center of the room is a huge - for lack of a\n       better term - device.  Part computer, part super-\n       structure, it is the sort of precision tangle of metal\n       and wire that would make Da Vinci weep.  It has a space\n       in the bottom that seems to fit Xavier and his chair\n       perfectly.  Suspended above its center -- a web of wires,\n       tubes, and cables all connecting to the heart of the\n       device -- a CHROME SKULLCAP.\n\n       Logan slowly circles the device.\n\n       Logan looks at Xavier, perhaps even a little impressed.\n\n                           LOGAN\n                 You designed this yourself?\n\n                           XAVIER\n                 Actually, Magneto helped me put it\n                 together.\n\n                           LOGAN\n                 He helped you?\n\n                           XAVIER\n                 We were friends once...  But that was\n                 a long time ago.\n\n       Jean, Logan, Cyclops and Storm watch as Xavier fits his\n       wheelchair into the huge machine, and the chrome skull\n       cap lowers onto the Professorís head, fitting like a\n       second skin.  It comes to life.  What was dark and\n       menacing is now a brilliant explosion of colored lights.\n\n       CLOSE UP ON:\n\n       XAVIER - into and through his eyes and:\n\n       EXT. SPACE - NIGHT\n\n       Closing in rapidly on the planet Earth.\n\n       Passing into its atmosphere, making a few orbits, all the\n       while hearing the deafening voices of billions.\n\n       Every country, every city, every town, berg, hamlet and\n       village.\n\n       Every language.\n\n       Every thought.\n\n       The voices descend to a sizeable crowd of millions, then\n       thousands, gradually working their way to one.\n\n       EXT. SKY - OVER WESTCHESTER - NIGHT\n\n       Down a tree-lined road and around a corner into a parking\n       lot.\n\n       Single out a figure that - by the clothes - can only be\n       Rogue.  Close in faster and faster, lower and lower until\n       we go right through the back of her head to:\n\n       BLACK\n\n       SILENCE\n\n                           ROGUE (O.S.)\n                 I donít belong...  I donít belong...\n                 Iím sorry... so sorry... thereís\n                 nowhere...\n\n       INT. CEREBRO - NIGHT\n\n       Xavierís eyes open.\n\n                           XAVIER\n                 Iíve found her, Westchester Mall.\n\n                           LOGAN\n                 Iíll go.\n\n                           CYCLOPS\n                 No...  Iíll go.\n\n       Logan looks over to Jean.\n\n                           LOGAN\n                 O.K. sport... you go.\n\n       INT. WESTCHESTER MALL - NIGHT\n\n       A mother and child wander in a typical shopping daze.\n\n       PULL OUT TO REVEAL\n\n       Crowds of shoppers mill about, a typical crowded evening\n       at the mall.  Rogue comes up the escalator, wandering\n       through them all.\n\n       She walks under a high-sphered glass ceiling, revealing\n       the night sky outside.\n\n       She walks over to a Victoriaís Secret store and looks up\n       at the mannequins in the windows who wear almost nothing\n       at all.  Quite a contrast from her own, stifling garb.\n       She touches the glass as though trying to reach them,\n       then she moves on.\n\n       ROGUEíS P.O.V.\n\n       She looks all around the mall at the many oblivious\n       people here.  Children playing tag on one side.  A young\n       couple holding hands.\n\n       Human contact all around.\n\n       She walks past a small child, her hand nearly brushing\n       the girlís hair.\n\n       Rogue takes a seat on a bench, alone.\n\n       A figure comes into frame.\n\n                           STORM\n                 Rogue.\n\n       Rogue looks up and sees Storm standing right in front of\n       her.  Her eyes dart around, looking for a way out.\n\n                           STORM (contíd)\n                 You donít have to run.\n\n       Finally, Rogue surrenders.\n\n                           ROGUE\n                 Iím sorry.  Iím not like the rest of\n                 you -- Iím tired of hurting people.\n\n       She starts to cry now.\n\n                           STORM\n                 Itís okay.\n\n                           ROGUE\n                 Why did I have to be like this?  What\n                 purpose does it serve?\n\n       And when Rogue looks up, she sees another figure - this\n       one filling the frame behind Storm.\n\n       A huge clawed hand grabs Storm around the throat and\n       lifts her up as she struggles in vain.\n\n       INT. MALL - LOWER LEVEL - NIGHT\n\n       Cyclops looks up and sees Storm is being CHOKED BY\n       SABRETOOTH, her feet not touching the ground.\n\n       Rogue is frozen with fear.\n\n       He tries to get a shot with his visor, but too many\n       people are in the way.\n\n       INT. MALL - UPPER LEVEL - NIGHT\n\n       Sabretooth smiles as Storm struggles to turn.  He\n       whispers in her ear.\n\n                           SABRETOOTH\n                 Scream for me.\n\n       CLOSE UP ON:\n\n       STORMíS EYES as the life is being squeezed out of her.\n\n       INT. XAVIERíS OFFICE - NIGHT\n\n       MIRROR SHOT OF XAVIERíS EYES\n\n       Suddenly, Xavier touches his throat, then raises a\n       shaking hand to his head.\n\n                           XAVIER\n                 Dear God.\n\n       Xavier wheels himself from the room.\n\n       INT. MALL - LOWER LEVEL - NIGHT\n\n       Cyclops has a clear shot now.  His eyes start to glow\n       brightly.\n\n       Suddenly, a familiar movement on the pedestal behind him.\n       Toad has been camouflaged the entire time.  He comes down\n       and FLICKS HIS LIZARD-LIKE TONGUE, snatching the visor\n       from Cyclopsí face.\n\n       Deep red light far greater than anything we have ever\n       seen before comes blasting out of cyclopsí eyes without\n       any sort of control, as if a fire hydrant had been ripped\n       from the ground.\n\n       His head comes back and the light blows the whole of the\n       glass ceiling to smithereens, bringing it down on\n       panicking shoppers who scatter.\n\n       Toad leaps to the second level and then again out of\n       sight.\n\n       INT. MALL - UPPER LEVEL - NIGHT\n\n       Sabretooth reacts, surprised by the sudden shift.  This\n       gives Storm one last chance to breath.\n\n       We notice now that something is happening to her body.\n\n       INT. MALL - LOWER LEVEL - NIGHT\n\n       Cyclops stumbles helpless, his eyes are shut to prevent\n       further destruction.\n\n                           CYCLOPS\n                 GET OUT OF THE WAY.  GET OUT OF THE\n                 WAY.\n\n       INT. MALL - UPPER LEVEL - NIGHT\n\n       Storm, nearly lifeless now, struggles with what little\n       strength she has to get free of Sabretooth.  He relishes\n       the slow kill.\n\n       But suddenly ALL THE HAIR ON HIS BODY STANDS ON END.\n       Sabretooth is momentarily confused.\n\n       Stormís eyes open wide as her body convulses.\n\n       BOOM\n\n       A huge bolt of lightning shoot from her body into\n       Sabretoothís chest, knocking him back in shock.  Storm\n       falls to the ground, not breathing.\n\n       Sabretooth, stunned and scorched, gets to his feet and\n       smiles at his handiwork.  He is about to move in and\n       finish them both when the rumble of a helicopter can be\n       heard above.\n\n       He looks up and sees SENATOR KELLYíS HELICOPTER passing\n       over the hold in the roof.  Sabretooth leaps up and pulls\n       himself out of the opening.\n\n       Toad is a leap behind.\n\n       Rogue rushes to Storm, struggling with how to give her\n       mouth to mouth, CPR, anything to resuscitate her without\n       touching.  She is starting to panic now.  She looks\n       around, but anyone still left in the mall is running for\n       the doors.\n\n                           ROGUE\n                 SOMEONE HELP ME.  SHEíS NOT BREATHING.\n\n       INT. MALL - LOWER LEVEL - NIGHT\n\n       Cyclops stumbles blind and helpless, covering his eyes.\n       He hears Rogue screaming.\n\n                           CYCLOPS\n                 ROGUE?\n\n                           ROGUE (O.S.)\n                 HELP ME.  STORM ISNíT BREATHING.\n\n       Cyclops tries to find a way up, but he trips over all the\n       debris, helpless.\n\n                           CYCLOPS\n                 YOU HAVE TO COME AND GET ME.  I CANíT\n                 SEE.\n\n       EXT. STREETS - NIGHT\n\n       Xavier is in a specially designed car that enables him to\n       drive solely with his hands.  He races towards the mall.\n\n       INT. MALL - UPPER LEVEL - NIGHT\n\n       Rogue is talking, walking backwards towards Storm, trying\n       her best not to lay a hand on Cyclops.\n\n                           ROGUE\n                 Here, here, here... a little left.\n                 Careful.\n\n       ANGLE ON:\n\n       Cyclops drops to his knees, the sprinklers still gushing.\n       His eyes are tightly shut.\n\n       He feels for Stormís face and touches her lips.\n\n                           CYCLOPS\n                 Oh God.\n\n       He immediately begins mouth to mouth, though it may have\n       been too long.\n\n       EXT. MALL - NIGHT\n\n       Xavier fights the rush of traffic - people fleeing madly\n       from the mall.\n\n       As he pulls up to the front doors, he sees Cyclops\n       emerging, carrying Storm.  She is conscious, but her\n       breathing is shallow.  His eyes are shut tightly and he\n       must follow Rogueís direction.\n\n       Sirens wail in the distance.\n\n       Xavier looks at the lot of them: waifish Rogue, blind\n       Cyclops, unconscious Storm and his wheelchair-bound self\n       as their guardian.\n\n                           XAVIER\n                 But why would they do this?\n\n       Then a look of realization...\n\n       EXT. MANSION - MEANWHILE - NIGHT\n\n       Rogue hurries past several students.\n\n       She runs up to the large front doors of the school, but\n       they are locked.  She looks around and then runs toward\n       the side of the building.\n\n       INT. LABORATORY - NIGHT\n\n       Beast, continuing his research into Magnetoís plan, is\n       analyzing the x-rays of Loganís skeleton.  Several books\n       about metallurgy are scattered across the table.\n\n       INT. LOGANíS ROOM - NIGHT\n\n       Logan is sketching quietly.  He chews a cigar, keeping it\n       politely unlit.\n\n       He hears something.  He stands, goes to the door and\n       opens it.  He cocks his head... listening... smiling...\n\n       We hear it too, sharing his ears.\n\n       It is a woman breathing, groaning.  He smiles and follows\n       the noise.\n\n       EXT. MANSION - NIGHT\n\n       Rogue climbs through a studentís open window.\n\n       INT. MANSION - NIGHT\n\n       She darts down a hallway and around a corner, looking\n       around, staying low.\n\n       INT. GYMNASIUM - NIGHT\n\n       Jean is working out on an average-sized set of free-\n       weights, sweating, pushing hard.  Obviously the sound\n       Logan heard.  She is on her back doing presses.\n\n       Suddenly, she looks up and sees Logan standing over.  She\n       is startled and starts to drop the bar.  He catches it.\n\n                           LOGAN\n                 You should always work with a spotter.\n\n                           JEAN\n                 Heís busy right now.\n\n       Logan cannot help but glance at her left hand, still\n       clinging to the bar.  The shimmering diamond on the third\n       finger.\n\n                           LOGAN\n                 I was thinking maybe you and me could\n                 go into town.\n\n                           JEAN\n                 Were you now?\n\n                           LOGAN\n                 What do you say?\n\n                           JEAN\n                 Not interested.\n\n       Logan shrugs, starts to take his hands away.  Jean is not\n       ready to take the weight of the bar.  It almost comes\n       down on her when he catches it again.\n\n                           JEAN\n                 Let go.\n\n                           LOGAN\n                 Suit yourself.\n\n       And he does.  And so does Jean at the same time.  She\n       gets up and faces Logan - the bar simply hovers in mid-\n       air.\n\n       Logan smiles.\n\n       INT. LABORATORY - NIGHT\n\n       Beast looks at his watch.  Itís stopped.  He puts it to\n       his ear -- shakes it.  Then his ears perk up.  He hears\n       something.  He glances at the wall.  All things METAL --\n       picture frames, chairs, objects on tables, etc. start to\n       move one after the other.\n       It is as if some magnetic force is moving past the wall,\n       just outside the lab, heading for the open door.\n\n       Beast, sensing the danger, makes a run for the metal\n       door.  Just as he reaches it, it SLAMS closed -- knocking\n       him back across the room.\n\n       Beast CRASHES into the wall on the opposite side of the\n       lab.  His leg badly hurt, Beast tries to crawl toward the\n       door.\n\n       But as he does this, METAL OBJECTS from around the lab\n       fly in front of it sealing him in.\n\n       INT. CORRIDOR - NIGHT\n\n       Rogue moves quietly down the corridor that leads to\n       Cerebro.\n\n       She comes to the retinal scanner - she brings her eye to\n       the screen.\n\n       It lights up and scans her eye.  A PICTURE OF XAVIERíS\n       RETINA appears on the screen.\n\n       A SINGLE WORD APPEARS ON THE SCREEN beneath it:\n\n       ACCESS DENIED\n\n       The scanner scans again.\n\n       E.C.U. ON ROGUEíS EYE\n\n       Something is wrong.  The eye not being scanned is a\n       familiar yellow.  It is Mystique.\n\n       Her other eye changes in the light of the scanner.  The\n       retina reshaping itself in minute ways.\n\n       ANGLE ON:  The screen -- ACCESS GRANTED -- CHARLES XAVIER\n\n       The door to Cerebro opens.\n\n       Rogue or rather Mystique, rushes in.  She goes to a small\n       panel on the side of Cerebro.\n\n       She opens it.  She reaches in.  SHE REMOVES A COMPUTER\n       CHIP -- No more than three inches wide.\n\n       INT. HALLWAY - NIGHT\n\n       ANGLE ON:  The black boots of a man, walk down a hallway,\n       as students peer from their sleeping quarters, terrified.\n\n       INT. GYMNASIUM - NIGHT\n\n       Jean is casually wiping sweat from her brow.  Loganís\n       eyes possess a certain focus intent.\n\n                           LOGAN\n                 Heís uptight.\n\n                           JEAN\n                 He takes his work seriously.\n\n                           LOGAN\n                 He takes himself seriously.\n\n                           JEAN\n                 What is it youíre failing to get at?\n                 Are you interested in me?\n\n                           JEAN\n                 Iím just interested.\n\n       Holding out her left hand.\n\n                           JEAN\n                 Logan, do you see this ring?\n\n                           LOGAN\n                 Iíve seen a lot of rings.\n\n                           JEAN\n                 Yeah, Iíll bet you have.\n\n       Before he can reply, Rogue is standing in the doorway\n       looking at them.\n\n                           JEAN\n                 Rogue, where have you been?\n\n                           ROGUE\n                 Logan.  The Professor wants you to\n                 come with me right away.\n\n       E.C.U. on Loganís nose.  His nostrils flare... sensing...\n\n       Logan squints the tiniest bit.  We know he knows\n       something is wrong, but he is hiding it.\n\n                           LOGAN\n                     (to Rogue)\n                 Hey Rogue, tell Jean what you were\n                 telling me last night.\n\n       Rogue pauses.  Confused.\n\n                           ROGUE\n                 The Professor--\n\n       Logan walks towards her.\n\n                           LOGAN\n                 You remember.  About women.\n\n       He moves closer.\n\n                           ROGUE\n                 Logan--\n\n                           LOGAN\n                 Whatever you say about them being the\n                 same...\n\n       SHOOK.  The claws are out.  HE LUNGES.\n\n                           LOGAN (contíd)\n                 No two women smell alike.\n\n       He grabs Rogue by the throat.\n\n                           JEAN\n                 Logan, what are you doing?\n\n       Jean, seeing Logan threaten Rogue with his claws for the\n       second time, RAISES A VAULTING HORSE INTO THE AIR.\n\n                           LOGAN\n                 This ainít Rogue!\n\n       He keeps his claws pointed at her face.\n\n       ANGLE TIGHT: Loganís left hand is wrapped around Rogueís\n       throat but part of it is TOUCHING THE EXPOSED SKIN OF HER\n       FACE WITH NO ILL EFFECTS.\n\n       Jean realizes that Logan is right.  ROGUE MORPHS INTO\n       MYSTIQUE.\n\n                           MAGNETO (O.S.)\n                 Telekinesis.\n\n       Jean spins around and sees MAGNETO.  Without hesitation,\n       the vaulting horse FLIES AT MAGNETO.\n\n       Simultaneously, one of the thousand-pound weights flies\n       from the weight set and smashes the vaulting horse aside.\n\n                           MAGNETO (contíd)\n                 Fascinating.  What I wouldnít give for\n                 that.  Alas, metal is all Iím good\n                 for.  But it seems to serve me well\n                 enough.\n\n       Jean is completely unaware of the huge set of lockers\n       rising behind her.\n\n                           LOGAN\n                 Jean!\n\n       WHAM.\n\n       The lockers hit her in the back, sending her flying.\n\n       Jean lies motionless on the floor, unconscious.  The\n       heavy lockers are floating above her, wavering between a\n       few feet and a few inches.\n\n                           MAGNETO\n                 I do love a good check mate.\n\n                           LOGAN\n                 What do you want?\n\n                           MAGNETO\n                 Come with me and Iíll let her live.\n\n                           LOGAN\n                 You think I care about her?  Iím the\n                 only one whoís sure to walk out of\n                 here.\n\n       Pause.\n\n                           MAGNETO\n                 Then why donít you kill her.\n\n       This catches Logan a little off guard.\n\n                           MAGNETO (contíd)\n                 Go on.  Kill her.  You can do it\n                 quicker than I will.  Maybe Iíll just\n                 cripple her.\n\n       The lockers now stand upright, hovering over Jeanís\n       knees.\n\n                           MAGNETO (contíd)\n                 So do her the favor.  Show her mercy.\n\n       Logan thinks for a moment -- looks at Jean still\n       unconscious on the floor.  Then:\n\n       Logan retracts his claws.\n\n       Mystique has morphed back into her natural state with the\n       exception of ONE OF ROGUEíS POCKETS, which still clings\n       to her hip.  Mystique produces a large syringe from the\n       pocket and sticks it in Loganís neck.  Loganís legs\n       weaken instantly.\n\n                           MAGNETO (contíd)\n                     (to Mystique)\n                 Call the others and tell them we have\n                 what we came for.\n\n       EXT. MANSION - LATER - NIGHT\n\n       The fence that surrounds the property has been bent and\n       buckled violently.\n\n       INT. MANSION HALLWAY - NIGHT\n\n       Xavier wheels down the hallway, pajama clad students are\n       milling about the halls.  Their faces showing that they\n       are afraid to go back to their rooms.  One GIRL, younger\n       and smaller than the others, seems particularly upset.\n\n       Xavier wheels over to her and gently touches the side of\n       her face.\n\n                           XAVIER\n                 Itís going to be alright.\n\n       She manages a faint smile.  Then Xavier looks to the\n       other students -- their frightened faces.\n\n       INT. LABORATORY - LATER - NIGHT\n\n       Beast reclines in his lab chair, a splint on his leg.\n\n       Jean stands with Cyclops who watches through a new visor.\n\n       Rogue sits off to the side, bearing the guilt.  While\n       Storm, her neck badly bruised, stands near her.\n\n       For the first time we have seen -- Charles Xavier is\n       angry.\n\n                           STORM\n                 When Rogue left the mansion, they must\n                 have followed her.\n\n       Xavier shuts his eyes furious.\n\n                           XAVIER\n                 Yes... they wanted me out of the way.\n                 If I had been here... I...\n\n       Xavier opens his eyes and sees Rogue sitting on a chair\n       in the corner.  She is visibly upset.  Xavier wheels over\n       to Rogue.  Xavier reaches out and softly touches her\n       clothing covered shoulder.\n\n                           XAVIER (contíd)\n                 This was not your fault.  I knew there\n                 was a danger, I should have never left\n                 the school.\n\n       And with that he turns his wheelchair to the door.\n\n                           XAVIER (contíd)\n                 I am going to find Logan.\n\n       Xavier leaves.\n\n       INT. CEREBRO - NIGHT\n\n       Xavier enters and wheels himself into the giant machine.\n       It immediately comes to life - lighting the room.  The\n       chrome skull cap descends onto Xavierís head.\n\n       Xavier closes his eyes as the machine powers up.\n\n       E.C.U. ON XAVIERíS EYES\n\n       They fly open.  And then a terrible noise.  The sound of\n       a well tuned machine suddenly going horribly wrong.\n       Xavier is in terrible pain.\n\n       His back arches and he falls from his chair onto the\n       floor.  He struggles to reach for a fire alarm on the\n       wall.  His fingers stretch until finally -- he pulls it.\n\n       Warning bells wail.  Xavier falls unconscious,\n       convulsing.\n\n       ANGLE ON: Cyclops and Jean as they burst into the room.\n\n       INT. LABORATORY - LATER - NIGHT\n\n       Xavier lies asleep in a hospital bed.  Several electrodes\n       are taped to his head.  A screen next to the bed monitors\n       his erratic brain waves.\n\n       Jean and the splinted Beast stare at the monitor\n       following its rhythm.  Storm and Rogue stand at the foot\n       of the bed.  They are each trying to hide their fear, and\n       not doing a very good job of it.  Cyclops looks on, the\n       stress shows on his face.\n\n                           CYCLOPS\n                 Whatís wrong with him?\n\n                           JEAN\n                 His vital signs are weak and getting\n                 weaker.\n\n                           BEAST\n                 Iím in the process of running more\n                 tests.  But it seems that every minute\n                 that goes by he gets weaker.\n\n       All are silent.  Rogue looks to Beast with desperate\n       eyes.\n\n                           ROGUE\n                 Can you help him?\n\n                           BEAST\n                 I donít know.\n\n       Xavier lies in bed, motionless.\n\n       INT. FRONT HALL - DAY\n\n       Two huge wooden front doors -- morning light shines\n       through the jagged holes in the wood where the knobs had\n       been pulled off.  The antique steel knobs lay twisted and\n       mangled on the floor.\n\n       The small girl from last night kneels in front of the\n       door with a dustpan, sweeping up the mess.\n\n       Something catches her eye.  She sits up and leans in\n       closer to the jagged hole in the door.\n\n       ANGLE ON: The little girl -- light from the hole washes\n       over her face.  Then suddenly the light is cut off, as if\n       something is blocking the hole.\n\n       DOLLY IN: as the small girl steps back, a look of\n       fascination comes across her face.  As if she sees\n       something coming through the hole.\n\n       INT. CEREBRO - DAY\n\n       Cyclops, Jean and Storm stand before the device.  Beast\n       rises awkwardly on his splinted leg, his back to the open\n       control panel.\n\n                           BEAST\n                 Itís gone.  The neuro-filter, someone\n                 removed it.\n\n       Jean stands.\n\n                           STORM\n                 What does that mean?\n\n                           BEAST\n                 The neuro-filter acts like a surge\n                 protector, regulating the infinite\n                 flow of information from Cerebro to\n                 the Professorís mind.  Itís what keeps\n                 him from being crushed by the\n                 consciousness of millions.\n\n       Cyclops steps away, pondering Beastís words.  He\n       understands the ramifications -- the damage that has been\n       done to Xavier.\n\n                           CYCLOPS\n                 Can the Professor repair his own mind?\n\n                           BEAST\n                 Iím afraid without Cerebroís help, he\n                 wonít have the strength to heal\n                 himself -- And without the neuro-\n                 filter... thereís no Cerebro.\n\n       Jean is noticeably upset.\n\n                           JEAN\n                 Heís already losing control of his\n                 vitals.  Respiratory.  Cardiovascular.\n                 Unless we manage to replace the filter\n                 by tomorrow morning, Iím afraid.\n\n                           CYCLOPS\n                 We have to find Magneto.\n\n       He exits.  Jean follows him.\n\n       INT. HALLWAY - DAY\n\n       Cyclops is standing, motionless.\n\n                           JEAN\n                 Are you all right?\n\n                           CYCLOPS\n                 No.  Iím...  I donít know if we can do\n                 this without Charles.\n\n       Jean puts her hand lovingly to his face.  Cyclops takes\n       her hand.\n\n                           JEAN\n                 He put you in charge for a reason,\n                 Scott.\n\n       She goes to kiss him.\n\n                           SMALL GIRL\n                 Dr. Grey?...\n\n       The small girl stands alone in the hallway.\n\n                           SMALL GIRL (contíd)\n                 Someone is here to see you.\n\n       Jeanís eyes widen -- and around the corner steps Senator\n       Kelly, wearing the clothing he had taken from the beach.\n       He trembles as though from a high fever.  His body is\n       covered with a layer of sweat.\n\n                           KELLY\n                 Dr. Grey.\n\n                           JEAN\n                 Senator?\n\n                           CYCLOPS\n                 How did you get in here?\n\n                           KELLY\n                 Your front door was damaged... there\n                 was a hole...\n\n       Kelly makes a hole with his hands that is not much larger\n       then that of a coffee can.\n\n                           KELLY (contíd)\n                 ... I squeezed through.\n\n       Kelly buckles in pain, but then catches himself.\n\n       Jean and Cyclops rush to help him.  Beast crutches\n       himself out to see whatís happening.\n\n       Kelly notices Beast.\n\n                           KELLY (contíd)\n                 What in Godís name are you?\n\n                           BEAST\n                 Iím Beast.\n\n                           KELLY\n                 Of course you are.\n\n       INT. LABORATORY - LATER - DAY\n\n       Xavier is in bed, eyes closed.\n\n       Rogue holds vigil at his side.\n\n       Kelly is in the bed next to him, trembling, burning up\n       from what seems to be a bad fever that keeps getting\n       worse.\n\n       Jean has a syringe in her hand and is swabbing some\n       alcohol on Kellyís skin.\n\n                           KELLY\n                 Iím sorry to come here, Ms. Grey.  I\n                 was afraid if I went to a hospital,\n                 they would...\n\n                           JEAN\n                     (interrupting)\n                 Treat you like a mutant?  We are not\n                 what you think.  Not all of us.\n\n                           KELLY\n                 Tell it to the ones that did this to\n                 me.\n\n       Jean looks closer at his hands.\n\n                           JEAN\n                 I donít see these spikes youíre\n                 talking about.  Iím going to give you\n                 an antibiotic for the - Oh my God.\n\n       Jean and Kelly both look as the cotton swab ignites like\n       flash paper in her hand.  Everyone is shocked.  Jean\n       pauses and takes the bottle of alcohol from the shelf.\n       She pours a small amount on Kellyís arm and it instantly\n       catches fire.\n\n       INT. LABORATORY - LATER - DAY\n\n       Rogue is still sitting in a chair, next to Xavierís bed --\n       Xavierís opens his eyes.  He looks at Rogue and smiles\n       softly.\n\n                           XAVIER\n                 Hello, Rogue?\n\n       Rogue almost jumps out of her chair with excitement.\n\n                           ROGUE\n                 Hold on, Iíll get the others.\n\n       Rogue exits.  Xavier slowly looks over to Kelly lying in\n       the bed next to him.  Both men are weak and getting\n       weaker.\n\n                           XAVIER\n                 Senator... Kelly?\n\n                           KELLY\n                 Yes...  Who are you?\n\n                           XAVIER\n                 I am Charles Xavier.  This is my\n                 school.\n\n       Kelly tries to speak, but his strength is waning.\n\n       The two men are a pitiful sight, both slowly coming\n       apart.\n\n                           XAVIER (contíd)\n                 Can you tell me what happened to you?\n\n       Kelly is in pain.  Itís a struggle to speak.\n\n                           KELLY\n                     (weak, delirious)\n                 I was kidnapped...  They killed\n                 GUYRICH... mutants...  There was a\n                 light... a bright... light.\n\n       Xavier turns to Kelly, looking deep into his eyes.\n\n       He begins to PROBE KELLYíS MIND.\n\n       INT. EXT. VARIOUS FLASHBACK - DAY/NIGHT\n\n       FLASH\n\n       The following is an audio-visual collage of Kellyís\n       perspective from throughout the film, coming back to us\n       in a new order.\n\n       THE CAGE OF SENATOR KELLY in Magnetoís lair.  NOW HIS\n       P.O.V. as seen by Xavier.\n\n       Vision fades in and out in a sedated haze.\n\n       He is laid out of a gurney.\n\n                           KELLY (V.O.)\n                 Whatever you do to me... no matter\n                 what -- youíll make me right.  Every\n                 word I have spoken will be confirmed.\n\n       He looks up and sees Mystique wheeling the gurney,\n       smiling down at the Senator.\n\n                           MYSTIQUE (V.O.)\n                 And people like you are the reason I\n                 was afraid to go to school as a child.\n\n       FLASH\n\n       Kelly is looking around a large, sphered room.  In the\n       center is the MACHINE.\n\n                           JEAN (V.O.)\n                 The mutant gene tells the body when it\n                 needs to change.\n\n                           KELLY (V.O.)\n                 I can assure you, there is no such\n                 creature in my genes.\n\n       FLASH\n\n       The DOG TAG as it is elevated into the machine.\n\n                           JEAN (V.O.)\n                 In every organism on Earth there exits\n                 a mutator gene -- The X-factor.  The\n                 beginnings of another stage of\n                 evolution.\n\n       SLOWLY BUILDING LIGHT, growing brighter and brighter.\n\n                           MAGNETO (V.O.)\n                 God works too slowly.\n\n       Pull back as if the camera is pulling back through his\n       eye, into his head -- A MICROSCOPEíS VIEW OF HIS CELLS,\n       suddenly and violently disturbed.\n\n                           KELLY (V.O.)\n                 What have you bastards done to me?\n\n                           CHILDíS VOICE (V.O.)\n                 Mom, is that a mutant?\n\n       Kellyís reflection in the metal of the sink in his\n       prison.\n\n                           MAGNETO (V.O.)\n                 Youíre a leader Senator Kelly, you set\n                 an example...\n\n       Blobís face, burned by Kellyís hands.\n\n       Over the cliff.\n\n                           GUYRICH (V.O.)\n                 ... A Demonstration of some kind?\n\n       The venomous spike emerging from Kellyís hands.\n\n                           MAGNETO (V.O.)\n                 Because if more of you... were like\n                 more of us... like more of us...\n\n                           GUYRICH (V.O.)\n                 ... the UN summit... the whole world\n                 will be watching.\n\n                           KELLY (V.O.)\n                 What is it you intend to do to me?\n\n       The woman staring up at him on the beach.\n\n                           KELLY (V.O.)\n                 Oh...  Oh God... what have you done to\n                 me?\n\n       The boy on the beach.\n\n       JARRING FLASH\n\n                           KELLY (V.O.)\n                 Dear God.... dear... God.\n\n                           NEWSCASTER (V.O.)\n                 ... the largest single summit in the\n                 history of the planet.\n\n                           JEAN (V.O.)\n                 ... the mutator gene will activate.\n\n                           MAGNETO (V.O.)\n                 Welcome to the future... brother...\n                 The brotherhood of mutants.\n\n       A VIOLENT COLLISION OF NOISE, IMAGE AND LIGHT AND THEN:\n\n       Xavierís eyes burst open.\n\n       INT. LABORATORY - NIGHT\n\n       Rogue leads Storm, Jean, Beast and Cyclops quickly into\n       the lab.\n\n       Xavier is lying in his bed.  Jean looks up at the screen\n       above him and sees Xavierís brain waves have dropped\n       severely.\n\n       Kelly lies unconscious in his bed, his heart monitor\n       weakening.\n\n       Beast limps over to Xavier.  Xavier struggles to speak.\n       Beast bends down so that Xavier can whisper into his ear.\n\n       E.C.U. Xavierís lips move as he tells Beast what he\n       knows.\n\n       INT. LAB - LATER - NIGHT\n\n       Jean, Storm, Beast and Cyclops talk while the news plays\n       silently on the TV in the background.\n\n                           BEAST\n                 It appears as though Magneto has built\n                 a machine which somehow triggers the\n                 mutator gene in normal human beings.\n                 And he is using Adamantium as its\n                 core.\n\n                           CYCLOPS\n                 Its core?\n\n       Beast grabs a wax pen and draws a lightbulb on a glass\n       drawing board.\n\n                           BEAST\n                 Thomas Edison knew how to make the\n                 light bulb.  He had the energy source.\n                 He had the vacuum.  But he didnít have\n                 the filament.  He tried metal after\n                 metal but nothing would hold to power.\n\n                           STORM\n                     (nods -- now understanding)\n                 ... until he found tungsten.\n\n       Beast finishes his lightbulb by drawing the filament.\n\n                           BEAST\n                 Correct...  Apparently, Adamantium is\n                 the only metal strong enough to hold\n                 the energy this machine produces.  He\n                 used the Adamantium in Loganís dog tag\n                 to test it on the Senator.  And I\n                 assume now he plans to use the rest of\n                 Loganís skeleton for a larger\n                 demonstration.\n\n                           CYCLOPS\n                 For what purpose?\n\n                           BEAST\n                 Yes -- Only thereís a problem.  The\n                 mutator gene is not responding to the\n                 radiation the way it would in mother\n                 nature.  Itís forcing the bodyís cells\n                 to replicate thousands of times faster\n                 than theyíre accustomed to.  The\n                 Senatorís body is literally burning\n                 itself out.  Scott -- this machine\n                 kills people and I donít think Magneto\n                 realizes it.\n\n                           CYCLOPS\n                 So where do you think heís planning\n                 this larger demonstration?\n\n       Jean looks down and sees Xavier pointing with a trembling\n       hand, trying to speak.\n\n       Xavier is pointing to the television.\n\n                           XAVIER\n                 There...\n\n       He is looking at yet another report on Ellis Island.\n\n       Cyclops and Jean walk over.  All they see on the TV is an\n       aerial shot of Manhattan, slowly coming around toward the\n       harbor.\n\n       The television image is from the P.O.V. of a helicopter\n       circling Ellis Island, taking in all the security and\n       construction.  The grand main hall to Ellis Island and\n       finally, what the helicopter sees as it comes around for\n       one more pass.\n\n       SUDDENLY - The sound of Kellyís heart monitor begins to\n       PICK UP SPEED.  Jean rushes to Kelly and touches his pale\n       neck.  She draws her hand back quickly as if burned.  The\n       heart monitor keeps speeding up until it is racing faster\n       than a human heart could possibly produce.\n\n       Jean backs away helplessly.\n\n       The sheet that covers Kellyís body begins to flatten out.\n       The sweat covering the hapless Senatorís body thickens\n       into a viscous, clear liquid and begins to run off the\n       table.  Kelly is literally melting away.  Cyclops holds\n       Jean as she turns away.\n\n       ANGLE ON: THE TV -- the gathering leaders of the world,\n       the water clogged with boats, and the thousands of\n       onlookers on Manhattan Island.  All well within range.\n\n       INT. READY ROOM - NIGHT\n\n       Storm finishes preparing to leave in another section of\n       the ready room.  Beast stands by on his Beast-size\n       crutches feeling useless.\n\n                           BEAST\n                 I wish I could go.\n\n                           STORM\n                 We all do.\n\n                           BEAST\n                 Storm.  Try to look for the highest\n                 vantage point.\n                 From what I can figure, heíll need to\n                 gain as much altitude as possible to\n                 blanket the island.  It is my feeling\n                 that Magneto has to--\n\n                           STORM\n                 Beast.\n\n       Beast looks at her.\n\n                           STORM (contíd)\n                 Weíll be fine.\n\n       INT. LAB - NIGHT\n\n       Cyclops stands looking down at Professor Xavier.  He\n       starts to walk away but he is stopped.  He looks down and\n       sees that the Professor has weakly grabbed his sleeve.\n       Cyclops looks at Xavier but he is still unconscious.  His\n       hand falls back to the bed.\n\n                           CYCLOPS\n                 You can still hear me... canít you.\n\n       Xavier lies still.\n\n                           CYCLOPS (contíd)\n                 I want to thank you for taking me in.\n                 Taking us in...  You have taught me\n                 everything in my life that is worth\n                 knowing.\n\n       Cyclops grimly regards Xavier.\n\n                           CYCLOPS (contíd)\n                 And I want you to know that Iíll take\n                 care of them.\n\n       INT. READY ROOM - NIGHT\n\n       Cyclops and Jean get into their uniforms.\n\n       Jean is about to go to the hanger when Cyclops stops her.\n\n                           CYCLOPS\n                 Hey.  Iím sorry.  About Logan.  I was\n                 jealous.\n\n                           JEAN\n                     (putting her arms around him)\n                 Well, I think thatís perfectly\n                 understandable.\n\n                           CYCLOPS\n                 Iíll tell you one thing though.\n\n                           JEAN\n                 Whatís that?\n\n                           CYCLOPS\n                 He calls me sport one more time, and\n                 Iíll blow a watermelon-sized hole\n                 through him.\n\n       She smiles and kisses him.\n\n                           CYCLOPS (contíd)\n                 Now letís go get him.\n\n       INT. X-JET - NIGHT\n\n       Cyclops, Storm, and Jean board the X-Jet.  They find --\n       ROGUE, strapped into a seat, ready to go.\n\n       INT. HANGER - NIGHT\n\n       ROGUE stands outside the jet, obviously having been\n       kicked off.\n\n       INT. X-JET - NIGHT\n\n       Jean reaches out a hand.  Cyclops takes it.  They squeeze\n       tight.  The X-Jetís engines begin to fire up.\n\n       INT. HANGER - NIGHT\n\n       The hatch slowly starts to swing closed.  From where she\n       stands Rogue debates, and then runs, dashing inside as\n       the hatch to the X-Jet closes behind her.\n\n       EXT. BASKETBALL COURT - NIGHT\n\n       A basketball sits on the ground near the middle of the\n       court.\n\n       Suddenly the asphalt starts to vibrate and the basketball\n       rolls a few inches.\n\n       THEN:  There is a grinding noise and the surface begins\n       to separate at the half court line.  The basketball falls\n       through the widening hole and bounces off the wing of the\n       rising X-Jet.\n\n       LIFT-OFF.  The jet turns and clears the hanger before\n       blasting off into the night sky.\n\n       EXT. ELLIS ISLAND - NIGHT\n\n       An aerial shot showing us the whole of the event.\n\n       Security of every kind covers every inch of the island.\n\n       Helicopters are coming in at the rate of about one every\n       minute to deliver dignitaries and their families from all\n       over the globe.\n\n       EXT. ELLIS ISLAND - BRIDGE TO NEW JERSEY - NIGHT\n\n       A steady flow of limos pour onto the island over a simple\n       two-lane bridge from New Jersey.\n\n       A NEWSCASTER IN THE FOREGROUND.\n\n                           NEWSCASTER\n                 With the ceremonies beginning shortly,\n                 it looks as though the last of the\n                 dignitaries have landed at Newark and\n                 Teterboro airports and will be\n                 arriving momentarily.  It would seem\n                 the United Nations has had their wish\n                 tonight.  There doesnít seem to be an\n                 empty seat in the house.\n\n       EXT. BATTERY PARK - NIGHT\n\n       The pier of the Ferry to Liberty Island.\n\n       A great many families have come to watch curiously the\n       going on.\n\n       EXT. MANHATTAN HARBOR - NIGHT\n\n       The harbor is filled with police and Coast Guard vessels\n       watching the water closely.\n\n       INT. NEW YORK CITY APARTMENTS/VARIOUS - NIGHT\n\n       A series of shots showing the many folks gathering to\n       watch the historic event on television.\n\n       In some of these apartments, Ellis and Liberty islands\n       can be seen from their windows in the distance.\n\n       INT. SECURITY CONTROL CENTER - NIGHT\n\n       The OPERATING COMMANDER monitors the countless video\n       screens that display nearly every crevice of Ellis Island\n       as well as other parts of New York Harbor as well as the\n       network news feeds of the event...\n\n       EXT. ELLIS ISLAND - MAIN ENTRANCE - NIGHT\n\n       The front of the Great Hall of Ellis Island, where once\n       immigrants poured into the new world by the millions.\n\n       A huge military band off to one side plays music from the\n       different countries to help with the milling about and\n       shaking of hands.\n\n       The PRESIDENT himself is in the crowd, meeting and\n       greeting, a mob of Secret Service always right there.\n       Follow him into:\n\n       INT. ELLIS ISLAND - MAIN HALL\n\n       A YASSAR ARAFAT TYPE, who we will call Yassir Arafat,\n       comes up to the President and smiles.\n\n       The President introduces his WIFE AND CHILD as more\n       delegates approach.\n\n       The two men LAUGH and then HUG to the flashing of a\n       million bulbs.\n\n       Smattering of ass-kissy applause.  Arafat and the\n       President wave to press and the like.\n\n       EXT. OBSERVATION DECK - ELSEWHERE - NIGHT\n\n       We are looking down on what APPEARS TO BE a deserted part\n       of the island.  Away from the action.\n\n       PAN ACROSS THE EDGE OF THE ISLAND\n\n       Every fifty feet or so, uniformed Secret Service agents\n       keep tight watch on the island.\n\n       ANGLE ON:\n\n       One Secret Service guy in particular.\n\n       PUSH IN FROM ABOVE - We realize we are pushing in\n       unusually fast, as though we are falling.\n\n       WHAM.  A sickening crunch.\n\n       Toad lands on top of the Secret Service guy.  We have\n       been watching from his P.O.V.  The Secret Service man is\n       tumbled into a heap.  A real frog rabbits O.S.\n\n       Toad looks around quietly, listens...  THEN LEAPS out of\n       frame.  Hold on the body of the Secret Service guy.\n\n       LONG PAUSE.\n\n       ANOTHER SICKENING CRUNCH OFF SCREEN.\n\n       EXT. LIBERTY ISLAND - NIGHT\n\n       Two Secret Service guys approach one another.  One is\n       holding a smoke, the other is producing a lighter.  Just\n       as his smoke is about to hit the flame, the flame dodges\n       to one side.  He moves the smoke to follow it, and the\n       flame dodges the other way.\n\n       The guy with the smoke looks at the guy with the lighter\n       as if to say ìknock it off.î  The guy with the lighter\n       shrugs as:\n\n       THE FLAME INSTANTLY GROWS TO A RAGING INTENSITY,\n       ENGULFING THEM.\n\n       As they are incinerated and their ashes fall to the\n       ground, Pyro climbs into view from the seawall below,\n       dripping wet.\n\n       He has come dressed to make trouble tonight.  Strapped to\n       his back is an impressive looking flame thrower.  A three\n       tanker.\n\n       EXT. SEAWALL - NIGHT\n\n       A Coast Guard boat crawls into view just off shore.  A\n       Secret Service man in the foreground waves to the boat as\n       it passes by.\n\n       EXT. COAST GUARD BOAT DECK - NIGHT\n\n       A thirty footer.  Fast and sturdy.\n\n       The PILOT OF THE BOAT, a man in his late forties, waves\n       back.\n\n       EXT. SEAWALL - NIGHT\n\n       As the Secret Service guy waves, he jolts upright, his\n       face contorting in impossible pain.  Slowly, he is lifted\n       off the ground.\n\n       EXT. COAST GUARD BOAT DECK - NIGHT\n\n       PILOTíS P.O.V.\n\n       Sabretooth holds the last Secret Service man aloft,\n       impaled on his claws.  He waves now, the body swaying\n       this way and that before he casually throws it to the\n       ground.\n\n       The Pilot turns to the wheel of the boat as he MORPHS\n       INTO MYSTIQUE and turns the boat toward the island.\n\n       EXT. BOTTOM OF THE SEAWALL - BOAT - NIGHT\n\n       Man-made rocky shore.  The boat bumps and grinds on the\n       rock.  Sabretooth jumps down to the deck and meets\n       Magneto coming up from below.  They nod to one another\n       and walk toward the front of the boat.  On the deck is\n       something covered with a tarp.  Sabretooth pulls back the\n       tarp to reveal Logan, still unconscious from the drug.\n\n       ANOTHER, MUCH LARGER OBJECT is on the back of the boat\n       under another tarp, but we cannot see what it is.\n\n       Magneto steps off the boat and looks up -- up at\n       someplace we cannot yet see.\n\n       EXT. ELLIS ISLAND - GREAT HALL - NIGHT\n\n       The dignitaries take their seats as the ceremony\n       commences.\n\n       INT. X-JET - NIGHT\n\n       Cyclops pilots the plane as Manhattan comes into view.\n       They bank to the south.  Cyclops checks his monitors.\n\n                           CYCLOPS\n                 Radar Stealth Mode checks out.  All\n                 right, thereíll be less security north\n                 of the George Washington Bridge.  Iím\n                 taking her down.\n\n                           JEAN\n                 Into the Hudson?\n\n                           CYCLOPS\n                     (smiles)\n                 Uh-huh.\n\n       EXT. HUDSON RIVER - NIGHT\n\n       The X-Jet slows to a hover.  Itís Harrier Jet engines\n       tilt back until they are vertical to the water.  The\n       engines cycle down and the plane lowers until it is\n       hovering a few feet off the surface.\n\n       INT. X-JET - NIGHT\n\n                           CYCLOPS\n                 V.T.O.L. off.\n\n       EXT. HUDSON RIVER - NIGHT\n\n       The Jetís engines cut and the plane splashes down into\n       the water.  It floats there for a moment and then sinks\n       below the surface.\n\n       EXT. BELOW RIVER SURFACE - NIGHT\n\n       As the X-Jet sinks, the hatches close off and the wings\n       retract to transform the plane into a submarine.  The\n       engines pull tight to the body of the craft and begin to\n       propel it forward.\n\n       EXT. HUDSON RIVER - NIGHT\n\n       AERIAL VIEW: The water ripples as the submersed aircraft\n       passes under the bridge and into the harbor.\n\n       INT. SMALL ROOM - NIGHT\n\n       C.U. on Logan.  He wakes.  His arms are cuffed behind his\n       back.  He is delirious and weakened from the drug.\n\n       He looks around and sees that he is in an oddly shaped\n       room with barely enough space for him and Magneto, who\n       smiles at him in the half darkness.\n\n                           LOGAN\n                     (very weak)\n                 Where am I?\n\n                           MAGNETO\n                 Youíre backstage at the encore of\n                 creation.\n\n       He looks at his watch.\n\n                           MAGNETO (contíd)\n                 Three minutes to curtain.\n\n                           LOGAN\n                 What are you going to do?\n\n                           MAGNETO\n                 In the road to survival, there is\n                 always sacrifice Logan.  We are the\n                 future... not them.  We must protect\n                 ourselves.  After tonight, when the\n                 leaders of the world return home --\n                 They will return as brothers, as\n                 mutants... and our cause will be\n                 theirs.  This is survival, I know you\n                 understand that, Logan... or is it\n                 Wolverine?\n\n       He steps out of the hatch and closes it.\n\n       EXT. LIBERTY ISLAND - NIGHT\n\n       Magneto who looks down.  From atop what, we cannot tell.\n\n       Magneto comes to stand on a railing outside from his high\n       perch, overlooking the island.  From here we pull out to\n       reveal at last where he is.\n\n       HE IS NOT ON ELLIS ISLAND AT ALL\n\n       Instead, he stands on the catwalk around the torch of the\n       Statue of Liberty, about a mile away.\n       He has his back to itís gold translucent flame, looking\n       over at the activity on Ellis Island, hearing the band\n       and inhaling the cool evening breeze.\n\n                           MAGNETO\n                 Give me your tired, your poor...\n\n       And he turns to the bright lights of Manhattan and itís\n       millions of inhabitants.\n\n                           MAGNETO (contíd)\n                 ... Your huddled masses.\n\n       He brings a radio to his lips.\n\n                           MAGNETO (contíd)\n                 Lights.\n\n       EXT. POWER STATION - NIGHT\n\n       Sabretooth is tearing the padlocks off of the generator\n       shed that powers the island.\n\n       INT. POWER STATION - NIGHT\n\n       Sabretooth grabs a hold of a fuse lever marked ìLiberty\n       Display Lightsî and pulls it down.  Turning it off.\n\n       INT. TORCH - NIGHT\n\n       Logan is now in darkness.  He frantically pulls on his\n       binds.  No use.\n\n       INT. X-JET - NIGHT\n\n       Cyclops is monitoring the area above-water on a video\n       screen.\n\n                           JEAN\n                     (points to the monitor)\n                 The lights on the Statue of Liberty\n                 are off.\n\n                           STORM\n                 Beast said that he would have to take\n                 a high vantage point.\n\n       Cyclops, motioning to an open area of water next to\n       Liberty Island.\n\n                           CYCLOPS\n                 Letís dock over there.\n\n       Cyclops pulls a lever.  The X-Jet begins to surface.\n\n                           CYCLOPS (contíd)\n                 Storm, give us some cover.\n\n       INT. APARTMENTS/VARIOUS - NIGHT\n\n       Televisions all over the city show the Statue sitting\n       dark to countless curious viewers.\n\n       INT. X-JET - NIGHT\n\n       The water level outside the X-Jet lowers as the plane\n       surfaces.\n\n       EXT. X-JET - NIGHT\n\n       The plane rises until it is nearly flush with the surface\n       of the water -- Not a hundred yards from an obvious Coast\n       Guard cutter.  Out the jetís window, the Statue rises\n       away into the fog that is now rolling in over the Harbor.\n\n       INT. SECURITY CONTROL CENTER - NIGHT\n\n       ANGLE ON:\n\n       The OPERATIONS COMMANDER raises a radio to his mouth.\n\n                           OPERATION COMMANDER\n                 Liberty One, Liberty One, this is\n                 Horizon, do you copy.\n\n       AN AGENTíS VOICE RESPONDS.\n\n                           AGENTíS VOICE\n                 Go, Horizon.\n\n                           OPERATION COMMANDER\n                     (on radio)\n                 Liberty, whatís the situation with the\n                 lights, over?\n\n       EXT. LIBERTY ISLAND - NIGHT\n\n       IT IS MYSTIQUE.  The lower part of her face and the whole\n       her neck are that of a stocky man.\n\n                           MYSTIQUE/AGENTíS VOICE\n                 Uhhh, Horizon, weíve seem to have had\n                 a shutdown at the generator, weíre\n                 five by five.  There now, checking it\n                 out.  Everything is fine other-wise.\n\n                           OPERATION COMMANDER\n                     (on radio)\n                 Roger Liberty one.  Horizon out.\n\n       She MORPHS back into her full self and smiles.\n\n                           MYSTIQUE\n                 Darling...  Weíre clear.\n\n       EXT. SEAWALL - NIGHT\n\n       Jean, Cyclops, Storm and Rogue step off the wing tip of\n       the X-Jet onto the island.  They climb over the fog\n       encased seawall and stand staring up at the Statue and\n       the desolate island.\n\n       EXT. TORCH - NIGHT\n\n       Magneto takes this moment in the darkness to point his\n       hands and all of his concentration on the bottom of the\n       torch.\n\n       The air RIPPLES with magnetic energy as -- the cap-like\n       end piece of the torch begins to vibrate, metal groans,\n       twists...\n\n       WITH A CRACK OF METAL, it comes free, dropping to the\n       ground.\n\n       INT. TORCH - NIGHT\n\n       Logan stares down through the hollow torch as the cap\n       falls away into the fog.\n\n       EXT. STATUE - BOTTOM - NIGHT\n\n       The foursome are deciding how to proceed.\n\n                           CYCLOPS\n                 We should check out operations, see if\n                 the Secret Service is still around.\n\n       Storm is surveying the layout of the island.  She looks\n       up at the Statue.\n\n                           STORM\n                 LOOK OUT.\n\n       They all look up.  The cap of the torch is SCREAMING DOWN\n       towards them out of the sky.  It crashes down as they\n       leap out of the way.\n\n                           CYCLOPS\n                 Iím going to assume that means that\n                 the Secret Service is out of\n                 commission.  Jean, can you raise me up\n                 there?\n\n                           JEAN\n                 Itís too far.\n\n                           CYCLOPS\n                     (assessing the situation)\n                 Storm, Rogue, -- you take the south\n                 entrance.\n                     (pointing to the main\n                      entrance)\n                 Jean and I will go in here.\n\n       Storm and Rogue start for the south entrance.\n\n                           CYCLOPS (contíd)\n                     (to Storm and Rogue)\n                 Iíll see you both soon.\n\n       EXT. TORCH - NIGHT\n\n       Magneto prepares to execute the next stage of his plan\n       when he looks out over the island.  A DENSE FOG has\n       rolled in, obscuring his view of the bottom half of the\n       Statue.  He looks out towards Ellis Island and sees that\n       the fog is localized over Liberty Island.\n\n                           MAGNETO\n                     (into radio)\n                 Be careful everyone...  I think we may\n                 have company.\n\n       EXT. SEAWALL - NIGHT\n\n       The Coast Guard boat Magneto came in on.  The giant tarp\n       on the boat and what is under it.\n\n       IT RISES IN THE AIR, standing upright.  The tarp slides\n       to the deck to reveal:\n\n       THE MACHINE.  The one Kelly and Xavier saw.  The air\n       ripples as it rises higher in the air.\n\n       INT. MUSEUM - NIGHT\n\n       Storm and Rogue quietly enter the Statueís museum.  It is\n       filled with scale models and full size displays\n       documenting the history of Lady Liberty.  One display\n       showcasing the METAL STRIPS which line the Statue for\n       support.  They quickly head for an exit on the far side\n       of the room.\n\n       SUDDENLY:\n\n       The lights go out.  Darkness.\n\n       A low guttural CROAK echoes in the void.\n\n                           STORM\n                     (whispering)\n                 Rogue... run.\n\n       Rogue runs into the darkness, heading for the exit.  She\n       dashes past a six foot copper replica of the Statue and\n       out the door.\n\n       As soon as Rogue is past, the Statueís HEAD TURNS and\n       watches her go.  The replica blinks and the eyes turn\n       Mystique yellow.\n\n       INT. TORCH - NIGHT\n\n       The machine is rising.  Logan yanks at the manacles in an\n       attempt to pull his hands free.\n\n       INT. OLD TORCH ROOM - NIGHT\n\n       A giant room that welcomes the many visitors to the\n       Statue.  In the center is the old torch, placed there\n       after the Statueís 1986 restoration.  The only light in\n       the room is a soft red glow that emanates from the old\n       torch.\n\n       Cyclops notices a map of the Statue on a pedestal.\n\n                           CYCLOPS\n                 Over there.\n\n       Cyclops and Jean study the map, looking for the way to\n       the torch.  In front of them is the old torch.  Itís\n       eerie red glow is growing brighter.\n\n       EXT. STATUE - TORCH - NIGHT\n\n       THE MACHINE rises up and into the bottom of the torch\n       itself.\n\n       INT. TORCH - NIGHT\n\n       The machine is now almost on him.  Loganís struggles\n       turns to rage.  SHOOK -- He pops his claws and\n       frantically cuts at the wall behind him, as the machine\n       draws closer.\n\n       INT. MUSEUM - NIGHT\n\n       We hear an ominous LOW RUMBLE, as you hear on an overcast\n       day just before a thunderstorm.  SHEETS OF HEAT LIGHTNING\n       begin to roll across the ceiling, lighting the room in\n       sporadic bursts.\n\n       Toad darts around the room.\n\n       FLASH -- Reptile eyes -- DARKNESS.\n\n       FLASH -- A WEBBED CLAW -- closer -- DARKNESS.\n\n       FLASH -- leaping body -- closer -- DARKNESS.\n\n       Silence.  Darkness.\n\n       The heat lightning continues to expose the room in\n       rolling flashes.\n\n       Silence.  Darkness.\n\n       Suddenly, behind Storm the sound of ELEVATOR DOORS\n       OPENING.  Storm spins and unleashes a BOLT OF LIGHTNING.\n       The lightning strikes an empty GLASS HYDRAULIC ELEVATOR\n       SHAFT.  No TOAD.\n\n       INT. OLD TORCH ROOM - NIGHT\n\n       ANGLE ON: The map of the statue.  Cyclops watches as the\n       dim red glow turns brighter and brighter.  He turns to\n       look up at the old torch -- it glows FIERY RED HOT.\n\n                           CYCLOPS\n                 Get down!\n\n       THE TORCH EXPLODES.\n\n       A RING OF FIRE wipes across the room.\n\n       Cyclops and Jean duck behind the marble map pedestal as\n       fire whips around them.\n\n       Move up through the CEILING OF FIRE to reveal Pyro at the\n       center of the old torch.  His eyes wide, manipulating the\n       fire like an orchestra conductor.\n\n       INT. HALLWAY OUTSIDE THE MUSEUM - NIGHT\n\n       Rogue runs down the hallway, she stops.  The sound of\n       footsteps echo from behind her.  The footsteps quicken\n       from walking to running.  Rogue runs to get away as the\n       footsteps of her pursuer get closer.\n\n       INT. MUSEUM - NIGHT\n\n       Darkness.  Silence -- except for the sound of Stormís own\n       breathing.  Stormís eyes dart around the room, her senses\n       are in overdrive.\n\n       Suddenly, SLIME drips onto her cheek.  A low guttural\n       CROAK.  Storm looks up -- TOAD clings to the ceiling.\n\n       WHAM.  Webbed feet slam into Stormís chest sending her\n       flying into the elevator shaft.  She crashes helplessly\n       to the bottom -- stunned.\n\n       Toadís head peers through the open elevator doors to the\n       level below, looking down on the helpless Storm.  Toad\n       SMILES.  His webbed finger presses the elevator button.\n\n       The elevator doors above her close, sealing her in the\n       glass tubular shaft.\n       The ROAR of the hydraulic engine coming to life, the\n       elevator begins its crushing descent down toward Storm as\n       she lies at the bottom of the shaft dazed.\n\n       INT. OLD TORCH ROOM - NIGHT\n\n       C.U. on Jean and Cyclops both pinned down.\n\n       Fire sweeps around the map pedestal.  Cyclops turns.\n\n       BOOM -- He fires a series of OPTIC BLASTS blindly through\n       the fire, blasting the ceiling.\n\n       Chunks of debris from the ceiling shower down onto Pyro.\n       The inferno stops.\n\n       Smoke fills the room, Jean tries to catch her breath.\n       Cyclops stands and heads toward the old torch trying to\n       draw a bead on Pyro.  Cyclops doesnít see him.  When:\n\n       A COLUMN OF FIRE erupts from the thick smoke, rocketing\n       at Cyclops.\n\n       Cyclops dodges, flipping a heavy wood table with flaming\n       pamphlets on it -- using it as a shield against Pyroís\n       fiery onslaught.\n\n       EXT. TORCH - BACK - NIGHT\n\n       ANGLE FROM DIRECTLY OVERHEAD:\n\n       Magneto on the side of the torchís flame raises the huge\n       machine -- while on the other side -- LOGAN PUSHES\n       HIMSELF THROUGH THE HOLE -- his hands still bound behind\n       his back, and slams against the outer railing of the\n       torch.\n\n       Logan looks around in shock.  He realizes where he is.\n       He looks out at all the activity on Ellis Island, drawing\n       a greater understanding of Magnetoís plan.\n\n       EXT. TORCH - FRONT - NIGHT\n\n       With a MAGNETIC RIPPLE of the air Magneto drives the\n       machine right up through the bottom of the torch like\n       batteries in a flashlight.\n\n       EXT. TORCH - BACK - NIGHT\n\n       Logan turns his back to the hole he has just emerged from\n       and braces his cuffs against the rising machine.  The\n       machine pushes against Loganís wrists driving his cuffs\n       up against the top of the hole.\n\n       CRACK.\n\n       The pressure leaves the cuffs apart.\n\n       INT. ELEVATOR SHAFT - NIGHT\n\n       Stormís eyes open, looking straight up.\n\n       ANGLE ON: The elevator continuing its crushing descent.\n\n       Storm struggles to her feet.  Her hand presses against\n       the thick glass elevator shaft, it surrounds her like a\n       coffin.\n\n       LIGHTNING strike the glass -- to no effect.\n\n       Storm frantically searches for a way out.  She looks up\n       to see the elevator closing fast.\n\n       Storm raises her hands above her head.  WIND begins to\n       lift Stormís hair.  The wind picks up and starts swirling\n       violently against the sides of the elevator shaft.\n\n       Wildly, the wind whips around causing a CYCLONE within\n       the glass shaft buffeting upwards against the elevator.\n\n       The elevator groans as the hydraulics fight the\n       unrelenting vortex of wind.  Smoke begins to pour from\n       the hydraulics, which whine in protest.  At the center of\n       the tornado stands Storm, a force of nature.\n\n       As the elevator continues its descent the cyclone pushes\n       outward.  Small cracks start to appear on the glass\n       walls.\n\n       She is now forced almost to the ground.  The elevator is\n       now inches from Stormís head.  The floor is made of a\n       thicker version of the same Plexiglas and we look up\n       through it, the massive elevator looming over Storm.\n\n       BOOM.\n\n       The glass walls explode outward, showering the museum.\n\n       Storm partly rolls and is partly blown from the shaft to\n       safety.  The pressure of the cyclone released, the\n       elevator SLAMS to the bottom.\n\n       INT. OLD TORCH ROOM - NIGHT\n\n       Jean, having caught her breath, looks over to:\n\n       C.U. on Cyclops.  Heís pinned down as fire wraps around\n       the table -- the fire is burning through.\n\n       Jean, seeing Cyclops defenseless, stands up from behind\n       the marble podium.  She quickly scans the room and spots,\n       on opposite walls near the old torch, TWO LARGE FIRE\n       EXTINGUISHERS.\n\n       Jean stretches out her fists and focuses her telekinesis.\n\n       Pyro spots Jean -- with one hand continuing to blast\n       Cyclops, he uses the other to unleash an ARM OF FIRE\n       toward Jean.\n\n       Jean focuses as she brings her outstretched fists closer\n       together.  Suddenly -- the two fire extinguishers crash\n       through their glass holders.\n\n       Like two gunslingers in a showdown.\n\n       The extinguishers bullet toward Pyro.\n\n       The arm of fire rockets closer to Jean.\n\n       Suddenly, the EXTINGUISHERS COLLIDE EXPLODING in front of\n       Pyro.\n\n       Inches from Jeanís face, the ARM OF FIRE disappears.\n\n       The COLUMN OF FLAMES against Scott VANISHES.  The flames\n       once covering the room are gone, a choking smoke is all\n       that remains.\n\n       Through the smoke, at the center of the old torch, Pyro\n       lies dead, covered in a sea of white foam.\n\n       Jean starts choking on the smoke.  Cyclops stands and\n       motions for her to get out of the smoke filled room.\n\n       EXT. TORCH - FRONT - NIGHT\n\n       The machine finally locks into place.  Magneto raises a\n       walkie talkie to his face.\n\n                           MAGNETO\n                 Lights on.\n\n       INT. POWER STATION - NIGHT\n\n       Sabretooth grabs a hold of the lever for the ìLiberty\n       Displayî power breaker and pulls up.  Turning it on.\n\n       INT. ELLIS ISLAND - GREAT HALL - NIGHT\n\n       The lights of the Statue come back on.  The crowd of\n       dignitaries burst into enthusiastic applause as if it is\n       part of the proceedings.\n\n       INT. SECURITY CONTROL CENTER - NIGHT\n\n       The Statue now lit up in the monitors.\n\n                           OPERATION COMMANDER\n                 Roger.  We see the lights.\n\n       EXT. TORCH - FRONT - NIGHT\n\n       Magneto turns and opens the hatch.  Magneto sees the hole\n       -- Logan is gone.\n\n       EXT. TORCH - BACK - NIGHT\n\n       Magneto walks over and stares at the hole, clearly out by\n       Loganís claws.\n\n       Magneto looks at his fingers after wiping the edge of the\n       hole.  Loganís blood.  Magneto looks down and sees\n       Loganís claw marks down the arm of the Statue, marking\n       his escape.\n\n       Magneto scans the island from his high perch.  He does\n       not see Logan.\n\n       EXT. STATUE - MAIN ENTRANCE - NIGHT\n\n       The doors to the old torch room burst open -- SMOKE\n       BILLOWS OUT.  Jean runs out coughing violently.\n\n       Suddenly, Toad lands in front of Jean, grabs her head and\n       before she can react, his tongue launches at her face.\n\n       His tongue covers her face with an ADHESIVE SLIME.  Jean\n       falls to the ground.  Toad looks back at the main\n       entrance, sees Cyclops emerging and LEAPS up, out of\n       frame.\n\n       ANGLE ON:\n\n       Cyclops stumbles out of the smoke filled building.\n       Seeing Jean lying on the ground, he runs to her.\n\n       Cyclops turns Jean on her back, ready to perform CPR.  He\n       is shocked, the slime has now hardened to Jeanís face.\n       She is suffocating.  He desperately tries to pry it off.\n\n       ANGLE ON:\n\n       The camera quickly pulls higher and higher revealing --\n\n       TOADíS P.O.V.\n\n       EXT. OBSERVATION DECK - NIGHT\n\n       Toad looks down, perched on top of the railing\n       surrounding the base of the Statue -- the same position\n       he had before crushing the Secret Service agent.\n\n       Toad arches his back ready to spring downward.  He will\n       kill two birds with one crushing leap.\n\n       The sound of WIND.\n\n       C.U. Toadís face static, his eyes slowly look to the\n       side.  His head twists, looking over his shoulder.  Storm\n       stands behind him.\n\n       Toad turns and hops off the railing towards Storm.\n\n       C.U. on TOADíS FACE.  Which is horrible.\n\n                           TOAD\n                 Donít you people die?\n\n       Suddenly the wind picks up violently.  Toad moves closer\n       -- fighting the wind.\n\n       Storm is MAD.  A face we remember seeing on a young girl\n       in Africa.\n\n       Toad fights the gale force winds, his webbed feet\n       adhering to the ground.  He inches closer to Storm.  Toad\n       bares his FANGS.\n\n       EXT. STATUE - MAIN ENTRANCE - NIGHT\n\n       On the ground Cyclops notices the wind howling with rage\n       above him.  He frantically pulls on the encrusted slime\n       suffocating Jean.\n\n       EXT. OBSERVATION DECK - NIGHT\n\n       Stormís eyes widen.  HURRICANE force winds blast Toad.\n       Try as he might to use his sticky feet to hold on, Toad\n       is blown back off his feet, catching the deck with his\n       hands.\n\n       The piece of the deck TEARS LOOSE still attached to\n       Toadís hands.  He flies off the deck, past the metal\n       railing.  Toadís tongue LASHES OUT AND ATTACHES TO THE\n       RAILING.  For a moment, Toad just flaps there like a\n       flag.\n\n       Storm RAISES HER ARMS.\n\n       CRASH -- A huge BOLT OF LIGHTNING strikes the railing.\n\n       Toad is blown off the railing in a flash of electricity\n       and --\n\n       EXT. HARBOR - NIGHT\n\n       Toad lands in the water.  He disappears below the surface\n       leaving nothing but bubbles.\n\n       EXT. OBSERVATION DECK - NIGHT\n\n       Storm moves to the railing.  She looks down at Cyclops\n       and Jean.  Suddenly, the metal railing on which her hands\n       rest BEGIN TO BEND TOWARD HER.\n\n       EXT. STATUE - MAIN ENTRANCE - NIGHT\n\n       Cyclops continues to pull on the slime.  Jeanís struggles\n       are becoming more panicked.\n\n       Cyclops stops and puts his hands on Jeanís shoulders,\n       pinning her down.\n\n                           CYCLOPS\n                 Jean.  Jean stop.  Stop moving.\n\n       Jean continues to struggle for a moment.  She starts to\n       calm down, her chest still hitching involuntarily for\n       air.\n\n                           CYCLOPS (contíd)\n                 Jean, trust me.  Donít move.\n\n       He takes a hold of her chin and grips it tightly.  He\n       FIRES A THIN, FOCUSED OPTIC BEAM INTO THE ENCRUSTED\n       SLIME, splitting it in half.  He pulls the remains away\n       from her face.\n\n       Jean GASPS for air.  Then she looks up.  Her face turns\n       to horror.  Behind Cyclops, towering over him is --\n       Sabretooth.\n\n       WHAM!  Sabretooth smashes down.\n\n       BLACK\n\n       INT. HALLWAY OUTSIDE THE MUSEUM - NIGHT\n\n       Rogue turns the corner of the hallway and trips, tumbling\n       to the ground.\n\n       Rogue watches from the floor as the shadow of her pursuer\n       bends around the corner.  The sound of their footsteps\n       get closer.  The shadow is upon her, turning the corner.\n\n       It is LOGAN.\n\n                           LOGAN\n                 I didnít mean to scare you.\n\n                           ROGUE\n                 Thank God.  Logan... we have to help\n                 Storm we have to.\n\n       Logan looks around to make sure itís clear.\n\n                           LOGAN\n                 Iíll go back, but first let me find\n                 you a safe place.\n\n       Logan extends his hand.\n\n                           LOGAN (contíd)\n                 Here, take my hand.\n\n       Rogue looks at Logan confused.  Logan grows impatient.\n\n                           LOGAN (contíd)\n                 Take it!\n\n       ANGLE ON: Over Loganís shoulder.  On the back of his neck\n       we see some BLUE SCALES.  Logan is not Logan, Logan is\n       MYSTIQUE.\n\n       INT. STATUE - HEAD - NIGHT\n\n       E.C.U.-on Magnetoís belt, which is lined with METAL\n       STRAPS.  Magnetoís hand comes into frame holding CYCLOPSí\n       VISOR and places it against one of the straps.  The strap\n       WRAPS ITSELF BACK AND AROUND, pinning the visor to the\n       belt.  He brings a radio to his mouth.\n\n                           MAGNETO\n                     (into radio)\n                 Mystique...  Mystique, where are you?\n\n       Magneto turns to Sabretooth.\n\n                           MAGNETO (contíd)\n                 Find Logan.\n\n       Sabretooth exits as Magneto turns to reveal --\n\n       Jean and Cyclops, without his visor, are trapped in a\n       hideous tangle of metal (taken from the Statueís steel\n       bracing) forcing the two to face each other.  Two sharp\n       points of metal rest on either side of Cyclopsí head,\n       locking it in position.  Cyclopsí is close enough to feel\n       Jeanís breath -- if he opens his eyes, he will destroy\n       everything in his path, including Jean.\n\n       Storm is also encased in a myriad of sharp metal bands,\n       pinning her to the wall.  Razor sharp pieces of metal\n       warp and close on her throat.\n\n       All in all, they are completely disabled.\n\n       Jean struggles to free them with her telekinesis, to no\n       avail.\n\n                           CYCLOPS\n                     (whispering)\n                 Jean... can you?\n\n                           JEAN\n                     (whispering)\n                 Iím sorry.  Iím not strong enough.\n\n       Magneto stands next to Storm.  Close.\n\n                           MAGNETO\n                     (whispering)\n                 If the temperature changes a single\n                 degree...\n                     (looking at Jean)\n                 I only need one hostage.\n\n       Magneto stares icily at Storm.\n\n       As if to accentuate the threat, a piece of metal pokes\n       ever so slightly into the side of Stormís throat.\n\n                           MAGNETO (contíd)\n                     (raising his voice)\n                 Now if you can hear me Logan...\n\n       EXT. SEAWALL - NIGHT\n\n       We find Logan -- The real Logan.  He has made it off the\n       Statue and is about to jump off the seawall.  He stops\n       suddenly.\n\n       E.C.U. of his ear.  His powerful hearing enables him to\n       hear Magneto.\n\n                           MAGNETO (V.O.)\n                 ... and I know you can -- It is a five\n                 minute run from the furthest distance\n                 on this island.  If you are not back\n                 in this time...  I will kill these\n                 friends of Xavierís.  Including the\n                 young lady from the gymnasium.  I\n                 think they came here to ìrescue you.î\n\n       INT. STATUE - HEAD - NIGHT\n\n       Magneto looks to his hand -- the CHIP from Cerebro.\n\n                           MAGNETO (contíd)\n                 I also have a small piece of Cerebro\n                 that might be of interest to you, if\n                 you hope to save Charles Xavier.\n\n       EXT. SEAWALL - NIGHT\n\n                           MAGNETO (V.O.)\n                 Xavier is dying you know.  Five\n                 minutes Logan.\n\n       Loganís face shows the frustration.  Again, he is forced\n       to make a decision.\n\n       INT. STATUE - HEAD - NIGHT\n\n       Magneto pulls out the chip taken from Cerebro and walks\n       over to Jean.\n\n                           MAGNETO\n                 Here -- Xavierís life.\n\n       He tucks it in an exposed part of her uniform.\n\n                           MAGNETO (contíd)\n                 If I get what I want, you can try and\n                 save him... for old times sake.\n\n       Magneto turns to Storm.\n\n                           MAGNETO (contíd)\n                 Now... shall we talk about the\n                 weather.\n\n       INT. ELLIS ISLAND - MAIN ENTRANCE - NIGHT\n\n       The President addresses the audience.  We move across all\n       the worldís leaders sitting with their families.  Men,\n       women and children of every race, color and creed that\n       the planet Earth has to offer.\n\n       INT. STATUE - HEAD - NIGHT\n\n                           JEAN\n                 Magneto.  Iíve seen the results of\n                 your machine.  Iíve seen Senator\n                 Kelly.\n\n                           MAGNETO\n                 Ahhhh, so the good Senator survived\n                 his fall?  And the swim to shore?  He\n                 is stronger than I ever could have\n                 imagined.\n\n                           JEAN\n                 The experiment was a failure.  Kelly\n                 didnít make it.  Yes, you were\n                 successful in activating his mutator\n                 gene, but you failed to take into\n                 account the rest of his body -- it\n                 wasnít ready for the strain.\n                 Kelly was dead within hours.  Your\n                 machine kills.\n\n                           MAGNETO\n                 Quiet...\n\n       Magneto pauses.  Shock registering on his face that he\n       could be wrong.  Thinking.  Considering what Jean is\n       telling him.  His mind races and calculates the\n       possibility.  Then:\n\n                           MAGNETO (contíd)\n                 I donít believe you.\n\n                           JEAN\n                 You donít understand.\n\n       Magneto gets angry -- squeezing the metal surrounding\n       Jeanís head.  Jean gasps.  This drives Cyclops crazy, but\n       he is helpless to stop it.\n\n                           CYCLOPS\n                     (yelling)\n                 Stop it!\n\n                           MAGNETO\n                 Why canít you see what I am trying to\n                 do?  Why do you stand in my way?\n\n       Magnetoís anger is boiling over.\n\n       THUD -- the sound of footsteps, then another and another.\n       The faces around the room look at the stairs as the\n       footsteps get closer and louder.\n\n                           MAGNETO (contíd)\n                 Check and mate.\n\n       PAUSE.\n\n       SUDDENLY:  SHOOK -- Loganís claws shoot up through the\n       floor, and through Magnetoís feet.  Magneto howls.  The\n       claws retract and Magneto falls.\n\n       Magneto, writhes in pain, rolling onto his stomach.\n\n       Logan quickly comes up the stairs and into the Statueís\n       head.  He stands over the crippled Magneto.\n\n       Logan turns to Jean who is still pressed eye to eye with\n       Cyclops.  He is relieved to see her alive.\n\n       ANGLE ON: Storm.  She sees something.  Several of the\n       steel bands that support the top of the Statueís head\n       begin to move.\n\n                           STORM\n                 Logan!\n\n       THREE METAL BAND peel off the ceiling, coming to life\n       with magnetic energy.  They leap across the room and wrap\n       around Logan.  Forcing his fists to press against his\n       chest.\n\n       Should he so much as extend his claws, he will rupture\n       his own vitals.  The metal bands wrap behind his back.\n\n       Magneto raises his hand and MAGNETIC WAVES RIPPLE.  Metal\n       groans as Magneto peels open a gaping hole in the top of\n       Lady Libertyís head.  Magneto looks up at the torch.  The\n       wind howls.\n\n       The AIR RIPPLES again as Magneto levitates the steel\n       bands holding Logan, lifting Logan off the ground and out\n       the hole in the Statueís head.\n\n       EXT. STATUE - HEAD - NIGHT\n\n       MAGNETIC WAVES thrust Logan through the air and --\n\n       INT. TORCH - NIGHT\n\n       WHAM -- THROUGH the metal skin of the flame.  Logan lands\n       in the center of the sphere on top of the machine.\n\n       Inside the sphere is a metal structure resembling the\n       model of an atom.  Its rings expand as it receives Logan.\n\n       Logan looks through the hole in the frame, down into the\n       hole in the Statueís head, at Magneto.\n\n       INT. STATUE - HEAD - NIGHT\n\n       Magneto struggles to his feet, pulling himself up by his\n       hands.  Magneto stares at Logan, impatient.\n\n       Magneto stands with a hand raised up toward the machine.\n       Then a slight motion of his wrist --\n\n       INT. TORCH - NIGHT\n\n       The rings start revolving just as it did with Kelly, back\n       at the lair.  Spinning slowly, then gaining in speed.\n\n       The air around it RIPPLES, gaining in intensity.\n\n       INT. STATUE - HEAD - NIGHT\n\n       MAGNETIC ENERGY POURS from Magnetoís hands toward the\n       machine, behind him Jean and Storm watch helplessly.\n\n       INT. TORCH - NIGHT\n\n       The rings are spinning around Logan at such a speed, the\n       rings themselves are no longer visible -- merely a blur\n       around the stationary Logan.\n\n       Logan yells.  Unthinkable pain, his skeleton beginning to\n       glow through his skin.\n\n       His eyes look down, through the hole in the torch, into\n       the Statueís head, searching for Jean.\n\n       The deafening whine builds louder and louder.\n\n       INT. STATUE - HEAD - NIGHT\n\n       Magneto looks at the incredible displays as MAGNETIC\n       ENERGY flows from his hands continuing to charge the\n       machine.\n\n       Mystique emerges from the stairwell behind Magneto.  Her\n       eyes widen in awe.\n\n                           MAGNETO\n                 Ahh, there you are.\n\n       Mystique walks slowly toward magneto.  Storm and Jean\n       watch the torch in horror.\n\n                           JEAN\n                     (to Mystique)\n                 You have to stop him, the machine...\n                 it kills people...\n\n       Mystique ignores Jean.  She stops behind Magneto.  She\n       looks up and sees Logan staring back in agony.\n\n                           JEAN (contíd)\n                 ... Please do something.\n\n       Magneto tilts his head slightly, acknowledging Jean, but\n       not moving from his task.\n\n                           MYSTIQUE\n                 Donít listen to her... itís a trap.\n\n       Magneto turns.\n\n                           MAGNETO\n                 What is?\n\n                           MYSTIQUE\n                 This is.\n\n       And she grabs the sides of his face and kisses him\n       deeply.  There is an awkward moment.  Until:\n\n       MAGNETO CONVULSES.  Once, then again.  Then he struggles\n       to be set free.\n\n       And MYSTIQUE TRANSFORMS INTO ROGUE.\n\n       It has been her all along, using SHAPE SHIFTING powers\n       borrowed from the real Mystique.\n\n       Magneto fights to get free, but his power is being\n       drained from him.\n\n                           JEAN\n                 ROGUE, DESTROY THE MACHINE!\n\n       Rogue goes to pull away, BUT MAGNETO WONíT LET HER GO.\n\n       Magneto grabs hold of Rogueís throat -- CHOKING HER.\n\n       INT. TORCH - NIGHT\n\n       Logan looking down, through the hole in the Statueís head\n       for Jean, sees Rogue and Magneto struggle.\n\n       Logan watches helplessly as MAGNETO STRANGLES ROGUE.\n\n       LOGAN YELLS -- THE WHITE LIGHT BEGINS TO EMANATE FROM HIS\n       BODY.  His flesh starts to SMOLDER.\n\n       INT. STATUE - HEAD - NIGHT\n\n       Magneto is strangling Rogue, who clings to his face --\n       drawing his powers.\n\n       The walls GROAN as magnetic energy RIPPLES through the\n       Statueís head.\n\n       ANGLE ON:\n\n       Rogue, choking to death, looks frantically at Cyclops for\n       help.  She raises one of her hands and uses Magnetoís\n       stolen power to BEND BACK THE METAL POINTS so that\n       Cyclops is able to move his head again.  Without his\n       visor however, he is still unable to open his eyes.\n\n       Magneto, feeling the last of his power draining from him,\n       grabs Rogue tightly and SLAMS her into the wall.  Rogue\n       slumps in Magnetoís arms and the two collapse to the\n       ground.\n\n       INT. TORCH - NIGHT\n\n       The sound from the machine is DEAFENING.  SUDDENLY --\n\n       SILENCE.\n\n       ABSOLUTE SILENCE.\n\n       At the silence, all eyes turn to the torch.\n\n       It is too late -- THE MACHINE IS FULLY CHARGED.\n\n       Loganís eyes tense.  He clenches his teeth.  Logan does\n       the unthinkable.\n\n       SHOOK.\n\n       The glowing white claws extend through Loganís chest and\n       out his back cutting three metal straps binding him.\n       Logan ROARS in pain as he --\n\n       Pulls his claws from his chest.\n\n       SLASH -- his claws rip through the inside of the machine -\n       - cutting apart the rings spinning around him.\n\n       The translucent torch of the Statue is CUT TO PIECES BY\n       THE FLYING METAL.\n\n       INT. ELLIS ISLAND - GREAT HALL - NIGHT\n\n       The President and the dignitaries turn.  Secret Service\n       rush to the window.  A wave of panic sweeps the crowd.\n\n       INT. SECURITY CONTROL CENTER - NIGHT\n\n       The flaming torch lights up one of many screens.\n\n                           OPERATION COMMANDER\n                 Liberty one this is Horizon...  I\n                 repeat... do you copy?  Liberty one\n                 this is Horizon ... I repeat... do you\n                 copy?\n\n       EXT. STATUE - TORCH - NIGHT\n\n       Where the flame of the torch once stood, now stands\n       Logan, his skeleton cooling down.\n\n       Logan leans on the torchís railing, his chest bleeds from\n       the six claw wounds.  Logan is exhausted.  He looks down\n       at his comrades still trapped by the metal bands.  And\n       Magneto lying powerless on the floor.  SUDDENLY, from\n       below --\n\n       A MASSIVE CLAWED HAND strikes Loganís chest.  The blow\n       sends Logan sailing back to the far end of the torch.\n\n       Logan lies against the railing.  Opening his eyes he sees\n       --\n\n       TWO CLAWED FEET following upward to a very angry, very\n       large Sabretooth, towering over him.\n\n       Sabretooth leaps at Logan.  Against the New York skyline\n       THEY GO AT IT, SLASHING AND HOWLING.\n\n       EXT. MANHATTAN HARBOR - NIGHT\n\n       Several Coast Guard cutters head full-speed toward\n       Liberty Island.\n\n       ANGLE ON: Their decks covered with armed Secret Service.\n\n       EXT. TORCH - NIGHT\n\n       Sabretooth picks up Logan over his head and throws him\n       like a rag doll into the railing on the other side of the\n       torch.\n\n       Logan struggles to his feet -- dazed.  Suddenly,\n       Sabretooth, running at full steam, tackles him.  Slamming\n       Logan into the railing.\n\n       The metal railing bends.\n\n       Sabretooth holds Logan by his wrists, trying to push him\n       over the edge.  It is several hundred feet to the ground\n       below.\n\n       Logan is weakening.  Sabretooth is in complete control,\n       he leans down near Loganís ear.\n\n                           SABRETOOTH\n                     (whispering)\n                 Your girlfriend is next.\n\n       With all his might, Logan pushes his clenched fists as\n       close to Sabretoothís face as he can.  SHOOK!  The claws\n       pop.  Sabretooth springs back to protect his face.\n\n       LOGAN KICKS WITH ALL HIS MIGHT AND SABRETOOTH flies back\n       to the other side of the torch.\n\n       LOGAN leaps up and running at full speed, tackles\n       Sabretooth -- like a train plowing into a stalled car.\n\n       The metal railing snaps and they both go flying through\n       the air.\n\n       EXT. STATUE - HEAD - NIGHT\n\n       CRACK.\n\n       Sabretooth and Logan slam onto the top of the Statueís\n       head.\n\n       Logan rolls off the back of the Statueís head and falls.\n\n       Sabretooth stands and looks over the edge - nothing.  All\n       he can see is the Statueís body curving away towards the\n       ground.  He smiles, and turns back to the hole.\n\n       EXT. STATUE - HEAD - NIGHT\n\n       ANGLE ON: LOGAN - Hanging from the ear of the Statue, the\n       claws of his right hand embedded in the lobe at the end\n       of three sets of long claw-marks.\n\n       He looks up.  A look of brutal determination crosses his\n       face.  Straining, he pulls himself up by his right arm.\n       The cords stand out on his neck as he tries to get to\n       shoulder level.  He aims his left claw a little further\n       up on the ear and --\n\n       THUNK.\n\n       He drives it in.\n\n       INT. STATUE - HEAD - NIGHT\n\n       WHAM -- E.C.U. Sabretoothís feet as he lands on the metal\n       floor.  He quickly takes in the situation, Magneto and\n       Rogue are still unconscious.  He walks towards Storm.\n\n       The air in the room starts to CRACKLE and Sabretoothís\n       hair begins to stand on end as it did when these two last\n       confronted each other.\n\n                           SABRETOOTH\n                 I donít think so.\n\n       Sabretooth backhands Storm across the jaw, knocking her\n       out.  As her head drops, he draws his claws and slashes\n       it down.  It STOPS, just before tearing open Stormís\n       throat, HELD BY AN UNSEEN FORCE.  He turns and sees that\n       Jean has focused her power in his arm.  He smiles.\n\n       He walks to Jean and tears off her bonds.  He reaches out\n       to grab her neck but his claw is stopped again in mid-\n       air.  Sabretooth just smiles wider and forces his hand\n       forward.  The outcome never really in doubt, the claw\n       wraps around Jeanís neck.  She begins to choke.\n\n                           CYCLOPS\n                 Jean!\n\n       Sabretooth lifts Jean by the neck and walks away from\n       Cyclops as he chokes her.\n\n                           SABRETOOTH\n                 Sorry about this sweetheart, but I\n                 made Logan a promise.\n\n       Jean struggles desperately against Sabretoothís\n       unbreakable grip, the life draining from her.  Then --\n\n                           LOGAN (O.S.)\n                 Hey, ya big pussy.\n\n       Sabretooth whips around, still clutching Jean to see -\n       LOGAN -\n\n       Bleeding, beaten and panting, and yet still standing\n       defiantly over Magnetoís unconscious body.\n\n                           LOGAN (contíd)\n                 I ainít finished with you yet.\n\n       Sabretooth looks at him, disbelieving that this man can\n       still be standing, let alone challenging him... and he\n       starts to laugh.\n\n                           SABRETOOTH\n                 You?\n\n       Logan grins.\n\n                           LOGAN\n                 Not just me.\n\n       And with that: he extends ONE CLAW from his right hand,\n       squats down, and cuts the piece of metal holding Cyclopsí\n       visor to Magnetoís belt.  He lifts it up and it slides\n       down his claw to his hand.  He casually throws it in the\n       air.\n\n                           LOGAN (contíd)\n                 Jean?\n\n       Logan looks at the visor and it freezes in the air.\n\n       It flies across the room, right past Sabretoothís head.\n       He lunges at it with his free claw but just misses it.\n\n       The visor lands square on Cyclopsí eyes, and attaches\n       itself to Cyclopsí face.\n\n       He turns.\n\n       BOOM!\n\n       A focused OPTIC BLAST hits Sabretooth like a FREIGHT\n       TRAIN.  He drops Jean and SLAMS THROUGH THE WALL.\n\n       EXT. STATUE - NIGHT\n\n       We see the side of the Statueís head.  Suddenly,\n       Sabretooth BLASTS THROUGH THE EYE.\n\n       For a moment Cyclopsí beam continues to fire through the\n       eye as if the Statue itself is imitating Cyclopsí power.\n\n       EXT. SEAWALL - NIGHT\n\n       Magnetoís boat still sits quietly next to the seawall.\n\n       CRASH.\n\n       Sabretoothís body SMASHES THROUGH THE ROOF of the boat.\n       The tarp flies up and drifts back down to rest over\n       Sabretoothís body.\n\n       INT. STATUE - HEAD - NIGHT\n\n       Loganís breathing is strained, a blood stain in the\n       middle of his shirt, but he is in control.  Logan looks\n       up, his eyes met by Jeanís.\n\n       He walks over to Storm and Cyclops and SHOOK! cuts them\n       loose.  Jean and Cyclops catch Storm, who begins to come\n       around.\n\n       Cyclops smiles.  Logan kneels down beside Rogue.  He\n       wants to comfort her but cannot touch her.  She opens her\n       eyes and sees Logan.\n\n                           ROGUE\n                 Hey...  There you are.\n                     (sudden apprehension)\n                 Is it really you?\n\n                           LOGAN\n                     (not quite sure what sheís\n                      talking about)\n                 Yeah, itís really me.\n\n                           CYCLOPS\n                 Come on, letís get out of here.\n\n       Logan stands.  He takes a couple of steps before\n       collapsing in Cyclopsí arms.\n\n                           LOGAN\n                     (sliding to the ground)\n                 Iím o.k.  Iím o.k.\n\n                           CYCLOPS\n                 Sure you are, sport.\n\n       EXT. LIBERTY ISLAND - DOCK - NIGHT\n\n       Several Coast Guard cutters and police boats reach the\n       island.  Men run across the dock as we pull up --\n\n       EXT. LIBERTY ISLAND - NIGHT\n\n       The Coast Guard, Secret Service, and FBI descend upon the\n       island.\n\n       INT. OLD TORCH ROOM - NIGHT\n\n       Security enters the smoldering remains of the old torch\n       room.  The walls blackened by a past inferno.  At the\n       center, Pyro lies motionless in a sea of foam.\n\n       INT. MUSEUM - NIGHT\n\n       Push in on MYSTIQUE who is tied up.  Across her feet a\n       crack of light as the door begins to open.  Swish pan\n       over to the NYPD entering the room.  Swish pan back.\n       Mystique has taken the form of a Secret Service agent.\n\n                           AGENT/MYSTIQUE\n                 Hey, could somebody untie me!\n\n       EXT. SEAWALL - NIGHT\n\n       A Secret Service spots the wreckage of Magnetoís boat and\n       the large tarp which covers it.  He pulls his gun.\n\n                           SECRET SERVICE MAN #3\n                     (to other agents)\n                 Hey!  Over here.\n\n       Three other agents pull their guns and aim at the tarp.\n       The first agent pulls it back to reveal... nothing.\n       Sabretooth is gone.\n\n       INT. STATUE - HEAD - NIGHT\n\n       NYPD and Secret Service rush up the stairs and into the\n       head.  Magneto lies unconscious on the floor.\n\n       The lead guy, an NYPD OFFICER in a flak jacket, holding a\n       shotgun, stares up at the ceiling.  He peers out through\n       the gaping hole.  Beyond the damaged torch the star\n       filled sky is momentarily eclipsed by a aircraft -- the X-\n       Jet.\n\n       The officer turns to say something, but stops --\n       wondering if his eyes were merely playing tricks on him.\n\n       INT. MANSION - DAY\n\n       Cyclops, Jean, Storm, Rogue and about two dozen students\n       all sit in front of a wide screen TV watching the Special\n       Report on the Mutant Registration Act vote.\n\n       As the Anchorman speaks we move over the concerned looks\n       on all of their faces.\n\n                           ANCHORMAN (O.S.)\n                 Even after last weeks terrorist\n                 vandalization of the Statue of Liberty\n                 by an unidentified mutant\n                 organization, the outcome of the vote\n                 was 51 to 49 in opposition to the\n                 Mutant Registration Act.\n\n       A LOUD CHEER as the room erupts into celebration.\n\n                           CYCLOPS\n                 Quiet.  Quiet everybody.\n\n                           ANCHORMAN\n                 This narrow defeat was probably due in\n                 large part to the surprising last-\n                 minute reversal by Senator Scott\n                 ìFrankî Kelly, who until today\n                 provided the loudest voice in the cry\n                 for Mutant Registration.  Earlier\n                 today, Kelly had this to say:\n\n       The TV cuts to a shot of Kelly being grilled by reporters\n       as he walks down the Capitol steps.\n\n                           KELLY\n                     (struggling to get through)\n                 If we can not go into the future\n                 together, the divisions of fear and\n                 prejudice will tear this country\n                 apart.\n\n       As he is speaking, we cut to:\n\n       INT. CAPITOL BUILDING - WASHINGTON D.C. - DAY\n\n       Kelly pushing past reporters.\n\n                           KELLY\n                 No more questions.  Please, no more\n                 questions.\n\n       E.C.U. The back of Kellyís neck as he passes.  A BLUE\n       SCALE is visible above his collar.\n\n       INT. LOGANíS ROOM - DAY\n\n       The FAINT CHEERS are heard through the walls.\n\n       HAZY THEN FOCUS INTO -- light pushes through blinds.  A\n       gentle breeze moves them slightly.\n\n       Logan sits up in his bed, his chest bandaged.\n\n       VRRRIP -- the sound of blinds being pulled open.  Bright\n       sunshine fills the room, washing across a box and a card\n       sitting on a bureau.\n\n       ANGLE ON: the card as Logan reads it.\n\n       LOGAN -- WELCOME HOME.  It is signed simply, X.\n\n       Logan reaches in the box, pulling out -- a UNIFORM.  He\n       lays it on the bed.  He pulls on one of the gloves,\n       stretching his fingers in it.  Perfect fit.\n\n       SHOOK -- He pops his claws through THREE METAL RINGLETS\n       on the back of the glove -- clearly it was made\n       specifically for him.\n\n       Logan looks down into the box for him.\n\n       INT. LOGANíS ROOM - LATER - DAY\n\n       From behind Logan we see him finish putting something on\n       over his head.  Logan turns into frame, he is wearing a\n       dark blue MASK.\n\n       It fits his head neatly.  The sides arch up shadowing his\n       ears, giving him a wolf or fox-like appearance.  The\n       shape is reminiscent of Loganís sketch -- the wolverine.\n\n       Logan stands facing a mirror.  The mask looks good on him\n       and he seems to know it.\n\n       Xavier is in the doorway.\n\n       Logan pulls off the mask, embarrassed.\n\n                           LOGAN\n                 Donít you knock?\n\n                           XAVIER\n                 Theyíre all asking how youíre doing.\n                 Are you feeling up to saying hello to\n                 everyone?\n\n                           LOGAN\n                     (pulling the glove off)\n                 Actually Iím feeling up to leaving.\n\n       Logan walks over to the closet and pulls out a shirt.  He\n       puts it on.\n\n                           XAVIER\n                     (surprised)\n                 Why?  You have a home here now, if you\n                 want it.  Everyone will...\n\n                           LOGAN\n                 What?... miss me?  Charley, Iím gonna\n                 walk out the front door and trust me,\n                 it wonít be soon enough for everyone\n                 here.\n\n       Logan pulls a duffle bag out of the closet.\n\n                           LOGAN (contíd)\n                 Can I, umm?\n\n                           XAVIER\n                 Of course.  Everything in this room is\n                 for you.\n\n       Logan seems genuinely touched by the gesture.\n\n                           LOGAN\n                 Thanks, Iíll pay you back.\n\n       Logan shoves some clothes into the bag, but not all.\n\n                           XAVIER\n                 Well if youíre going to leave then you\n                 at least owe them a goodbye.\n\n       Logan smirks.  He picks up his bag.  They exit the room\n       together.\n\n       INT. MANSION - DAY\n\n       The celebration continues unabated.  The newscaster on\n       the defeat of the Mutant Registration Act muted, in the\n       background -- Storm, Jean, and Cyclops all sit around a\n       table chatting.  Rogue sits on the couch with other\n       students, trying on a new pair of leather gloves.\n\n                           XAVIER (O.S.)\n                 Excuse me.\n                     (louder)\n                 Excuse me.\n\n       Xavier is in the doorway.\n\n                           XAVIER (contíd)\n                 Everyone, Logan would like to say...\n\n       Logan steps into the doorway.  Everyone can see him now.\n       Before Xavier can finish his sentence he is interrupted\n       by --\n\n       APPLAUSE -- simple, genuine, applause.\n\n       Students slowly stand up.  Proud of Logan.  For he is one\n       of them.  He is a mutant.  And he is a hero.\n\n       As the unconditional applause echoes around him, Logan\n       seems sincerely touched by their spontaneous outpouring.\n       He is almost choked up -- almost.\n\n       The applause quiet.\n\n                           XAVIER (contíd)\n                 Well, Logan.\n\n       All eyes are on Logan.  Logan pauses.  He looks to\n       Xavier, then back to the room.\n\n                           LOGAN\n                 Whatís a guy gotta do to get a beer\n                 around here?\n\n       Logan puts his duffle bag down.  He walks over to the\n       table with Storm, Cyclops and Jean.  Jean smiles at him,\n       so does Cyclops -- his arm around the back of her chair.\n\n       Logan sees them together, they are happy, and finally he\n       offers a smile.\n\n       Xavier holds for a moment at the door.  A look of pride\n       on his face, the pride a father has for his children.\n\n       INT. PLASTIC PRISON - DAY\n\n       A CLEAR PLASTIC HALLWAY\n\n       Thatís right, PLASTIC.  Everything we can see -- walls,\n       ceiling, floor -- is made, entirely, of thick, clear\n       plastic.\n\n       DOWN THE HALL TO:\n\n       A THICK PLASTIC CELL\n\n       There, in the middle, at the clear plastic desk, with two\n       clear plastic cups filled with the only thing of color\n       other than the two men in the room.\n\n       Xavier and Magneto.\n\n       They play a friendly game of chess.\n\n       Magneto is notably without his trademark helmet.  Two\n       casts encase his legs from his Logan-inflicted injury.\n\n       Xavier is on a modified plastic chair with plastic\n       wheels.\n\n                           MAGNETO\n                 I wouldnít really have let you die,\n                 you know.  I just needed...\n\n                           XAVIER\n                     (interrupting)\n                 I know.\n\n       Magneto thinks for a while; then:\n\n                           MAGNETO\n                 Doesnít it ever wake you in the middle\n                 of the night?  The feeling that some\n                 day, some day very soon, they will\n                 pass that foolish law - or one just\n                 like it - and they will come for you\n                 and your children?  Take you all away?\n\n                           XAVIER\n                 It does indeed, Max.\n\n                           MAGNETO\n                 And what do you do when you wake up to\n                 that?\n\n                           XAVIER\n                 I feel a great swell of pity for the\n                 poor soul who comes to that school\n                 again looking for trouble.\n\n       He stares right at Magneto.\n\n       Xavier makes a move, Magneto counters.  Xavier moves\n       again.\n\n                           MAGNETO\n                 But you know that it is a war, old\n                 friend.  And to win a war it takes the\n                 will to fight it at all costs, by any\n                 means necessary.  And for that reason,\n                 I will always have the advantage.  No\n                 matter how you trap me, how I am\n                 contained -\n\n       Chess pieces seem to visually mimic their conversation\n       Xavierís white pieces slowly surrounding Magnetoís Black\n       King.\n\n                           MAGNETO (contíd)\n                 - I will always find an escape.\n\n                           XAVIER\n                 And I will always be there, old\n                 friend.\n\n       And with that, Xavier places his queen gently down,\n       taking away a knight.\n\n                           XAVIER (contíd)\n                 Check.\n\n       Just then, the door to the cell opens.  A Guard waits.\n\n       Magneto and Xavier stare at one another before Xavier\n       turns and wheels himself out of the room.\n\n       The door closes behind him, leaving Magneto alone with\n       his plastic chess set in his plastic cell.\n\n       And Magneto looks at the pieces before him.  Something\n       occurs to him.  He smiles a wicked smile.\n\n       And his rook LEVITATES, despite its properties, moving\n       across the board and toppling Xavierís king.\n\n                           MAGNETO\n                 And mate.\n\n       BLACK\n\n\n\n\n\n\n\n\n\n\n\nX-Men\nWriters :   Ed Solomon  Christopher McQuarrie  Tom DeSanto  Bryan Singer\nGenres :   Action  Sci-Fi\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:39:06.693628"}