{"title": "X-Men Origins: Wolverine", "film_link": "/Movie Scripts/X-Men Origins: Wolverine Script.html", "script_link": "/scripts/X-Men-Origins-Wolverine.html", "info_raw": "\n\nX-Men Origins: Wolverine Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (10.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  David Benioff  Skip Woods\nGenres  Action  Fantasy  Sci-Fi  Thriller\nMovie Release Date : May 2009\n\nRead \"X-Men Origins: Wolverine\" Script\n\n\n", "script": "\n\n\n                             X-MEN ORIGINS: WOLVERINE \n\n\n                                    Written by\n\n                            David Benioff & Skip Woods\n\n\n\n\n\n          EXT. RURAL ROAD - DAY\n\n          A two-lane road carves through an endless forest of towering\n          black spruce. A flock of pintails skims over the treetops,\n          heading south before the first snowfall.\n          A young BOY (12), undersized and feral, trudges home, bookbag\n          strapped to his back. Black-haired and pale-skinned, the boy\n          looks as if he hasn't had a good meal in a long time.\n          Before we hear anything the boy turns, watching the bend in\n          the road behind him. After a moment we hear the thrum of a\n          hard-charging engine.\n          An Oldsmobile Super 88 rounds the bend, accelerating as it\n          hits the straightaway. The boy steps away from the road but\n          the car comes straight at him.\n          The boy closes his eyes. The Oldsmobile's brakes clamp down\n          on the wheels and the car shivers to a halt with inches to\n          spare. Laughter spills from the car's open windows.\n          Four HIGH SCHOOL LETTERMEN pile out of the car, wearing their\n          leather-sleeved football jackets. GILMAN, the largest of the\n          four, shakes his head and laughs.\n\n          GILMAN\n          Kid didn't even move. You see that?\n          Where's your survival instincts,\n          boy?\n          The boy says nothing. He readjusts his bookbag and resumes\n          his long walk northward.\n          GILMAN (cont'd)\n          Hey!\n          Gilman grabs the boy's shoulder and spins him around-\n          GILMAN (cont'd)\n          The hell you going? You hear me\n          talking to you?\n          One of the other football players, MASON, walks over and\n          inspects the boy's face.\n\n          MASON\n          This is the kid whose old man\n          robbed the truck stop last year.\n          Gilman curls his meaty hand around the back of the boy's neck\n          and pulls him closer, scrutinizing him. The four lettermen\n          tower over the small boy.\n          I C_ONTTNTT f 1\n\n          \n\n          \n\n          \n\n          \n\n          2.\n\n          CONTINUED:\n\n          GILMAN\n          You the one with the convict daddy?\n          The boy stares back at Gilman, unblinking.\n\n          MASON\n          That's him.\n\n          GILMAN\n          What's the matter, you about to\n          piss your pants? Answer me.\n          The boy says nothing, never looking away from the bully.\n          Gilman presses his fist, adorned with a heavy class ring,\n          against the.boy's cheek.\n          GILMAN (cont'd)\n          You a tough guy like your daddy?\n          Gilman shoves the boy, forcing him to stumble backwards. The\n          boy regains his balance, never taking his eyes off Gilman.\n          GILMAN (cont'd)\n          You want to play tough guy with me?\n          Huh?\n          Provoked by the boy's lack of fear, by the insolence of his\n          stare, Gilman rears back and punches him in the face.\n          The boy falls to the ground. Blood spills from a gash in his\n          cheek where the class ring cut him.\n\n          MASON\n          (a ringside announcer)\n          Right cross to the face... and he's\n          down!\n          The football players laugh, looking down at the fallen boy.\n          The boy stands. There is still no sign of emotion on his\n          face. No fear, no anger, no evident pain.\n\n          GILMAN\n          What's the matter? You want some\n          more?\n          The boy doesn't look away. The bully swings, cracking the boy\n          in the side of the head, knocking him down again.\n          GILMAN (cont'd)\n          (to his friends)\n          Let's get out of here.\n\n          CONTTNTTF:T) I\n\n          \n\n          \n\n          \n\n          \n\n          3.\n\n          CONTINUED: (2)\n          Walking back to the car, Mason slaps Gilman on the shoulder.\n\n          MASON\n          You gave that little pissant\n          something to think about.\n          Gilman grins and looks back at the boy, expecting him to be\n          sprawled and crying on the ground.\n          Instead the boy stands again, brushes the dirt off his shirt,\n          and walks toward Gilman.\n\n          GILMAN\n          You got to be kidding me. I'm gonna\n          knock the--\n          But Gilman's words die in his throat as he sees something\n          impossible happening. The gash on the boy's cheek knits\n          itself shut, leaving no sign of injury.\n          Gilman is so shocked he doesn't see the boy's fist whizzing\n          toward him, striking him in the nose. And then another punch.\n          And then another.\n          The boy is far smaller and weaker than Gilman, but he fights\n          with a ferocity that seems inhuman, punching and kicking and\n          headbutting, doing whatever it takes to fell his enemy.\n          Gilman, stunned by the intensity of the assault, goes down,\n          trying to protect his face from the blur of blows.\n          Mason tries to pull the boy off his friend and suffers a bite\n          to the hand. He howls with pain and backs off.\n          The other two football players, amazed to see their leader\n          getting pummeled by a boy half his size, watch in awe.\n          The boy growls as he batters the bully. He grabs Gilman's\n          collar and lifts the football player's head off the ground,\n          prepared to deliver the coup de grace with his right fist.\n          Three bone claws spring from the boy's hand, serrated and\n          razor sharp.\n          Everything stops. Mason, clutching his wounded hand, quits\n          hollering and stares. The other two football players blink\n          and slowly back away.\n          Even Gilman, moaning on the ground, hushes and tries to crawl\n          backwards, away from this beast on top of him.\n\n          ((\"ONTTN11F.1)1\n\n          \n\n          \n\n          \n\n          \n\n          4.\n\n          CONTINUED: (3)\n          But the boy is more shocked than-any of them. He stares with\n          horror at the claws, this part of him he never knew existed.\n          He stands and stumbles away from Gilman. Mason runs over,\n          lifts his punch-drunk friend to his feet, and hustles him\n          toward the Oldsmobile.\n          The other football players pile in, slam the doors shut, and\n          speed off, leaving the boy alone by the side of the road.\n          The boy stares at his claws and for the first time we see\n          fear in his eyes. He screams, a scream that echoes over the\n          black spruce, into the darkening northern sky.\n\n          INT. CABIN - MORNING\n\n          LOGAN wakes. with a wordless shout, sitting upright,\n          shirtless, in a bed covered with shredded bedsheets.\n          KAYLA SILVERFOX (25) wraps her arms around him and whispers\n          in his ear.\n\n          KAYLA\n          It's okay... shh... it's okay.\n          Logan pants, chest heaving, eyes wild, gripping the tattered\n          sheets in his fists. Kayla holds him tight until his bone\n          claws retract.\n          KAYLA (cont'd)\n          I'm right here with you. Okay? I'm\n          right here with you.\n          Kayla, a full-blooded Innu, wears her long black hair pulled\n          back in a ponytail. She's been sleeping in one of Logan's\n          flannel shirts.\n          KAYLA (cont'd)\n          The war dreams or the one where\n          you're a kid?\n          Logan takes a deep breath, finally calming down. He relaxes\n          into Kayla's arms.\n\n          LOGAN\n          The one where I'm a kid.\n          Kayla runs her fingers through his thick hair, kissing his\n          forehead. He sees that she has a small cut on her forearm. He\n          takes her arm and looks at the wound.\n\n          ((0NTTN111 T)1\n\n          \n\n          \n\n          \n\n          \n\n          5.\n\n          CONTINUED:\n          LOGAN (cont'd)\n          I cut you.\n\n          KAYLA\n          It's nothing. Just a scratch.\n          She kisses him.\n          KAYLA (cont'd)\n          We need new sheets again, baby.\n\n          EXT. CARNIVAL - NIGHT\n\n          A traveling carnival has come to a seaside New England town.\n          The brightly-lit Ferris Wheel spins a few hundred yards\n          inland from the dark Atlantic.\n          LOCALS roam through the carnival, lining up to ride the Tilt-\n          A-Whirl. KIDS carrying plumes of cotton candy race from shoot-\n          'em-up games to free throw competitions.\n          A CARNY BARKER of the old school, wearing a patched-suit and\n          a derby, beckons the curious to his attraction.\n\n          CARNY BARKER\n          Come see the notorious Bird Man!\n          Half-man, half-eagle, is he an\n          angel from Heaven or a spawn of\n          Satan? Ladies and gentlemen,\n          tonight is your last chance to see\n          the creature you've all been\n          hearing about:\n          We follow two BOYS who hand the barker their tickets, pull\n          aside the curtain and step into the sideshow...\n\n          INT. SIDESHOW - CONTINUOUS\n\n          .joining a small crowd of CURIOUS ONLOOKERS. The tent is\n          dark save for a spotlight fixed on a tiny stage.\n          SHERRLENE, a peroxide-blonde in her fifties, whose tanned\n          hide is covered with interlaced tattoos, slaps a tribal beat\n          on a pair of bongos.\n          The crowd hushes. A tall man in a hooded robe shuffles toward,\n          the stage like a boxer long past his prime. He stands in\n          front of the gawkers, head bowed, face shadowed by his hood.\n\n          1 RFNTTNTTPD 1\n\n          \n\n          \n\n          \n\n          \n\n          6.\n\n          CONTINUED:\n          Finally BEAK throws off his robe and raises his wings to the\n          crowd. As advertised, he looks like an amalgam of man and\n          bird, with three-toed, clawed feet and dirty-feathered wings.\n          His very human, tired brown eyes are set in a face dominated\n          by a long sharp beak. He stares back at the gaping crowd.\n          Beak looks more pathetic than monstrous. His skinny limbs\n          don't seem very strong and he projects an air of weary\n          resignation, not menace.\n          But when he flaps his gray wings and caws at the onlookers,\n          the children shriek in terror and bury their faces in their\n          father's legs.\n\n          INT. BEAK'S TRAILER - NIGHT\n\n          Sherrlene and Beak sit at a card table, playing gin and\n          drinking bourbon.\n\n          SHERRLENE\n          I'm gonna knock with three.\n\n          BEAK\n          Are you kidding me?\n          He throws down his hand in disgust.\n\n          SHERRLENE\n          You always hold out for gin. You\n          could have knocked a while ago.\n\n          BEAK\n          Yeah, well, I'm an eternal.\n          optimist.\n          Sherrlene tallies the points.\n\n          SHERRLENE\n          All right, I'm gonna hit it. You\n          want to come look for shells with\n          me on the beach tomorrow?\n\n          BEAK\n          I don't want to scare away any\n          tourists.\n\n          SHERRLENE\n          Aw, sweetie, it's winter. No\n          tourists. I'll come get you in the\n          morning.\n          (rr)NTTNTrJ r) 1\n\n          \n\n          \n\n          \n\n          \n\n          7.\n\n          CONTINUED:\n          Sherrlene collects her things, stands, and kisses Beak on the\n          side of his feathered head.\n\n          BEAK\n          Goodnight, Sherrlene.\n\n          SHERRLENE\n          Night, Beak. Sweet dreams.\n          Sherrlene closes the door behind her and Beak flips through\n          the deck of cards, preparing for another lonely night.\n          A knock on the door.\n\n          BEAK\n          You forget your purse?\n          (another knock)\n          All right, all right, I'm coming.\n          He stands and opens the door.\n\n          EXT. BEAK'S TRAILER - CONTINUOUS\n\n          A towering figure in a long black coat looms beside the\n          trailer's door.\n\n          BEAK\n          Show's over, pal.\n          VICTOR CREED is shrouded in shadows, but when he grins his\n          white fangs gleam. He drapes his arm around Beak and drags\n          the birdman inside the trailer.\n\n          VICTOR CREED\n          Show's never over for you, freak..\n\n          INT. BEAK'S TRAILER - CONTINUOUS\n\n\n          BEAK\n          You want money? There's twenty\n          bucks on the dresser. That's all I\n\n          HAVE--\n\n          VICTOR CREED\n          I just want to hear you talk a\n          minute before I cut your lungs out.\n          Creed shoves Beak back into his seat, picks up the bottle of\n          bourbon, examines the label, and guzzles it. Beak opens his\n          mouth but no words come out. Finally:\n\n          (RONTTNTIED\n\n          \n\n          \n\n          \n\n          \n\n          8.\n\n          CONTINUED:\n\n          BEAK\n          You're the one that's been killing\n          mutants.\n          Creed wipes his lips with the back of his clawed hand.\n          BEAK (cont'd)\n          But you... you're one of us.\n\n          VICTOR CREED\n          Us? There's no us. There's you and\n          there's me, and in a minute, just\n          me.\n          Creed smiles down at his feathered target. Beak tries to\n          shield his body with his wings.\n\n          BEAK\n          Please... I never hurt anybody, my\n          whole life...\n\n          VICTOR CREED\n          Let me show you how it's done.\n\n          EXT. BEAK'S TRAILER - CONTINUOUS\n\n          An awful, prolonged shriek escapes from the trailer.\n\n          EXT. CABIN - DAY\n\n          The small log cabin sits in a clearing in a jack pine forest.\n          Winter has come to the north country; the ground and tree\n          branches are covered with several inches of snow.\n          Logan chops firewood behind the cabin, splitting the logs\n          with expert axe strikes, smoking a cheap cigar.\n          His nose wrinkles as he sniffs the air.\n\n          LOGAN.\n          Smells like government.\n          Behind Logan, two approaching men in dark suits and black\n          overcoats glance at each other. Logan, halving another block\n          of wood, doesn't turn around.\n          One of the newcomers, STRYKER, was a colonel in the Special\n          Forces. He still has the look. His hair is cropped short, his\n          bearing is military, and his blue eyes are fierce.\n          f r_ONTTNTJF D\n\n          \n\n          \n\n          \n\n          \n\n          9.\n\n          CONTINUED:\n          CHRISTOPH NORD, A.K.A. AGENT ZERO, looks more like a death\n          row convict than a military man. A family of tattooed spiders\n          walk down his neck.\n\n          STRYKER\n\n          (SMILING)\n          I even showered today.\n          Logan turns, the axe gripped in his hand.\n          STRYKER (cont'd)\n          Been a long time, Logan. You\n          haven't aged a day. Everyone else\n          gets old and gray, but not you.\n\n          LOGAN\n          How'd you find me?\n\n          STRYKER\n          We never lost you, my friend. I\n          believe you know my colleague?\n          Logan and Agent Zero stare at each other. There is a history\n          between these two and clearly the memories are not fond.\n          STRYKER (cont'd)\n          We're with the Department of\n          Agriculture now.\n\n          LOGAN\n          Agriculture? You working with\n          farmers?\n          Agent Zero grins. There is nothing pleasant about his grin,.\n\n          AGENT ZERO\n          Pest Control Division. Working with\n          exterminators.\n\n          LOGAN\n          (puffing on his cigar)\n          Still shooting first, asking\n          questions later?\n          In one blindingly fast motion, Agent Zero pulls a customized\n          automatic from his shoulder holster, fires, and reholsters.\n\n          AGENT ZERO\n          Still smoking cheap cigars?\n          Logan spits the butt of the severed cigar from his mouth and\n          clenches his fists.\n\n          ( C'ONTTNTTFTL'\n\n          \n\n          \n\n          \n\n          \n\n          10.\n\n          CONTINUED: (2)\n\n          LOGAN\n          That was a buck twenty-five,\n          asshole.\n          Stryker holds up both hands, one palm to Logan, one to Zero.\n\n          STRYKER\n          Boys, please.\n          (to Logan)\n          Could we take a minute of your\n          time?\n\n          LOGAN\n          You're taking it.\n\n          STRYKER\n          We want you back.\n          Logan turns away from them. He tosses aside the axe, picks up\n          a load of firewood and . stacks. it beside the cabin.\n          STRYKER (cont'd)\n          You're a born warrior. You can hide\n          up here as long as you want, that's\n          never gonna change.\n\n          LOGAN\n          Not interested.\n\n          STRYKER\n          It's... creative work, I can assure\n          you of that. And it pays well.\n\n          LOGAN\n          Already got a job.\n\n          AGENT ZERO\n          Lumberjack. Eighteen grand a.year.\n\n          LOGAN\n          Eighteen five.\n\n          AGENT ZERO\n          You content chopping down trees?\n\n          LOGAN\n          Yeah, I am. It's good work. And I\n          haven't killed anybody in three\n          years.\n\n          AGENT ZERO\n          Starting to miss it?\n\n          (CONTTNTIRT)1\n\n          \n\n          \n\n          \n\n          \n\n          11.\n\n          CONTINUED: (3)\n\n          LOGAN\n          Right about now I am.\n          Agent Zero grins, enjoying the game. Stryker, seeing that\n          this is going badly, tries to break the tension.\n\n          STRYKER\n          We're putting together a team. Best\n          men in the business. Men with...\n          special qualities. Men like you.\n\n          LOGAN\n          Forget it.\n          Logan walks around to the front of the cabin. Stryker and\n          Agent Zero follow. Logan's battered old pickup truck is\n          parked beside the newcomers' Lincoln.\n\n          STRYKER\n          It's a team of hunters. We're going\n          after some very bad people.\n          Logan climbs into the driver's seat.\n          STRYKER (cont'd)\n          You read the papers, Logan? They're\n          killing mutants.\n          Logan closes the door, turns the key and revs the engine to\n          warm it. Stryker taps on the window. Logan grits his teeth\n          and rolls down the window, not looking at the colonel.\n          STRYKER (cont'd)\n          Listen to me. They have names. They\n          have addresses.\n\n          LOGAN\n          I can take care of myself.\n\n          STRYKER\n          All right, forget about yourself.\n          Your country needs you.\n\n          LOGAN\n          I'm Canadian.\n          He hits the gas, forcing Stryker to jump back lest the tires\n          run over his foot. Stryker and Agent Zero watch him go.\n\n          \n\n          \n\n          \n\n          \n\n          12.\n\n          EXT. DISTRICT UNIFIED SCHOOL - DAY\n\n          Logan parks in the lot of a sprawling brick grammar school.\n          He gets out of the truck and walks toward the main building.\n          The school day has ended. STUDENTS meet up with their MOMS or\n          DADS for the ride home.\n          As Logan rounds a corner, he stops in his tracks, looking\n          around. Something's not quite right.\n          Logan'ducks his head at the last. possible second and a\n          snowball whizzes past, missing him by inches.\n          Six FOURTH GRADERS (four boys and two girls) charge at him,\n          hurling snowballs and screaming.\n\n          FOURTH GRADERS\n          Get him!\n          Logan jumps back around the corner, out of sight. The fourth\n          graders chase after him, round the corner with their throwing\n          hands cocked, ready to launch some serious ice.\n          Logan is nowhere in sight.\n          The fourth graders turn in confused circles, searching for\n          their target, snowballs melting in their hands.\n\n          LOGAN (O.S.)\n          Hey, fellas.\n          The boys and girls look up and see Logan sitting on a second-\n          floor window ledge. He has already formed six perfect\n          snowballs, with which he proceeds to pelt the fourth graders.\n          The kids run, screaming and laughing, nearly colliding with\n          Kayla, who rounds the corner and stares up at Logan.\n\n          KAYLA\n          Nice.\n          Logan, caught with a snowball in his hand, looks sheepish.\n\n          LOGAN\n          They started it.\n\n          \n\n          \n\n          \n\n          \n\n          13.\n\n          INT. PICKUP TRUCK - LATER\n\n          Logan drives Kayla home over roads slick with black ice. She\n          sings softly along with the country song on the radio.\n\n          LOGAN\n          Stryker came by the house today.\n\n          KAYLA\n          Stryker? Colonel Stryker? The one\n          you told me about?\n          (off Logan's nod)\n          What did he want?\n\n          LOGAN\n          Wants me back.\n\n          KAYLA\n          And?\n\n          LOGAN\n          Told him no.\n\n          KAYLA\n          So why can't they get someone else?\n          Logan thinks about it for a moment. When he speaks there is a\n          degree of self-loathing in his tone.\n\n          LOGAN\n          I'm the best there is at what I do.\n          And what I do best isn't very nice.\n          Kayla studies the side of his face for a moment.\n          LOGAN (cont'd)\n          Maybe he's right. Maybe it's the\n          only thing I'm good for.\n          Kayla watches him. Logan shakes his head as if ridding\n          himself of an errant thought.\n          LOGAN (cont'd)\n          Son of a bitch had me thinking\n          about it for a minute.\n          He wraps his arm around her shoulders and pulls her closer.\n          f CONTTN11Fn1\n\n          \n\n          \n\n          \n\n          \n\n          14.\n\n          CONTINUED:\n          LOGAN (cont'd)\n          I'm not going anywhere. First time\n          in my life, I don't feel like a\n          freak.\n\n          KAYLA\n          Hey. You're not a freak.\n\n          LOGAN\n          Most guys don't have to worry about\n          gutting their girlfriend when they\n          have a bad dream.\n\n          KAYLA\n          You're not a freak. You've got a\n          gift.\n\n          LOGAN\n          A gift?\n          Logan shakes his head, staring at the black ribbon of road.\n          LOGAN (cont'd)\n          You can return a gift..\n\n          INT. CABIN - NIGHT\n\n          A well-built fire burns in the fireplace. Logan and Kayla sit\n          naked in front of it, wrapped in an old flannel quilt.\n\n          KAYLA\n          The kids made cornhusk dolls today\n          in Arts and Crafts.\n          She reaches for her bag and pulls out a little doll.\n          KAYLA (cont'd)\n          I made one for you.\n          Kayla hands him the doll and he examines it by firelight.\n          Given the limitations of the art form, it's a skillful\n          representation of Logan, unique hairstyle and all.\n\n          LOGAN\n          I look like Elvis.\n\n          KAYLA\n          You're Elvis with claws.\n          The moon, swollen and red-hued, rises above the dark hills,\n          framed in the cabin's window.\n          I coNTTNTTRn 1\n\n          \n\n          \n\n          \n\n          \n\n          15.\n\n          CONTINUED:\n\n          LOGAN\n          Full moon tomorrow.\n\n          KAYLA\n          You know why the moon's so lonely?\n          Logan shakes his head. Kayla lies back, resting her head on\n          Logan's leg as he plays with her hair.\n          KAYLA (cont'd)\n          She used to have a lover.\n          Kuekuatsheu. They lived in the\n          Spirit World and every night they'd\n          wander the skies together. But one\n          of the other spirits was jealous.\n          Trickster wanted the Moon for\n          himself. So he told Kuekuatsheu the\n          Moon asked for flowers. He told him\n          to come to our world and pick her\n          some wild roses.\n\n          LOGAN\n          Never trust a guy named Trickster.\n\n          KAYLA\n          Yeah, well, you do some stupid\n          things when you're in love.\n          Kuekuatsheu didn't know that once\n          you leave the Spirit World, you can\n          never go back. Now he's trapped\n          here. Every night the Moon searches\n          for him and every night he sees her\n          in the sky and howls her name...\n          but he can never touch her again.\n          For a moment they're both quiet, contemplating the sad myth.\n\n          LOGAN\n          Koo-koo-choo got screwed.\n\n          KAYLA\n          Kuekuatsheu. The Wolverine.\n\n          EXT. CABIN - NIGHT\n\n          Viewed from a distance, the little cabin looks warm and\n          inviting, the firelight shining from the windows.\n          Something watches from the edge. of the dark woods. Something\n          monstrous, its black talons carving gashes in the trunk of a\n          pine tree.\n\n          \n\n          \n\n          \n\n          \n\n          16.\n\n          EXT. LOGGING CAMP - MORNING\n\n          Kayla drops Logan off at the logging camp. The site is\n          already loud with motorized activity. TRIMMERS remove the\n          limbs from fallen trees. TEAMSTERS in forklifts load logs\n          onto flatbed trucks.\n          Logan comes around to the driver's side window, holding his\n          orange Husqvarna chainsaw in one hand.\n\n          KAYLA\n          Be careful.\n          Logan bends forward to kiss her on the lips. He turns and\n          walks towards a crew of LUMBERJACKS circled around a\n          SUPERVISOR with a clipboard.\n          Logan turns when he hears a honk. Kayla leans out the window.\n          KAYLA (cont'd)\n          I love you, by the way.\n          Logan notices that dozens of lumberjacks are watching this\n          scene. He clears his throat.\n\n          LOGAN\n          T love you, too.\n\n          SUPERVISOR\n          (thick Maine accent)\n          We all love you, Casanova, but\n          could we get to work here? We need\n          to let some daylight in the swamp.\n          The lumberjacks laugh loudly. Damage done, Kayla waves a\n          cheerful goodbye and drives away from the camp.\n          Logan trudges into the circle of lumberjacks, who make kissie-\n          kissie sounds and slap his shoulder.\n          SUPERVISOR (cont'd)\n          All right, I need a team of\n          choppers for 3B, that's gonna be\n          Phelan, Marcuse, Van Mier and\n          Logan. Two teams for 3C...\n\n          EXT. ACCESS ROAD - MORNING\n\n          Kayla steers the pickup along the access road leading away.\n          from the logging camp.\n          C'C)NTTNTTF.n )\n\n          \n\n          \n\n          \n\n          \n\n          17.\n\n          CONTINUED:\n          An eighteen-wheel flatbed loaded with trimmed logs blocks the\n          road. Men in reflective vests stand on the flatbed, securing\n          the load with chains.\n          Kayla hits the brakes and checks-her watch. She's late. She\n          taps the horn.\n          A FOREMAN ambles over to her, in no particular rush.\n\n          FOREMAN\n          Can't move the truck till the\n          load's tied down.\n\n          KAYLA\n          Please? I'm already late.\n\n          FOREMAN\n          Not gonna happen, ma'am...\n          The foreman thinks about it, sighs, and changes his tune.\n          FOREMAN (cont'd)\n          (yelling to truck driver)\n          Hey Zeke! Pull this mother over.\n          Lady's got to get through.\n          Moments later the truck rolls forward, enabling Kayla to\n          scoot through in her pickup. She toots her horn and waves.\n\n          KAYLA\n          Thanks, fellas.\n\n          EXT. TIMBER STAND - MORNING\n\n          Logan and three other lumberjacks-- PHELAN, MARCUSE, and VAN\n          MIER-- tramp through the woods towards their designated area,\n          carrying their chainsaws and helmets.\n          Phelan, whiskey-bellied and flushed from the exertion, has\n          fallen behind.\n\n          PHELAN\n          You all want to ease the pace a\n          little bit? Trees ain't going\n          anywhere.\n          Logan, in the lead, stares at a crude smiley face carved into\n          a tall pine tree. His gaze travels from the carving to\n          something sitting on the forest floor.\n          (CON'TNt1F.n I\n\n          \n\n          \n\n          \n\n          \n          lB.\n\n          CONTINUED:\n          PHELAN (cont'd)\n          What you got there?\n          The other lumberjacks gather around Logan. A severed bear's\n          head, haloed by buzzing flies, rots in the sun.\n          PHELAN (cont'd)\n          Goddamn.\n\n          VAN MIER\n          Hunter?\n\n          MARCUSE\n          Why would a hunter leave the head?\n\n          LOGAN\n          Bullet didn't kill this bear.\n\n          (BEAT)\n          Claws did.\n\n          INT. TRUCK - MORNING\n\n          Kayla sings along with the tape on the tape deck.\n\n          KAYLA\n          Lolly Lolly Lolly get your adverbs\n          here, Lolly Lolly Lolly got some\n          adverbs here, Come on down to\n          Lolly's get the adverbs here...\n          Rounding a corner on the narrow access road, Kayla nearly\n          collides with a man in a long black coat. She slams on the\n          brakes and the truck shudders to a halt.\n          The man's back is turned to the truck, his head bowed. His\n          hair hangs below his shoulders, clotted with dirt, as if he's\n          been sleeping in the woods for weeks.\n          Kayla leans out of the open truck window. Before she can\n          speak, the man in the long black coat turns.\n          It's not just his size that frightens us, though the man is\n          massive. It's not just the four-inch-long black talons\n          curling from his fingertips, or the gleaming fangs he licks\n          as he smiles at her.\n          What terrifies us most are his eyes. They are a shark's eyes,\n          black and loveless and utterly inhuman.\n          f CONTTNT1FD'\n\n          \n\n          \n\n          \n\n          \n\n          19.\n\n          CONTINUED:\n          Victor Creed walks toward the truck. He scrapes his talons\n          over the hood: screeeeee. Five parallel gashes now scar the\n          hood, carved straight through the steel.\n\n          EXT. TIMBER STAND - CONTINUOUS\n\n          Logan, hearing a noise the other men can't, rises from his\n          crouch. He looks to the west, listening carefully.\n\n          PHELAN\n          What's the matter--\n          Logan holds up a hand: quiet. He hears a distant scream. A.\n          voice he knows better than any other.\n          He runs, leaving his astonished co-workers behind.\n          No one can run through the woods faster than Logan and'Logan\n          has never needed to run faster. He vaults fallen trees, ducks\n          under branches, accelerates when he hits the access road.\n\n          EXT. ACCESS ROAD - MINUTES LATER\n\n          Logan sees the pickup truck in the distance. Even a hundred\n          yards away he can tell that something is.wrong.\n          It seems impossible that he could run any faster, but now he\n          does, reaching the truck in seconds. He sees the claw marks\n          gouged through the steel hood.\n          He sees.the driver's side door tossed onto the asphalt twenty\n          yards. from the truck.\n          And finally he sees Kayla, curled in the fetal position on\n          the side of the access road. Blood puddles beneath her. Her\n          skin has already begun to lose its 'color.\n          He runs to her, kneels beside her body, hands checking for a\n          pulse, listening for breath, trying desperately to find any\n          sign of life in her lifeless form.\n\n          LOGAN\n          Come on, you're okay. Say\n          something. Say something, darling.\n          Say something. Kayla, come on.\n          He cradles her in his arms.\n          LOGAN (cont'd)\n          You're okay. You're okay.\n\n          (CONTTNTTRN'\n\n          \n\n          \n\n          \n\n          \n\n          20.\n\n          CONTINUED:\n          He rocks back and forth, her lifeless body clutched tightly\n          in his arms, his eyes clenched shut.\n          The veins bulge in his neck, every muscle in his body tenses,\n          as if there were a beast inside him trying to break free of\n          his skin.\n\n          INT. CASADY'S BAR & GRILL - DAY\n\n          The local dive opens early. TOWN DRUNKS sit by themselves,\n          smoking cigarettes, sipping the day's first hair-of--the-dog,\n          reading the paper or staring into their beer.\n          Victor Creed sits at the bar, carving a crude smiley face\n          into the wood with the claw of his index finger. He looks up\n          and sees the BARTENDER staring at him. The bartender doesn't\n          approve of the vandalism, but he's not about to say anything.\n          Creed taps the rim of his glass. The bartender comes over\n          with a bottle of George Dickel Tennessee whiskey. He fills\n          Creed's glass halfway-- a standard pour.\n          Creed stares at the bartender. He taps the glass again. The\n          bartender, hand shaking, fills the glass to the brim.\n          Creed raises the whiskey to the light.\n\n          VICTOR CREED\n          Stuff don't work on me. I drink and\n          drink and I never feel any\n          different.\n          He downs the full glass of whiskey with a swallow. He looks\n          around the bar, at the pool table in the back, the Wurlitzer\n          jukebox, the stacked bottles of liquor.\n          VICTOR CREED (cont'd)\n          You got any insurance on this\n          place?\n\n          BARTENDER\n          Insurance? I guess so. Why?\n          Creed wipes his mouth with the back of his hand.\n\n          VICTOR CREED\n          'Cause it's about to get ugly.\n          Logan walks into the tavern, sniffing the air. He sees Creed\n          sitting on the barstool, back to the door.\n\n          ( C_0NTTNTTF.T) I\n\n          \n\n          \n\n          \n\n          \n\n          21.\n\n          CONTINUED:\n          Logan approaches the bar, never taking his eyes off creed.\n          Finally Creed turns to look at Logan. He stands, towering\n          above the smaller man.\n          Logan sees a splotch of dried blood on the back of Creed's\n          hand. Creed knows Logan is looking at it. He lifts his hand\n          to his mouth and licks the blood off.\n          VICTOR CREED (cont'd)\n          Sweet girl. Tasted like strawberry\n          jam.\n          The bone claws burst from Logan's hands, pale, white, and\n          serrated. He growls and swings at Creed's head.\n          The big man is fast. He ducks under the claws, grinning and\n          circling like a boxer, happy that he's finally got a decent\n          adversary.\n          The bartender and the local drunks have seen plenty of bar\n          fights, but not ones featuring clawed mutants. They run.\n          VICTOR CREED (cont'd)\n          You can scare off the civilians\n          with those, sonny boy. But I got\n          claws of my own.\n          He swings, raking his talons across Logan's chest, drawing\n          first blood. Logan lunges at Creed and the battle begins.\n          -The pace of the combat is startling, the physical power\n          stupendous. A missed swipe by Creed ends with him clawing out\n          the guts of the jukebox. Logan jumps at his enemy and gets\n          swatted into the wall, smashing the plasterboard.\n          Creed grabs Logan by the collar and tosses him onto the pool\n          table. Creed brings his fist down, looking to pulverize\n          Logan's skull, but the smaller man rolls clear. Creed's fist\n          shatters the slate and the table collapses.\n          Clearing his head on the sawdusted floor, Logan sees the\n          eight ball rolling past. He picks it up and hurls it at\n          Creed's head.\n          Creed catches the eight ball in his left hand and squeezes\n          his fist shut. He opens his hand and lets the powdered\n          remains spill onto the floor.\n          Logan springs to his feet and swings at creed, again and\n          again, his claws whooshing through the air.\n          l CONTTNTJRT) )\n\n          \n\n          \n\n          \n\n          \n\n          22.\n\n          CONTINUED: (2)\n          Creed, despite his bulk, is an elegant fighter. He circles\n          just out of reach, grinning as the claws slash past his face.\n          Creed grabs Logan's right wrist as it flies by. He grabs the\n          left wrist. His wet fangs glisten as they plunge toward\n          Logan's throat.\n\n          I\n          With no room to dodge, Logan drives his head forward,\n          smashing Creed's face with a glorious headbutt.\n\n          I\n          As Creed staggers back, Logan kicks him in the chest,\n          knocking the big man over the bar, where he crashes into the\n          bottles of liquor and slides to the floor in a tumult of\n          glass shards and alcohol.\n          Logan sees a lit cigarette in an ashtray on one of the\n          tables. He picks the butt up and flicks it over the bar.\n          The cigarette ignites the spilt alcohol. Creed roars and\n          rises to his feet, a burning man.\n          He vaults over the bar and advances on Logan. The flames\n          consume his overcoat, licking at his skin. Creed slaps them\n          out with his palms, apparently oblivious to the pain.\n          VICTOR CREED (cont'd)\n          You put up a better fight than your\n          girl did.\n          Creed snatches Logan and slings him headfirst through the\n          plate glass window.\n\n          EXT. PARKING LOT - CONTINUOUS\n\n          Logan hits the snow-covered pavement hard, splinters -of glass\n          in his hair, his face bloodied from dozens of small cuts.\n          Creed steps out the bar. As Logan struggles to his feet Creed\n          kicks out his legs and drops him again.\n          Creed crouches beside Logan, grabs the back of his head, and\n          smashes his face into the concrete.\n          The beating gets savage, creed hammering Logan again and\n          again. Logan's healing factor cannot keep up with the\n          violence being done to his body.\n\n          VICTOR CREED\n          Time you got declawed, kitty kat.\n          Creed lifts his heavy black boot and brings it down hard on\n          the extended claws of Logan's left hand.\n\n          I CONTTNTTFT)1\n\n          \n\n          \n\n          \n\n          \n\n          23.\n\n          CONTINUED:\n          Logan howls as the-bone claws shatter. Creed repeats the\n          process on Logan's right hand.\n          VICTOR CREED. (cont'd)\n          You were a tough little guy. But\n          there's always someone tougher.\n          Creed plunges his clawed hand into Logan's chest. Logan\n          gasps, eyes widening. His tolerance for pain is world-class\n          but this is another level of suffering.\n          VICTOR CREED (cont'd)\n          And it's always me.\n          Creed stands, staring down at Logan's unmoving body. Sirens\n          moan in the distance. Creed walks away.\n          Logan bleeds in the snow. We rise above him, higher and\n          higher, his battered body dwindling as we rise with the\n          smoke.\n\n          INT. HOSPITAL EMERGENCY ROOM - DAY\n\n          Two MALE NURSES shove a gurney down the corridor. Logan is\n          flat on his back, bloody and unconscious.\n          A SURGEON hurries after them, pulling on latex gloves.\n\n          SURGEON\n          We know what we're looking at?\n\n          MALE NURSE #1.\n          Bar fight.\n\n          MALE NURSE #2\n          Multiple knife wounds.\n\n          INT. OPERATING ROOM - CONTINUOUS\n\n          The male nurses transfer Logan from the gurney to the\n          operating bed. One FEMALE NURSE prepares Logan's arm for an\n          IV while a second NURSE cuts open his blood-soaked shirt with\n          surgical scissors.\n          The frenetic activity in the room ceases. Everyone stares at\n          Logan's unblemished chest.\n\n          SURGEON\n          What is this?\n          ( CO749TNnFn )\n\n          \n\n          \n\n          \n\n          \n\n          24.\n\n          CONTINUED:\n          Logan lunges forward, grabbing the surgeon's collar and\n          pulling the startled man's face next to his own.\n\n          LOGAN\n          Where is he?\n\n          MALE NURSE #1\n          Hey, hey, easy--\n          The male nurses struggle to restrain Logan but he's too\n          strong for them. The surgeon gasps for air.\n\n          LOGAN\n          Where is he?\n\n          STRYKER (O.S.)\n          His name is Victor Creed.\n          Logan turns and sees Stryker standing at the entrance to the\n          operating room.\n          STRYKER (cont'd)\n          I can help you find him.\n\n          EXT. HOSPITAL - DAY\n\n          Logan storms out of the hospital, followed by Stryker.\n\n          STRYKER\n          He escaped from an ultramax\n          penitentiary in Nevada last year.\n          Started murdering mutants. Shape-\n          changer in New Mexico, pair of\n          telekinetic twins in California--\n          Logan turns on Stryker, grabbing the colonel by the throat\n          and shoving him against a lamp post.\n\n          LOGAN\n          Three years I been here. Three\n          years everything's good. Nobody\n          knows me. And then one day you show\n          up and the next day she's dead.\n\n          STRYKER\n          I came to warn you--\n\n          LOGAN\n          You knew he was coming.\n          f CONTTNfJRD 1\n\n          \n\n          \n\n          \n\n          \n\n          25.\n\n          CONTINUED:\n          Stryker shakes his head as well as he can with Logan's hand\n          on his throat. Stryker's face is turning red.\n          LOGAN (cont'd)\n          How did you know?\n\n          STRYKER\n          He got the List.\n\n          LOGAN\n          What list?\n          Stryker chokes, gasping for air. Logan eases up on his grip\n          but doesn't release the man. Stryker takes a deep breath.\n\n          STRYKER\n          The List. Every known mutant in\n          North America. Government's been\n          keeping it for years. Names,\n          addresses, everything.\n\n          LOGAN\n          How did he get it?\n\n          STRYKER\n          Someone must have leaked it to him.\n          There are people in Washington who\n          want to see you all destroyed.\n          Logan releases Stryker. The ex-colonel straightens his jacket\n          collar and composes himself.\n\n          LOGAN\n          Creed's a mutant, too.\n\n          STRYKER\n          Apparently he doesn't have much\n          tribal loyalty.\n          Logan turns and walks away. He looks like a homeless man, his\n          clothes torn and bloodied, his hair disheveled. He walks\n          fast. Stryker calls after him.\n          STRYKER (cont'd)\n          Do you have a plan, Captain?\n\n          LOGAN\n          I'm not in the Army anymore.\n\n          STRYKER\n          Do you have a plan?\n          CnNTTNT TF.Tf 1\n\n          \n\n          \n\n          \n\n          \n\n          26.\n\n          CONTINUED: (2)\n          Logan turns and stares at Stryker.\n\n          LOGAN\n          I'm gonna track him down and I'm\n          gonna end him. That's the plan.\n\n          I\n\n          STRYKER\n          You already tried that. He's a\n          hundred miles away and you're\n          walking out of the hospital.\n          Logan's fists are clenched. He's ready to hammer Stryker into\n          the ground, but the older man does not back down.\n          STRYKER (cont'd)\n          You can't beat him. Not the way you\n          are right now. You've probably gone\n          your whole life without losing a\n          fight, but I'm telling you now, you\n          can't beat him.\n\n          (BEAT)\n          Unless I give you the tools.\n          Logan glares at Stryker, still itching for immediate revenge.\n          STRYKER (cont'd)\n          You come with me, I promise you two\n          things. You will suffer more pain\n          than any other man could bear. And\n          you will have your revenge.\n          Logan stares into Stryker's eyes.\n\n          EXT. ALKALI LAKE - DAY\n\n          A black helicopter lands on a concrete helipad inside the\n          walls of the massive compound.\n          SENTRIES armed with assault rifles man the guard towers,\n          scanning the perimeter with binoculars.\n          Logan, Stryker and Agent Zero step out of the helicopter.\n          Logan glances around the foreboding place before following\n          Stryker inside the main building.\n\n          INT. SURGICAL PREP ROOM - DAY\n\n          Logan lies on his back on an examining table, naked save for\n          a strategically-placed towel.\n          (-ONTTNTTFr) l\n\n          \n\n          \n\n          \n\n          \n\n          27.\n\n          CONTINUED:\n          A red-bearded scientist, DR. CORNELIUS, draws blood from\n          Logan with a syringe.\n          An Army surgeon, CAROL HINES, marks Logan's skin with an\n          indelible pen. He looks like a Maori warrior, his body mapped\n          with strange lines, dots and x's. Stryker watches Hines work.\n\n          STRYKER\n          Could you unsheath your claws?\n          Logan raises his left hand. The bone claws pop out, the same\n          length they were before Creed shattered them.\n          STRYKER (cont'd)\n          Remarkable. Full regeneration.\n          Logan examines the markings on his forearm.\n\n          LOGAN\n          The hell you planning on doing to\n          me?\n          Hines gives Stryker a worried look but he ignores her.\n\n          STRYKER\n          We're going to make you\n          indestructible. But first we have\n          to destroy you.\n          Stryker heads for the door but stops midway and turns.\n          STRYKER (cont'd)\n          I forgot to give you something.\n          He reaches into his jacket pocket, pulls out an old set of\n          dog tags and tosses them to Logan. Logan inspects the tags\n          with ambivalence.\n\n          LOGAN\n          Never wanted to put these on again.\n\n          STRYKER\n          Held on to them for years. Figured\n          you'd be back one day.\n          Logan slips the steel chain over his head.\n          STRYKER (cont'd)\n\n          (SMILING)\n          Now you'll always know your name.\n\n          \n\n          \n\n          \n\n          \n\n          28.\n\n          INT. CORRIDOR - DAY\n\n          Stryker walks down a long concrete corridor lit by\n          fluorescent ceiling lights. Hines steps out of the prep room\n          and hurries after him.\n\n          HINES\n          Sir?\n          Stryker stops and waits.for her to catch up.\n          HINES (cont'd)\n          I know we've discussed this before--\n          He knows what she's going to say. He shakes his head and\n          continues down the hallway, forcing Hines to chase after him.\n\n          STRYKER\n          Ad nauseam, Lieutenant.\n\n          HINES\n          Anesthetic won't work on him. His\n          healing factor neutralizes drugs.\n          Including painkillers.\n\n          STRYKER\n          He can handle the pain.\n\n          HINES\n          We've never conducted any animal\n\n          TESTING--\n\n          STRYKER\n          No other animal would survive the\n          experiment.\n\n          INT. SURGICAL PREP ROOM - CONTINUOUS\n\n          Logan, wearing a hospital-style robe, stands by the closed\n          door. No other human could hear the conversation down the\n          hallway. Logan catches every word.\n\n          HINES (O.S.)\n          He might not, either. There's a\n          significant chance the procedure\n          will kill him.\n          (C_l)NTTNTTFn )\n\n          \n\n          \n\n          \n\n          \n\n          29.\n\n          CONTINUED:\n\n          STRYKER (O.S.)\n          Correct. Some experiments succeed,\n          some fail. That's why we call them\n          \"experiments.\"\n\n          INT. CORRIDOR - CONTINUOUS\n\n\n          STRYKER\n          The man's well-being is not my\n          concern. Proving that the science\n          works-- that's what matters.\n          Hines does not relish confrontation and she's afraid of\n          Stryker. But she gives it one more try.\n\n          HINES\n          Sir... I took the Hippocratic Oath.\n          I swore I'd never intentionally\n          harm another human being.\n          Stryker turns on Hines, jabbing his finger at her.\n\n          STRYKER\n          You also swore. to protect your\n          nation. You remember that oath,\n          Lieutenant Hines?\n\n          HINES\n          Yes sir, but I don't understand why-\n\n          STRYKER\n          I don't need you to understand. I\n          need you to follow orders.\n          Stryker continues down the corridor, leaving Hines standing\n          alone in the fluorescent light.\n\n          INT. SURGICAL PREP ROOM - MOMENTS LATER\n\n          Hines enters the room to find Logan sitting on the examining\n          table, paging through a magazine. He smiles up at her.\n\n          LOGAN\n          You ready for me, Doc?\n\n          INT. SURGICAL THEATER - LATER\n\n          Hines and two MEDICAL TECHNICIANS accompany Logan to a water-\n          filled plexiglass tank the size of a lidless coffin.\n\n          ((Y)NTTN1WS) )\n\n          \n\n          \n\n          \n\n          \n\n          30.\n\n          CONTINUED:\n          An array of stainless-steel machines crowds around the tank,\n          including a series of robotic arms that taper into foot-long\n          needles.\n          One wall of the theater is glass. Behind the glass is the\n          control room, where Stryker looks on, hands behind his back.\n          Dr. Cornelius and several SUPPORT STAFF enter data into\n          computers monitoring the experiment.\n          Logan removes his robe and hands it to Hines before stepping\n          into the tank of water.\n\n          LOGAN\n          See you on'the other side.\n          One of the technicians fastens a breathing tube, connected to\n          an oxygen tank, to Logan's mouth.\n          Logan lies down, submerging himself in the cold water. The\n          technician clamps Logan's wrists and ankles into place with\n          stainless-steel shackles bolted to the plexiglass walls.\n          Logan's eyes are open as he watches the robotic arms swivel\n          into place, poised above him like a gang of metal vipers.\n\n          INT. CONTROL ROOM - MOMENTS LATER\n\n          GENERAL MUNSON stands in the back of the room, observing the\n          experiment with great interest.\n          Agent Zero leans against the back wall, bored, cracking his\n          knuckles.\n          Hines takes a seat beside Cornelius, who studies a readout on\n          his computer screen.\n\n          CORNELIUS\n          Adamantium temperature?\n\n          TECHNICIAN #1\n          Steady at eighty-two eleven.\n\n          CORNELIUS\n          Feed lines clear?\n\n          TECHNICIAN #2\n          Lines one through twelve clear.\n\n          CORNELIUS\n          Prepare insertion.\n\n          \n\n          \n\n          \n\n          \n\n          31.\n\n          INT. SURGICAL THEATER - CONTINUOUS\n\n          Logan lies underwater, watching as the robotic arms descend\n          toward him. The needles begin to spin at high speed, like\n          massive power drills. They churn the water when they enter.\n          CLOSE on Logan's eyes as the needles enter his body. The man\n          has suffered gunshots and knife wounds, car crashes and\n          bottles smashed across his face. He has never suffered this.\n          He closes his eyes.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n\n          CORNELIUS\n          Commence feed.\n          The technicians enter commands, watching close-up images of\n          the procedure on their monitors.\n\n          INT. SURGICAL THEATER - CONTINUOUS\n\n          Logan writhes in the tank. Twelve long needles have drilled\n          into his bones, including his skull.\n\n          TECHNICIAN #1 (O.S.)\n          Feed commenced at a rate of twenty\n          nine cc's per second.\n\n          TECHNICIAN #2 (O.S.)\n          Density probe indicates preliminary\n          chelation of the compact tissue.\n\n          CORNELIUS (O.S.)\n          Body temperature?\n\n          HINES (0.5.)\n          One zero two point three.\n\n          CORNELIUS (O.S.)\n          Heart rate?\n\n          HINES (O.S.)\n          One sixty.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n          Stryker turns and addresses the general.\n\n          (C_C)NTTNTTF.T) )\n\n          \n\n          \n\n          \n\n          \n\n          32.\n\n          CONTINUED:\n\n          STRYKER\n          You're witnessing medical history\n          in the making. We've begun bonding\n          adamantium to Weapon X's skeleton.\n\n          GENERAL MUNSON I\n          We tried to use that stuff for tank\n          armor. Too damn expensive.\n\n          STRYKER\n          It took us three years to prepare\n          enough alloy for the skeleton.\n\n          GENERAL MUNSON\n          So if this works, I guess Weapon X\n          won't be walking through any metal\n          detectors.\n\n          STRYKER\n          If this works, General, Weapon X\n          will walk wherever he wants.\n\n          INT. SURGICAL THEATER - CONTINUOUS\n\n          Logan spasms in the tank like a man being electrocuted.\n\n          HINES (O.S.)\n          Heart rate one ninety.\n\n          CORNELIUS (O.S.)\n          Density?\n\n          TECHNICIAN #2 (O.S.)\n          Four four seven.\n          CLOSE on Logan's clenched eyelids and CLOSER still, entering\n          the mind of the tortured man.\n          Horrific images flicker past, selected traumas from a deeply\n          traumatic life.\n          Logan cradles the lifeless body of Kayla Silverfox.\n          The feral boy stares at his monstrous claws and howls.\n          Logan (looking identical in age to the man we've been\n          following) stands in a village in Vietnam as bamboo huts-burn\n          around him.\n\n          \n\n          \n\n          \n\n          \n\n          33.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n\n          GENERAL MUNSON\n          How long before he's mission\n          operative?\n\n          STRYKER\n          Remains to be seen. We're in\n          uncharted territory here.\n\n          GENERAL MUNSON\n          Uncharted territory is a pretty\n          good description of your budget,\n          Colonel. This doesn't work, you can\n          kiss the Eleven good-bye.\n\n          STRYKER\n          We need the Eleven. Our victory in\n          the war to come depends on it.\n\n          GENERAL MUNSON\n          Not everyone in the Pentagon thinks\n          there's gonna be a war.\n          Stryker turns and fixes his gaze on the general.\n\n          STRYKER\n          Oh, it's coming, General. The enemy\n          walks among us. We'd better be\n          prepared.\n\n          INT. SURGICAL THEATER - CONTINUOUS\n\n          Logan thrashes in the tank, his convulsions increasingly\n          violent, his eyes rolling back in their sockets. The water in\n          the tank begins to steam.\n          The reel of blood-stained images from Logan's past continues.\n          A bull-necked man beats the feral boy with an axe handle.\n\n          HINES (O.S.)\n          Body temperature one zero eight.\n          Heart rate two ten. Sir--\n          A dying Russian lies on his back on a dock in Odessa, staring\n          at the sky, his shirt punctured with three precise holes.\n          Logan stares down at him, bone claws extended.\n          (CONTTNi1FT)1\n\n          \n\n          \n\n          \n\n          \n\n          34.\n\n          CONTINUED:\n\n          STRYKER (O.S.)\n          He's a warrior, Hines. He can\n          handle it.\n          Victor Creed plunges his clawed hand into Logan's gut.\n\n          CORNELIUS (O.S.)\n          Density?\n\n          TECHNICIAN #2 (O.S.)\n          Probe rejected, sir.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n\n          GENERAL MUNSON\n          Is there a problem?\n          Stryker allows himself a small smile.\n\n          STRYKER\n          On the contrary. The probe is\n          diamond-tipped. It's not hard\n          enough to penetrate adamantium.\n\n          HINES\n          Heart rate two twenty five. Sir,\n          we're well beyond maximum--\n\n          STRYKER\n          You're trained to care for humans,\n          Doctor. Weapon X is not one of us.\n\n          INT. SURGICAL THEATER - CONTINUOUS\n\n          Logan writhes in the tank, muscles coiling and uncoiling. The\n          montage of nightmares continues, snapshots from Hell.\n          The feral boy sits alone in the back of a school. bus. While\n          the other children talk and laugh, he cuts his thumb with a\n          pocket knife and watches the wound heal.\n\n          TECHNICIAN #1 (O.S.)\n          Chelation near completion.\n\n          HINES (O.S.)\n          Heart rate two forty four... two\n          fifty... two fifty seven...\n\n          ( CONTTNTT1 D'\n\n          \n\n          \n\n          \n\n          \n\n          35.\n\n          CONTINUED:\n\n          TECHNICIAN #2 (O.S.)\n          Adamantiumreservoir ninety percent\n          depleted.\n\n          HINES (O.S.)\n          Core temperature one hundred and\n          nineteen degrees.\n          .A young Stryker, wearing jungle fatigues and a necklace of\n          human ears, holds a revolver to the temple of a sobbing Viet\n          Cong prisoner. Stryker smiles as he pulls the trigger.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n          Stryker leans close to the glass, watching his test subject's\n          agony. His experiment will succeed or fail in the next few\n          moments. Sweat beads his forehead.\n\n          STRYKER\n          Easy now.\n\n          TSURGICAL THEATER - CONTINUOUS ï¿½.., .,.\n          Adamantium claws burst from Logan's hand, shimmering\n          underwater.\n          Crazed with pain, he carves through the walls of the\n          plexiglass tank. Steaming water cascades onto the poured\n          concrete floor.\n          Bursting free of his restraints, Logan slashes through the\n          robotic arms. Sparks dance like a swarm of fireflies. The\n          dismembered machines twitch like wounded beasts.\n          Logan rises from the broken tank, drenched with water, naked\n          save for dozens of long stainless steel needles drilled into\n          his body and the wires and hoses trailing from the needles.\n          Hair matted to his head, eyes wild, face contorted, he looks\n          like a strange amalgam of machine and animal. He tears the\n          breathing tube from his mouth and stares through the window\n          into the control room, panting, claws extended.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n          Hines sits very still, hand over her mouth. Cornelius and the\n          technicians rise from their chairs and slowly back away from\n          the window.\n\n          I CC)NTTNTTF.T) I\n\n          \n\n          \n\n          \n\n          \n\n          36.\n\n          CONTINUED:\n          The general stares at Logan, awed by the sight of the living\n          weapon. Even Agent Zero no longer looks bored.\n\n          STRYKER\n          Magnificent.\n\n          INT. SURGICAL THEATER - CONTINUOUS\n\n          Logan slashes through the locks of the steel-reinforced\n          theater door. He charges out of the room.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n          For a moment there is silence in the control room.\n\n          GENERAL MUNSON\n          I take it this is still part of the\n          plan, Colonel?\n\n          STRYKER\n          He's got nowhere to run.\n          Closed circuit monitors show Logan running down a tunnel.\n          STRYKER (cont'd)\n          The only exit is a 25 ton blast\n          door. It was built to withstand a\n          nuclear detonation.\n\n          INT. CORRIDOR - CONTINUOUS\n\n          Logan hurries down a long tunnel hewn through solid rock,\n          leaving a trail of watery footprints. He stops in front of\n          the battleship-steel door at the end of the tunnel.\n          Growling, he carves through the door as if it were cardboard.\n\n          INT. CONTROL ROOM - CONTINUOUS\n\n          The savaged blast door flickers on the monitors. Logan Is\n          free. The general stares at Stryker. Stryker licks his lips.\n\n          STRYKER\n          (to Agent Zero)\n          Alert the containment team. Bring\n          him back.\n          (( r)NTTNTJF.J) )\n\n          \n\n          \n\n          \n\n          \n\n          37.\n\n          CONTINUED:\n\n          AGENT ZERO\n          Bagged or breathing?\n\n          STRYKER\n          Either way. Just bring him back.\n\n          EXT. ALKALI LAKE - NIGHT\n\n          A full moon shines down on the frozen landscape. Logan has\n          exited the Alkali Lake complex beyond the high walls of the\n          compound. The lake itself shimmers in the moonlight.\n          Logan stares at the lonely moon. A wolf howls in the\n          distance.\n          His breath rises above him in the cold air; his wet hair\n          freezes. Ignoring the gusting wind and bitter chill, he runs\n          through the snow toward the distant woods.\n\n          EXT. WOODS - NIGHT\n\n          Logan runs. Pine trees tower above him. He enters a clearing\n          where the virgin snow glitters beneath the moon.\n          He stops moving and peers through the darkness. He smells\n          something coming closer.\n          A pack of GRAY WOLVES emerges from the woods, surrounding\n          Logan. Snow dusts their fur. They look hungry, their blue\n          eyes unblinking as they watch this pale interloper.\n          The LEADER OF THE PACK, a muscular brute far bigger than his\n          comrades, snarls at Logan. Logan stares back at the wolf.\n          The wolf jumps at Logan, fangs bared, aiming for the man's\n          throat. Logan sidesteps and the wolf hurtles past, skidding\n          on the snow when he lands.\n          Logan and the wolf circle each other, looking for weakness.\n          The wolf gnashes its wet teeth and pounces again.\n          Man and beast battle in the moonlight, a shadowy combat of\n          ferocious velocity, of gleaming fangs and gray fur.\n          The wolf lunges for Logan's throat again, but this time Logan\n          catches the wolf in one hand and slams it to the snow.\n          The wolf, desperate to escape, rakes Logan's arm with his\n          claws. Logan ignores the bloody welts.\n          rC)NTTNTTF.T) )\n\n          \n\n          \n\n          \n\n          \n\n          38.\n\n          CONTINUED:\n          His face is close to the wolf's face and they stare into each\n          other's eyes, predator to predator.\n          Snikt!\n          Logan presses the claws of his left hand to the wolf's\n          throat. The wolf quits fighting, mewling submissively. He\n          goes slack in Logan's grip, rolling over to signal surrender.\n          Logan stands over the newly-subservient alpha wolf. The other\n          wolves in the pack stare at the strange champion.\n          Intense light shines on Logan's face. He turns and sees that\n          he's surrounded by a dozen SOLDIERS wearing tactical armor.\n          Powerful flashlights are mounted to the barrels of their\n          guns, which are pointed at Logan.\n          The wolves flee, dodging through the pines, their paws\n          kicking up snow.\n\n          SOLDIER #1\n          Put your hands in the air!\n\n          INT. CONTROL ROOM - NIGHT\n\n          Stryker and the others are able to watch Logan in action, as\n          night-vision security cameras mounted in the trees beam a\n          constant live feed back to monitors in the control room.\n\n          STRYKER\n          These soldiers are the creme de la\n          creme. They're equipped to handle\n          the situation.\n\n          EXT. WOODS - NIGHT\n\n          Logan tries to gauge his enemies, staring into the harsh\n          lights- He growls.\n\n          SOLDIER #1\n          Hands in the air, now!\n          Logan charges at the soldiers.\n          The soldiers fire their weapons. These are not rifles but\n          high-powered Tasers. Twelve darts sink into Logan's skin,\n          each connected to a silvery wire.\n          Thousands of volts of electricity course through Logan's\n          body.\n          (fC)NTTNIJF.n\n\n          \n\n          \n\n          \n\n          \n\n          39.\n\n          CONTINUED:\n          Gritting his teeth and fighting through the pain, he slices\n          the twelve wires with his claws and advances on the stunned\n          soldiers.\n\n          INT. CONTROL ROOM - NIGHT\n\n          The monitors show the fallen soldiers lying in the snow. For\n          a moment everyone in the room is quiet.\n\n          HINES\n          The creme de la creme just got\n          creamed.\n          Stryker gives her a very nasty look before turning to General\n          Munson and speaking in calming tones.\n\n          STRYKER\n          There's a high-voltage fence on the\n          perimeter of the base--\n\n          GENERAL MUNSON\n          Is it made out of adamantium?\n\n          EXT. HUDSON FARM - DAY\n\n          An old Chevrolet pickup truck rattles down a snow-covered\n          road that passes acres of frozen farm fields. A Good Sam Club\n          sticker is pasted on the rear bumper.\n\n          INT. CHEVROLET - CONTINUOUS\n\n          JAMES and HEATHER HUDSON, a middle-aged farmer and his middle-\n          aged wife, are bundled up in heavy parkas. James drives; his\n          wife talks.\n\n          HEATHER HUDSON\n          Marge'll probably make her walnut\n          pie again. I thought I'd do\n          meringues this year. Try something\n          different. Don't you think?\n\n          JAMES HUDSON\n          Yep.\n\n          HEATHER HUDSON\n          You like my meringues, don't you?\n\n          JAMES HUDSON\n          Yep.\n          ((Y)NTTN!JRr 1\n\n          \n\n          \n\n          \n\n          \n\n          40.\n\n          CONTINUED:\n\n          HEATHER HUDSON\n\n          (GOOD-HUMORED)\n          Yep. Yep. Forty years of\n          conversation, all I get is yeps.\n          Heather grabs her husband's arm.\n          HEATHER HUDSON (cont'd)\n          Jimmy!\n          James turns in time to see a naked man sprint across the snow\n          and slip inside a red sheep barn.\n          HEATHER HUDSON (cont'd)\n          I think there's a naked man in the\n          barn.\n\n          JAMES HUDSON\n          .yep.\n\n          INT. SHEEP BARN - DAY\n\n          James Hudson cautiously slides his barn door open. He holds\n          an old shotgun in his hands, a gun he hasn't fired in years.\n          He advances slowly into the barn, sunlight from the open door\n          falling on the scattered straw. A vintage motorcycle covered\n          in a tarp stands near the side wall.\n          Hudson looks inside each sheep pen. His thick-wooled SHEEP,\n          ready for breakfast, bleat hopefully.\n          In the third pen Hudson finds Logan, who has covered himself\n          with straw. A few curious sheep sniff at the fugitive's face.\n          Hudson stares at Logan, who stares back somewhat, well,\n          sheepishly.\n\n          JAMES HUDSON\n          Son... What in hell are you doing?\n\n          LOGAN\n          Sorry... It's a little cold out\n          there.\n\n          JAMES HUDSON\n          Uh huh. It's the middle of January\n          and you got no clothes on.\n\n          LOGAN\n          That's probably it.\n\n          (CFNTTNEWF )\n\n          \n\n          \n\n          \n\n          \n\n          41.\n\n          CONTINUED:\n          Hudson sighs and lowers his shotgun.\n\n          JAMES HUDSON\n          You're not on the drugs, are you?\n\n          LOGAN\n          No sir.\n\n          JAMES HUDSON\n          Just had a rough night?\n\n          LOGAN\n          Pretty rough, yeah.\n\n          JAMES HUDSON\n          All right, come on. I got some old\n          clothes'll probably fit you.\n          He turns and Logan begins covering strategic places with wads\n          of straw.\n          JAMES HUDSON (cont'd)\n          I'll take you around back so my\n          wife don't see you again.\n\n          LOGAN\n          Sorry if I scared her.\n\n          JAMES HUDSON\n          Scared her?\n\n          (SNORTS)\n          I'm not worried about you scaring\n          her.\n\n          INT. KITCHEN - DAY\n\n          Logan sits at the breakfast table with James and Heather. He\n          wears an old plaid shirt, dungarees, and a pair of scuffed\n          work boots.\n          A heaping breakfast lies before him: scrambled eggs, pork\n          sausages, pancakes with maple syrup, a steaming mug of\n          coffee.\n          Logan devours everything in front of him, looking up only to\n          nod in thanks as Heather scoops more food onto his plate.\n\n          JAMES HUDSON\n          You mind if I ask where you came\n          running from?\n          r()NTTNITF.n )\n\n          \n\n          \n\n          \n\n          \n\n          42.\n\n          CONTINUED:\n\n          HEATHER HUDSON\n          Jimmy. Let the boy eat.\n          Logan piles eggs onto a slice of buttered toast.\n\n          JAMES HUDSON\n          I'm just wondering. We're twenty\n          miles from town. It's a miracle you\n          didn't get hypothermia out there.\n\n          LOGAN\n          I've got good circulation.\n          (gesturing toward barn)\n          Nice chopper you got out there, by\n          the way.\n          James's face lights up. Logan has found the man's passion.,\n\n          JAMES HUDSON\n          You know motorcycles?\n\n          LOGAN\n          What is it, '48 Panhead?\n\n          JAMES HUDSON\n          Best bike Harley-Davidson ever\n          made. First one with a seventy-four-\n          cubic inch engine, hydraulic valve\n          lifters, aluminum heads--\n          Heather stands to clear the plates.\n\n          HEATHER HUDSON\n          Now you've got him started. You\n          need more of anything?\n          Logan, smiling, holds up his hands to surrender.\n          The smile fades when he sees the red laser dot appear on\n          Heather's shirt.\n          HEATHER HUDSON (cont'd)\n          What's the matter, honey?\n          Logan dives across the table, trying to knock her out of the\n          way, but the bullet beats him there, punching through the\n          window frame and straight through Heather Hudson's heart.\n          She collapses in Logan's arms.\n\n          JAMES HUDSON\n\n          WHAT--\n\n          (CONTTNIWIF 1\n\n          \n\n          \n\n          \n\n          \n\n          43.\n\n          CONTINUED: (2)\n\n          LOGAN\n\n          GET DOWN!\n          But it's too late. A second bullet hits James in the back;\n          the farmer blinks and topples forward, dead before he hits\n          -the ground.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n          Agent Zero lies on his belly three hundred yards from the\n          farmhouse. He lowers his sniper rifle and speaks into his\n          headset.\n\n          AGENT ZERO\n          Weapon X is in the farmhouse. He\n          just murdered.two civilians.. Fire\n          at will.\n          An APACHE LONGBOW helicopter streaks overhead, fifty feet\n          above the ground.\n\n          INT. KITCHEN - CONTINUOUS\n\n          Logan checks James Hudson's pulse but finds none. He looks up\n          when he hears the thrum of the military helicopter.\n          Two Good Samaritans lie dead at his feet, slaughtered for\n          sheltering him. Something bestial has. entered Logan's eyes.\n\n          EXT. HUDSON FARM - CONTINUOUS-\n\n          The Apache circles the farmhouse.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n          Both the PILOT and the GUNNER wear helmets with monocular\n          eyepieces that provide images from the external cameras.\n\n          GUNNER'S EYEPIECE POV\n          The farmhouse is centered in the crosshairs. Scrolling\n          numbers to the side of the image indicate the range in\n          meters. The gunner's finger tightens on the trigger.\n\n          INT_ KITCHEN - CONTINUOUS\n          Logan growls and runs for the door.\n\n          \n\n          \n\n          \n\n          \n\n          44.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n          The gunner squeezes the trigger.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n          The Apache fires multiple Hellfire rockets, which blast out\n          of their launchers and rip into the farmhouse.\n          The old Hudson homestead collapses as the explosions blow out\n          the roof and the support walls.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n\n          GUNNER\n          Direct hit.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n\n          AGENT ZERO\n          Locate the target and fire again.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n          The gunner glances at his pilot. Both men seem mystified by\n          the command.\n\n          GUNNER\n          Sir... the target's destroyed.\n\n          AGENT ZERO (O.S.)\n          Repeat: locate the target and fire\n          again.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n          The Apache circles the smoking ruin where the house once\n          stood. No sign of Logan is visible in the scorched debris.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n\n          GUNNER\n          They must've hated this guy big\n          time.\n          t C'_C?NTTNTTRI)1\n\n          \n\n          \n\n          \n\n          \n\n          45.\n\n          CONTINUED:\n\n          PILOT\n          What was he, terrorist or\n          something?\n\n          GUNNER\n          I don't know but he's a puddle now.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n          The Apache hovers near the sheep barn, rotor blades fanning\n          the rising smoke.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n          As the gunner continues to scout the ground for any sign of a\n          corpse, the pilot notices something out of the corner of his\n          eye. He stares at the roof of the sheep barn.\n          A smoke-darkened figure stares back at him.\n\n          EXT. SHEEP BARN - CONTINUOUS\n\n          Logan, claws extended, skin blackened with soot, jumps from\n          the roof of the barn. He lands on the helicopter windshield.\n\n          INT. APACHE LONGBOW - CONTINUOUS\n\n          The pilot nearly jumps out of his seat.\n\n          PILOT\n          Jesus!\n          Logan raises his right hand and plunges his claws through the\n          bulletproof glass.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n          Agent Zero watches the Apache plummet to the ground. He\n          snorts with amusement and activates his headset.\n\n          AGENT ZERO\n          Your boy just took down fifty\n          million dollars worth of hardware.\n          Guess I got to do this myself.\n\n          \n\n          \n\n          \n\n          \n\n          46.\n\n          INT. STRYKER'S OFFICE - DAY\n\n          Stryker sits alone in his office, pinching the bridge of his\n          nose. It's been a long day for the colonel.\n\n          STRYKER\n          (on headset)\n          Negative. Come back to base.\n\n          AGENT ZERO (O.S.)\n          Have a little faith, boss.\n\n          STRYKER\n          You don't have the weaponry...\n\n          EXT. HUDSON FARM - DAY\n\n\n          AGENT ZERO\n          Don't care what kind of bones he's\n          got. Fifty caliber bullet through\n          his eyeball ought to do it.\n\n          STRYKER (O.S.)\n          Nord, goddamnit--\n\n          AGENT ZERO\n          I'm losing you, boss.\n          Agent Zero clicks off his headset and.raises the sniper\n          rifle, searching through the smoke with his scope.\n          AGENT ZERO (cont'd)\n          (muttering to himself)\n          Come out and play...\n\n          EXT. SHEEP BARN - CONTINUOUS\n\n          Logan emerges from the Apache's wreckage and runs toward the\n          sheep barn door.\n          A bullet cracks him in the forehead and Logan falls backwards\n          into the snow, stunned. For a few seconds we can glimpse the\n          adamantium of his skull.\n          His healing factor takes over and his skin begins to knit\n          itself back together.\n          Logan combat crawls inside the sheep barn.\n\n          \n\n          \n\n          \n\n          \n\n          47.\n\n          INT. SHEEP DARN - CONTINUOUS\n\n          He throws the tarp off the '48 Harley. James Hudson restored\n          this bike with love and elbow grease. The chrome and leather\n          shine as brightly as any new model on the factory floor.\n          The key is in the ignition. This used to be a safe\n          neighborhood.\n\n          EXT. SHEEP BARN - CONTINUOUS\n\n          Logan bursts out of the barn on the Harley. The tires spin on\n          the snow but Logan is an experienced rider. He steadies the\n          bike, steers it onto the blacktop and accelerates, heading in\n          the opposite direction from Agent Zero.\n\n          EXT. HUDSON FARM - CONTINUOUS\n\n          Agent Zero grabs his rifle and jogs over to a black SUV with\n          tinted windows and off-road tires.\n\n          EXT. COUNTY ROAD - DAY\n\n          Logan speeds down the road, Agent Zero in hot pursuit. Zero\n          gains ground, both hunter and quarry racing past 100 MPH.\n\n          INT. SUV - DAY\n\n          Agent Zero grabs an Atchisson assault shotgun from a rack\n          behind his seat that holds an impressive array of weaponry.\n          He lowers the passenger window and gets a bead on Logan, who\n          swerves to keep himself (and his more fragile motorcycle) a\n          tricky target.\n\n          EXT. COUNTY ROAD - DAY\n\n          Agent Zero fires six shells in rapid succession. Hundreds of\n          steel pellets scream over the motorcycle, perforating the\n          face of a smiling farmer on a fertilizer billboard.\n          Logan turns and sees the SUV closing on him. Agent Zero rams\n          the bumper into the Harley and Logan very nearly loses\n          control, managing to right the bike at the last second.\n\n          ( C'ONTTNTIRF 1\n\n          \n\n          \n\n          \n\n          \n\n          48.\n\n          CONTINUED:\n          Logan accelerates and opens up thirty yards of breathing\n          room. He turns and sees Agent Zero catching up again.\n          Logan clamps on the brakes, hard.\n          He holds out his left hand and extends his claws. The tips of\n          the blades scrape the asphalt and sparks fly.\n          The SUV cannot brake in time. As it hurtles past the\n          motorcycle, Logan's claws hit the SUV's front tire and shred\n          it instantly. A split-second later he shreds the rear tire.\n          The SUV totters, falls to its side, and barrel rolls across\n          the empty road. It ends up on its roof in a drainage ditch,\n          wheels still spinning in the air.\n          Logan turns his bike and pulls up next to the upended SUV. He\n          lowers the kickstand, stands, and walks to the driver's side.\n          Agent Zero, bloodied and dazed, has managed to push open the\n          door. He leans out and aims his shotgun at Logan, who slices\n          the weapon into four pieces with a sweep of his claws.\n          Logan grabs Agent Zero by the back of the neck and hauls him\n          out of the car.\n\n          LOGAN\n          Those were good people back there.\n          Innocent people.\n          Agent Zero surreptitiously pulls a commando knife from a\n          sheath on his ankle.\n\n          AGENT ZERO\n          You ever notice good people tend to\n          die when they spend time with you?\n          He swings the knife at the side of Logan's neck.`Logan\n          catches Agent Zero's wrist and slams it against the door\n          frame.\n          Agent Zero drops the knife with a pained smile. He didn't\n          think that would work.\n          AGENT ZERO (cont'd)\n          Maybe you should stick with the bad\n          people. We're more your speed.\n\n          LOGAN\n          I got a message for your boss.\n\n          (C'_ONTTNTTF.T) I\n\n          \n\n          \n\n          \n\n          \n\n          49.\n\n          CONTINUED: (2)\n\n          AGENT ZERO\n\n          (SMIRKING)\n          Yeah? Tell me.\n          The smirk fades from Zero's face as he sees the adamantium\n          claws plunging toward his heart.\n\n          EXT. GAS STATION - DAY\n\n          Logan stands at a pay phone beside the Texaco station,\n          watching a couple of SKATEBOARD PUNKS practice their ollies.\n          He punches in a number and waits for the connection.\n\n          OPERATOR (O.S.)\n          Department of Agriculture.\n\n          LOGAN\n          Get me the Pest Control Division.\n\n          OPERATOR (O.S.)\n          I'm sorry, sir, there is no Pest\n          Control Division.\n\n          LOGAN\n          Why don't you get 'em anyway. And\n          tell 'em Logan's calling.\n          While he waits he watches one of the kids attempt a backside\n          tailslide on the curb. The kid loses his balance and wipes\n          out, skinning his palms on the asphalt.\n\n          STRYKER (O.S.)\n          Where are you?\n\n          LOGAN\n          (controlled fury)\n          You shouldn't have killed those\n          people. All they were doing was\n          helping a stranger.\n\n          INT. STRYKER'S OFFICE - DAY\n\n          Stryker sits behind the desk of his office. His aide,\n          COLLINS, stands on the other side of the desk, listening in\n          on an extension.\n\n          STRYKER\n          You ran on me, goddamnit. We had a\n          deal. Now you get back to base--\n\n          \n\n          \n\n          \n\n          \n\n          50.\n\n          EXT. GAS STATION - CONTINUOUS\n\n          We continue to INTERCUT between the gas station and Stryker's\n          office.\n\n          LOGAN\n          They had nothing to do with this.\n          You let that mad dog gun 'em down\n          like they were animals.\n\n          STRYKER\n          I'm giving you an order, soldier!\n          Return tobase--\n\n          LOGAN\n          Had enough orders for one lifetime.\n\n          (BEAT)\n          I'm going after Victor Creed.\n          For several seconds there is silence on the line.\n\n          STRYKER\n          We're bringing you in. One way or\n          another, we're bringing you in.\n          Logan bows his head, considering his next words.\n\n          LOGAN\n          People like you are always waiting\n          for the next war. You start one\n          with me, Colonel, you better sleep\n          with the lights on.\n          He hangs up the phone and walks to his bike. The skateboard\n          punks give him a wide berth.\n\n          EXT. SAN DIEGO ZOO - DAY\n\n          Closing time at the big zoo and FAMILIES flock toward the\n          parking lot. SANITATION WORKERS clean the trash from the\n          walking paths.\n\n          EXT. LEMUR ISLAND - DAY\n\n          The lemur habitat is cultivated to mimic the environment of\n          Madagascar. Four RING-TAILED LEMURS swing from the branches\n          of the baobab trees, shrieking at each other.\n          f rC)NTTNTTPD I\n\n          \n\n          \n\n          \n\n          \n\n          51.\n\n          CONTINUED:\n          They congregate in a small wooden hut with a peaked roof,\n          where they scamper up and down the back of FRANCIS, a\n          slender, balding man in a zoo keeper's uniform.\n          Francis has a gentle smile as he feeds the lemurs leaf-eater\n          biscuits. He speaks to them as they shriek,: clambering over\n          his lap, biscuits clutched in their tiny hands.\n\n          FRANCIS\n          She did what? Ninna, that wasn't\n          very nice.\n          He gives one of the female lemurs an admonishing look. She\n          shrieks and dances away, biscuit held to her chest.\n          FRANCIS (cont'd)\n          You must have done something to\n          deserve it, Myrto. Oh, you bit her?\n          Why? Haven't we talked about this?\n          The lemurs all quiet down at the same time. Francis watches\n          them. Something is wrong. The lemurs flee, ducking into holes\n          in the baobab trees, hiding from whatever's coming.\n          Francis frowns and turns. Victor Creed stands above him.\n\n          VICTOR CREED\n          Everyone thinks you're a lunatic,\n          talking to animals. But I know\n          you're not, Francis. You understand\n          them, don't you? That's your power.\n          Francis looks for help but there is no one in sight.\n          VICTOR CREED (cont'd)\n          What do they tell you?\n          Francis is quiet for a few seconds, staring at the killer.\n\n          FRANCIS\n          Nothing very fancy. They tell me\n          when they're scared. When they're\n          angry. When they're hungry.\n\n          VICTOR CREED\n          You ever talk to a panther,\n          Francis?\n          Francis shakes his head.\n          CONTTNi7Ff)1\n\n          \n\n          \n\n          \n\n          \n\n          52.\n\n          CONTINUED: (2)\n\n          ï¿½1\n          VICTOR CREED (cont.'d)\n          Every now and then a white panther\n          comes along. Albino. The mama\n          panther won't even look at it. She\n          won't lick it, she won't feed it,\n          nothing. So pretty soon the white\n          panther dies. You know why?\n          (off Francis's silence)\n          White panthers are mistakes. And\n          nature takes care of its mistakes.\n\n          FRANCIS\n          There are no mistakes. We're all\n          part of the plan. We're all God's\n          children.\n          Creed grins, licking his sharp fangs.\n\n          VICTOR CREED\n          I don't know who my Daddy was, but\n          it sure as Hell wasn't God.\n          Francis bows his head.\n\n          FRANCIS\n          I'm not afraid of dying.\n          Creed runs one long claw across Francis's cheek.\n\n          VICTOR CREED\n          How do you know? You've never done\n          it before.\n\n          CUT TO:\n          Ninna the ring-tailed lemur mewls softly, trying to hide\n          herself deep within the baobab tree as her human friend\n\n          SCREAMS.\n\n          EXT. LAS VEGAS STRIP - NIGHT\n\n          Logan, riding James Hudson's vintage motorcycle, rolls down\n          the famous strip, lit by the mammoth neon signs above him.\n          He stops at a red light and stares at the lonely moon rising\n          over the desert.\n\n          LADY OF THE NIGHT (O.S.)\n          You look like a man who could use a\n          night off.\n          (C fNTTNTTRT)1\n\n          \n\n          \n\n          \n\n          \n\n          53.\n\n          CONTINUED:\n          Logan turns to look at a REDHEAD in a tight silver dress,\n          waiting at the light in her Cadillac convertible. She looks\n          like she's expensive, and she looks like she'd be worth it.\n\n          LOGAN\n          You're way out of my league,\n          darlin'.\n\n          LADY OF THE NIGHT\n          You never know. You looking for a\n          good time with a bad woman?\n          Logan smiles and shakes his head.\n\n          LOGAN\n          Not tonight.\n          The redhead purses her lips.\n\n          LADY OF THE NIGHT\n          You don't know what you're missing.\n          Logan revs his engine as the light changes.\n\n          LOGAN\n          I know exactly what I'm missing.\n           The courtesan waits at the green light,. watching Logan speed\n          off into the night -\n\n          EXT. BOXING GYM - NIGHT\n\n          In a seedy part of town, far from the casinos' bright lights,\n          Logan walks through the front door of a rundown boxing gym.\n\n          INT. BOXING GYM - NIGHT\n\n          Even at this hour the gym is packed with aspiring PUGILISTS.\n          Las Vegas has become the Mecca of world boxing, and many 'of\n          the fighters here exhibit impressive skills as they batter\n          the heavy bag, tap at the speed bag, and jump rope.\n          Logan walks toward a ring in the center of the gym. Two young\n          BOXERS inside the ropes, wearing headgear and sparring\n          gloves, dance around throwing quick jabs that don't land.\n          JOHN WRAITH (45) stands outside the ring, watching this\n          action with evident distaste. He wears a black cowboy hat,\n          sunglasses, and a handlebar mustache. He has the swagger and\n          drawl of a rodeo cowboy.\n\n          ! ('ONTTNTTF.T) )\n\n          \n\n          \n\n          \n\n          \n\n          54.\n\n          CONTINUED:\n\n          WRAITH\n          This is a contact sport, ladies. If\n          you don't like hitting people, try\n          golf.\n          Logan comes up behind Wraith, unseen by the Texan..\n\n          LOGAN\n          You talk tough for a guy who always\n          let me do the dirty work.\n          A slow smile creases Wraith's face. He turns.\n\n          WRAITH\n          Look at this. You never get old, do\n          you?\n          The two men'embrace. There is genuine affection here, the\n          camaraderie of men who have fought together, bled together.\n          WRAITH (cont'd)\n          Nobody followed you?\n\n          LOGAN\n          You tryin' to insult me?\n\n          WRAITH\n          Can't be too careful, brother. I've\n          been retired five years I still\n          check under the car every time I\n          drive.\n\n          LOGAN\n          I'm looking for Victor Creed.\n          Wraith's face goes serious at the mention of the name. He\n          looks around the gym, making sure no one's watching them.\n          He glances at the boxers in the ring, who lean on the ropes\n          and breathe heavily, awaiting instructions.\n\n          WRAITH\n          Why don't you two get a manicure or\n          something and meet me back here in\n          the morning.\n          (to Logan)\n          Want a beer?\n\n          LOGAN\n          Always.\n\n          (C_ONTTNTTF.T)'\n\n          \n\n          \n\n          \n\n          \n\n          55.\n\n          CONTINUED: (2)\n          Wraith leads Logan toward an office in the back, draping an\n          arm around his shoulders.\n\n          WRAITH\n          I love you like a brother. So I'm\n          giving you thirty minutes. After\n          that, you're too dangerous to know.\n\n          INT. WRAITH'S OFFICE - NIGHT\n\n          The windows in the office look out on the training boxers.\n          Wraith leads Logan inside and grabs two longneck bottles of\n          beer from a mini-fridge.\n\n          WRAITH\n          What I hear, our friend the\n          Colonel's got eyes all over the\n          country looking for you. He ain't\n          about to let Weapon X go rogue on\n          him.\n          Wraith pops the caps off the beer bottles and hands one to\n          Logan.\n\n          LOGAN\n          What's Weapon X?\n          They tap glass.\n\n          WRAITH\n          You are. A walking, talking,\n          hundred-million dollar experiment.\n\n          LOGAN\n          You know about it.\n          Wraith sits behind his desk and puts his boots up. Logan sits\n          across from him.\n\n          WRAITH\n          I keep my ear to the ground. People\n          like us, we never really quit the\n          game.\n\n          LOGAN\n          I did. Woke up one day and knew I\n          was done.\n          Logan peels the label from his bottle of beer.\n          f CONTTNTTFT) )\n\n          \n\n          \n\n          \n\n          \n\n          56.\n\n          CONTINUED:\n          LOGAN (cont'd)\n          Stryker used to give me a new name\n          every Monday. And by the end of the\n          week, I'd draw a line through it.\n\n          (BEAT)\n          I .put a whole lot of people under\n          the ground. And one day I\n          realized... Stryker was never gonna\n          run out of names.\n          Wraith nods, meditative.\n\n          WRAITH\n          Our friend the Colonel has big\n          plans.\n\n          LOGAN\n          What kind of plans?\n\n          WRAITH\n          Hear a lot of chatter about\n          something called the Eleven. My\n          boys in Arlington say it's the\n          biggest covert weapons project\n          since FDR built himself an atom\n          bomb. Other than that, no one knows\n          a goddamn thing.\n          Wraith places his bottle on his desk and sits up straight in\n          his chair.\n          WRAITH (cont'd)\n          Look, I... I heard about what\n          happened to your woman. For what\n          it's worth, I'm sorry.\n          Logan nods. He doesn't want to talk about it.\n          WRAITH (cont'd)\n          I did a little contract work with\n          Creed back in the day. I've known\n          some seriously foul people, but\n          that cat... They say he took out a\n          whole village in Nicaragua one\n          time, every man, woman, and child,\n          killed 'em all, just 'cause he was\n          bored.\n\n          (BEAT)\n          I been screwed, sued, and tattooed,\n          but I never killed no kids.\n\n          C'ONTTNIIRT) I\n\n          \n\n          \n\n          \n\n          \n\n          57.\n\n          CONTINUED: (2)\n\n          LOGAN\n          Creed did government work?\n\n          WRAITH\n          Till they got wise to him. Wherever\n          he went there was a trail of\n          bodies. And not always the right\n          bodies, you know what I'm saying?\n          There is murder in Logan's eyes.\n\n          LOGAN\n          Help me find him.\n\n          WRAITH\n          He's a hard cat to track.\n\n          LOGAN\n          Just tell me where to start\n          looking. I'll do the rest.\n          Wraith taps the bottleneck, considering.\n\n          WRAITH\n          Might want to talk to his friends\n          from the ultramax.\n\n          LOGAN\n          The prison he busted out of?\n\n          WRAITH\n\n          (NODDING)\n          Feds built it to hold the baddest\n          of the bad mutants. Worked pretty\n          well. Only problem-- now they all\n          know each other.\n\n          (BEAT)\n          You ever hear of a guy named Fred\n          J. Dukes?\n\n          LOGAN\n          Nope.\n\n          WRAITH\n          People call him the Blob. You find\n          him, you'll know why. Got out of\n          the hoosegow a few months ago. Went\n          home to Iowa. Town called Elgin.\n\n          LOGAN\n          You think he's still in touch with\n          Creed?\n          f C_ONTTNTIRT)1\n\n          \n\n          \n\n          \n\n          \n\n          58.\n\n          CONTINUED: (3)\n          Wraith leans back in his chair and allows himself another\n          slow smile.\n\n          WRAITH\n          I bet you'll find out.\n\n          EXT. HIGHWAY - NIGHT\n\n           Logan, on his Harley, speeds past a welcome sign for Elgin,\n          Iowa, Population 676.\n\n          EXT. ROADSIDE MOTEL - NIGHT\n\n          The neon Vacancy sign shines, a beacon for tired travellers\n          in the heartland.\n\n          INT. MOTEL ROOM - NIGHT\n\n          Logan lies on top of the bed covers, hands behind his head.\n          The lights are out and Fox News plays on the television,\n          casting the small room in blue light.\n\n          INSERT TELEVISION\n          A REPORTER stands in a Detroit alleyway as POLICE OFFICERS in\n          the background cordon off the area from ONLOOKERS.\n\n          REPORTER\n          This is the 13th confirmed mutant\n          slaying of the last two months, and\n          with the investigation apparently\n          stalled, members of the mutant\n          community are voicing their\n          outrage.\n          A YOUNG WOMAN wearing a \"Mutants are Humans, Too\" t-shirt\n          speaks passionately for the camera.\n\n          YOUNG WOMAN\n          Of course there's bias at work\n          here. If these were normal people\n          getting. chopped up, you better\n          believe there'd be an FBI Task\n          Force investigating, there'd be all\n          sorts of resources allocated to\n          find this killer. Why is it that\n          when violence is done to our\n          community, the nation turns its\n          back?\n\n          (MORE)\n\n          (RNNTTWURD\n\n          \n\n          \n\n          \n\n          \n\n          59.\n\n          CONTINUED:\n          YOUNG WOMAN (cont'd)\n          If the government can't protect us,\n          we're gonna have to start\n          protecting ourselves.\n          In the corner of the TV screen, carved directly into the\n          brick wall of the alley, is a crude smiley face.\n\n          END INSERT\n          Logan's expression does not change as he watches the report.\n          Our only indications that he's boiling inside are the look of\n          dark vengeance in his eyes, and the fingers of his right\n          hand, which clench into a fist, unclench, clench again.\n          He lowers the volume with the remote, picks up the telephone\n          and dials a number. We hear four rings.\n\n          KAYLA (O.S.)\n          (on answering machine)\n          Hey, you've reached Kayla and\n          Logan. We're not home right now so\n          please leave a message after the\n          beep and we'll get back to you as\n          soon as we can. Bye!\n          Beep. Logan replaces the receiver in its cradle and' lies\n          back, alone in the world.\n\n          EXT. SUPERMARKET PARKING LOT - DAY\n\n          A MOTHER pushes her shopping cart towards her minivan. Her\n          young, freckled SON holds her hand, gazing fearfully at\n          Logan, who stands on the edge of the lot smoking a cigar. He\n          looks out of place in this quiet, Midwestern town.\n          Logan winks at the kid. He drops his cigar, grinds it out\n          with the toe of his boot, and heads for the supermarket.\n\n          INT. SUPERMARKET - DAY\n\n          Two STOCK BOYS, wearing bright blue vests over red shirts,\n          stand at one of the aisle dividers, hiding behind a stack of\n          breakfast pastries. They are plainly terrified.\n\n          STOCK BOY #1\n          Say something.\n\n          STOCK BOY #2\n          You say something. It's your\n          section!\n\n          (C_ONTTNTTF.T)1\n\n          \n\n          \n\n          \n\n          \n\n          60.\n\n          CONTINUED:\n\n          STOCK BOY #1\n          Dude...\n          The stock boy peeks around the divider. FRED J. DUKES,\n          a.k.a., THE BLOB, stands in the center of the aisle, tearing\n          open bags of pork rinds and pouring them down his gullet.\n          Dukes is the biggest man you've ever seen. By a long shot.\n          Just shy of seven feet tall and weighing in at half a ton,\n          he's beyond fat. Beyond obese.\n          His eyes look like pinpricks in the swollen enormity of his\n          face. When he shifts his bulk, ripples cascade down his\n          flanks, his flesh trembling with each breath.\n\n          LOGAN (O.S.)\n          Jesus, Dukes...\n          Dukes, mouth and chin dusted with fried pork skin, turns his\n          head to examine the pest standing next to him.\n          LOGAN (cont'd)\n          Maybe it's time to give the pork\n          rinds a rest.\n          Dukes swings his arm. Despite his enormous mass, the man\n          moves with surprising speed. Not quick enough to catch Logan,\n          though, who ducks beneath the blow.\n          Dukes's forearm, thicker than a fire hydrant, smashes through\n          the steel shelving. Bags of pork rinds and potato chips\n          tumble to the floor.\n          Snikt! Logan shows his glittering claws to the big man.\n          LOGAN (cont'd)\n          I'll fillet you standing, fat man.\n          That what you want?\n          Dukes hesitates. That is not what he wants.,\n          LOGAN (cont'd)\n          .Where's Victor Creed?\n          Dukes grunts and bulls forward, toppling the heavily-laden\n          shelves into the next aisle. Panicked SHOPPERS scream and run\n          for the exits.\n          Dukes blasts through the cereal aisle, too, with a great\n          rending of steel, his giant shoes crushing boxes of Lucky\n          Charms as he stomps into the produce section.\n          CONPTNi)F.T)1\n\n          \n\n          \n\n          \n\n          \n\n          61.\n\n          CONTINUED: (2)\n          A coconut bounces off Dukes's head. Enraged, the giant turns\n          and sees Logan standing by a pile of hairy coconuts, tossing\n          one in his hand like a baseball.\n          LOGAN (cont'd)\n          You're gonna help me, bub. You_just\n          don't know it yet.\n          Dukes bellows and runs at Logan. A coconut pelts him in the\n          face, angering him further. Logan jumps out of the way as\n          Dukes brings down his massive fists. Coconuts explode.\n          Dukes charges after Logan, shattering watermelons, stacked\n          grapefruits, clusters of bananas.\n          After a thirty second rampage Dukes is exhausted, his giant\n          chest heaving as he gasps for air, his hands and face\n          splattered with remnants of crushed fruit.\n          Logan jumps onto Dukes' back. The fat man roars and spins\n          around, trying to buck the little rider, but Logan's got one\n          arm wrapped around Dukes' throat and he's not letting go.\n          The spinning makes Dukes a little dizzy and he slows down.\n          Three adamantium claws shine in the big fellow's face,\n          reflecting the overhead fluorescent lights.\n          Dukes quits, his massive shoulders slumping. He sinks to his\n          knees, his great bulk splitting the linoleum floor.\n          Logan presses his claws against Dukes' quivering jowls.\n          LOGAN (cont'd)\n          Where's Creed?\n\n          FRED J. DUKES\n          How the hell would I know?\n\n          LOGAN\n          Come on, he's your friend. When was\n          the last time you talked to him?\n\n          FRED J. DUKES\n          Friend? He don't have any friends.\n          All he's got is victims.\n\n          LOGAN\n          Careful, Dukes. I can smell a lie\n          before you even tell it.\n          The Blob begins to cry, the great bellows of his cheeks\n          trembling, tears and snot dribbling down his face.\n\n          1 RONTTNTTEH 1\n\n          \n\n          \n\n          \n\n          \n\n          62.\n\n          CONTINUED: (3)\n\n          FRED J. DUKES\n          I'm not lying! I don't know where\n          he is.\n          Logan pulls a handkerchief out of his back pocket and hands\n          it to Dukes.\n\n          LOGAN\n          All right, take it easy.\n          Dukes blows his nose into the handkerchief, one of history's\n          loudest and most violent nasal ejaculations.\n          He offers back the soiled handkerchief. Logan waves it off.\n          LOGAN (cont'd)\n          It's a gift.\n          Dukes takes a deep breath, gathering himself.\n\n          FRED J. DUKES\n          You ever been to Superior?\n\n          LOGAN\n          The club for mutants? Down in New\n          Orleans?\n\n          FRED J. DUKES\n          Creed likes to party down there.\n          Talked about it all the time-- how\n          hot the girlies were. That's all I\n          know.\n          Logan shaves Dukes' jaw with the edge of his claw.\n\n          LOGAN\n          Nah. You know more than that.\n          Dukes tilts his face, trying to keep his face from getting\n          scraped off.\n\n          FRED J. DUKES\n          Joint's owned by a guy named\n          Barbarus. Shared a cell with Creed\n          in the ultramax. Anyone knows where\n          to find him, it's Barbarus.\n          Logan stares into the Blob's face, gauging the man's words.\n\n          LOGAN\n          He better be there, Freddie. And he\n          better know something good.\n\n          (MORE)\n          ( r'nNT T NT TF.n )\n\n          \n\n          \n\n          \n\n          \n\n          63.\n\n          CONTINUED: (4)\n           LOGAN (cont'd)\n          'Cause I'm in a mood for violence\n          and you're way too big to hide.\n\n          INT. CONFERENCE ROOM - DAY\n\n          Stryker stands by a window-overlooking Alkali Lake while\n          General Munson sits at the head of the conference table.\n\n          STRYKER\n          we have information that he was in\n          Las Vegas two nights ago. We'll\n          find him soon.\n\n          GENERAL MUNSON\n          This is turning into a goddamn\n          disaster, Colonel.\n\n          STRYKER\n          I disagree. I'd say the experiment\n          has been a success.\n\n          GENERAL MUNSON\n          Success? Are you kidding me?\n\n          STRYKER\n          Weapon X is a prototype. Nothing\n          more. He's the walking proof that\n          enhanced skeletons are viable.\n          That, along with the healing factor\n          we've replicated from his blood,\n          will insure that the Eleven is\n          capable of protecting our species\n          from extinction.\n\n          (BEAT)\n          At this point, Logan is merely an\n          inconvenience. He won't be for\n          long.\n\n          GENERAL MUNSON\n          I'm sorry, William. I've lost\n          confidence in your leadership. I'm\n          going to recommend your dismissal\n          to the Joint Chiefs.\n          Stryker stares out the window at the distant lake, with no\n          visible reaction to the General's words.\n\n          STRYKER\n          Disappointing, General. Expected,\n          but still... disappointing.\n\n          I CONTTN:]M )\n\n          \n\n          \n\n          \n\n          \n\n          64.\n\n          CONTINUED:\n          General Munson takes a sip of water from the glass in front\n          of him.\n\n          GENERAL MUNSON\n          I know you believe in what you're\n          doing. But I don't. War with the\n          mutants is not inevitable.\n          The general coughs. He begins to look confused as he coughs\n          again, his breathing gone suddenly ragged. He clutches at his\n          chest.\n          A thin smile curls Stryker's lips. He turns to regard the\n          General.\n\n          STRYKER\n          You're having a massive heart\n          attack, sir. Leading cause of death\n          for men in your age bracket.\n          The general gasps for air, trying to rise to his feet. In his\n          death throes, he knocks the glass of water from the table. It\n          shatters on the floor.\n          STRYKER.(cont'd)\n          The war is coming. It's time to\n          choose sides.\n          The general collapses-and Stryker stands above him, staring\n          down at the dying man with pitiless eyes.\n          STRYKER (cont'd)\n          You chose treason.\n\n          EXT. CLUB SUPERIOR - NIGHT\n\n          A heavy rain falls in the French Quarter. There is no sign\n          outside the club, only.a gargantuan BOUNCER standing in front\n          of an unmarked door in a dark alley.\n          The bouncer apprises the stocky mutant walking his way.\n\n          BOUNCER\n          You superior?\n          Only when we go CLOSE ON THE BOUNCER do we realize he has a\n          single eye, large and bloodshot, centered in his forehead..\n          Logan raises both hands. Snikt! A single claw extends from\n          his right hand.\n\n          (ONTTNTTF.T) )\n\n          \n\n          \n\n          \n\n          \n\n          65.\n\n          CONTINUED:\n          He shoves the claw straight through his left palm, retracts\n          the blade, and shows his wounded palm to the bouncer. The\n          bouncer sees the wound heal and opens the door.\n          BOUNCER (cont'd)\n          Welcome home, brother.\n\n          INT. CLUB SUPERIOR - MOMENTS LATER\n\n          The dimly-lit club is the size of a warehouse and jammed with\n          PARTYING MUTANTS. Most of them look like normal humans but a\n          few are \"overts,\" distinguished by curling horns, scaled skin\n          and other genetic abnormalities.\n          A sexy WAITRESS walks by with a tray of drinks. She winks at\n          Logan. A \"Kiss Me, I'm a Mutant\" button is pinned to her\n          shirt.\n          Industrial beats pour out of speakers bolted to the ceilings.\n          Logan surveys the room. A young PUSHER approaches, his long\n          sideburns shaved into scimitars running down his jawline.\n\n          PUSHER\n          You lookin' for help, man? Ups,\n          downs, in-betweens. What you need?\n\n          LOGAN\n          Wild roses for the moon.\n\n          PUSHER\n          Wild roses... That some new hash\n          out of Amsterdam?\n\n          LOGAN\n          Something like that. You seen my\n          buddy Barbarus?\n          The dealer points toward a staircase at the back of the club.\n\n          PUSHER\n          VIP room. But hold up,bro,.I got\n          what you're looking for.\n\n          LOGAN\n          Trust me, bub-- you don't.\n          Logan heads for the staircase.\n\n          \n\n          \n\n          \n\n          \n\n          66.\n\n          INT. CLUB SUPERIOR, SECOND FLOOR - NIGHT\n\n          Logan tries to enter the VIP room but a muscle-bound SKINHEAD\n          with Mutant Power brands on his biceps blocks his path.\n\n          SKINHEAD\n          Private party.\n\n          LOGAN\n          I'm on the list. Logan.\n          The skinhead raises his clipboard and examines the list.\n\n          SKINHEAD\n          Last name?\n          Logan's fist splits the clipboard and crushes the skinhead's\n          nose. The muscle-bound brute slumps to the floor,\n          unconscious. Logan steps over him and into the VIP room.\n\n          LOGAN\n          Unknown.\n\n          INT. VIP ROOM - CONTINUOUS\n\n          The VIP MUTANTS -sit at plush booths, downing shots of\n          tequila. They grope their GIRLFRIENDS. They arm wrestle and\n          compare tattoos and gobble down fried oysters.\n          BARBARUS sits in a corner booth. He wears a custom-made wife-\n          beater. The brutally-muscled mutant has four arms, all\n          sleeved in tattoos.\n          One hand pours himself a new glass of Jack Daniel's. A second\n          hand gouges his name into the table top with a black steel\n          commando knife. The third drums the beat of the current song\n          on the vinyl booth's backrest.\n          The fourth hand pets PANTERA, the nubile mutant sitting on\n          his lap, a beautiful young woman entirely covered in\n          glistening black fur. Her yellow eyes glitter.\n          Logan approaches the table. Barbarus stares up at him.\n          Pantera purrs, yellow eyes on Logan.\n\n          BARBARUS\n          (nuzzling his girl)\n          Oh, I heard about this li'l fella.\n          Mr. Creed beat him to hell.\n\n          ( C_ONTTNTTRT)1\n\n          \n\n          \n\n          \n\n          \n\n          67.\n\n          CONTINUED:\n\n          LOGAN\n          I came back. Where is he?\n\n          BARBARUS\n          Somewhere in America. Doing what he\n          does best.\n\n          LOGAN\n          What's that?\n\n          BARBARUS\n          Putting people's insides on the\n          outside.\n\n          LOGAN\n          He's killing mutants, bub.\n          Barbarus smiles, twenty fingers drumming on the table top.\n\n          BARBARUS\n          Some mutants need killing.\n\n          LOGAN\n          You got that right.\n          Snikt!\n          Barbarus shoves his girlfriend out of the way and stands,\n          unsheathing three more black commando knives from his belt.\n          The other MUTANTS quiet down, watching the fireworks.\n          Barbarus swings, the four knives whistling through the air.\n          Logan ducks under them and continues to bob and weave as\n          Barbarus advances behind a whirlwhind of black steel.\n          Logan slashes and one severed hand falls to the ground.\n          Barbarus howls, stabbing at Logan with his three good arms.\n          Logan's claws flash through the air again, and another neatly\n          severed hand lands on the table.\n          Logan retracts his claws and curls one finger: come at me.\n          Barbarus, shamed and furious, gathers himself and charges.\n          Logan times his punch perfectly, pivoting on the ball of his\n          foot and hitting Barbarus with an uppercut that sounds like a\n          well-hit baseball.\n          Barbarus crashes to the floor. Pantera hisses and pounces at\n          Logan, her black claws aimed at his face. Logan backhands\n          her. She hits the floor and slides across the hardwood.\n          C_nWTTAATFT)\n\n          \n\n          \n\n          \n\n          \n\n          68.\n\n          CONTINUED: (2)\n          Logan kneels beside Barbarus.\n          LOGAN (cont'd)\n          You want to keep your other hands?\n          Where is he?\n          Blood dribbles from Barbarus's lip. He spits out a tooth.\n\n          BARBARUS\n          He don't sent me postcards.\n\n          LOGAN\n          No? Way I hear it, you two were\n          practically boyfriends before he\n          busted out.\n\n          BARBARUS\n          Busted out?\n\n          (LAUGHING)\n          You been misinformed. Victor Creed\n          got himself a government pardon.\n          Some fellas from the Department of\n          Agriculture came and picked him up.\n\n          LOGAN\n          You're lying to me.\n          Barbarus grins, his teeth red from the blood in his mouth.\n\n          BARBARUS\n          No, sir. But somebody is.\n\n          INT. PARKING GARAGE - NIGHT\n\n          A five-story concrete parking structure on the edge of Las\n          Vegas. John Wraith walks to his black.'68 Mustang, whistling\n          a Jerry Jeff Walker song.\n          When he gets to the car he drops to the floor and checks the\n          underbody for bombs. Nothing down there.\n          He stands, reaching into his pocket for his keys.\n\n          VICTOR CREED (O.S.)\n          You think I'd use a bomb on you,\n          Johnny Boy?\n          Wraith spins around. Victor Creed sits on a concrete parapet,\n          the desert wind blowing his filthy blonde hair.\n          He hops off the parapet and walks toward Wraith.\n\n          (COWTNIIEFL 1\n\n          \n\n          \n\n          \n\n          \n\n          69.\n\n          CONTINUED:\n          VICTOR CREED (cont'd)\n          It's all about human contact for\n          me.\n          Wraith quickly unlocks the car door and get in. He slips the\n          key into the ignition. The engine turns on the first try.\n          Wraith hits the gas and the Mustang squeals out in reverse.\n          He slams on the brakes, shifts into drive, and guns the car\n          right at Creed.\n          An instant before impact, Creed sidesteps the car and punches\n          through the driver's window.\n          It's a miracle of a punch, timed perfectly, a crushing shot\n          to Wraith's jaw. Wraith loses control. of the car and it\n          sideswipes a parked Hummer, spinning to a stop against a\n          concrete wall.\n          Wraith blinks and tries to clear his head. Creed reaches\n          inside the broken window and hauls the Texan out. He lifts\n          the bleeding man into the air and flashes his white fangs.\n          VICTOR CREED (cont'd)\n          Hear you been talking out of\n          school.\n\n          WRAITH\n          He'll find you.\n\n          VICTOR CREED\n          That's the plan. It's a lot easier\n          than finding him.\n          Creed slams Wraith against the concrete wall and plunges his\n          claws deep into Wraith's gut.\n          The Texan's mouth opens as the full force of the pain hits\n          him. Creed whispers in his ear.\n          VICTOR CREED (cont'd)\n          I can feel your spine, Johnny Boy.\n          A sickening crunch as vertebrae are crushed like walnut\n          shells.\n          VICTOR CREED (cont'd)\n          Never knew you had one.\n          Creed drops Wraith's body to the ground.\n\n          \n\n          \n\n          \n\n          \n\n          70.\n\n          INT. HINES' HOUSE - NIGHT\n\n          Carol Hines, the Army surgeon last seen in Alkali Lake,\n          unlocks her front door and steps inside her house.\n          she looks exhausted, with deep circles under her eyes. She\n          puts her keys and the mail on a table by the door and then\n          looks up, startled, when she hears SHRIEKING.\n          Hines, very nervous, advances into the dark kitchen.\n          She flicks on the lights. A red kettle on the stove top\n          whistles. A mug waits on the counter. Hines, mystified, turns\n          off the burner.\n\n          LOGAN (V.0.)\n          Pour yourself a cup of tea.\n          Hines spins around. Logan sits at the kitchen table, an unlit\n          cigar in his mouth.\n          LOGAN (cont'd)\n          It's gonna be a long night.\n\n          INT. HINES' HOUSE - LATER\n\n          They both sit at the kitchen table now. Logan smokes his\n          cigar and watches Hines, who clutches her mug of tea with\n          trembling hands.\n          Logan watches her through the haze of smoke.\n\n          LOGAN\n          Careful, Doc. I can smell a lie. I\n          can hear it. Maybe you start to\n          sweat a little bit. Maybe the pitch\n          of your voice changes. But I'll\n          know.\n\n          (BEAT)\n          Tell me about Creed.\n          Hines opens her mouth, closes it, opens it again.\n\n          HINES\n          I can't. Please... you don't know\n          what they'll do to me.\n\n          LOGAN\n          Nope. But I know exactly what I'll\n          do to you.\n          (rnNTTNT1FT) I\n\n          \n\n          \n\n          \n\n          \n\n          71.\n\n          CONTINUED:\n          Hines stares at Logan and he stares back.\n\n          HINES\n          I don't believe you. You're\n          different than they are. You\n          wouldn't hurt an innocent person.\n\n          LOGAN\n          You're not innocent, Doc.\n          He leans forward, forearms on the tabletop.\n          LOGAN (cont'd)\n          What does Victor Creed have to do\n          with the Weapon X program?\n\n          HINES\n          It's not the Weapon X program, it's\n          the Weapon Ultra program. Started\n          sixty-five years ago. They've been\n          trying to make the perfect soldier\n          for a long time. First to fight the\n          Nazis. Then the Communists. Now\n          it's mutants.\n\n          LOGAN\n          So where does Weapon X fit in?\n          Hines closes her eyes and takes a deep breath.\n\n          HINES\n          You don't understand. X is a letter\n          but it's also a Roman numeral.\n          Weapon \"Ex\" is a nickname.\n          Officially, you're Weapon Ten.\n\n          (BEAT)\n          Victor Creed is Weapon Nine.\n          Hines watches him, unsure how he'll react.\n          HINES (cont'd)\n          Both of you are experiments...\n          prototypes. The final product is\n          almost ready. Weapon Eleven.\n          Logan's face darkens as the extent of his betrayal becomes\n          clear to him.\n\n          LOGAN\n          Creed works for Stryker.\n          Hines nods.\n          I CONTTNi]RM\n\n          \n\n          \n\n          \n\n          \n\n          72.\n\n          CONTINUED: (2)\n          LOGAN (cont'd)\n          Be ordered it. He ordered Creed to\n          kill her.\n          Hines can see Logan's mounting fury. She holds up her hands.\n\n          HINES\n          I don't know about anyone getting\n          killed. I'm just a scientist. I\n          work in a lab sixteen hours a day.\n\n          LOGAN\n          Just following orders, huh?\n\n          HINES\n          He was your commanding officer for\n          years. How many people did you kill\n          on his orders?\n          Logan stares at her for a long count. she stares back,\n          terrified but resolute.\n\n          LOGAN\n          All this time I been hunting Creed,\n          and he's just a puppet. It's\n          Stryker pulling the strings.\n          He stubs out his cigar on the breakfast table.\n          LOGAN (cont'd)\n          You ready to stop following orders?\n\n          INT. CONFERENCE ROOM - DAY\n\n          Stryker stands at the window overlooking Alkali Lake. Dr.\n          Cornelius steps into the room, holding a black leather case.\n\n          CORNELIUS\n          The Eleven will be ready within 24\n          hours.\n\n          STRYKER\n          Good.\n\n          CORNELIUS\n          Sir... Lieutenant Hines hasn't\n          reported to base today.\n\n          STRYKER\n          Hines?\n\n          (C_ONTT1 TIED 1\n\n          \n\n          \n\n          \n\n          \n\n          73.\n\n          CONTINUED:\n          Stryker considers the information for a moment and nods.\n          STRYKER (cont'd)\n          All right, thank you, Doctor.\n          (glancing at case)\n          What's this?\n          Cornelius sets the case on the table and opens it. Six\n          gleaming, armor-piercing bullets rest in green felt niches.\n\n          CORNELIUS\n          We saved the leftover adamantium\n          from the Weapon X procedure.\n          Stryker plucks one of the bullets from its niche and rolls it\n          between his fingers, examining it with a practiced eye.\n          CORNELIUS (cont'd)\n          Each one's got a high-explosive\n          core. Two in the head and Logan's\n          brain will have to regenerate from\n          scratch.\n\n          STRYKER\n          They won't kill him?\n\n          CORNELIUS\n           According to the computer models we\n          ran, there's a 30 percent chance\n          his healing factor will\n          reconstitute the gray matter. But\n          those synaptic bridges that form\n          our memories? Gone. If he survives,\n          his brain will come back fresh.\n\n          STRYKER\n          A blank slate... easy to train.\n          Stryker fondles the shining bullet lovingly.\n          STRYKER (cont'd)\n          She's a pretty little thing.\n\n          CORNELIUS\n          She ought to be. That's the world's\n          most expensive bullet.\n          Stryker pulls a revolver from his shoulder holster, dumps the\n          standard rounds, and begins loading the adamantium bullets.\n          (rfNTTN11F.T 1\n\n          I\n\n          \n\n          \n\n          \n\n          \n\n          74.\n\n          CONTINUED: (2)\n          CORNELIUS (cont'd)\n          There's another way, a more\n          reliable way, to break down his\n          memory.\n\n          STRYKER\n          Mm?\n\n          CORNELIUS\n          Only problem is, the procedure can\n          only be done here at Alkali Lake.\n          Stryker swings the chamber shut and holsters his gun.\n\n          STRYKER\n          Oh, he's coming back, Doctor. We\n          have what he's looking for.\n\n          EXT. ALKALI LAKE - DAY\n\n          Hines, driving an old Ford, pulls up.to the guard house at\n          the perimeter of the compound. A YOUNG SENTRY salutes her.\n\n          YOUNG SENTRY\n          Morning, Lieutenant.\n          Hines smiles brightly, trying to hide her nervousness.\n\n          HINES\n          Good morning!\n          The sentry looks into the car's cabin. The passenger seat is\n          empty. The back seat is empty.\n\n          YOUNG SENTRY\n          Could you pop the trunk for me?\n\n          HINES\n          The trunk?\n\n          YOUNG SENTRY\n          Yes, ma'am.\n          It's all standard procedure but Hines is close to panicking.\n          She opens the glove compartment and hits the trunk release.\n          The sentry inspects the trunk... nothing but a coil of rope\n          and a roll of electrical tape. He slams the trunk door.\n          YOUNG SENTRY (cont'd)\n          You have a good day.\n\n          (C'NNTTNTTHN 1\n\n          \n\n          \n\n          \n\n          \n\n          75.\n\n          CONTINUED:\n          He signals to a second SENTRY standing inside the guard\n          house, who hits a button. The steel gate rolls open and Hines\n          drives into the compound.\n\n          EXT. PARKING LOT - DAY\n\n          Hines steps out of her parked car and looks around. No one is\n          in the immediate vicinity.\n\n          HINES\n          It's safe.\n          Logan crawls out from the underbody, where he had been\n          clinging. He dusts himself off.\n\n          LOGAN\n          Were you aiming for every speed\n          bump in the state?\n\n          HINES\n          Sorry about that. Now what?\n\n          LOGAN\n          We find a uniform that fits.\n          A well-built SERGEANT walks toward his vehicle, paging\n          through requisition papers on a clipboard.\n          LOGAN (cont'd)\n          That ought to work.\n\n          EXT. ALKALI LAKE WEAPONS ENGINEERING CENTER - DAY\n\n          Hines and Logan, who now wears a crisp uniform with a\n          sergeant's stripes and a black beret, walk into the building.\n\n          INT. WEAPONS ENGINEERING CENTER - CONTINUOUS\n\n\n          HINES\n          You have some blood on your shirt.\n          Logan sees the drops of blood and tries to blot them out.\n\n          LOGAN\n          I barely hit the guy.\n          They don't notice as a small security camera near the\n          entrance pivots, its black eye watching the intruders.\n          (C'ONTTNI]F.n )\n\n          \n\n          \n\n          \n\n          \n\n          76.\n\n          CONTINUED:\n          Hines, very nervous, tries to keep her composure. Logan puts\n          a hand on her shoulder-- partly to steady her nerves, partly\n          to keep pushing her forward.\n          LOGAN (cont'd)\n          Time to visit the Colonel.\n\n          INT. WEAPONS ENGINEERING CENTER - DAY\n\n          Hines and Logan walk down a long corridor. Several SOLDIERS\n          and SCIENTISTS walk by, most of them ignoring the pair.\n          One young scientist in a lab coat hurries past, nodding at\n          Hines.\n\n          YOUNG SCIENTIST\n          Lieutenant.\n\n          HINES\n\n          (NODDING)\n          Murphy.\n          Hines waits till Murphy passes. She stops in front of a\n          locked door and allows a laser scanner to read her retina.\n          The door slides open.\n          Logan looks through the open doorway, his nostrils flaring.\n          He looks primed for homicide.\n\n          LOGAN\n          I can smell him.\n          He walks through the door. Hines checks to see if the coast\n          is clear.and follows him. Neither notices the security camera\n          mounted on the ceiling, swiveling to track their movement.\n\n          INT. WEAPON XI FACILITY - DAY\n\n          Logan and Hines stand at the top of a steel staircase, forty\n          feet above the concrete floor of a massive cavern.\n          Created in the 1960s by an underground hydrogen bomb test,\n          the Alkali Lake cavern is the second biggest in the country,\n          smaller only than the salt caverns of the Gulf Coast, home of\n          the Strategic Petroleum Reserve.\n\n          (CONTTNTTFT)1\n\n          \n\n          \n\n          \n\n          \n\n          77.\n\n          CONTINUED:\n          The sheer scale of the place is staggering. Three times the\n          size of the Super Dome, with walls of rough granite, the\n          cavern is loud with the constant thrum of ventilation and\n          high-powered machinery. Heavy steel pillars support the\n          ceiling of the cavern.\n          Ten thousand stainless steel isolation tanks crowd the floor,\n          arrayed in a grid, each tank slightly larger than a coffin.\n          TECHNICIANS walk in between the tanks, checking gauges,\n          writing notes in clipboards.\n          More technicians sit on a raised podium in the center of the\n          cavern, overlooking the Eleven, entering information into the\n          computers that monitor the sleeping army.\n          Logan is awed by the sight. Hines has descended the staircase\n          ahead of him. He follows after her.\n\n          HINES\n          Welcome to Weapon Eleven.\n\n          LOGAN\n\n          (STUNNED)\n          I thought it was just gonna be one\n          guy. This is...\n\n          HINES\n          Ten thousand.\n          They reach the cavern floor and walk amongst the Eleven.\n          HINES (cont'd)\n          Stryker says mutants and humans\n          will fight a war soon.\n          (gesturing to Weapon XI)\n          This is his army.\n          The camera glides over the isolation tanks as Hines continues\n          to speak. We catch glimpses of the ELEVEN inside, comatose\n          soldiers with needles and wires protruding from their skin,\n          exactly like Logan during the Weapon X procedure.\n          The men all look identical and they all look oddly familiar.\n          HINES (cont'd)\n          They incorporate the most\n          successful features of the previous\n          Weapons. Enhanced skeletons,\n          heightened senses, healing factor--\n          f r0NTTNTTF.T) I\n\n          \n\n          \n\n          \n\n          \n\n          78.\n\n          CONTINUED: (2)\n          Logan stops beside one tank and looks at the man inside, who\n          floats in his chemical sleep. His eyes widen when he realizes\n          what he's looking at.\n\n          LOGAN\n          It's Creed...\n          He looks inside another tank. Same cruel face, same powerful\n          body. Only their shaved heads distinguish them from Victor\n          Creed.\n          LOGAN (cont'd)\n          They're all Creed.\n\n          HINES\n          Stryker's most successful mutant\n          hunter. They cloned him years ago.\n\n          (BEAT)\n          The Colonel's been planning this\n          for a long time. _\n          Logan walks through the midst of this vast, sleeping army,\n          surrounded by ten thousand replicas of his worst enemy.\n\n          LOGAN\n          They get into the world, it's\n          genocide.\n\n          HINES\n          I think that's the general idea.\n          Logan stops in mid--stride, head raised in the manner of a\n          hunting dog who has just caught wind of his prey.\n          HINES (cont'd)\n          What's the matter?\n          Logan moves, walking quickly, nearly knocking over a\n          technician entering data into one of the stasis pods.\n\n          TECHNICIAN\n          Hey...\n          Hines hurries after Logan, smiling apologetically at the\n          annoyed technician.\n\n          HINES\n          Where you going?\n          Logan never turns.\n          f rONTTNUT n %\n\n          \n\n          \n\n          \n\n          \n\n          79.\n\n          CONTINUED: (3)\n\n          LOGAN\n          Don't follow me.\n          Hines stops, standing alone in the middle of the Eleven.\n\n          INT. HALLWAY - DAY\n\n          Logan walks rapidly down the hallway, his pace accelerating\n          as he nears a closed doorway. He rests his head against the\n          door for a moment before putting his hand on the knob and\n          entering the room.\n\n          INT. STRYKER'S OFFICE - CONTINUOUS\n\n          Stryker sits behind his desk, smiling at Logan. But Logan's\n          not looking at the colonel. He's looking at the young woman\n          who sits across from Stryker, her back to the door.\n          She doesn't turn. Her long black hair cascades down her back.\n\n          STRYKER\n          Hello, old friend. We've been\n          waiting for you.\n          Logan walks toward the desk, slowly now, a man in a nightmare\n          he can't wake from.\n          STRYKER (cont'd)\n          Did you really think we just let\n          you walk away three years ago?\n          You're a dangerous man, my friend.\n          We like to keep an eye on dangerous\n          men.\n          When Logan reaches the young woman he puts his hand on her\n          shoulder.\n          Kayla Silverfox turns and stares up at him, tears streaming\n          down her face.\n\n          KAYLA\n          I'm sorry. I'm so sorry.\n          An aluminum baseball bat whirs through the air, smashing the\n          back of Logan's head.\n          Logan falls to the floor, unconscious.\n          Victor Creed stands above him, staring at the flattened\n          barrel of the baseball bat.\n          f nNTTNITFT)1\n\n          \n\n          \n\n          \n\n          \n\n          80.\n\n          CONTINUED:\n\n          VICTOR CREED\n          Man's got a hard head.\n\n          STRYKER\n\n          (STANDING)\n          Let's go. He'll only be out for a\n          couple minutes.\n          Creed tosses aside the bat and lifts Logan onto his shoulders\n          as easily as a normal man would lift a child of six. He\n          carries Logan out of the room, winking at Kayla.\n\n          INT. RE-EDUCATION CHAMBER, ALKALI LAKE - DAY\n\n          Logan, still unconscious, sits on a chair that looks far too\n          similar to an electric chair, his arms and legs bound with\n          titanium manacles that prevent any movement.\n          The room looks like an execution chamber, complete with a\n          viewing window.\n          He opens his eyes and blinks in the bright light. Stryker and\n          Creed stand in front of him but Logan doesn't look at them.\n          Dr. Cornelius and an ASSISTANT stand near a machine that is\n          wired to the electric chair, fiddling with the controls, but\n          Logan doesn't look at them, either.\n          He stares at Kayla, who cannot meet his eyes.\n\n          LOGAN\n          Who are you?\n\n          KAYLA\n          (very quiet)\n          You know who I am.\n\n          LOGAN\n          No I don't.\n\n          STRYKER\n          She's real, old friend. Your eyes\n          are telling you. Your ears. Your\n          nose.\n          Logan ignores Stryker, staring at the love of his life.\n\n          LOGAN\n          You're dead.\n\n          ('.ONTTNTWD )\n\n          \n\n          \n\n          \n\n          \n\n          81.\n\n          CONTINUED:\n\n          STRYKER\n          I asked you nicely to join the\n          program. And you were so stubborn.\n          But I knew if nothing else could\n          motivate you, revenge would.\n          Stryker smiles at Kayla, a proud professor beaming at his\n          student.\n          STRYKER (cont'd)\n          Tell him. Tell him about the day\n          you died.\n          Kayla, head bowed, is silent for a long count. When she\n          speaks her voice is a strange monotone, devoid of feeling.\n\n          KAYLA\n          They gave me a syringe full of\n          hydrochlorothiazide.\n\n          EXT. ACCESS ROAD - AN EARLIER DAY\n\n          Perhaps the colors are desaturated to let us know that this\n          is a scene we've witnessed before, or thought we did.\n          Kayla sits behind the wheel of her pickup. Victor Creed walks\n          toward her, black talons raking five gashes on the hood.\n          Kayla has been expecting him. She pulls her backpack out from\n          behind the seat and takes from it a hypodermic needle and a\n          plastic IV bag filled with dark blood.\n          Creed tears the truck's door off its hinges and tosses it\n          twenty yards. Kayla injects herself with the hypodermic.\n\n          KAYLA (V.0.)\n          Reduces the heartbeat to almost\n          zero. Breathing virtually stops.\n          Makes you flatline for six minutes.\n          Kayla hops down from the truck. She holds out the IV bag to\n          Victor, who casually pierces it with his claw.\n          KAYLA (V.0.) (cont'd)\n          I'd been drawing my own blood every\n          night for the past week. I had four\n          liters ready that morning.\n          Kayla smears. her own blood on her body and empties the rest\n          of the bag on the pavement. She lies down in the puddle in a\n          fetal position, her breathing already beginning to slow.\n\n          \n\n          \n\n          \n\n          \n\n          82.\n\n          INT. RE-EDUCATION CENTER, ALKALI LAKE - DAY\n\n\n          I\n\n          LOGAN\n          Why? I\n\n          KAYLA -\n           Same as Victor. Stryker gave me a I\n          choice: spend the rest of my life\n          in prison or come work for him.\n\n          LOGAN\n          Prison...\n          Kayla finally raises her head-and looks directly at Logan.\n\n          KAYLA\n          Shot my Daddy when I was eighteen.\n          Big mistake. Should have shot him\n          when I was seventeen.\n\n          LOGAN\n          You told me he died of a heart\n          attack.\n\n          KAYLA\n          Maybe he had a heart attack after I\n          shot him. Sat there and watched him\n          bleed. After what that man did to\n          me, I wish he died slower.\n          Logan stares at her for a long time.\n          KAYLA (cont'd)\n          That sweet little girl you lived\n          with in the cabin? That was all\n          make-believe.\n\n          LOGAN\n          You loved me. I know you loved me.\n          Kayla blinks and looks away.\n\n          KAYLA\n          I'm a good actress.\n\n          LOGAN\n          No one's that good.\n          (C ONTTN1TF.f )\n\n          \n\n          \n\n          \n\n          \n\n          83.\n\n          CONTINUED:\n\n          STRYKER\n          Everybody's a sucker for something.\n          Figuring out what it is, that's the\n          trick. For you, it's a woman's\n          love. An easy weakness to forgive.\n          But still a weakness.\n          Stryker signals to Cornelius. The doctor and his assistant\n          attach a nasty-looking copper halo to Logan's skull. The halo\n          is wired to the electric chair.\n          Logan never takes his eyes off Silverfox.\n          STRYKER (cont'd)\n          Don't be angry at her. She was just\n          serving her country, keeping the\n          mutant menace in check. She and\n          victor have been a real credit to\n          their race.\n          It takes Logan a moment to understand this comment.\n\n          LOGAN\n          You're a mutant?\n\n          KAYLA\n          My Daddy found out when I was\n          twelve. Said a freak like me\n          deserved whatever I got.\n\n          VICTOR CREED\n          My kind of guy.\n\n          STRYKER\n          She's a gifted girl. She can plant\n          thoughts in anyone's mind, make\n          them believe what she wants-- as\n          long as she stays focused on them.\n          He strokes her long dark hair, proud of his protege. Kayla\n          doesn't seem thrilled by Stryker's touch, but she endures it.\n          STRYKER (cont'd)\n          A useful tool in a seduction.\n\n          KAYLA\n          (to Logan)\n          Spent so much time getting you to\n          love me, by the time the Colonel\n          showed up I couldn't get you to\n          leave me.\n          (r0N'rTN1 F.n 1\n\n          \n\n          \n\n          \n\n          \n\n          84.\n\n          CONTINUED: (2)\n          Dr. Cornelius finishes calibrating his machine and adjusting\n          the halo brace.\n\n          CORNELIUS\n          We're good to go.\n\n          STRYKER\n          So, Logan... The truth is, you're a\n          real pain in the ass. But we've\n          invested far too much time and\n          treasure to terminate you. We're\n          starting over.\n          Cornelius checks the digital gauges on the machine.\n\n          CORNELIUS\n          If I've calibrated correctly, we'll\n          leave intact the hard-wired\n          functions, walking and talking, all\n          that good stuff.\n\n          VICTOR CREED\n          You mean I don't get to potty train\n          him?\n\n          CORNELIUS\n          But every memory you've ever had\n          will evaporate. Just like it never\n          happened.\n          Logan never takes his eyes off Kayla, his personal Judas.\n\n          LOGAN\n          Good.\n\n          STRYKER\n          (to Cornelius)\n          Let me know when he's clean. I have\n          to look in on our other guest.\n          Stryker exits the room, followed by Victor.\n\n          LOGAN\n          (to Kayla)\n          That story you told me... about the\n          guy who goes to get flowers for the\n          Moon. I can't get it out of my\n          head. Except I had it all\n          backwards. I thought you were the\n          moon and I was your Wolverine. But\n          you're the Trickster, aren't you?\n\n          (MORE)\n\n          ( ('ONTTNTTF.1))\n\n          \n\n          \n\n          \n\n          \n\n          85.\n\n          CONTINUED: (3)\n          LOGAN (cont'd)\n          And I'm just a schmuck who got\n          played.\n          Kayla is silent for a moment.\n\n          KAYLA\n          My mother told me that story.\n          She takes a deep breath and turns to go.\n          KAYLA (cont'd)\n          It doesn't matter. You won't\n          remember any of this.\n\n          LOGAN\n          You didn't trick me into loving\n          you.\n\n          KAYLA\n          What?\n\n          LOGAN\n          The last two months, you weren't\n          playing around in my skull. You\n          weren't using. your powers on me. I\n          thought you were dead and I loved\n          you more than ever. Maybe it makes\n          you feel better to think it was all\n          fake. But it was never fake for me.\n          Kayla lowers her eyes.\n\n          KAYLA\n          You don't know where I come from.\n          You don't know what it was like.\n\n          LOGAN\n          I know exactly what is was like. I\n          come from there too.\n\n          KAYLA\n          I didn't have a choice.\n\n          LOGAN\n          Course you did. You still do.\n          Kayla stares down at Logan. The tenderness returns to her\n          face. She could free him right now if she wanted.\n          The moment passes and Kayla shakes her head.\n\n          KAYLA\n          I'm sorry.\n          t C()NTTNTTPTI'\n\n          \n\n          \n\n          \n\n          \n\n          86.\n\n          CONTINUED: (4)\n\n          LOGAN\n          Yeah, you keep saying that.\n          (to Cornelius)\n          Come on. Turn on the juice. Let's\n          get this over with.\n\n          CORNELIUS\n          Whenever you're ready, Miss\n          Silverfox.\n          Kayla turns and walks out of the room. Cornelius and his aide\n          follow, shutting the door behind them.\n          Logan takes a deep breath. He looks like a man who is ready\n          to forget everything.\n\n          INT. HOLDING CELL - DAY\n\n          Hines sits alone on a metal cot. The cell door slides open.\n          Stryker and Victor step inside.\n\n          STRYKER\n          Lieutenant. Victor and I were just\n          discussing how to kill you and we\n          thought you might have some\n          suggestions.\n\n          INT. CORRIDOR - CONTINUOUS\n\n          Silverfox steps out of the re-education chamber. She hears\n          voices from the holding cell and approaches.\n\n          STRYKER (O.S.)\n          When the Turks captured a traitor,\n          they strapped a steel basket to the\n          man's stomach. Inside the basket\n          was a rat.\n\n          INT. HOLDING CELL - CONTINUOUS\n\n\n          STRYKER\n          Now, even a rat can't chew through\n          steel. But it can chew through a\n          stomach. So it would. Right through\n          the skin and the fat and the muscle\n          and the intestines, right on out\n          the other side.\n          l CDNTTNi7ET) I\n\n          \n\n          \n\n          \n\n          \n\n          87.\n\n          CONTINUED:\n          Hines looks like she might be sick very soon. Kayla steps\n          into the doorway.\n          STRYKER (cont'd)\n          Victor thinks the Turks were soft,\n          letting the rats do the dirty work.\n          He's looking forward to spending\n          your last night with you.\n\n          HINES\n          Please, Colonel--\n          Stryker pats Hines on the cheek and nods to Victor.\n\n          STRYKER\n          Enjoy yourself.\n\n          HINES\n          Please don't do this... Please!\n          Victor drags the screaming Hines off of her cot. Kayla\n          watches with growing unease but Stryker smiles and- waves\n          goodbye as he turns the key that shuts the cell door.\n\n          INT. RE-EDUCATION CENTER, ALKALI LAKE - DAY\n\n          Logan sits in his electric chair, staring straight ahead,\n          preparing himself for the pain.\n\n          INT. VIEWING ROOM - CONTINUOUS\n\n          Cornelius stands behind the glass viewing window with his\n          ASSISTANT. He puts his hand on a red switch.\n\n          INT. RE-EDUCATION CENTER, ALKALI LAKE - CONTINUOUS\n\n          Thousands of volts surge into Logan's skull, forcing his body\n          to arch. After several seconds the power shuts off. Tendrils\n          of white smoke rise from the copper halo.\n          Logan opens his eyes and stares at Cornelius.\n\n          LOGAN\n          That all you got?\n\n          \n\n          \n\n          \n\n          \n\n          88.\n\n          INT. VIEWING ROOM - CONTINUOUS\n\n\n          CORNELIUS\n          (to his assistant)\n          This could take a while. Raise the\n          amperage by forty percent.\n\n          INT. STRYKER'S OFFICE - DAY\n\n          Stryker signs a memo and hands it to his aide, Collins. Kayla\n          stands by the window, picking at her fingers.\n\n          KAYLA\n          You're going to let Victor kill\n          that woman.\n          Stryker and Collins ignore her.\n          KAYLA (cont'd)\n          When you got me out of prison, you\n          told me we were going to help\n          people.\n          Stryker continues to sign papers, never looking up.\n\n          STRYKER\n          We are. We're saving humanity.\n\n          KAYLA\n          From the mutants?\n          The phone rings. Stryker answers it.\n\n          STRYKER\n          Yes?\n\n          (LISTENING)\n          Good. I'm coming down.\n          (hanging up; to Collins)\n          The Eleven is ready.\n          He stands and heads for the door. Collins follows. In the\n          doorway, Stryker stops and fixes his cold blue gaze on Kayla.\n          STRYKER (cont'd)\n          Don't worry, my sweet. You're one\n          of the good ones. I'll protect you.\n          He and Collins exit the room, leaving Kayla alone with her\n          misery.\n\n          \n\n          \n\n          \n\n          \n\n          89.\n\n          INT. RE-EDUCATION CENTER, ALKALI LAKE - DAY\n\n          Logan sits panting in the chair, gripping the ends of the arm\n          rests with white fingers, waiting for the next surge of\n          electricity. It comes and he arches again, all the muscles in\n          his body contracting, the veins in his neck bulging.\n\n          INT. VIEWING ROOM - CONTINUOUS\n\n          Cornelius and his assistant watch Logan with no detectable\n          sympathy. They turn when Kayla walks into the room.\n\n          KAYLA\n          Is he clean yet?\n          Cornelius and the assistant face front again..\n\n          CORNELIUS\n          He's stronger than I thought. We\n          could be here all night..\n          Kayla watches Logan in his agony. A glimmer of remorse passes\n          over her face.\n\n          KAYLA\n          He was good to me.\n          Cornelius, fiddling with the amperage dial, curls his lips in\n          a sardonic smile.\n\n          CORNELIUS\n          You have a funny way of showing\n          your gratitude.\n          Logan thrashes in his chair. Kayla chews her lip. For a long\n          count she watches Logan suffer.\n\n          KAYLA\n          You should turn it off now.\n          Cornelius turns and stares at her.\n\n          CORNELIUS\n          I should what?\n\n          (BLINKING)\n          Oh. I guess that's... I guess\n          that's a good idea.\n          He turns off the electricity.\n          1coNTTN IRD 1\n\n          \n\n          \n\n          \n\n          \n\n          90.\n\n          CONTINUED:\n\n          KAYLA\n          You two have always hated each\n          other. You should fight.\n          The assistant blinks and begins to scowl, turning toward\n          Cornelius just in time to get punched in the mouth.\n          The two men brawl on the floor with the lack of skill you'd\n          expect from two scientists.\n\n          INT. RE-EDUCATION CENTER - MOMENTS LATER\n\n          Kayla steps into the room. Logan sits slumped motionless in\n          the electric chair. She detaches the copper halo. The skin\n          beneath the metal is singed but it quickly begins to heal.\n          Kayla stares at the man she betrayed, hesitates for a moment\n          and exhales.\n          She unfastens the titanium manacles. Logan is still\n          unconscious. Kayla shakes him gently.\n\n          KAYLA\n          Hey. Wake up.\n          Logan opens his eyes. He is clearly disoriented, as if waking\n          from a long coma. He stares up at Kayla.\n          KAYLA (cont'd)\n          Are you okay?\n          Logan stares at her, groggy and confused.\n          KAYLA (cont'd)\n          Do you understand what I'm saying?\n\n          (BEAT)\n          Do you remember me?\n          In one blinding motion, Logan snatches Kayla by the throat\n          and roughly pulls her to him. She does not resist.\n\n          LOGAN\n          I would have done anything for you.\n\n          KAYLA\n          Please...\n\n          LOGAN\n          Do you hear me? Anything.\n          (r0NTTNTTF.T)1\n\n          \n\n          \n\n          \n\n          \n\n          91.\n\n          CONTINUED:\n\n          KAYLA\n          Please... Creed's killing your\n          friend.\n\n          INT. HOLDING CELL - DAY\n\n          Victor Creed holds Hines against the cell wall with one hand.\n          Her feet kick in the air as she struggles.\n          He splits her blouse down the middle with a long black talon.\n\n          VICTOR CREED\n          I've always had a thing for human\n          chicks. You're all so soft and\n          helpless.\n\n          HINES\n          No...\n\n          VICTOR CREED\n          Maybe it's time I did a little\n          surgery on you, Doctor.\n\n          LOGAN (O.S.)\n          The woman said no.\n          Creed turns his head and sees Logan and Kayla standing in the\n          doorway.\n          He grins and tosses Hines aside. She crashes into the wall\n          and slides to the floor, dazed.\n\n          VICTOR CREED\n          (to Logan)\n          Starting to think you're addicted\n          to pain. You keep coming back for\n          more.\n          Snikt !\n\n          LOGAN\n          This is the end.\n\n          VICTOR CREED\n          Amen to that.\n          Kayla stands in between them, holding up her hands.\n\n          KAYLA\n          Please! We shouldn't be fighting\n          each other. Stryker's using us.\n\n          (CONTTNTIF.T) I\n\n          \n\n          \n\n          \n\n          \n\n          92.\n\n          CONTINUED:\n\n          VICTOR CREED\n          A little late for the Mutant Power\n          crap. We hunt freaks for the man.\n          That's why we're free.\n\n          KAYLA\n          What's he gonna do with us when the\n          other mutants are dead? Put us in a\n          zoo?\n          Creed hesitates, considering the logic of her words. A fanged\n          smile splits his face.\n\n          VICTOR CREED\n          Don't try your head games on me.\n          I've gutted better telepaths than\n          you.\n          Creed rears back to hammer Kayla, a blow that would separate\n          her head from her body.\n          Logan catches Creed's fist inches from Kayla's face.\n\n          LOGAN\n          Time you quit picking on girls.\n\n          VICTOR CREED\n          Oh, I'm happy picking on men.\n          Creed swings at Logan's head, Logan ducks, and the fight\n          begins.\n          This is melee so efficient that no motion is wasted. Every\n          lunge would kill any other adversary. Every parried blow\n          would shatter a normal man's arm.\n          Kayla, bleeding from the nose, staggers to her feet. She\n          helps up Hines and pushes her toward the door.\n\n          KAYLA\n          Get out of here.\n          Hines doesn't have to be told twice. She flees. Creed sees\n          his plaything running out the door. He snarls in frustration.\n\n          VICTOR CREED\n          You're ruining my party.\n          He grabs hold of Logan and hurls him headfirst through the\n          cell wall-- a concrete support wall.\n\n          \n\n          \n\n          \n\n          \n\n          93.\n\n          INT. HALLWAY - CONTINUOUS\n\n          Logan crashes to the floor, covered in rubble. Creed steps\n          out of the cell, licking his fangs.\n          Creed tries to stomp Logan's face, but the smaller man rolls\n          out of the way and gets back on his feet.\n          The mutants battle down the corridor, claws whistling through\n          the air.\n          A team of SENTRIES charge around the corner, wearing tactical\n          armor and carrying XM8 assault rifles. They level their\n          rifles at the battling mutants.\n\n          SENTRY #1\n          Get down! Get down!\n\n          SENTRY #2\n          Down on your knees!\n          Logan and Creed, trying to punch holes in each other, ignore\n          the sentries. Kayla, staring down the barrels of the big\n          guns,. holds up her hands.\n          She concentrates, staring into the sentries' eyes.\n\n          KAYLA\n          We're here as guests of Colonel\n          Stryker.\n          The sentries' hostility shifts into apologetic obeisance.\n\n          SENTRY #1\n          Very sorry about that.\n\n          KAYLA\n          You boys are no longer needed here.\n          Go back to barracks.\n\n          SENTRIES\n          You got it. See ya later. Bye!\n          The sentries wave cheerfully and depart.\n          Creed and Logan are equally skilled, but Creed's superior\n          size and strength begin to wear the smaller man down.\n          Creed slams him into the wall, opening fissures. Holding both\n          of Wolverine's wrists up with one hand, Creed grabs\n          Wolverine's face with his free hand.\n          (CONTTNI IRh )\n\n          \n\n          \n\n          \n\n          \n\n          94.\n\n          CONTINUED:\n          His black claws slide toward Wolverine's eyes.\n\n          VICTOR CREED\n          How you gonna fight without eyes,\n          little man?\n          Logan brings his knee up hard, smashing his adamantium-\n          enhanced kneecap into Creed's groin.\n          The big man groans. Logan spins Creed around, jamming him\n          against the wall. He tries to skewer Creed with the claws of\n          his right hand but Creed moves his head at the last moment.\n          Logan's claws are buried to the hilt-in the wall. He strikes\n          at Creed with his left hand, but Creed dodges again. All six\n          of Logan's claws are deep in the solid rock wall.\n          He brings his hands. together, the adamantium blades slicing\n          through granite as if it were cheesecake.\n          Creed ducks under the claws an instant before they shred him.\n          He grabs Logan in a-bear hug.\n          A large section of the wall behind them falls out, and,\n          unable to halt their momentum, Logan and Creed tumble through\n          the hole, disappearing from sight.\n          Kayla runs over and stands at the jagged precipice, looking\n          out onto the gargantuan Weapon XI cavern.\n\n          INT. WEAPON XI FACILITY - CONTINUOUS\n\n          Logan and Creed fall seventy feet, clawing at each other in\n          mid-air.\n          Logan hits the floor hard, the impact blasting a small crater\n          in the concrete.\n          Creed manages a rolling fall, cat-quick and dexterous.\n\n          CUT TO:\n          Stryker stands on the raised podium in the center of the\n          cavern, overlooking his vast, sleeping army. He cannot\n          believe what he's seeing.\n\n          STRYKER\n          (to Lead Technician)\n          I want the Eleven combat ready.\n          (cnNTTNIIF.T)1\n\n          \n\n          \n\n          \n\n          \n\n          95.\n\n          CONTINUED:\n\n          LEAD TECHNICIAN\n          We can't rush them,.sir. They've\n          been in stasis for--\n\n          STRYKER\n          I want them ready!\n          The Lead Technician flinches and barks orders to his\n          subordinates, who enter commands into their computers.\n          The lids of ten thousand isolation tanks slide open. As the\n          camera roams among the Eleven, needles and hoses detach from\n          their bodies, releasing their metallic grip.\n          The cloned Creeds begin to stir in their stainless steel\n          coffins.\n\n          CUT TO:\n          Creed pounces on Logan, who is still severely injured from\n          the fall. Creed tears into the smaller man mercilessly,\n          slinging him around the cavern, gouging him with his black\n          talons.\n          Creed batters Logan with a series of savage blows. Logan\n          falls, his healing factor overwhelmed, barely conscious.\n          Creed plants one heavy black boot on Logan's face and presses\n          down hard. He leers at his defeated foe.\n\n          VICTOR CREED\n          Your pal Wraith pissed all over my\n          boots when I crushed his spine.\n          Smell like fear, don't they?\n          Something changes within Logan, a fury so overwhelming it\n          cannot be contained, a rage so vast it could only be called\n          berserker.\n          .Logan rolls toward his tormentor, sweeping his claws straight\n          through Creed's ankle, severing the foot.\n          Creed screams and falls to his knees.\n          Logan stands, grabbing a handful of Creed's dirty blonde\n          hair.\n\n          LOGAN\n          This is for the ones who couldn't\n          fight back.\n\n          ((`ONTTNTIRT) )\n\n          \n\n          \n\n          \n\n          \n\n          96.\n\n          CONTINUED: (2)\n          The adamantium blades are a silver blur in the overhead\n          light.\n\n          CUT TO:\n          Stryker, standing on the podium, sees his chief henchman's\n          head tumble from his shoulders. He grits his teeth and\n          surveys his army.\n          Ten thousand enhanced warriors begin to step out of their\n          steel coffins, baring their fangs, eyeing their surroundings.\n\n          STRYKER\n          (to the Lead Technician)\n          Activate the PA system.\n          The Lead Technicians flips a switch. Stryker speaks into a\n          microphone; his voice booms from speakers mounted on the\n          pillars throughout the cavern.\n          STRYKER (c.ont'd)\n          Soldiers!\n          The Eleven snap to attention with machined synchronicity, all\n          ten thousand facing Stryker.\n\n          CUT TO:\n          Logan, bloodied but healing, stares down at his fallen enemy.\n\n          KAYLA (O.S.)\n          Logan!\n          Kayla runs down one of the steel staircases that clings to\n          the cavern wall like fire escapes.\n          KAYLA (cont'd)\n          If we get closer to Stryker, I can\n          work my magic.\n          Logan stares at Stryker, his true enemy, the.man who\n          destroyed his life. Ten thousand clones. encircle Stryker, who\n          stands on the raised podium in the cavern's center.\n\n          LOGAN\n          I don't want him hypnotized. I want\n          him dead.\n          Never taking his eyes off his enemy, Logan advances.\n\n          CUT TO:\n          I c_0NTTNTTF:T)1.\n\n          \n\n          \n\n          \n\n          \n\n          97.\n\n          CONTINUED: (3)\n          Stryker sees Logan walking toward him, toward the hordes of\n          clones. Stryker shakes his head and smiles.\n\n          STRYKER\n          The man's committing suicide.\n          He leans into the microphone. The Eleven listen to their\n          commander's voice, amplified by hundreds of speakers\n          STRYKER (cont'd)\n          No army that ever marched could\n          stand against you! You will never\n          abandon your mission, and your\n          mission is simple! Kill the\n          mutants! Kill them wherever you\n          find them!\n          Stryker points at Logan.\n          STRYKER (cont'd)\n\n          THIS IS YOUR FIRST ENEMY!\n          Ten thousand cloned murderers turn on Logan, soulless black\n          eyes focusing on their target.\n          Logan stops his march beside one of the massive steel pillars.\n          that supports the cavern ceiling.\n\n          LOGAN\n          (to Kayla)\n          Get the hell out of here.\n\n          KAYLA\n          What are you doing?\n\n          LOGAN\n          Bringin' down the house.\n          He sweeps his claws clean through the pillar, at an angle.\n          The uppermost section shears off and drills into the floor\n          with a concussive whump that spiderwebs the concrete for\n          thirty feet around the impact site.\n          Stryker realizes what Logan is doing.\n\n          STRYKER\n\n          ATTACK! ATTACK!\n          The Eleven charge. From above we can see the full-scale of\n          the onslaught, wave upon wave of cloned murderers closing in.\n          (CENTTN11FTl'\n\n          \n\n          \n\n          \n\n          \n\n          98.\n\n          CONTINUED: (4)\n          Logan runs to the next pillar and slices through it. Creaks\n          and groans sound overhead, as the tremendous weight above\n          exerts pressure on the remaining weight-bearing supports.\n          Most of the ten thousand can't get close to Logan, but they\n          all want in on the first kill.\n          Whirling, slashing, stabbing, kicking, Logan scythes a circle\n          of devastation, spray-painting the floor with the black blood\n          of the Eleven.\n          He reaches a third pillar and chops through it.\n          Kayla eyes the ceiling nervously and hurries toward the exit.\n          STRYKER (cont'd)\n\n          STOP HIM, YOU IDIOTS! STOP HIM!\n          Even Logan can't hold back the tide for long. Talons rake his\n          face, his arms, his chest. But still he battles, slicing\n          through a fourth pillar, a fifth.\n          Tremendous fissures split the rock ceiling. Dust and rocks\n          fall onto the cavern floor as the fissures widen.\n          Logan sees that the cavern's collapse is imminent. He can no\n          longer hold off the Eleven's assault.\n          An instant before the clones can shred him, he jumps, using\n          his claws to scale one of the still-standing steel pillars\n          with the grace and speed of a leopard climbing a tree.\n          One of the clones follows, using his black talons in the same\n          fashion, grabbing at Logan's feet.\n          When Logan is forty feet above the throng of teeth-gnashing\n          clones, he severs the pillar below his feet. The clone\n          chasing him can climb no farther, can do nothing but roar and\n          hiss at his escaping prey.\n          Logan swings himself onto the steel staircase, where Kayla\n          waits beside the open door. He races up the stairs.\n          Stryker sees his dream in ruins. He runs for the nearest\n          exit.\n          Kayla and Logan are a few feet from the door, from safety,\n          when the cavern ceiling gives out. Thousands of tons of stone\n          and steel come crashing down.\n          Logan grabs Kayla and hauls her to safety an instant before\n          she would be crushed.\n\n          \n\n          \n\n          \n\n          \n\n          99.\n\n          EXT. ALKALI LAKE - DAY\n\n          The compound has essentially imploded, the major structures\n          falling into the massive pit created by the cavern's\n          collapse.\n          Severed gas lines and ruptured boilers have turned the crater\n          into a raging fire pit. Smoke billows up from the molten\n          core.\n          A few dazed survivors, SOLDIERS and SCIENTISTS, have escaped\n          the carnage, but Alkali Lake no longer exists as a military\n          base. Thousands of singed documents flutter in the wind.\n          Logan and Kayla walk away from the burning crater, never\n          looking back. They head through the woods toward the lake\n          that glitters in the sunlight.\n\n          KAYLA\n          One of them could have survived.\n          Logan glances at her.\n          KAYLA (cont'd)\n          The clones. They've got your\n          healing factor.\n          Logan looks back at the devastation.\n\n          LOGAN\n          Unless someone comes along who can\n          move a few million tons of steel,\n          they ain't going anywhere.\n\n          EXT. ALKALI LAKE - LATER\n\n          They stop at the edge of the lake. Paper from the destroyed\n          base drifts through the air, falling on the water and the\n          shore.\n\n          LOGAN\n          Almost looks peaceful from here.\n\n          KAYLA\n          There's something I want you to\n          know.\n          He looks at her.\n          (CONTTNt1F.fl\n\n          \n\n          \n\n          \n\n          \n\n          CONTINUED:\n          KAYLA (cont'd)\n          Maybe nothing I say matters\n          anymore. But I'm going to say it\n          anyway. I...\n          A blossom of blood opens up on her chest. She stares down at\n          it in wonder before sinking to her knees.\n          Logan turns and sees Stryker walking toward them.\n          KAYLA (cont'd)\n          No...\n          Stryker fires again. The adamantium bullet rips through\n          Logan's forehead with an unholy sound.\n          Logan falls to the ground. Stryker stands above him and fires\n          another bullet into Logan's head.\n          Stryker turns the gun on Kayla.\n          KAYLA (cont'd)\n          You don't need to waste another\n          bullet. I'm already dead.\n          Stryker blinks and hesitates. Kayla coughs, her strength\n          beginning to fade.\n          KAYLA (cont'd)\n          Maybe you should turn that gun on\n          yourself, Colonel.\n          Stryker nods, pointing the gun at his own head.\n          KAYLA (cont'd)\n          It would be good for the mutants if\n          I made you pull the trigger..\n\n          (BEAT)\n          Why do you hate us so much?\n          Stryker's finger trembles on the trigger.\n          KAYLA (cont'd)\n          Is it because your son is one of\n          us?\n          For the first time, perhaps, we see something human in the\n          cold blue of Stryker's eyes.\n          KAYLA (cont'd)\n          Enough killing, Colonel. Throw your\n          gun in the lake.\n          r (-nNTTNTTFT)1\n\n          \n\n          \n\n          \n\n          \n\n          101.\n\n          CONTINUED: (2)\n          Stryker does as he's told. The revolver sinks into the water.\n          KAYLA (cont'd)\n          Leave us. Keep walking till your\n          feet start to bleed.\n          Stryker turns and walks away.\n          Kayla crawls over to Logan. She lifts his head onto her lap.\n          He's unconscious but breathing. The bullet holes in his skin\n          have already healed. She strokes his jaw. and smiles sadly.\n          One of the scraps of paper from the base blows against her\n          leg. She takes it and looks down at the blank page.\n          She has no pen. She touches her chest, just above her heart,\n          wetting her finger with her blood.\n          She writes four words on the page, blows on it to dry it,\n          folds it once and places it in Logan's hand.\n          She kisses his lips and rests his head gently on the ground.\n          Fighting the pain, a dying woman, Kayla manages to stand.\n          KAYLA (cont'd)\n          If you ever remember what I did to\n          you, try to forgive me. I was a\n          fool. And you were right... I\n          always loved you.\n          She turns and walks toward the lake, never looking back,\n          never hesitating as the waters rise above her knees, above\n          her waist, above her shoulders, above her head.\n\n          EXT. ALKALI LAKE - SUNSET\n\n          Logan's eyes flutter and open. For a moment he squints into\n          the blue sky.\n          He sits up, looking around. The woods are empty.\n          He stands, completely disoriented, a stranger in the world.\n          He realizes that he's holding a piece of paper in his hand.\n          He unfolds it and reads the message written in blood.\n          You are my Wolverine.\n          He stares at it for a moment before folding it carefully and\n          putting it in his pocket.\n          f C ONTTNIIRD)\n\n          \n\n          \n\n          \n\n          \n\n          102.\n\n          CONTINUED:\n          He takes a deep breath of cold air and walks west, toward the\n          falling sun.\n          He doesn't know who he is. He doesn't know where he's going.\n          But the wind blows through his hair, the last of the sunlight\n          feels good on his skin. He is a free man.\n          He walks toward his destiny..\n\n\n\n\n                                 THE END\n\n\n\n\n\n\n\nX-Men Origins: Wolverine\nWriters :   David Benioff  Skip Woods\nGenres :   Action  Fantasy  Sci-Fi  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:39:07.477424"}