{"title": "xXx", "film_link": "/Movie Scripts/xXx Script.html", "script_link": "/scripts/xXx.html", "info_raw": "\n\nxXx Script\n\n\n\n\nIMSDb opinion  None available\nIMSDb rating  Not available\nAverage user rating   (3.00 out of 10)\n\n\n(adsbygoogle = window.adsbygoogle || []).push({});\n\nWriters  Rich Wilkes\nGenres  Action  Adventure  Thriller\nScript Date : August 2001\n\nRead \"xXx\" Script\n\n\n", "script": "\n                                          \"xXx\"\n\n                                            by\n\n                                       Rich Wilkes\n\n                                     August 26, 2001\n\n                                       Third Draft\n\n                \n\n               FADE IN:\n\n               EXT. PRAGUE - NIGHT\n\n               On a hill above the city is an old CATHEDRAL. The night is \n               spooky, with harsh shadows playing across the cobblestones \n               and medieval walls.\n\n               A NERVOUS YOUNG HACKER makes his way down an alley.\n\n               There is a DOOR at the end of the alley. MUSIC can be faintly \n               heard from inside.\n\n               EXT. ROOFTOP - NIGHT\n\n               High above the street an INTRUDER DRESSED ALL IN BLACK spies \n               from the roof. He's watching with NIGHT VISION GOGGLES.\n\n               He pulls out a CROSSBOW and FIRES.\n\n               A BOLT flies, trailing CABLE.\n\n               THUNK! It sticks into the alley wall below.\n\n               EXT. THE ALLEY - NIGHT\n\n               As he passes by the ominous Cathedral, the Hacker spins, \n               sure he's heard something.\n\n               But there's nothing there. He continues on.\n\n               Then the Intruder comes sliding down the ZIP-LINE from above.\n\n               WHAM! He kicks the Hacker into the wall, knocking him out.\n\n               The Intruder pulls off his mask, revealing the chiseled \n               features of a dashing BRITISH SECRET AGENT. His name is \n               STERLING.\n\n                                     STERLING\n                         I hate to drop in unexpectedly.\n\n               Sterling searches the Hacker and pulls a SMALL BLACK CASE \n               from his coat. Inside the case is a DATA CHIP. Sterling tucks \n               it away.\n\n               Sterling unzips his black jumpsuit, revealing a crisp TUXEDO \n               underneath. He pulls out CAR KEYS. In a quick insert we see \n               the \"ASTON-MARTIN\" LOGO.\n\n               As he strolls back out the alley, he HEARS something and \n               flattens against the wall.\n\n               A BLACKED OUT SUV screeches to a stop, blocking his exit.\n\n               The SUV's HEADLIGHTS illuminate the slumped Hacker.\n\n               BAD GUYS get out to investigate, pulling out weapons.\n\n               Cornered, Sterling heads deeper into the alley, staying in \n               the shadows. He gets to that DOOR the Hacker was heading \n               towards.\n\n               As he PICKS THE LOCK Sterling can hear MUSIC from inside. He \n               smooths his hair and prepares to \"blend in\" with the crowd.\n\n               INT. CONCERT HALL - NIGHT\n\n               Sterling comes through the door and his face falls. He's \n               stepped into a loud METAL CONCERT.\n\n               We see a GO-GO DANCER in LATEX. Onstage is RAMMSTEIN, a \n               bizarre German industrial-metal band.\n\n               The tattooed YOUNG CROWD slam dances and swings glo-stix \n               over their heads. Some wear rubber BRAIN SKULLCAPS outfitted \n               with fiber optic lights. It's a sea of SPIKED HAIR and BONDAGE \n               OUTFITS.\n\n               Sterling squares his jaw and starts pushing through the crowd. \n               With his tuxedo he sticks out like a penguin in a chicken \n               coop.\n\n               ON THE BALCONY ABOVE THE CROWD stands a wild haired young \n               GANGSTER with PIERCED BROWS. With him is a STREET-TOUGH GIRL \n               with multi-colored hair. They look like a post-Apocalyptic \n               Bonnie & Clyde. They are YORGI and PETRA.\n\n               Yorgi checks his watch. His delivery is late. Then his CELL \n               PHONE rings. He's getting the news from outside.\n\n               He looks down, spots Sterling amidst the moshing crowd. With \n               that look, that tux, there's no mistaking what he is.\n\n               They make EYE CONTACT and Sterling gives a little nod.\n\n               Yorgi calmly issues orders into his phone.\n\n               Immediately VIKTOR starts moving in Sterling's direction.\n\n               Viktor is huge, with a MOHAWK and a six-inch GOATEE.\n\n               Sterling sees him advancing and makes for the exit, pushing \n               through the freaky crowd.\n\n               EXT. CONCERT HALL - NIGHT\n\n               Sterling's ASTON-MARTIN VANTAGE screeches away from the curb.\n\n               INT. ASTON-MARTIN - MOVING - NIGHT\n\n               Sterling is at the wheel of his spy car. He plugs the DATA \n               CHIP into the dash and punches buttons. A computer screen \n               says \"DATA DOWNLOADING\".\n\n               He sees a BLACKED-OUT SUV racing up behind him.\n\n               He accelerates and hits a SWITCH.\n\n               ARMORED PLATING slides up over the rear window.\n\n               EXT. COBBLESTONE STREET - NIGHT\n\n               The SUV is right behind him. Viktor rolls down the passenger \n               window, readies his PISTOL.\n\n               The rear bumper of the spy car opens. SMOKE BOMBS drop out.\n\n               They explode in MASSIVE CLOUDS, obscuring the narrow, street.\n\n               Sterling skids around a corner.\n\n               The blinded bad guys drive straight into a STOREFRONT. Glass \n               and merchandise flies as the SUV gets stuck.\n\n               The Aston-Martin rounds another corner and slides to a stop.\n\n               Blocking the road ahead are two more SUV's.\n\n               A MOTORCYCLE slides to a stop in front of them. The rider is \n               ANDERS, a leather clad biker who looks half Viking.\n\n               Anders pulls out a SILENCED SUB-MACHINE GUN and starts \n               BLASTING.\n\n               BULLETS SLAM into the Aston-Martin, cracking the bullet-proof \n               glass, shattering headlights, and BLOWING OUT THE FRONT TIRES!\n\n               Sterling jams it into reverse and backs around the corner on \n               the RIMS.\n\n               INT. ASTON-MARTIN - IDLING - NIGHT\n\n               Sterling notices an ERROR MESSAGE now flashing on his computer \n               screen: \"TRANSMISSION ERROR: - DATA PARTIALLY SENT\".\n\n               Sterling looks around desperately. Somehow he's got to get \n               this data out of here.\n\n               Straight ahead is the RIVER. Chugging up the river: a PARTY \n               BARGE.\n\n               PARTYGOERS in formal attire dance to an orchestra. A SWIMMING \n               POOL is in the middle of the deck for a perfect water landing.\n\n                                     STERLING\n                         Time for a slow boat to China.\n\n               He hits a BUTTON.\n\n               EXT. COBBLESTONE STREET - NIGHT\n\n               The rear license plate folds down, revealing a ROCKET ENGINE.\n\n               Flames spew as he jams down the accelerator.\n\n               Sterling is pushed back into his seat by the G-forces.\n\n               SPARKS fly from the rims as he skips across the pavement at \n               ever increasing speed.\n\n               Anders FIRES with his gun, but Sterling is getting away!\n\n               But then KIRILL steps around the corner. He's academic \n               looking, a CHAIN SMOKING intellectual with COKE-BOTTLE \n               GLASSES. He's also a highly proficient and cold-blooded \n               SNIPER.\n\n               Kirill puts his lit cigarette behind his ear and unslings a \n               SURFACE-TO-AIR MISSILE LAUNCHER from his shoulder.\n\n               The Aston-Martin reaches the riverbank and goes AIRBORNE. It \n               ROCKETS through the air towards the party barge.\n\n               We see the car REFLECTED in Kirill's glasses as he AIMS.\n\n               On a little SCREEN we see the missile launcher HOME IN on \n               the HEAT SOURCE of the jet engine.\n\n               The missile locks-in and FIRES...\n\n               HEATSEEKER P.O.V. - we see a GREEN CAR with all its hot spots \n               GLOWING RED. Camera ROARS towards the flying car.\n\n               INT. ASTON-MARTIN - FLYING - NIGHT\n\n               Sterling sees the missile streaking at him.\n\n                                     STERLING\n                         Oh bloody hell!\n\n               EXT. THE RIVER - NIGKT\n\n               WHOOMPH! The Aston-Martin EXPLODES in mid-air.\n\n               Partygoers shriek as the AXLE and FLAMING RIMS rain down on \n               the deck.\n\n               Kirill takes the cigarette from his ear, PUFFS IT.\n\n               Finally, Sterling's flaming BOW TIE flutters down and lands \n               on a LEAPING SALMON ICE-SCULPTURE above a tantalizing SEAFOOD \n               BUFFET.\n\n                                                                    CUT TO:\n\n               EXT. WASHINGTON D.C.\n\n               A STRAFING SHOT over the city. We make a sudden left turn \n               and SPEED OUT OF TOWN.\n\n               We shoot over to the BLUE RIDGE MOUNTAINS of VIRGINIA. In \n               the middle of NOWHERE we dive towards a COMPLEX OF BLACK \n               BUILDINGS.\n\n               INT. UNDERGROUND HEADQUARTERS - HALLWAY - NIGHT\n\n               Inside it's modern, cold and high tech. An elevator COUNTS \n               DOWN to a deep basement level.\n\n               The doors open and a TALL MAN man with a PROSTHETIC LEG \n               strides down the empty hall. AGENT GIBBONS is African-\n               American, a battle-scarred WARRIOR. Even with a limp he looks \n               sturdy, confident, deadly.\n\n               At the end of the hall is a METAL DOOR.\n\n               INT. ULTIMATE INFORMATION ROOM - NIGHT\n\n               Gibbons walks into the INFORMATION ROOM of the NATIONAL \n               SECURITY AGENCY (NSA). There are WORLD MAPS, SATELLITE IMAGES \n               on COMPUTER SCREENS, TECHIES monitoring everything.\n\n               If a nuclear war broke out, you could run the country from \n               down here.\n\n               Gibbons takes an elevator up.\n\n               INT. SAM TANNICK'S OFFICE - NIGHT\n\n               The office is expensive yet devoid of personality, reflecting \n               the shadowy nature of it's owner. One wall is GLASS, looking \n               down on the information room. SAM TANNICK, grizzled NSA chief, \n               looks down at the activity below.\n\n                                     SAM TANNICK\n                         Come.\n\n               Gibbons enters, stands by the desk.\n\n                                     GIBBONS\n                         Evening, Sam.\n\n               Sam remains in shadow.\n\n                                     SAM TANNICK\n                         What do you have?\n\n                                     GIBBONS\n                         Not a whole helluva lot. His final \n                         transmission was mangled. About \n                         something or someone called \"Ahab\". \n                         Whatever it is, it cost him his life.\n\n                                     SAM TANNICK\n                         He was the best there was. That makes \n                         three agents lost.\n\n                                     GIBBONS\n                         They're ruthless and they have a lot \n                         of firepower. It's only a matter of \n                         time before they figure out how to \n                         deploy Silent Night. Then we're gonna \n                         have a catastrophe on our hands.\n\n                                     SAM TANNICK\n                         Silent Night in the hands of a bunch \n                         of impertinent cowboys\n\n                                     GIBBONS\n                         We're gonna have to step in, Sam. \n                         Those CIA boys couldn't find a clown \n                         in a field of cactus. Let me take \n                         care of it.\n\n                                     SAM TANNICK\n                         How will you fix it?\n\n                                     GIBBONS\n                         I'll go in with a team. But first \n                         I'm going to need some intel. I'll \n                         have to put someone inside, someone \n                         new, someone they won't see coming. \n                         One of their own.\n\n                                     SAM TANNICK\n                         So you'll dredge the bottom again. \n                         You've done that before. The results \n                         were... uneven.\n\n                                     GIBBONS\n                         You wanna find out about rats, ask a \n                         rat. I've had my people put together \n                         a talent pool. I downloaded it to \n                         your desktop.\n\n               Gibbons snaps on the giant FLATSCREEN on Sam's desk. He starts \n               cycling through PHOTO AFTER PHOTO of TOUGH LOOKING MEN.\n\n                                     GIBBONS\n                         The usual prospects. Convicts, \n                         contract killers, murde...\n\n                                     SAM TANNICK\n                         The scum of the Earth.\n\n                                     GIBBONS\n                         But programmable. And expendable.\n\n                                     SAM TANNICK\n                         I've seen enough. Turn it off.\n\n               Gibbons clicks off the screen.\n\n                                     SAM TANNICK\n                         They're degenerates. There's not a \n                         man in there that would give a damn \n                         if the Chinese took over.\n\n                                     GIBBONS\n                         That's exactly why we need them.\n\n               Sam sighs, stares out at the information room.\n\n                                     SAM TANNICK\n                         Get these \"scum\", Mr. Gibbons, bring \n                         them in. Test them. Train them. Find \n                         your man.\n\n                                                                    CUT TO:\n\n               EXT. SKYSCRAPER - DOWNTOWN LA - NIGHT\n\n               The huge ARCO TOWER rises up towards a moonlit sky.\n\n               We see ACCOMPLICE #1 (TRAVIS PASTRANA) sneak up and take \n               position behind a FOUNTAIN.\n\n               ACCOMPLICE #2 (CAREY HART) sneaks across a roof and takes \n               position overlooking the fountain position of #1.\n\n               ACCOMPLICE #3 (DAVE MIRRA) takes up position in the second \n               story window of a FLOPHOUSE HOTEL down the street.\n\n               A MESSENGER (BOB BURNQUIST) skates up to the front of the \n               skyscraper with a PACKAGE. He gets the attention of the \n               SECURITY GUARD inside. The Security Guard unlocks the door \n               and lets him in.\n\n               Just then a VAN pulls up and ACCOMPLICES #4 (SHAUN PALMER) \n               and #5 (MAT HOFFMAN) hop out. They open up the back and a \n               BICYCLE is rolled out of the back by a MAN IN A HOODED JACKET.\n\n               Jacket Man rolls the bike to the skyscraper and enters the \n               lobby.\n\n               INT. SKYSCRAPER LOBBY - NIGHT\n\n               The Security Guard is checking his computer.\n\n                                     SECURITY GUARD\n                         Crump... I'm sorry, no one by that \n                         name.\n\n               K The Guard glances up as Jacket Man gets into an ELEVATOR.\n\n                                     SECURITY GUARD\n                         Hey! You can't go up there!\n\n               The Security Guard rushes to intercept him. The Messenger \n               kicks his skateboard out, TRIPPING UP the Security Guard.\n\n               The Messenger hauls ass out the door. The Security Guard \n               pulls out his WALKIE-TALKIE.\n\n                                     SECURITY GUARD\n                         We've got an intruder in the express \n                         elevator!\n\n               INT. ELEVATOR - NIGHT\n\n               The button for \"91 - ROOF ACCESS\" is lit up. Jacket Man waits \n               patiently.\n\n               INT. 91ST FLOOR - NIGHT\n\n               This fancy office is empty for the night. The STAIRWELL DOOR \n               opens and a PLATOON of SECURITY GUARDS rushes in. They take \n               Up position in front of the elevator doors armed with BILLY \n               CLUBS and TASERS.\n\n               DING! The elevator arrives and the door swings open. But \n               there's NOBODY INSIDE.\n\n               One Guard steps forward and suddenly a bicycle SWINGS DOWN \n               from the ceiling, TAGGING HIM IN THE FACE. He falls back, \n               TASERING another Guard.\n\n               Jacket Man drops down onto his bike and pedals through the \n               chaos before the Guards know what hit them. There's a CURVY \n               PIECE OF ART in the room, some kind of modern art statue.\n\n               Jacket Man rides up the artwork like a ramp and does a \n               TABLETOP AERIAL over a DIVIDER. He hits the ground pedalling, \n               the Guards hot after him.\n\n               Jacket Man enters a HUGE OPEN ROOM with a FIELD OF CUBICLES \n               in the middle. He bunny hops onto a desk and SLIDES TO A \n               STOP. He tosses back his hood and we get a good look at him \n               for the first time.\n\n               He is XANDER CAGE. He's got a shaved head, bizarre TATTOOS \n               all over his body and multiple PIERCINGS. He's lean and \n               heavily cut, even dangerous looking.\n\n               The Guards charge at him and he HOPS up onto the top of the \n               CUBICLE WALL. This thing is maybe FOUR INCHES WIDE and FIVE \n               FEET TALL.\n\n               He pedals across the top of the cubicle wall, the Guards \n               scrambling after him.\n\n               Xander bunny hops over one guy's head onto the next set of \n               cubicles and pedals hard. The Guards fall all over themselves \n               trying to catch him.\n\n               At the other end Xander catches air and lands on a CONFERENCE \n               TABLE. He does a WHEELIE across it's length with Guards \n               closing in.\n\n               Xander springs up and does a TAIL WHIP, knocking them back \n               with his rear wheel. He lands and pedals to the stairwell \n               untouched.\n\n               EXT. THE ROOF - NIGHT\n\n               Xander bursts out of the stairwell to the top of the TALLEST \n               BUILDING IN DOWNTOWN LA. He climbs on a RAISED PLATFORM.\n\n               From here he can drop down onto another level that is strewn \n               with SATELLITE DISHES and MICROWAVE RELAYS.\n\n               Guards rush onto the roof and try to corral him.\n\n               Xander tears off his jacket, revealing a BACKPACK on his \n               back and VIDEO CAMERA on his chest. He pulls out a ROAD FLARE \n               and SPARKS IT. We see there are SOAKED RAGS tied to his \n               SPOKES.\n\n               He LIGHTS THEM with the flare. Then he TOSSES THE FLARE off \n               the building.\n\n               EXT. STREET LEVEL - NIGHT\n\n               The Accomplices see the flare drop. #'s 1, 2 & 3 pull CAMERAS \n               OUT and start filming.\n\n               EXT. THE ROOF - NIGHT\n\n               Xander races around the roof like a trapped animal. He evades \n               Security Guards, picking up speed.\n\n               With Guards right behind, he drops off the TOP PLATFORM and \n               lands on a massive SATELLITE DISH.\n\n               Using the dish as a ramp, Xander LAUNCHES himself OFF THE \n               TOP OF THE BUILDING. We're talking 90 some stories here.\n\n               He spins through the air, his bike on fire. He's doing end \n               over end backflips. One... Two... Three... Four...\n\n               He's looping through space on his bike, a crazy man on a \n               flaming bike against a backdrop of sleek skyscrapers and \n               night lights.\n\n               The stunt is covered by the various Accomplices and Xander's \n               own chest camera, in SUPER 8 and DIGITAL VIDEO, from four \n               different angles.\n\n               Xander ditches the bike, kicking it away from him and plummets \n               towards the ground.\n\n               At the last moment he throws out a \"bucket\" and his PARACHUTE \n               OPENS.\n\n               EXT. STREET LEVEL - NIGHT\n\n               The bicycle comes flying down and SMASHES into the pavement.\n\n               It bounces a full TWO STORIES back up before coming to rest.\n\n               Xander glides down and makes his landing. Accomplices #4 and \n               #5 rush out to help him gather up his chute and jump in the \n               van. SIRENS APPROACH as the van makes it's escape.\n\n               As COP CARS screech up to the skyscraper, one of them RUNS \n               OVER the smoking wreckage of the bike.\n\n                                                                   SLAM TO:\n\n               TITLE SEQUENCE - HARDCORE MUSIC plays as we see a flowing \n               TAPESTRY OF FLORID TATTOOS. SILHOUETTED against this backdrop \n               we see the OUTLINES of NUDE WOMEN riding BMX BIKES in a HALF-\n               PIPE, BLADING ever obstacles, SKY SURFING and doing street \n               SKATE TRICKS. It's a collision of outlandish imagery that \n               tells you one thing: This ain't your daddy's spy movie.\n\n                                                               DISSOLVE TO:\n\n               EXT. CITY STREETS - NIGHT\n\n               Xander, now on a MOTORCYCLE, zips through traffic. He's \n               smiling, leaning it way over on the turns. He's got another \n               BACKPACK on his back.\n\n               EXT. LOFT DISTRICT - DOWNTOWN - NIGHT\n\n               Xander drives his motorcycle into the garage of his building.\n\n               INT. XANDER'S LOFT APARTMENT - NIGHT\n\n               A FREIGHT ELEVATOR rises up, bringing Xander and his \n               motorcycle into the loft.\n\n               There are EXTREME SPORTS ACTION POSTERS on the walls, \n               MOTORCYCLE PARTS and BARBELLS on the floor, and everywhere \n               there's EXTREME SPORTS EQUIPMENT of every description.\n\n                                     XANDER\n                         Sky, you there? Start packin' cause \n                         we are out of here!\n\n               There's a NEATLY FOLDED FLAG hanging in a slightly crooked \n               FRAME on the wall. Xander straightens it as he goes by.\n\n               He hears her in the sectioned off \"bedroom\" and heads back \n               there.\n\n                                     XANDER\n                         Did I promise you a fat vacation or \n                         what? Get ready to get down in \n                         paradise.\n\n               He comes into the bedroom to find SKY, his long-suffering \n               girlfriend. She's a wannabe artist type. She's got SUITCASES \n               and BOXES scattered around and she's PACKING.\n\n                                     XANDER\n                         Hey, you don't need all this just to \n                         go on vacation. Unless this ain't \n                         for going on vacation...\n\n                                     SKY\n                         I'm through, Xander.\n\n                                     XANDER\n                         I can see that. Why?\n\n                                     SKY\n                         You run around with maniacs jumping \n                         motorcycles in the desert, you break \n                         36 bones crashing wave runners and \n                         snowboarding off cliffs, all with no \n                         health insurance... It's insane, I \n                         can't take it anymore.\n\n                                     XANDER\n                         I'm having fun, what's the problem?\n\n                                     SKY\n                         You have all this talent, and you \n                         waste it. You won't take a single \n                         endorsement deal. Meanwhile those \n                         other guys have their own video games! \n                         But no, you've got too much \n                         \"integrity\" for that.\n\n                                     XANDER\n                         I don't wanna go mersh, you know \n                         that. But hey, if this is about \n                         money...\n\n               He opens up the backpack, revealing WADS OF CASH.\n\n                                     XANDER\n                         I got an advance on the next bootleg. \n                         Let's get out of here, just you and \n                         me. We'll chill out in Bora Bora for \n                         a couple months.\n\n               She sorts through the money.\n\n                                     SKY\n                         French Polynesia? This wouldn't last \n                         us a week in a cheap hotel. Do you \n                         know how expensive it is down there?\n\n                                     XANDER\n                         Alright, so I'll get more.\n\n                                     SKY\n                         It's not about the money, X! You \n                         never plan for anything. I can't \n                         live like that anymore, I need some \n                         stability.\n\n                                     XANDER\n                         Well if you're bailing, I guess I'd \n                         better give you your surprise now.\n\n               He pulls off his shirt. Pierced through his nipple is a \n               DIAMOND ENGAGEMENT RING.\n\n                                     SKY\n                         What...?\n\n                                     XANDER\n                         I was gonna wait till the islands, \n                         but...\n\n                                     SKY\n                         You're serious?\n\n                                     XANDER\n                         Of course I'm serious. I bought it, \n                         didn't I?\n\n                                     SKY\n                              (shakes her head)\n                         This is so typical. I can't believe \n                         you. I've barely seen you for the \n                         last three weeks and now this? Are \n                         you out of your mind?\n\n                                     XANDER\n                         I don't know. I thought this is what \n                         you wanted. You want stability, here \n                         it is.\n\n                                     SKY\n                         You can't just propose to me out of \n                         nowhere. You think that's going to \n                         solve our problems? I'm sorry, X. It \n                         was a kick for a while, but it's \n                         over. You're just not going anywhere.\n\n                                     XANDER\n                         You're not exactly \"going anywhere\" \n                         yourself.\n\n                                     SKY\n                         You're wrong about that. I'm heading \n                         out that door right now.\n\n               She heads towards the front door.\n\n               Just then the door BLOWS IN.\n\n               CRASH! -- the windows SMASH IN too. Then the LIGHTS GO OUT \n               as STORMTROOPERS in black body armor rush in, weapons drawn.\n\n               It's a blur of FLASHLIGHTS, PISTOLS and JACK BOOTS. It's \n               scary as hell. A professional take-down.\n\n               They slam Xander against the wall.\n\n               Just like that it's quiet again. Sky hyperventilates, a gun \n               in her face.\n\n                                     XANDER\n                         She had nothing to do with the tower \n                         jump. She's nobody. I just met her \n                         last night. Tell them.\n                              (with meaning)\n                         I hardly know you.\n\n               The Stormtrooper looks at Sky. She nods. The Stormtroopers \n               take their guns off her.\n\n               Sky grabs up here stuff. She looks back at Xander.\n\n                                     SKY\n                         Keep the ring. It looks better on \n                         you anyways.\n\n               She heads out.\n\n                                     XANDER\n                         God, I hate cops. What's the charges \n                         this time?\n\n               The Stormtrooper pulls out a DART GUN and SHOOTS Xander. He \n               pulls a CHROME DART from his chest, examines it.\n\n                                     XANDER\n                              (groggy)\n                         You... pussies...\n\n               Xander slides to the floor.\n\n               FADE TO BLACK.\n\n               INT. PAN'S DINER - DAY\n\n               A SIDEWAYS IMAGE: an out of focus COFFEE CREAMER.\n\n               Xander wakes up with his head on the counter of a DINER. He \n               shakes out the cobwebs.\n\n                                     XANDER\n                         What the hell?\n\n               WHIP PAN as a WAITRESS walks by. Xander blinks.\n\n                                     XANDER\n                         Hey. Where am I? How did I get here?\n\n                                     WAITRESS\n                         I don't know, you wandered in ten \n                         minutes ago and put your head down. \n                         I told you we were closing.\n\n               Xander looks around, sees a TRUCKER chewing with his mouth \n               open. A SALESMAN buried in his NEWSPAPER.\n\n               Xander gets up. Where the hell is he? He takes a step towards \n               the door.\n\n                                     WAITRESS\n                         Want some coffee?\n\n                                     XANDER\n                         Huh?\n\n               The Waitress pours him coffee. QUICK PUSH TO: her hands are \n               shaking.\n\n                                     XANDER\n                         You alright?\n\n                                     WAITRESS\n                              (smiles)\n                         Fine, just fine. Come on and sit. \n                         I'll get you something to eat.\n\n                                     XANDER\n                         Yeah, sure.\n\n               Xander sits. When he swigs his coffee, he notices something \n               written on his napkin in shaky ballpoint: \"S.O.S.\"\n\n               What the hell? He looks at the Trucker. The Trucker's staring \n               at the waitress. QUICK PUSH TO: The Trucker has a BULGE \n               underneath his vest... then PUSH TO: The Salesman's eyes \n               darting about suspiciously, newspaper pulled up to his nose. \n               Something is going down...\n\n               He hears a SLOWED DOWN VOICE and glances back at the Trucker, \n               who's now fixing him with a DEATH STARE. Xander snaps from \n               his reverie.\n\n                                     XANDER\n                         What?\n\n                                     TRUCKER\n                         I said, you got a problem, boy?\n\n                                     XANDER\n                         Problem? No, no problem. You go right \n                         ahead.\n\n                                     TRUCKER\n                         With what? I said, go right on ahead \n                         with what?\n\n                                     XANDER\n                         Whatever, dude.\n\n               The Trucker and the Salesman look at each other. Suddenly \n               they jump up.\n\n               The Trucker pulls a PISTOL from his vest, the Salesman \n               brandishes the SHOTGUN he had behind the paper. The Waitress \n               cringes.\n\n                                     TRUCKER\n                         Alright, nobody make a move!\n                              (to Xander)\n                         Shoulda walked away when you had the \n                         chance, dumb shit.\n\n                                     SALESMAN\n                         Forget him, Buck, let's just do it.\n\n                                     TRUCKER\n                         Shut up!\n                              (in Xander's face)\n                         You keep still or I'm gonna make \n                         damn sure you stop breathing today. \n                         Got that?\n\n               Xander stays strangely calm, his senses now fully focused.\n\n                                     XANDER\n                              (shrugs)\n                         Alright, \"Buck\", whatever you say.\n\n               The Waitress let's out a whimper.\n\n                                     TRUCKER\n                         Keep your gotdam mouth shut and empty \n                         that register! Couldn't just let him \n                         leave, could ya! You know what I'm \n                         gonna do to ya for that? Huh? Do \n                         ya?!\n\n               She goes to open the register and knocks a tray of glasses \n               on the floor. Xander springs into action.\n\n               He CHOPS down on the Trucker's arm and ELBOWS him in the \n               face.\n\n               Xander twists the gun out of his hand and kicks his legs out \n               from under him.\n\n               The Salesman pumps on his shotgun, but it seems to be jammed.\n\n                                     XANDER\n                         Better shoot me quick.\n\n               The Salesman fights with his gun but can't get it to work. \n               Xander advances on him.\n\n                                     XANDER\n                         Too late!\n\n               He unleashes with a series of rapid front kicks to the jaw.\n\n               The Salesman goes crashing through the kitchen doors.\n\n               Xander turns to the terrified Waitress.\n\n                                     XANDER\n                         Alright, bitch, what's going on?\n\n               She stares at him, unable to speak. He raises the gun.\n\n                                     XANDER\n                         Talk! What's the game? Who are you \n                         people?\n\n               The front door bell JINGLES. A guy with an impeccably tailored \n               suit and a cane hobbles in. It's Gibbons. There a problem, \n               Mr. Cage?\n\n                                     XANDER\n                         Who the hell are you?\n\n                                     GIBBONS\n                         The name's Gibbons. You were saying?\n\n                                     XANDER\n                         What is this place?\n\n                                     GIBBONS\n                         Looks like a diner.\n\n                                     XANDER\n                         Diner, huh? Let me tell you what the \n                         problem is. I wake up drugged to \n                         find what? You've got a \"salesman\" \n                         over here reading a three week old \n                         newspaper. He's pulling a 211 with a \n                         \"trucker\", who happens to be packing \n                         a cop issue H&K 9mm. I get tipped \n                         that something is going down when \n                         she passes me a note. How's that for \n                         twisted logic? How did she know there \n                         was trouble unless they pulled the \n                         guns before I \"walked\" in? And if \n                         that's true, why'd they stop and \n                         wait until I woke up to gaffle the \n                         money? Then I notice how beefy they \n                         both are. Hell, even the waitress is \n                         cut. All three of them look like \n                         they went through the same training \n                         program. Ergo they ain't strangers \n                         and this isn't what it seems. That's \n                         how I knew yo-yo wouldn't get a round \n                         off even if I gave him all day. Why?\n\n               He aims at the Waitress and FIRES! She's startled, but unhurt.\n\n                                     XANDER\n                         Cuz there's nothing but blanks in \n                         these guns. And no offense, but their \n                         performances were terrible.\n\n               Xander tosses the gun on the counter. Gibbons gives a sly \n               smile.\n\n                                     GIBBONS\n                         Not bad. Not bad at all. Have a seat.\n\n               Gibbons sits in a booth. Xander sits across from him. In the \n               background the Waitress helps the Trucker and Salesman up.\n\n                                     GIBBONS\n                         Most guys we ran through this either \n                         took off or helped them rob the place. \n                         I expected you to do the same.\n\n                                     XANDER\n                         That shows me already that you don't \n                         have a clue. What's it to you, anyway?\n\n                                     GIBBONS\n                         Whether you thought this was for \n                         real or not, you jumped in and helped \n                         the waitress on instinct. That tells \n                         me something about your character.\n\n                                     XANDER\n                         Good for you. Now why don't you stop \n                         wasting my time and tell me what you \n                         want. You didn't go through all this \n                         for my benefit.\n\n                                     GIBBONS\n                         It's your lucky day. You just might \n                         get the chance to pay back our \n                         wonderful country for all the freedom \n                         you enjoy.\n\n                                     XANDER\n                         A Fed, I shoulda known. Who else \n                         would have this kind of budget? Now \n                         you're gonna hit me with the sales \n                         pitch.\n\n                                     GIBBONS\n                         Alright, Cage, you've got me. This \n                         is one of those moments. \"Many are \n                         called, few are chosen\", that kind \n                         of thing. Your government needs you. \n                         Are you up for the challenge?\n\n                                     XANDER\n                         ..If you're trolling around for narcs, \n                         man, have you got the wrong guy.\n\n                                     GIBBONS\n                         Why is that?\n\n                                     XANDER\n                         Look at me, dude, do I look like a \n                         fan of law enforcement? Forget the \n                         tests, you shoulda just asked me. I \n                         woulda saved you a lot of trouble.\n\n                                     GIBBONS\n                         Oh I don't know, I think the tests \n                         work pretty well. Sometimes they \n                         give me answers you wouldn't admit \n                         to in a million years.\n\n                                     XANDER\n                         Are we done now? You've got nothing \n                         on me. So if you ain't booking me, \n                         I'm walking.\n\n                                     GIBBONS\n                         You've got this wrong. You're not \n                         under arrest, you've been abducted. \n                         And until I say different, you belong \n                         to me.\n\n                                     XANDER\n                         Is that a fact?\n\n                                     GIBBONS\n                         Sure as gravity. I've had a feeling \n                         about you from the start, Cage. It's \n                         nausea.\n\n                                     XANDER\n                              (smiles)\n                         You know what I hate? Any scumbag \n                         with a clean shirt and a bad haircut \n                         can get one of those tin stars and \n                         suddenly they think they're God.\n\n                                     GIBBONS\n                              (smiles)\n                         You know what I hate? It's always \n                         the assholes that pass the tests.\n\n               There's a POP and Xander clutches his stomach. Gibbons tosses \n               his DART GUN onto the table. Xander blinks at him.\n\n               He pulls another CHROME DART from his gut and examines it.\n\n                                     XANDER\n                         You bastards love to see me sleep.\n\n               WHACK! He goes face down on the table.\n\n                                                              CUT TO BLACK:\n\n               CLOSE ON - XANDER'S FACE\n\n               He comes to, blinking in low RED LIGHT. He's shocked to find \n               that he's...\n\n               INT. AIRPLANE - TWILIGHT\n\n               Xander's on the floor of a military aircraft. TWO OTHER TOUGH \n               GUYS are waking up next to him. One's a greaser named VIRG, \n               the other is T.J., ex-Navy.\n\n               Xander notices as they each pull out CHROME DARTS. They sit \n               up, looking at each other. Xander chuckles.\n\n                                     VIRG\n                         What's so damn funny?\n\n                                     XANDER\n                         Been to any good diners lately?\n\n               The three laugh, realizing they're all in the same boat.\n\n                                     T.J.\n                         We must be the final \"candidates\".\n\n               They quiet down as they notice for the first time, THEY ARE \n               NOT ALONE.\n\n               Sitting silently on benches facing them are SOLDIERS DRESSED \n               IN BLACK. They wear BLACK MASKS over their faces. They are a \n               nasty looking BLACK OPS TEAM.\n\n                                     XANDER\n                         Nobody told me this was a costume \n                         party.\n\n               The Black Ops Team, just stares.\n\n                                     T.J.\n                         I've worked with guys like this \n                         before. Black Ops. Serious government \n                         spooks.\n\n               Virg notices something STRAPPED TO HIS BODY. They all have \n               them.\n\n                                     VIRG\n                         Heads up, man. What's this thing on \n                         my back?\n\n                                     XANDER\n                         A parachute. This does not argue \n                         well.\n\n               Then the red light switches to GREEN.\n\n               One of the Soldiers opens the JUMP DOOR. The rest of the \n               team advances on Xander, Virg and T.J.\n\n                                     VIRG\n                         This is bullshit! Hey!\n\n               They drag Virg to the door and THROW HIM OUT. T.J. goes next, \n               kicking and fighting.\n\n               Then they turn on Xander.\n\n                                     XANDER\n                         I get the picture.\n\n               Xander jumps out on his own.\n\n               We see him tumbling away from the airplane. Far below his \n               chute BLOSSOMS OPEN.\n\n               EXT. A FIELD - TWILIGHT\n\n               We see three chutes coming down. The first two HIT HARD.\n\n               We ROCKET IN on the last chute as Xander lands like a pro.\n\n               The other guys run up to him. Then they hear SHOUTING in \n               SPANISH.\n\n                                     VIRG\n                         Jee-zus, man! What the hell now? \n                         Another damn test?\n\n                                     T.J.\n                         We should head for those trees.\n\n                                     XANDER\n                         Don't look at me, brother. It's every \n                         man for himself.\n\n               They wrestle out of their chutes and push past each other as \n               they TAKE OFF IN DIFFERENT DIRECTIONS.\n\n               Xander runs low down a culvert. There's SHOUTING all around.\n\n               He flattens down and crawls up over the rise. What he sees \n               stuns him.\n\n                                     XANDER\n                         You gotta be kidding me.\n\n               We crane up to reveal A FIELD OF POT PLANTS. There's a COCAINE \n               PROCESSING PLANT along the field's edge. The whole place \n               looks exactly like a Central American DRUG FARM.\n\n               NARCO TERRORISTS run around with AK-47's.\n\n               Xander sneaks past EQUIPMENT covered in CAMOUFLAGE NETTING.\n\n               A squad of Narcos runs by and Xander makes his move.\n\n               He rounds another pile of equipment and comes right into the \n               HEADLIGHTS of a truck.\n\n               Narcos hop out and charge forward.\n\n               Xander raises his hands.\n\n                                     XANDER\n                         You boys are too good for me. Guess \n                         I failed this one, huh?\n\n               They grab him and haul him away.\n\n               INT. TORTURE ROOM - NIGHT\n\n               We see a RUSTY MEAT HOOK. A CHAIN is wrapped around it.\n\n               Attached to the chain, his arms over his head, is Xander.\n\n               He's in the middle of a bleak looking room. There are \n               BLOODSTAINS on the wooden walls, the floor strewn with filthy \n               HAY.\n\n               Behind him against the wall Xander sees T.J. and Virg both \n               HOG-TIED.\n\n                                     XANDER\n                         So much for \"every man for himself\". \n                         Nice to see you again, fellas.\n\n                                     T.J.\n                         They really went all out on this \n                         one. This is a pretty gnarly setup.\n\n                                     VIRG\n                         Check the table in the corner.\n\n               There's a BLOOD STAINED TOWEL COVERING a TABLE near the door.\n\n                                     XANDER\n                         This oughta be good.\n\n               Then they hear talking outside and the door is UNLOCKED.\n\n               A very nasty looking Marco comes in. By his look he's the \n               LEADER.\n\n                                     XANDER\n                         This must be el jefe. How's it goin' \n                         jefe? Some weather we're havin'.\n\n               Narco Guards bring in one of their PARACHUTES and toss it on \n               the floor. They exit, closing the door behind them.\n\n               Jefe goes to the table throws back the towel. Beneath it are \n               HIDEOUS, BLOOD ENCRUSTED TORTURE DEVICES: a HACK SAW, a BOLT \n               CUTTERS, KNIVES, CHISELS, a BLOW TORCH.\n\n                                     XANDER\n                         What's on the menu tonight? The old \n                         blowtorch-to-the-family jewels \n                         routine, I'll bet. Hey, you want \n                         roasted nuts, let's break out the \n                         Planters.\n\n               T.J. and Virg both crack up. Jefe gives them a withering \n               look.\n\n                                     JEFE\n                         Do you know what we do with people \n                         come round here? You know what we do \n                         with people come in our business?\n\n               Jefe passes his hand over the various tools. He finally \n               settles on a crude MACHETE. He walks amongst them brandishing \n               it.\n\n                                     JEFE\n                         We cut the Achilles tendon. Your \n                         feet flop around like a marionette. \n                         You ain't walkin' nowhere no more.\n                         Sound good, tough guy? Or maybe \n                         instead you wanna tell me something.\n\n               He stops in front of Xander.\n\n                                     JEFE\n                         Whatchu doing here?\n\n                                     XANDER\n                         Oh, I don't know. It was an accident.\n\n                                     JEFE\n                         That's some accident, hombre. You \n                         accidentally fall out of a plane in \n                         the middle of the night and land up \n                         in my back yard.\n\n               He BACKHANDS Xander across the face.\n\n                                     JEFE\n                         We seen this kind of parachutes \n                         before, you know. U.S. Army. You got \n                         some friends here, jump out with you \n                         guys?\n\n                                     XANDER\n                         We're anti-social. We don't have any \n                         friends.\n\n               Jefe SLAPS him again.\n\n                                     JEFE\n                         No friends, huh? That's funny, I \n                         don't know no U.S. Army that comes \n                         without no friends. That's cuz U.S. \n                         Army is pussies. They always come \n                         with the five hundred guys and the \n                         helicopters and the see-in-the-dark \n                         glasses. So don't you tell me you \n                         all alone out here, my friend. You \n                         bullshitting the wrong guy.\n\n               Xander looks over at T.J. and Virg.\n\n                                     XANDER\n                         Who's writing this dude's dialogue?\n\n                                     VIRG\n                         He's a pretty good actor, though.\n\n                                     T.J.\n                         Makes the diner look like a sixth \n                         grade play. He's even got them crazy \n                         eyes.\n\n                                     JEFE\n                         You ain't begun to see crazy yet, \n                         amigo.\n\n                                     XANDER\n                         We're on to the game, ese. You got \n                         the fake blood splattered all over \n                         the walls, you got your torture \n                         tools... It's all very cute. But \n                         come on, let's quit while you're \n                         ahead. I'm only trying to save you a \n                         beatin'.\n\n                                     JEFE\n                         You saving me? You talking pretty \n                         tough for a guy got himself chained \n                         to the ceiling.\n\n                                     XANDER\n                              (shrugs)\n                         Alright. You wanna eat through a \n                         tube, be my guest.\n\n                                     JEFE\n                         Now you're gonna make me enjoy this, \n                         funny guy. Now I'm gonna take the \n                         whole foot off. Whatchu think of \n                         that?\n\n               A low THUMPING is heard outside. It's the sound of approaching \n               HELICOPTERS, lots of them.\n\n               Then the night ERUPTS in GUNFIRE. It sounds like a full scale \n               assault outside.\n\n                                     JEFE\n                         What's that, eh? I thought you didn't \n                         have no friends!\n\n               Jefe goes into a fury. He SWINGS his machete at Xander's \n               legs.\n\n               Xander JUMPS UP, grabbing on to the chain above, and KICKS \n               Jefe in the chest.\n\n               Jefe falls back and Xander climbs up to the roof BEAM.\n\n               He grabs onto the beam with his legs and UNHOOKS his chain \n               from the meat hook.\n\n               He drops down, six feet of chain still hanging from his cuffed \n               wrists, and Jefe comes charging at him.\n\n               Xander dodges a few wild swings.\n\n               He grabs Jefe's PANT CUFF and dumps him on his ass.\n\n               Jefe scrambles to his feet, drawing his PISTOL.\n\n               Xander swings his chain and WHIPS the gun out of Jefe's hand.\n\n               With another swing he WRAPS the chain around Jefe's neck and \n               pulls it taught.\n\n                                     XANDER\n                         Keys. You got 'em?\n\n               Jefe nods, choking, and reaches into his pocket.\n\n                                     XANDER\n                         Hand 'em to me.\n\n               Instead Jefe hurls them out the window.\n\n                                     XANDER\n                         I hope you're getting paid extra for \n                         this.\n\n               Xander jerks the chain, slamming Jefe head first into the \n               wall. Jefe drops, knocked out.\n\n               Outside it sounds like a full scale FIREFIGHT. Xander gets \n               the machete and CUTS the ropes holding T.J. and Virg.\n\n               Then a HAIL OF BULLETS sprays through the room.\n\n               All three guys hit the deck but T.J. gets shot. He clutches \n               his side, BLOOD all over his hands.\n\n                                     T.J.\n                         I'm hit! I'm hit!\n\n                                     VIRG\n                         They're shooting for real! This is \n                         all real.\n\n               Xander knows this is true.\n\n                                     XANDER\n                         Aw shit.\n\n               He checks out T.J.'s wound.\n\n                                     XANDER\n                         Help me with this guy.\n\n                                     VIRG\n                         It's like you said, every man for \n                         himself.\n\n               Virg bolts for the door.\n\n                                     XANDER\n                         That only works if you're a man!\n\n               EXT. DRUG FARM - NIGHT\n\n               Narcos are shouting, running to and fro.\n\n               TRACER ROUNDS cut through the air. They are trying to repel \n               an UNSEEN ASSAULT FORCE.\n\n               Overhead SIX MILITARY HELICOPTERS buzz the compound like \n               Apocalypse Now, their NIGHT SUNS lighting up the place.\n\n               Xander comes out of the torture building holding T.J. in a \n               fireman's carry. His hands are still CUFFED, the length of \n               chain dragging.\n\n               Xander crouches behind some equipment, putting T.J. on the \n               ground.\n\n                                     XANDER\n                         You alright?\n\n                                     T.J.\n                         I used to be a SEAL, it's not the \n                         first time I've been shot. Thanks, \n                         man.\n\n                                     XANDER\n                         Keep your head down, I'll be right \n                         back. I'm gonna steal us some wheels.\n\n               Xander moves on, finds cover under the camouflage netting.\n\n               He can see Narcos shooting into the trees at the UNSEEN ENEMY.\n\n               Looking the other way, he spots Virg running back his way.\n\n               He's been corralled by one of the Helicopters.\n\n               He's zigzagging, trying to stay out of the beam of it's Night \n               Sun.\n\n               Xander darts out and GRABS him, pulling him under the \n               camouflage netting.\n\n                                     VIRG\n                         They're all over the place! What the \n                         hell's going on?\n\n                                     XANDER\n                         Looks like we're in the middle of \n                         the drug war.\n\n               The Helicopter lights up the camouflage netting.\n\n               They're pinned down.\n\n                                     XANDER\n                         Alright Mr. free-for-all, you go \n                         that way, I'm gonna go this way. \n                         They can't follow us both.\n\n               They squat down in runners stances, the helicopter kicking \n               up DUST all around them.\n\n                                     XANDER\n                         Go!\n\n               They jet off in opposite directions.\n\n               Xander books, running for all he's worth. His cuffed hands \n               and the dangling chain make it difficult.\n\n               He's heading straight into the FIELD OF POT PLANTS.\n\n               Suddenly the massive SPOTLIGHT picks him out.\n\n                                     XANDER\n                         Shit!\n\n               The CHOPPER swoops down after him.\n\n               Its big GATLING GUNS turn, aiming right at him.\n\n               BRAAAAAAAAPPP! The guns cut loose, tearing up the ground \n               right behind him.\n\n               Xander sprints, the chopper after him like Cary Grant in \n               \"North By Northwest\", except instead of corn fields, Xander's \n               running through a field of HUGE MARIJUANA PLANTS.\n\n               Xander hits the deck and the chopper soars over him.\n\n               Xander cuts over a couple rows and hunkers down amongst the \n               plants.\n\n               All around him it's a chaos of Helicopters and GUNFIRE.\n\n               Two choppers attack the factory building, BLASTING it with \n               their guns. Narcos run terrified.\n\n               Xander notices a FAT PURPLE BUD on the plant right in front \n               of him. He SNAPS IT OFF.\n\n                                     XANDER\n                         I'm gonna need to hit the trees after \n                         a night like this.\n\n               He tucks it-into his shirt and takes off through the POT \n               FOREST.\n\n               Xander finally spots a vehicle. It's a TRUCK LADEN WITH BAILS \n               OF COCAINE. He heads for it.\n\n               Then the SPOTLIGHT finds him again and the Chopper swings \n               around. The gatling guns RIP the plants to pieces all around \n               him.\n\n               Xander hauls ass, heading for the truck.\n\n               Bullets chew up the dirt all around him.\n\n               As the helicopter passes overhead, it's guns RAKE THE TRUCK.\n\n               There is a FLASH as the GAS TANK goes up.\n\n               WHOOOOPPHH! A SUPERNOVA OF FIRE AND HIGH-GRADE COKE erupts \n               into the night air.\n\n               Xander dives into a DRAINAGE DITCH. He tumbles down into \n               FILTHY WATER.\n\n               A powdery cloud washes over him, dusting the trees white.\n\n               Near him is a big DRAINPIPE leeching sewage. Xander crawls \n               inside.\n\n               The Chopper makes another pass overhead.\n\n               The big spotlight plays over the area, then moves on.\n\n               Xander gives a sigh of relief. He crawls out of the drainpipe.\n\n               JEEPS race by on the road right above him as MILITARY MEN \n               flood the compound. There's no going back.\n\n               Xander turns and makes his way along the tree line.\n\n               The chopper and gunfire are in the distance now. Things are \n               quieter here and he starts to relax. Bad idea.\n\n               As he goes by, one of the TREES moves.\n\n               He takes a few more steps and the grass he just walked on \n               EXPLODES UPWARDS. ARMS reach out, tackling Xander from behind.\n\n               Another TEAM of BLACK OPS SOLDIERS bursts from the weeds, \n               the bushes, all perfectly camouflaged like the landscape.\n\n               They fall on him like a curtain.\n\n               XANDER'S P.O.V. - Soldiers hold him down while a BLACK HOOD \n               is pulled over his head.\n\n               FADE TO BLACK.\n\n               INT. AIRPLANE HANGER - DAY\n\n               As the MASSIVE HANGER DOORS CLOSE we can see CHOPPERS taking \n               off and landing. MEXICAN SOLDIERS load Jefe and his Narcos \n               onto a FEDERALE BUS. Virg resists and is BEATEN. T.J. can be \n               seen being loaded into an AMBULANCE.\n\n               The hanger doors slide shut with a THUD.\n\n               We see Xander's HANDS as the CHAINS are cut away.\n\n               Xander sits in a chair with the BLACK HOOD still over his \n               head. He blinks when the hood is torn off. A Black Ops Soldier \n               smirks as he walks away.\n\n               Xander looks around, sees the Black Ops Team unpacking some \n               STRANGE GEAR. Two of them are dumping bottles of a CLEAR \n               LIQUID into a RUSTY CLAWFOOT BATHTUB.\n\n                                     XANDER\n                         Nice of you to draw me a bath. Is it \n                         Saturday already?\n\n               The Black Ops guys grin knowingly.\n\n               On the other side, Xander sees a FLIGHT CREW readying a \n               GULFSTREAM for travel. Gibbons steps up from behind him.\n\n                                     GIBBONS\n                         Congratulations, you've just graduated \n                         at the head of your class.\n\n                                     XANDER\n                         You're a cold piece of work. You \n                         almost got three people killed out \n                         there.\n\n                                     GIBBONS\n                         Good thing you were there to save \n                         the day. Come walk with me.\n\n               Xander gets up and Gibbons leads him on a stroll around the\n\n                                     GIBBONS\n                         You've really got me confused, Cage. \n                         On the one hand you showed leadership, \n                         courage under fire, a willingness to \n                         protect men you hardly knew... and \n                         on the other you have an arrest record \n                         that pegs you as near sociopathic. \n                         Help me out here. I'm not following \n                         your evolution.\n\n                                     XANDER\n                         You want the cheap backstory? The \n                         runaway mom, the suicide dad and the \n                         foster homes? Gimme a break. You're \n                         not interested in my past, you're \n                         interested in my future as some kind \n                         of spy.\n\n                                     GIBBONS\n                         You're perceptive too. I forgot to \n                         add that to the list of surprises. \n                         I'm with the National Security Agency. \n                         And unlikely as it may sound, I need \n                         your help.\n\n                                     XANDER\n                         I'm not interested. I've already got \n                         a job.\n\n                                     GIBBONS\n                         You're an adrenaline junkie with one \n                         foot in the penitentiary. You risk \n                         your ass building a daredevil myth \n                         that means nothing and you're not \n                         getting any younger.\n\n                                     XANDER\n                         I plan on getting a lot older. And \n                         playing spy games sounds like a quick \n                         way to get yourself dead.\n\n                                     GIBBONS\n                         That's too bad. I thought a guy like \n                         you would appreciate the challenge.\n\n               As they walk by the Black Ops guys, Xander sees they're \n               getting busy. One spreads out a plastic DROPCLOTH. Another \n               plugs in a BONE SAW.\n\n                                     XANDER\n                         What's this? You're gonna try to \n                         scare me now?\n\n               Gibbons grabs a CHICKEN LEG from a guy eating lunch.\n\n                                     GIBBONS\n                         Do you know the reason why I try to \n                         recruit guys like you? There's no \n                         risk.\n\n               He tosses it into the tub. Instantly it starts to SIZZLE and \n               BUBBLE. The tub is full of ACID.\n\n                                     GIBBONS\n                         There's nobody back home who's gonna \n                         ask questions if you just... disappear \n                         for a while.\n\n               In seconds the entire leg has been consumed, leaving only a \n               oily cloud of residue.\n\n               Gibbons eyes him coldly, nailing the point home.\n\n                                     XANDER\n                         Now I'm the one who's nauseous. So \n                         what's the deal? What do you need me \n                         for?\n\n                                     GIBBONS\n                         There's some folks I want to keep \n                         tabs on. Dirty, tattooed, uncivilized. \n                         Your kind of people.\n\n                                     XANDER\n                         What do I get out of it?\n\n                                     GIBBONS\n                         If you find out what I want to know, \n                         and if I'm able to successfully use \n                         that information, you get to go back \n                         to your degenerate little life. If \n                         not, you take a bath.\n\n                                     XANDER\n                         You're one sick bastard. A sadist \n                         with a badge looking to rope me in \n                         to a suicide mission. I think no \n                         matter which way I go I'm likely to \n                         wind up face down on a sheet of \n                         plastic. So here's my answer: kiss \n                         my ass, Hop-along.\n\n               Gibbons kicks the back of Xander's leg and dumps him on his \n               ass. Gibbons was so quick, Xander never saw it coming.\n\n               The Black Ops guys clap and cheer, always interested in a \n               fight.\n\n                                     XANDER\n                         Not bad for a gimp.\n\n                                     GIBBONS\n                         What's with that \"X\" on the back of \n                         your head? Does that mean you're \n                         \"extreme\"? I've got some news for \n                         you, Mr. X, you're a three time loser. \n                         So maybe you should tattoo another \n                         couple of X's on your head.\n\n               Xander gets up.\n\n                                     XANDER\n                         I'll take that under advisement. \n                         Maybe I can be like you and lose a \n                         leg for the old Stars and Bars. I \n                         bet the flag's a great comfort every \n                         time you need help climbing stairs.\n\n               Gibbons lunges and grabs Xander's throat in the vice-like \n               grip of his thumb and middle finger.\n\n                                     GIBBONS\n                         One twitch and my finger and thumb \n                         will meet inside your esophagus. \n                         Believe me, Mr. X, I've put foot to \n                         ass for my country on many occasions \n                         and I don't feel the urge to stop \n                         just yet. So think carefully before \n                         you tell me: Is \"kiss my ass, Hop-\n                         along\" your final answer?\n\n               The fingers are so powerful that Xander is paralysed. He \n               looks over, sees the bone saw start revving.\n\n                                     XANDER\n                              (choking)\n                         No.\n\n               Gibbons releases his grip.\n\n                                     GIBBONS\n                         I thought you might see it my way.\n\n               Then Xander starts walking away.\n\n                                     GIBBONS\n                         Where you going, X? I said where you \n                         going?\n\n               The Black Ops guys grab weapons, ready to stop him.\n\n                                     XANDER\n                         You tell me.\n\n               Xander climbs up the steps of the Gulfstream.\n\n                                     XANDER\n                         There better be a movie on this Goddam \n                         flight.\n\n               INT. GULFSTREAM - DAY\n\n               Xander sits with Gibbons in big leather chairs. They are \n               surrounded by NSA AGENTS in suits.\n\n               A NERDY AGENT snaps an ANKLET around Xander's ankle.\n\n                                     XANDER\n                         How about a pedicure as long as you're \n                         down there. What's this? Lo-Jack?\n\n                                     GIBBONS\n                         Wherever you go on the planet, I'll \n                         find you. There's no quitting. If \n                         you try to take it off, a ring of \n                         needles will inject enough curare \n                         into your bloodstream to kill you \n                         before you hit the ground. Is all \n                         that clear?\n\n                                     XANDER\n                         Yeah, I spy or I die.\n\n               INT. EMPTY FIRST CLASS LOUNGE - SUNSET\n\n               Orange light floods this beautiful airline lounge. There's a \n               fully stocked bar, a snack table, all unused. That's because \n               it's been sealed off for NSA use. (NOTE: perfect product \n               placement opportunity for an AIRLINE).\n\n               Xander, Gibbons and his Men are all silhouetted against the \n               smoked glass windows.\n\n               The Nerdy Agent hands Xander a Palm Pilot sized ELECTRONIC \n               DEVICE.\n\n                                     NERDY AGENT\n                         This is your communicator. You'll \n                         identify yourself by a call sign. \n                         From here on out you're Bulldog Omega \n                         5.\n\n                                     XANDER\n                         You must stay up late to come up \n                         with shit like that.\n\n                                     GIBBONS\n                         I expect you to call in regularly \n                         with progress reports.\n\n                                     XANDER\n                         Fine, but I'm not gonna be no Bulldog \n                         Omega 5.\n\n               Gibbons checks his watch. They get up and start walking.\n\n               INT. AIRPORT TERMINAL - SUNSET\n\n               The phalanx of Agents surrounds Xander and Gibbons as they \n               walk to the gate. The Nerdy Agent hurries to catch up.\n\n                                     AGENT\n                         Uh... Call signs derive from the \n                         parameters of the mission.\n\n                                     GIBBONS\n                         If he doesn't like it, we can make \n                         an exception just this once. We'll \n                         call him \"Triple X\".\n\n               They walk past the gate, down the jet-way, the Agents FLASH \n               BADGES to the GATE WORKERS.\n\n                                     XANDER\n                         Up yours.\n\n                                     GIBBONS\n                         Crude and defiant as always, Triple \n                         X. It fits so well because you're \n                         obscene.\n\n               Xander is the last one to board the plane.\n\n                                     XANDER\n                         Is that all?\n\n                                     GIBBONS\n                         Just remember, I'll be watching.\n\n               As the door closes, he looks back at Gibbons and his phalanx \n               of Agents.\n\n                                     XANDER\n                         I've got something for you to chew \n                         on. Next time you send someone to \n                         save the world, make sure they like \n                         the planet the way it is.\n\n               The jet's door CLOSES.\n\n               INT. COMMERCIAL JET - NIGHT\n\n               Xander is in the last row against the bulkhead. He's got a \n               personal DVD player and headphones and he's reviewing his \n               mission. The high-tech screen shows photos, maps, cool \n               graphics.\n\n               The KID sitting across the aisle leans over for a look.\n\n                                     KID\n                         What game is that?\n\n                                     XANDER\n                         Slick graphics, huh? See these dudes? \n                         They're called \"Anarchy 99\", they're \n                         the bad guy bosses.\n\n                                     KID\n                         Do they have any special powers? The \n                         bosses always have special powers.\n\n                                     XANDER\n                         You wanna check it out? Come here.\n\n               The kid moves to the seat next to Xander.\n\n               Onscreen see photos of the FIVE BAD GUYS from the opening \n               sequence. We DIVE IN to the computer as Xander describes \n               them.\n\n               For each of the baddies, we'll see 3-D PHOTOS and VIDEO CLIPS, \n               all enhanced with COMPUTER GRAPHICS and POP-UP MENUS.\n\n                                     XANDER\n                         First we've got Anders, the psycho \n                         looking biker. In charge of \n                         transportation and smuggling. Controls \n                         every trucking union in Eastern \n                         Europe. Don't look too clean, either.\n\n               We see ANDERS, the wild-eyed and unclean Swedish biker, \n               against a backdrop of MOTORCYCLES and MUSCLE CARS.\n\n                                     XANDER\n                         Next we got a Siberian redneck, \n                         Viktor. Into snowmobiles and \n                         snowboarding. So naturally, he covers \n                         prostitution and the drug trade.\n\n                                     KID\n                         Naturally.\n\n               We see Viktor, with the goatee and belly, doing some hairy \n               snowboarding.\n\n                                     KID\n                         This guy's kinda dorky lookin'.\n\n                                     XANDER\n                         Kirill, the sniper. Looks like a \n                         bookworm, but he had 72 confirmed \n                         kills in Chechnya, they called him \n                         the \"Finger of God\". Assassination \n                         and weapons.\n\n               We see Kirill in UNIFORM with his well used SNIPER RIFLE.\n\n                                     KID\n                         Who's the hottie?\n\n               He indicates Petra, the tough gangster chick. With her LEATHER \n               and TATTOOS she looks like she could mop up the floor with \n               Lara Croft.\n\n                                     XANDER\n                         You like her, huh? Petra. She runs \n                         their finances, money laundering, \n                         computers. Joined the gang after \n                         spending some time as the girlfriend \n                         of this dude, Yorgi Azar Zimin. Capo \n                         of Anarchy 99.\n\n               Finally we see YORGI, the unlikely looking Mafiya Don. We \n               see CRIME SCENE PHOTOS that illustrate his exploits.\n\n                                     XANDER\n                         Yorgi masterminded the take-over of \n                         three Red Mafiya clans. Cops called \n                         it \"blood week\". He combined all of \n                         their global enterprises into one \n                         huge crime syndicate: Anarchy 99.\n\n                                     KID\n                              (skeptically)\n                         \"Anarchy\" 99\"?\n\n                                     XANDER\n                         What are you gonna do? They're Euro-\n                         trash.\n\n                                     KID\n                         What weapons do you have?\n\n               Xander clicks on \"INVENTORY\". He scrolls through a staggering \n               array of WEAPONS and VEHICLES.\n\n                                     XANDER\n                         Just about anything I want, it looks \n                         like. This is gonna be tough, though. \n                         There's no way to save this game. I \n                         gotta get it right the first time \n                         through.\n\n                                     KID\n                         What do you get if you finish?\n\n                                     XANDER\n                         Nothing, really. My guy is just doing \n                         it to stay alive.\n\n                                     KID\n                         Oh. I bet by the end he gets something \n                         out of it.\n\n                                     XANDER\n                         Like what?\n\n                                     KID\n                         He gets to be the hero.\n\n               The Kid's mom calls him back to his seat. Xander looks at \n               the kid, then gets back to his research.\n\n                                                               DISSOLVE TO:\n\n               EXT. PRAGUE - DAY\n\n               We CRANE UP from the COBBLESTONE STREET as a BEAT-UP CAR \n               races by. We rise up, revealing PRAGUE in all it's glory.\n\n               INT. BEAT-UP CAR - MOVING\n\n               Xander sits in the back, wedged between TWO IDENTICAL LOOKING \n               TOUGH GUYS. If you were to call Central Casting and ask for \n               a couple of cold war spy types, this is what they'd send.\n\n               They're both 6' 4\", have sloppily cut hair, square jaws, \n               wrinkled overcoats.\n\n                                     XANDER\n                         This is bullshit, man, I wanna see \n                         some ID.\n\n               The two tough guys flash their COP ID's. Xander studies them. \n               \"IVAN PEDGRAG\" and \"IVAN PODROV\".\n\n                                     XANDER\n                         You're both named Ivan? That's gotta \n                         be confusing on Valentine's Day. So \n                         where we headed? Fellas, I said where \n                         we headed?\n                              (beat)\n                         Yeah, whatever.\n\n               He looks out the window, sees a GRAND HOTEL. They drive right \n               on by.\n\n               EXT. DIRTY APARTMENT BUILDING - DAY\n\n               It's a crumbling old dump in a nasty part of town. Xander \n               shakes his head.\n\n                                     XANDER\n                         James Bond never had to put up with \n                         this shit.\n\n               Ivan 1 pulls Xander's gear bag from the trunk and throws it \n               on the sidewalk.\n\n               Xander picks it up and carries it into the building.\n\n               INT. DIRTY APARTMENT - DAY\n\n               Dumpy furniture, roaches, cracked windows. Xander is ushered \n               in. There's another GUY in a UGLY SUIT waiting. He is \n               DETECTIVE MILAN SLOVO.\n\n                                     SLOVO\n                         Sit down.\n\n                                     XANDER\n                         I've been on a plane for twelve hours, \n                         I think I'll stand.\n\n               Ivan 1 shoves him into a chair.\n\n                                     SLOVO\n                         My name is Slovo, Czech secret police. \n                         When you are here you are under my \n                         jurisdiction, you take my orders, \n                         you do what I say. If you become any \n                         kind of an inconvenience, I'll shoot \n                         you.\n\n                                     XANDER\n                         Here we go again.\n\n                                     SLOVO\n                         You're here because your government \n                         is putting pressure on my government. \n                         This is an internal affair, a Czech \n                         affair, that you are interfering \n                         with. I will warn you once: Don't \n                         shit in my lawn. Get whatever \n                         information your government seeks \n                         and get our.\n\n                                     XANDER\n                         First of all, you should kill whoever \n                         sold you that suit. Two, I don't \n                         wanna be here either, so just step \n                         off. Three, if you had the authority \n                         to shoot me you would've done it by \n                         now, so just ease up on the machismo, \n                         bitch. Now that we've got that sorted \n                         out, I'm gonna get some rest.\n\n               Xander lays down on the bed. Slovo stares, burning with \n               hatred. He heads to the door.\n\n                                     SLOVO\n                         Be ready in three hours.\n\n               Slovo exits. Ivans 1 & 2 stay, staring at Xander.\n\n               EXT. HALF-PIPE DISCO - NIGHT\n\n               A fancy, flashy disco with an extreme sports theme. A big \n               bouncer in a leather coat works the door. This is a highclass, \n               expensive joint but it still looks seedy and dangerous.\n\n               Xander and Slovo walk up to the place. Xander's wearing a \n               Tshirt that says \"RON JEREMY: AMERICAN LEGEND\" complete with \n               a photo of the Hedgehog.\n\n               INT. HALF-PIPE DISCO - NIGHT\n\n               A STRIPPER that looks like a runway model SLIDES across the \n               stage on SKATEBOARD KNEE-PADS while PATRONS cheer. The disco \n               is a combination STRIP-CLUB and CONCERT VENUE. All the \n               STRIPPERS are outfitted in HELMETS, ELBOW PADS, G-STRINGS \n               and BELLY SHIRTS.\n\n               There's a WARPED TOUR BAND playing on a STAGE. On either \n               side of the stage are two MINI-HALF PIPES that the GIRLS are \n               cutting back and forth on.\n\n               WEALTHY BUSINESSMEN sit in plush booths getting table dances \n               while the dance floor is packed with sexily dressed YOUNG \n               HIPSTERS.\n\n               Xander gets a beer from a BUXOM COCKTAIL WAITRESS on IN-LINE \n               SKATES.\n\n                                     XANDER\n                         Nice hops.\n\n                                     SLOVO\n                         The corner. Anarchy 99.\n\n               Slovo points them out in the far corner. They're surrounded \n               by straight faced BODYGUARDS.\n\n               What ANARCHY 99 is doing in their booth with the STRIPPERS \n               looks like Led Zeppelin on tour. Booze, broads, good times... \n               These guys are living like rock stars.\n\n               They're all here: Anders the biker, Viktor, Kirill. In the \n               middle sit Yorgi and Petra. Petra's wearing an \"I AM EVIL\" \n               Tshirt.\n\n                                     SLOVO\n                         See the one with the funny colored \n                         hair? Crazy bitch stabbed one of my \n                         men in the knee-cap. There they are, \n                         American. The low-rent millionaire \n                         criminals. And you thought only your \n                         country had white trash. American?\n\n               He looks around but Xander is gone. He heads for the exit, \n               pushing his way through the crowd. But then he spots him, \n               not by the door but deeper in the club.\n\n                                     SLOVO\n                         Oh no!\n\n               He sees Xander walk right up to the Anarchy 99 booth and \n               start talking to them.\n\n                                     SLOVO\n                         Jesus Christ!\n\n               Slovo can't hear a thing, but they're obviously interested \n               in what he has to say. Next thing he knows Xander is pointing \n               at him and waving him over.\n\n                                     SLOVO\n                              (horrified)\n                         What the hell...?\n\n               Slovo makes his way through the crowd to the booth. Yorgi \n               looks him up and down.\n\n                                     XANDER\n                         That's the guy.\n\n                                     YORGI\n                         This pizda? Never seen him before.\n\n                                     XANDER\n                              (to Slovo)\n                         Who you workin' for? What do you do \n                         for a living, dickhead?\n\n                                     SLOVO\n                         Uh... I am... I work in insurance.\n\n               Xander grabs Slovo and starts searching him.\n\n                                     SLOVO\n                              (panicked whisper)\n                         What the hell are you doing?\n\n               He slams Slovo up against the wall and pulls out Slovo's \n               police badge.\n\n                                     XANDER\n                         Look what we have here. Czech 5-0 on \n                         the mack.\n\n               The Bodyguards pull out guns and Slovo rushes for the \n               emergency exit in a panic. In seconds he's out and gone.\n\n                                     YORGI\n                         Cops. Like a plague. No matter how \n                         many you pay there's always another \n                         with his hand out. How did you pick \n                         him out?\n\n                                     XANDER\n                         He flashed his badge to half the bar \n                         when he bought his drink.\n\n                                     YORGI\n                         I appreciate you bringing this to \n                         our attention. Whatever you want, \n                         the rest of the night, consider it \n                         on the house.\n\n               Yorgi waves over some strippers.\n\n                                     XANDER\n                         Thanks, but I'm here on business. I \n                         heard you're the G around here. I'm \n                         looking for some cars, expensive \n                         ones. A lot of them.\n\n                                     YORGI\n                         Sorry, man, don't know what you're \n                         talking about.\n\n                                     XANDER\n                         I'm talking about the sports cars \n                         that disappear off the docks in Genoa \n                         and wind up here. If you don't know \n                         about 'em, who does?\n\n               Yorgi nods and the Bodyguards step in front of Xander.\n\n                                     XANDER\n                         I guess I heard wrong.\n\n               Xander turns to leave.\n\n               That's when Anders notices the \"X\" tattoo on the back of \n               Xander's head. He gets excited and alerts Yorgi.\n\n                                     YORGI\n                         Xander Cage!\n\n               Xander turns. Suddenly their whole demeanor changes. All \n               five guys get up, awed, and push the Bodyguards out of the \n               way.\n\n                                     ANDERS\n                         The X man! We seen your bootleg \n                         videos!\n\n                                     VIKTOR\n                         You sick! You sick crazy on a board, \n                         on a bike! Everything!\n\n                                     YORGI\n                         This is insane, man. Xander Cage in \n                         Prague. Come on, sit. Sit with us.\n\n               Yorgi signals for more drinks.\n\n                                     YORGI\n                         I remember that one where you jump \n                         the motorcycle over the freeway at \n                         rush hour.\n\n                                     XANDER\n                         When else are you gonna do it?\n\n                                     VIKTOR\n                         You almost died on that one.\n\n                                     XANDER\n                         Cops arrested me while I was still \n                         in surgery. Did two months.\n\n                                     YORGI\n                         We seen all your shit! So you want \n                         cars? We get whatever cars you need. \n                         What are you looking for?\n\n                                     XANDER\n                         Ferrari's, Lamborghini's... high end \n                         pasta rockets. Ten to start.\n\n                                     ANDERS\n                         Ten! No problem! We do that no \n                         problem!\n\n               Petra elbows Anders.\n\n                                     PETRA\n                         Ten is hardly worth the effort. We're \n                         talking a lousy million five U.S.\n\n                                     XANDER\n                         I have Japanese buyers who are looking \n                         to move a fleet, if you have the \n                         quality of merchandise they're after. \n                         And it's a mil two, max.\n\n               Petra glances at Yorgi who nods.\n\n                                     PETRA\n                         Do you know what a wire transfer is?\n\n                                     XANDER\n                         Is she for real? Honey, maybe you \n                         should quiet down and let the grownups \n                         have a conversation.\n\n                                     PETRA\n                         My goodness, a word with four \n                         syllables. I should get some ice \n                         before your brain gets too hot.\n\n                                     XANDER\n                         Sure. Just chisel some off your heart.\n\n                                     PETRA\n                              (smiles)\n                         So cute. He shows up for a battle of \n                         wits with a mental butter knife.\n\n               Xander looks to Yorgi.\n\n                                     YORGI\n                              (laughing)\n                         Don't look at me, X, she handles all \n                         the details.\n\n                                     XANDER\n                         It'll work faster if I have an account \n                         number.\n\n               Petra scrawls numbers on a cocktail napkin.\n\n                                     PETRA\n                         You'll have forty-eight hours to \n                         complete the transfer. Don't waste \n                         our time.\n\n               Xander snatches the napkin.\n\n                                     XANDER\n                         Wouldn't dream of it. I'm even gonna \n                         throw in a few extra bucks to send \n                         you to charm school.\n\n               Petra glares at him.\n\n                                     YORGI\n                         Alright, now that business is \n                         finished, we party! Bitches, come! \n                         We have a drink and toast the deal!\n\n               Yorgi claps and a flock of strippers descends on the booth.\n\n               Anarchy 99 lifts their glasses. Xander joins in the toast.\n\n                                     XANDER\n                         I believe I can hang with you fellas \n                         for a while.\n\n               INT. UNDERGROUND HEADQUARTERS - HALLWAY - MORNING\n\n               We see the FEET of AGENT POLK sprinting down the hallway.\n\n               INT. ULTIMATE INFORMATION ROOM - MORNING\n\n               Agent Polk looks around, spots Gibbons. He rushes to him, \n               waving a COMMUNIQUÉ.\n\n               Gibbons grabs the communiqué, reads it. He looks up, stunned.\n\n               INT. DIRTY APARTMENT - DAY\n\n               Xander is having coffee at his window when his communicator \n               RINGS.\n\n                                     XANDER\n                              (into phone)\n                         I guess you got my E-mail. I set up \n                         a purchase. Ten cars.\n\n               INTERCUT WITH GIBBONS IN INFORMATION ROOM\n\n                                     GIBBONS\n                         If you're trying to push my buttons, \n                         you're on the right track. Don't \n                         make me question my own judgment, X.\n\n                                     XANDER\n                         Buddy, you sent me here to get close \n                         to their organization, that costs \n                         money.\n\n                                     GIBBONS\n                         One point two million dollars? I did \n                         not authorize you to spend one point \n                         two million dollars!\n\n                                     XANDER\n                         I'm already on a first name basis \n                         with these dudes, I got a deal set \n                         up, you want me to hammer it or not?\n\n                                     GIBBONS\n                         We're not after car thieves here.\n\n                                     XANDER\n                         What the hell am I after? You're \n                         telling me dick.\n\n                                     GIBBONS\n                         That information is classified. You're \n                         there to gather information on their \n                         operations, period.\n\n                                     XANDER\n                         Call me crazy, but I thought hooking \n                         up a million dollar deal was a great \n                         way to get on their good side. What \n                         else? You gonna hassle me about the \n                         weapons and spy stuff too?\n\n                                     GIBBONS\n                         My friend, if you're planning on \n                         crossing me...\n\n                                     XANDER\n                         I know, poison needles in my shins. \n                         You've got 36 hours. Peace, out.\n\n               Xander hangs up.\n\n               INT. SAM TANNICK'S OFFICE - DAY\n\n               Gibbons stands before Sam's desk. Sam scans over the \n               communiqué.\n\n                                     SAM TANNICK\n                         Ridiculous. Cut him off. I'm sorry \n                         Gibbons, you pulled up a shark this \n                         time.\n\n                                     GIBBONS\n                         I think we should send him whatever \n                         he wants.\n\n                                     SAM TANNICK\n                         You what? A wire transfer of this \n                         size?\n\n                                     GIBBONS\n                         If it means getting Silent Night \n                         back, absolutely.\n\n                                     SAM TANNICK\n                         You're talking about a very expensive \n                         risk here.\n\n                                     GIBBONS\n                         He's gotten closer in 24 hours than \n                         all of the other operatives combined. \n                         He got us an account number to boot. \n                         Now even if he's just dumb and lucky, \n                         I say we back his play.\n                              (beat)\n                         I put him out there, Sam. If he \n                         doesn't come up with the money, \n                         they'll kill him. I can't let that \n                         happen.\n\n                                     SAM TANNICK\n                         Why not? You were going to throw him \n                         in a tub full of acid, weren't you?\n\n               Gibbons smiles.\n\n                                     SAM TANNICK\n                         Alright, do what you want. But keep \n                         the screws on him. He's a wild card. \n                         That could be either good or bad.\n\n                                     GIBBONS\n                         So the odds are up to fifty-fifty? I \n                         can deal with that.\n\n                                                                    CUT TO:\n\n               EXT. CZECH POLICE BUILDING - ROOFTOP - DAY\n\n               A HELICOPTER comes flying in, a MAN standing out on the strut. \n               He's a disgruntled GADGET WRANGLER from the NSA. His name is \n               TOBY LEE SHAVERS.\n\n               Slovo and Xander watch from a distance as a series of METAL \n               CASES is unloaded by CZECH COPS. Slovo lets out a low whistle.\n\n                                     SLOVO\n                         Your government must know something \n                         we don't.\n\n               Shavers walks up to them.\n\n                                     SHAVERS\n                         Hate those Russkie choppers. Rattle-\n                         trap pieces of garbage. I'm agent \n                         Shavers. Toby Lee Shavers. I'm looking \n                         for what's his name. Three X' s.\n\n                                     XANDER\n                         That's would be me.\n\n               Shavers gives him a disapproving look.\n\n                                     SHAVERS\n                         Figures. You got someplace we can \n                         spread out my gear or what? I mean \n                         today.\n\n               Slovo gestures towards the stairs and Shavers marches off, \n               muttering to himself.\n\n                                     SLOVO\n                         I'll leave you two alone to talk.\n\n                                     XANDER\n                         Yeah, thanks a lot.\n\n               INT. CZECH POLICE BUILDING - BASEMENT TRAINING AREA - DAY\n\n               Down in the basement there is a SHOOTING RANGE along one \n               wall. A squad of CZECH COPS is BLASTING AWAY. They become \n               distracted by the noise in the middle of the room.\n\n               One of the metal boxes has been dropped by a Cop. The rest \n               are spread out in front of Xander, Slovo and Shavers.\n\n                                     SHAVERS\n                         Back off, just go away you klutz. \n                         Alright, here's the story. The items \n                         in these cases belong to me. I \n                         designed them, built them, and was \n                         going to use them in the field myself \n                         until you showed up.\n\n                                     XANDER\n                         I stole your beat, huh? Guess you \n                         forgot to brown-nose the right people.\n\n                                     SHAVERS\n                         Is that supposed to be funny? I'm \n                         not laughing. I've worked for ten \n                         years to get my shot at being a field \n                         agent, funny boy. And ar the last \n                         minute I get bumped by you, some \n                         reject from the Ozzfest.\n\n                                     XANDER\n                         Why don't you show me some gear before \n                         you get hurt.\n\n                                     SHAVERS\n                         Listen to you. Right away, sir, \n                         anything you say, sir.\n\n               Shavers pops open the first metal case. Inside are various \n               GADGETS laid into the molded carbon fiber lining.\n\n                                     XANDER\n                         What is all this? I didn't even order \n                         some of this stuff.\n\n               Shavers holds up a small METAL BALL.\n\n                                     SHAVERS\n                         You're gonna need it, rookie, trust \n                         me.\n\n               The metal ball unrolls into a six legged ROBOT INSECT.\n\n                                     SHAVERS\n                         An all-terrain mobile video monitoring \n                         system for surveillance. I call it \n                         the \"Roach Cam\". See the little camera \n                         it's got for a head?\n\n               Xander picks it up.\n\n                                     XANDER\n                         Kinda looks like you.\n\n               Shavers snatches it back. He puts on a METAL GLOVE, it's \n               fingers are SHARP TALONS.\n\n                                     SHAVERS\n                         \"Terminator\" climbing claws.\n\n               He CLAMPS the claw onto the metal case. It holds fast.\n\n                                     SHAVERS\n                         Miniature power cams set in on \n                         contact, giving you a sure grip on \n                         any surface.\n\n                                     XANDER\n                         They come in any other styles or \n                         colors?\n\n               He tosses the glove aside, pulls out a DART GUN.\n\n                                     SHAVERS\n                         This is your standard dart gun.\n\n                                     XANDER\n                         That one I'm real familiar with.\n\n               Shavers displays a case of DARTS.\n\n                                     SHAVERS\n                         You've got your chromium knock-out \n                         dart, microphone listening dart, \n                         explosive dart, even one with a \n                         splatter blood packet, whatever you \n                         need. They also come in a special \n                         9mm casing for use with your service \n                         pistol.\n\n               Xander pulls out some SUPER BINOCULARS.\n\n                                     SHAVERS\n                         Multi-view binoculars. Nine different \n                         enhanced vision modes, plus a digital \n                         camera.\n\n               Xander looks through them, starts cycling through the \n               different modes.\n\n               BINOCULAR P.O.V. - we see the various modes as Xander scans \n               the grounds.\n\n                                     SHAVERS\n                         Infrared, starlight... Even a special \n                         \"penetrator\" mode to see through \n                         walls, curtains, almost anything...\n\n               Xander aims at the shooting range.\n\n               BINOCULAR P.O.V. - we see through the clothes of the FEMALE \n               COPS on the shooting range. (PG-13 style, of course). We can \n               even see the INNER WORKINGS of their GUNS. One of the Female \n               Cops turns and gives Xander an approving look.\n\n                                     XANDER\n                         I think I'll hang on to these.\n\n                                     SHAVERS\n                         Think again, that's government \n                         property. You have to sign for \n                         everything. I've got one more that \n                         wasn't on your list.\n\n               Shavers pulls out a JUMPSUIT.\n\n                                     XANDER\n                         From the Beastie Boys collection?\n\n                                     SHAVERS\n                         It's a stakeout suit. It's got food, \n                         water, recording gear, anything you \n                         need for covert spying. It's all-\n                         weather, fire retardant, and if you \n                         give this buckle a sharp pull, the \n                         whole outfit deploys into a parachute.\n\n                                     XANDER\n                         You're joking, right?\n\n               Shavers just gives him a deadpan look.\n\n                                     SHAVERS\n                         Now that I've given you the overview, \n                         we're going to spend the next couple \n                         hours going into extensive operational \n                         detail.\n\n                                     XANDER\n                         I thought that was in detail.\n\n               As Shavers drones on, Xander hangs his head.\n\n               EXT. WAREHOUSE DISTRICT - DAY\n\n               The TEN BLACK MARKET EUROPEAN SPORTS CARS are loaded on two \n               TRANSPORT TRUCKS. Mafiya BODYGUARDS keep watch.\n\n               The Ivans (in Teamster garb) inspect the cars while Xander \n               supervises. Anders hovers around him.\n\n                                     ANDERS\n                         So what you think? Beautiful!\n\n               Sitting in an OFFICE watching are Yorgi, Kirill and Petra.\n\n               Petra has a LAPTOP.\n\n                                     YORGI\n                         Has it arrived yet?\n\n               Petra checks her computer. ON SCREEN she's monitoring their \n               BANK ACCOUNT.\n\n                                     PETRA\n                         Nothing. He had two days.\n\n                                     YORGI\n                         Perhaps he is not all he says he is.\n\n               Outside the Ivans nod approval and Xander heads to the office. \n               Yorgi looks to kirill, who puts his hand on his PISTOL.\n\n               Xander opens the door.\n\n                                     XANDER\n                         Very nice. I'm impressed.\n\n                                     YORGI\n                         I'm somewhat less so. We seem to \n                         have a bit of a problem...\n\n               Just then Petra's computer BEEPS and the MONEY floods into \n               their account. Xander holds up a CELL PHONE and smiles.\n\n                                     XANDER\n                         I had to inspect the merchandise \n                         first.\n\n                                     YORGI\n                         Of course.\n\n               He nods for Kirill to stand down.\n\n               OUTSIDE - the two transport trucks are driven off by the \n               Ivans. As they pull out they reveal ANOTHER CAR under a COVER.\n\n                                     XANDER\n                         What's this?\n\n                                     YORGI\n                         This is a gift. From me to you.\n\n               Anders pulls off the cover, revealing a cherry '72 PONTIAC \n               GTO.\n\n                                     YORGI\n                         It's a little nothing, you take it.\n\n               Xander checks out his new ride. Yorgi gets in the passenger \n               seat.\n\n                                     YORGI\n                         Come on, get in.\n\n               Xander sits behind the wheel and STARTS IT UP. The big engine \n               ROARS.\n\n                                     XANDER\n                         You're alright, Yorgi.\n\n               Next door to the warehouse sits an ABANDONED BUILDING. Up on \n               the sloped roof, Slovo spies down on the transaction. He's \n               got a camera with a big zoom lens.\n\n                                     SLOVO\n                         Smile, bychara.\n\n               Slovo snaps a few pictures but his view is obscured. To get \n               a better vantage, he JUMPS DOWN onto a lower part of the \n               roof.\n\n               CRUNCH! His foot BREAKS THROUGH THE SHABBY ROOF TILE.\n\n               Down below, Kirill hears the noise.\n\n                                     KIRILL\n                         Yorgi!\n\n               They all look to the abandoned building.\n\n               Through the second floor window they can see Slovo's leg \n               poking through the ceiling.\n\n               Xander is taken aback.\n\n                                     YORGI\n                         What in the hell...?\n\n               Yorgi turns to Xander, goes for his pistol.\n\n               Thinking fast, Xander does the same.\n\n               They draw simultaneously and hold the guns to each other's \n               heads as they sit in the car. Petra, Kirill and Anders draw \n               as well, all of them covering Xander.\n\n                                     YORGI\n                         What's going on, my friend?\n\n                                     XANDER\n                         You tell me! You got a sniper up \n                         there or what?\n\n                                     YORGI\n                         He's not with us, Xander. He must be \n                         with you.\n\n                                     XANDER\n                              (he cocks the hammer)\n                         Bullshit! You get your boy off that \n                         roof or I swear to God I'm gonna \n                         give you another hole to breathe out \n                         of.\n\n               Yorgi stares, finally believes him. He lowers his gun.\n\n                                     YORGI\n                         Get him! Find out who he is!\n\n               By now Slovo is down the fire escape. He hits the ground and \n               goes running down the street.\n\n               The Anarchy 99 crew heads for their cars. Xander SPINS the \n               cylinder on his REVOLVER.\n\n                                     XANDER\n                         I've got him. Buckle up.\n\n               The GTO peels out.\n\n               EXT. STREET - DAY\n\n               Slovo is huffing and puffing as fast as he can when Xander \n               comes skidding around the corner. He looks back and sees the \n               speeding GTO.\n\n                                     YORGI\n                         That's the cop from the club!\n\n               Xander does the only thing he can. He puts the car sideways \n               and aims out the window as he slides to a stop.\n\n               Slovo turns and BLAM! Xander SHOOTS Slovo right in the chest.\n\n               IN SLO-MO: a spray of BLOOD erupts from his chest and Slovo \n               falls backwards, his face frozen in a look of shock and \n               betrayal.\n\n               The smoking shell clatters to the ground.\n\n               Slovo blinks up at Xander, gasping for words, then lays still.\n\n               Xander hops out, rifles through Slovo's pockets. The other \n               Anarchy 99 cars pull up, the whole group looking on.\n\n                                     YORGI\n                         What are you doing? Get in the car!\n\n               Xander heads back to the GTO and the cars peel out.\n\n               INT. GTO - MOVING - DAY\n\n               The rest of Anarchy 99 follows behind the GTO.\n\n                                     YORGI\n                         I don't believe it! You can't shoot \n                         a cop in the middle of the street!\n\n                                     XANDER\n                              (grim)\n                         Had to do what I had to do.\n\n               He pulls out the roll of FILM. Yorgi laughs.\n\n                                     YORGI\n                         You say you get a million, you get \n                         the million. Some cop gives us shit, \n                         he's dead. Jesus Christ, man, you're \n                         hard-core!\n\n               EXT. DEAD END STREET - DAY\n\n               The Ivans pull up in their transport trucks. They see all \n               the blood and rush towards Slovo. But something doesn't look \n               right.\n\n               Ivan 1 TASTES the blood and spits it out.\n\n                                     IVAN 1\n                         It's sweet.\n\n               Ivan 2 pulls a CHROME DART from Slovo's chest. Slovo GROANS.\n\n               INT. NIGHTCLUB - NIGHT\n\n               It's a crowded basement rave club. Hot and sweaty RAVERS \n               dance in provocative outfits. The Anarchy 99 group is standing \n               on the best booth, right on the packed dance floor.\n\n               Surrounding them are a handful of MAFIYA BODYGUARDS who stand \n               at attention like the Secret Service.\n\n               Anders swings from a water pipe and then drops onto the table, \n               smashing glass.\n\n               A DRUNK GUY tries to pull Petra onto the dance floor and she \n               PUNCHES him. The Bodyguards drag the dude out for a proper \n               thrashing. Yorgi shatters a BOTTLE against the wall.\n\n                                     YORGI\n                         Total chaos, man! Welcome to Anarchy \n                         99!\n\n                                     XANDER\n                         What's \"Anarchy 99\"?\n\n                                     YORGI\n                         It's all this craziness! It's what \n                         we've been living since 99, when we \n                         left the Army. One of our brothers \n                         died in Grozny and we said the hell \n                         with this shit. What for? He dies \n                         for what? Politics? Who's politics? \n                         Not ours.\n\n                                     XANDER\n                         You wanna see my politics?\n\n               Xander shows him a TATTOO on his arm. It shows PLANET EARTH \n               with a giant SCREW through it.\n\n                                     XANDER\n                         Screw the world. If I'm gonna die \n                         for something, it better be bitches \n                         and money.\n\n                                     YORGI\n                         That's what I'm talking about, man! \n                         That's why Anarchy 99 was born.\n\n               Yorgi rolls up his sleeve, revealing an Anarchy 99 tat (a \n               circled \"A\" with \"99\" underneath).\n\n                                     YORGI\n                         To us it means no walls, no speed \n                         limits, no jails. It's everybody \n                         does what he wants. People think \n                         democracy is freedom but they don't \n                         have a clue. There's an old punk \n                         song. It says: \"America stands for \n                         freedom, but if you think you're \n                         free...\"\n\n                                     XANDER\n                         \"...try walking into a deli and \n                         urinating on the cheese\". 'Anarchy \n                         Burger' by the Vandals.\n\n                                     YORGI\n                         You got it, man. It's stupid but \n                         it's true. True freedom is when you \n                         do whatever you want anytime you \n                         want. That's when you know you're \n                         living, man.\n\n                                     XANDER\n                         How you gonna do that with government \n                         and rules everywhere?\n\n                                     YORGI\n                         Easy. You get enough money that you \n                         grow an ass big enough for the whole \n                         world to kiss.\n\n               Yorgi throws a fistful of money onto the dance floor. The \n               Xed out ravers swat it around like confetti.\n\n                                     YORGI\n                         You hang with us, buddy, taste some \n                         freedom! Petra! Dance with this guy!\n\n               Yorgi melts into the dance floor crowd, leaving Xander alone \n               with Petra. She gets up grumpily and starts dancing. Xander \n               joins her, but she won't even look at him.\n\n                                     XANDER\n                         This is great, dancing with the back \n                         of your head.\n\n               She reluctantly turns around.\n\n                                     XANDER\n                         If you got a problem with me, why \n                         are we dancing?\n\n                                     PETRA\n                         Yorgi asked me to.\n\n                                     XANDER\n                         You do everything Yorgi says?\n\n                                     PETRA\n                         Go to hell.\n\n                                     XANDER\n                         It's gonna be like that, huh? You \n                         got all bent out of shape as soon as \n                         he started dancing with someone else. \n                         Why's that?\n\n                                     PETRA\n                         Mind your business.\n\n                                     XANDER\n                         Did you guys used to date? That's \n                         it, right? He broke your heart and \n                         you're still soft on him. That's \n                         funny, it don't seem to fit with a \n                         tough broad like you.\n\n               She glares at him and walks away. Xander follows.\n\n                                     XANDER\n                         Where are you going?\n\n                                     PETRA\n                         Why are you still hanging around? \n                         Your business is finished, you should \n                         go home.\n\n                                     XANDER\n                         I was invited. What's your story?\n\n                                     PETRA\n                         I don't know who you are or where \n                         you come from, but I don't like you. \n                         You ask too many questions.\n\n               There's a big line outside the \"ladies\" and no line at the \n               \"men's\". Petra heads into the Men's Room.\n\n               Some DUDE whistles at her. She pushes him out of the way and \n               enters a stall. Xander leans on the sink.\n\n                                     XANDER\n                         Come on, don't front like that. You'll \n                         put a guy right off you.\n\n                                     PETRA\n                         Don't even bother, X man, I'm not \n                         your type.\n\n                                     XANDER\n                         That right? Why's that?\n\n               The stall door flies open and Petra marches out.\n\n                                     PETRA\n                         My chest is too small and my brain \n                         is too big.\n\n               She shoves him to the door and stomps back to her stall.\n\n               Xander walks back out, shaking his head and laughing.\n\n               Across the room, Viktor shoves the D.J. out of the way and \n               puts on \"ANARCHY BURGER\" by the Vandals. The rave dance is \n               interrupted by the pounding punk beat.\n\n                                     YORGI\n                         Xander, check it out! The revolution \n                         begins!\n\n               Viktor and Anders swiftly turn the dance floor into a violent \n               mosh pit. Xander can't help it, he actually likes these guys.\n\n                                     YORGI\n                         Let's get some air, man.\n\n               Yorgi and Xander head outside. A moment later, Kirill hurries \n               out another door.\n\n               EXT. PRAGUE RIVERFRONT - NIGHT\n\n               It's late. Yorgi and Xander stroll along the river.\n\n                                     XANDER\n                         You got a great set-up here Yorgi. \n                         You really know how to live.\n\n                                     YORGI\n                         It's a beautiful town, Prague. It's \n                         been good to me.\n\n                                     XANDER\n                         I've been here before, when I was a \n                         kid. My old man was in the service, \n                         we used to live on the Army base in \n                         Hamburg.\n\n                                     YORGI\n                         You, an Army brat? I don't see that \n                         one at all. Did you join the service \n                         as well?\n\n                                     XANDER\n                         Hell no. My dad was a straight up \n                         tin soldier. Somehow he pissed this \n                         general off and got himself \n                         dishonorably discharged. Had a court \n                         martial and everything. The charges \n                         were total bullshit, so he was sure \n                         he'd get his name cleared, but it \n                         didn't happen.\n\n                                     YORGI\n                         Connections and politics, it's the \n                         same everywhere.\n\n                                     XANDER\n                         My old man, he bought into the system, \n                         and it screwed him. So he swallowed \n                         a bullet. Me, I don't believe in \n                         nothing I can't see and touch.\n\n               The camera suddenly ZOOMS across the city, flying over streets \n               and houses until, half a mile away, it finds Kirill in a \n               window with his SNIPER RIFLE.\n\n               P.O.V. THROUGH SCOPE - Xander's head is in the crosshairs.\n\n               The scope pans over to Yorgi, who looks INTO CAMERA and gives \n               a small signal, calling off the hit.\n\n               BACK ON YORGI AND XANDER\n\n               Yorgi looks up at a \"PRAGUE PEACE CONFERENCE\" banner.\n\n                                     YORGI\n                         Next week these idiots are having a \n                         peace conference here. What the hell \n                         are they going to talk about? It's \n                         the system itself that causes all \n                         the world's problems. You're okay, \n                         buddy. Come on, it's getting early.\n\n               They stroll off and Kirill stands down.\n\n               EXT. PRAGUE STREETS - SUNRISE\n\n               A flotilla of VEHICLES (Xander's GTO among them) drives \n               through the gate in a massive, stone wall. It's a big manor \n               house in the middle of town.\n\n               INT. MEDIEVAL MANOR - COURTYARD - PRAGUE - SUNRISE\n\n               The GTO, sedans, SUV's park in the courtyard. Xander sees a \n               row of MOTORCYCLES parked here as well.\n\n               Xander also sees a Guard hit a switch that LOWERS the HEAVY \n               WOODEN GATE.\n\n               Yorgi corrals a bunch of STRIPPERS he's brought home.\n\n                                     YORGI\n                         This way, girls, let's go!\n\n               He leads the whole troop inside.\n\n               INT. MEDIEVAL MANOR - HALLWAY - SUNRISE\n\n               As they go down the hall/Xander sees ROOMS FULL OF OFFICE \n               WORKERS and MAFIYA GOONS.\n\n                                     VIKTOR\n                         Diversified global operations. The \n                         sun never sets on our empire.\n\n               Xander takes in WORLD MAPS, FAX MACHINES, BANKS OF COMPUTERS.\n\n               For all their screwing around, it's clear Anarchy 99 runs a \n               large operation.\n\n               INT. MEDIEVAL MANOR - MAIN HALL - SUNRISE\n\n               With leaded glass windows overlooking the river, this place \n               is beautiful. Inside it's done up more like the house from \n               MTV's \"Real World\", except trashed. There's cool fish tanks, \n               a pool table, PS2 on a flatscreen and spray paint and holes \n               all over the walls.\n\n               SERVANTS welcome them with food and Yorgi's SECRETARY gives \n               him important messages.\n\n                                     YORGI\n                              (sorting through \n                              messages)\n                         Not bad, yes? The original owners, \n                         they just one day decide to move \n                         out.\n\n               Anders starts pounding on a drumset. Petra kicks a soccer \n               ball at him.\n\n                                     PETRA\n                         Yeb vas, z'opa. Shut up!\n\n               Yorgi paws at a Stripper.\n\n                                     YORGI\n                         I've got meetings this afternoon, \n                         I've got to get some sleep. Just \n                         pick a girl.\n\n                                     XANDER\n                         That's alright, I'm kinda tired.\n\n                                     YORGI\n                         You want to insult me? This is my \n                         hospitality. Pick one.\n\n               Xander points at one of the Strippers. She's wearing a \n               fashionable FLAK JACKET.\n\n                                     YORGI\n                         Good, now find a room to crash in.\n\n               Petra, show him.\n\n               The surly Petra opens a door, revealing a hall of doors.\n\n               Xander and Flak Jacket follow.\n\n                                     XANDER\n                         You gonna tuck us in?\n\n               She just gives him a nasty look, walks into her room and \n               slams the door. Xander scratches his head and picks a room.\n\n               The others shuffle off to their beds with their Strippers.\n\n               INT. MEDIEVAL MANOR - XANDER'S ROOM - SUNRISE\n\n               Flak Jacket is out of sight in the bathroom. Xander talks to \n               her while he gets undressed.\n\n                                     XANDER\n                         Listen, no offense, but I'm not in \n                         the market right now, okay? You can \n                         stay here, but let's not --\n\n               He trails off as she steps out of the bathroom. She's wearing \n               just a G-string and the flak jacket.\n\n                                     XANDER\n                         You don't understand a word I'm \n                         saying, do you?\n\n               She just smiles at him sweetly and pulls his shirt off. She \n               looks at the ENGAGEMENT RING still pierced through his nipple \n               and gives a puzzled look.\n\n                                     XANDER\n                         Stupid, right? That's what I was \n                         trying to tell you. I just got out \n                         of this heavy thing...\n\n               She kisses him and lets the flak jacket fall (PG-13 style).\n\n                                     XANDER\n                         The things I have to do for my \n                         country.\n\n               He gives in and starts making out with her.\n\n                                                               DISSOLVE TO:\n\n               INT. MEDIEVAL MANOR - HALLWAY - LATER THAT MORNING\n\n               Xander sneaks out of his room and down the hail. Behind him, \n               we can see Flak Jacket asleep amongst the tussled sheets.\n\n               INT. MEDIEVAL MANOR - MAIN HALL - MORNING\n\n               Anders is snoring on the floor. Xander skirrs around him and \n               goes through another door.\n\n               INT. MEDIEVAL MANOR - OFFICE - DAY\n\n               Xander finds an office and starts going through the desk. He \n               finds a PALM PILOT and snaps a RECORDING DEVICE to the bottom. \n               In seconds he's copied everything on it. He moves on to some \n               drawers.\n\n                                     PETRA\n                         What are you doing?\n\n               He turns, sees Petra standing in the doorway with a GUN.\n\n                                     XANDER\n                         Looking for a phone book. I want to \n                         call a cab. Unless you wanna give me \n                         a ride?\n\n               She shuts the door, advances, staring him down.\n\n                                     PETRA\n                         Who are you?\n\n                                     XANDER\n                         We hung out last night, remember?\n\n                                     PETRA\n                         I also remember you drove your car \n                         here. Who are you really? Make no \n                         mistake, I will shoot you and not \n                         feel bad about it. Who are you working \n                         for?\n\n                                     XANDER\n                         Hey, take it easy. I'm just a dude \n                         trying to make a buck.\n\n               She SLAPS him, hard.\n\n                                     PETRA\n                         Bullshit. I see you look at \n                         everything, study everything, ask \n                         questions. I know exactly what you're \n                         doing. Empty your pockets.\n\n                                     XANDER\n                         You've got to relax, baby, you're \n                         paranoid.\n\n               She SLAPS him again and Xander goes for her gun. Before he \n               can pry it from her hand, she's pulled another gun from \n               nowhere and has it jammed against his neck. He lets go.\n\n                                     XANDER\n                         Hey, you're good.\n\n                                     PETRA\n                         Maybe we should start again, yes? I \n                         know so little about you, except \n                         that you're not what you say you \n                         are.\n\n                                     XANDER\n                         That makes two of us then, sweetheart, \n                         because I ain't buying your bullshit \n                         either. You're not like them, I can \n                         see it in your eyes. So you tell me, \n                         who's bullshitting who?\n\n               INT. YORGI'S BEDROOM - DAY\n\n               There are THREE STRIPPERS asleep in bed. Yorgi is sitting at \n               his COMPUTER in his underwear.\n\n               He's hacked in to the CZECH POLICE network.\n\n                                     YORGI\n                         Something bothers me about you, Mr. \n                         Xander Cage...\n\n               He looks around a bit, doesn't find what he's looking for.\n\n               He sits up, getting pissed.\n\n                                     YORGI\n                         Get Kirill. Now!\n\n               She heads out. Yorgi goes to the bathroom, splashes water on \n               his face.\n\n               Kirill enters, still half asleep.\n\n                                     KIRILL\n                         What's the problem?\n\n                                     YORGI\n                         I'm inside the police mainframe. Do \n                         you see anything?\n\n               Kirill studies the screen while Yorgi pulls on clothes.\n\n                                     KIRILL\n                         What?\n\n                                     YORGI\n                         I've searched their E-mail. No funeral \n                         announcement, no obituary, no call-\n                         to-arms. Nothing on the news, even. \n                         I swear I saw a cop get shot \n                         yesterday. How come no one is talking \n                         about it?\n\n               Kirill looks back at the screen. Nothing there.\n\n                                     YORGI\n                         I also check the wire transfer. I \n                         follow the money back to it's source, \n                         but there is no source. It comes \n                         from nowhere. First they bring CIA, \n                         then British SAS, now maybe they \n                         plumb the lower depths. Maybe now \n                         they send someone who looks like us. \n                         Maybe someone like our houseguest \n                         Mr. X.\n\n               INT. MEDIEVAL MANOR - OFFICE - DAY\n\n               Petra still has the gun on Xander.\n\n                                     PETRA\n                         I don't know what you're talking \n                         about.\n\n                                     XANDER\n                         The eyes don't lie. All this has \n                         gotten to you, hasn't it, Petra? You \n                         came in as Yorgi's girlfriend and \n                         you stayed because it was fun. Now \n                         you don't like it so much, but you're \n                         in so deep you can't get out anymore. \n                         Tell me if I'm wrong, Petra.\n\n                                     PETRA\n                         Go to hell!\n\n                                     XANDER\n                         Look at you. You're helping run things \n                         now. You're a gangster. I bet that \n                         snuck up on you. You woke up one day \n                         and you were a criminal.\n\n               She pulls back the hammer on her gun.\n\n                                     XANDER\n                         It's cool, I feel you. I might even \n                         be able to help. Here, let me show \n                         you something. You wanna see what's \n                         in my pocket, I'll show you.\n\n               He makes a move and she jabs the gun at him. She reaches \n               into the pocket for him and pulls out his little data \n               recorder.\n\n                                     PETRA\n                         What are you?\n\n                                     XANDER\n                         I'm an information gatherer. You \n                         wanna go somewhere and talk about \n                         it?\n\n               INT. MEDIEVAL MANOR - HALLWAY - DAY\n\n               Yorgi creeps down the hall, Kirill in tow. They both screw \n               SILENCERS onto their PISTOLS.\n\n               They flatten themselves up against the wall and prepare to \n               burst into Xander's room.\n\n               One...\n\n               Two...\n\n               THREE! They kick in the door and aim their guns around.\n\n               Flak Jacket sits up, terrified.\n\n               Yorgi and Kirill lower their guns. Viktor stumbles by in his \n               underwear.\n\n                                     YORGI\n                         Where is he?\n\n                                     VIKTOR\n                         They went to breakfast.\n\n               INT. ROMANTIC RESTAURANT - DAY\n\n               This is a beautiful and historic Prague location with WINDOWS \n               and a nice view. It's rather fancy and PACKED with UPSCALE \n               PATRONS. Petra and Xander sit in the middle of the room, \n               sticking out badly in their grungy clothes.\n\n               A WAITER takes their order.\n\n                                     PETRA\n                         Perogies, potato pancakes, fried \n                         goose livers, the sausage plate and \n                         a pot of Turkish coffee.\n\n               Xander shakes his head.\n\n                                     XANDER\n                         I'm just gonna have a garden salad. \n                         Oil and balsamic vinegar on the side.\n\n               The Waiter takes off. Petra puffs on a cigarette, staring at \n               Xander.\n\n                                     PETRA\n                         That's how you eat? It's like a \n                         gerbil.\n\n                                     XANDER\n                              (shrugs)\n                         I'm from L.A.\n\n                                     PETRA\n                         So why don't you tell me something \n                         about who you gather information \n                         for. They obviously have very deep \n                         pockets. Are you from a rival clan?\n\n                                     XANDER\n                         Let's just say I'm freelancing and \n                         leave it at that.\n\n                                     PETRA\n                         Whoever sent you knew what they were \n                         doing. You and Yorgi are practically \n                         twins. Two nihilistic fashion victims \n                         who make a lot of noise but don't \n                         say much.\n\n                                     XANDER\n                         Don't judge a comic book by it's \n                         cover.\n\n                                     PETRA\n                         You agree with a lot of what he says, \n                         don't you.\n\n                                     XANDER\n                         I know where he's coming from. The \n                         only thing I really don't get is why \n                         he dumped you. Up until I found that \n                         out, I thought his judgment was pretty \n                         sound.\n\n                                     PETRA\n                         Don't even start. I'll be honest, I \n                         don't trust you. Bur lets pretend \n                         for a minute that what you say is \n                         true, that I want to leave. What can \n                         you do about it?\n\n                                     XANDER\n                         The people I know want facts, the \n                         kinds of things an insider would \n                         know. They're interested in putting \n                         Anarchy 99 out of business.\n\n                                     PETRA\n                         All I have to do is risk my life \n                         providing you with these facts.\n\n                                     XANDER\n                         We could work together. Then maybe \n                         we could both get the hell out of \n                         here. There's a beach in Bora Bora \n                         with my name on it.\n\n                                     PETRA\n                         A beach named X? That I'd like to \n                         see.\n\n                                     XANDER\n                         So there you have it. I guess you \n                         just have to ask yourself, how bad \n                         to you want out?\n\n               She thinks on it. Then her cell phone RINGS.\n\n                                     PETRA\n                              (into phone)\n                         Da!\n\n                                     KIRILL (O.S.)\n                              (on phone)\n                         Listen very carefully, Petra. We \n                         think Cage may be an American agent, \n                         do you understand what I'm telling \n                         you?\n\n                                     PETRA\n                              (into phone)\n                         Yes.\n\n                                     KIRILL (O.S.)\n                              (on phone)\n                         Don't worry, I've got your back. I'm \n                         right across the street, above the \n                         bakery. Just bring him outside and \n                         let me do the rest.\n\n               Kirill hangs up. She looks back at Xander, shell shocked.\n\n                                     XANDER\n                         What's up? Is there a problem?\n\n               She studies his eyes, decides to risk it.\n\n                                     PETRA\n                         They tell me you're an American agent.\n\n                                     XANDER\n                         What are you talking about?\n\n                                     PETRA\n                         There's no more time for games. They \n                         made you. There's a sniper out front \n                         waiting to put a bullet in your eye. \n                         Tell me if it's true.\n\n                                     XANDER\n                         It's a long story, but yeah, more or \n                         less.\n\n                                     PETRA\n                         Jesus Christ. You're going to have \n                         to go out the back. The data that \n                         you copied with your toy. Tomorrow, \n                         at six o'clock. Look it up. We're \n                         taking a trip. Be there at six and \n                         you'll have plenty to tell your \n                         people.\n\n                                     XANDER\n                         If I go out the back, he'll know \n                         you've warned me.\n\n                                     PETRA\n                         That's alright, I'll figure something \n                         out.\n\n                                     XANDER\n                         Not an option. Just get up slowly \n                         like everything's cool. Petra, trust \n                         me. You just hung yourself out to \n                         dry for me, I'm not gonna let you \n                         down.\n\n               EXT. BAKERY ROOF - DAY\n\n               Kirill lays on his stomach, peering into the scope of his \n               SILENCED SNIPER RIFLE.\n\n                P.O.V. Through scope - he can faintly see them inside the \n               crowded restaurant. Xander and Petra are making their way \n               towards the exit.\n\n                                     KIRILL\n                         Nice and easy, Petra...\n\n               INT. ROMANTIC RESTAURANT - DAY\n\n               They work their way through the lunchtime crowd.\n\n                                     PETRA\n                         I can't let this happen. I want you \n                         to go out the back. I'll make up \n                         some excuse.\n\n                                     XANDER\n                         They'll kill you, you know they will. \n                         Besides, there is no back door. Keep \n                         smiling. Ready? Now.\n\n               EXT. ROMANTIC RESTAURANT - DAY\n\n               Xander's timed it perfectly so that just as they get to the \n               door, a BUS passes by.\n\n               Kirill keeps focused, waiting for the bus to pass.\n\n                P.O.V. THROUGH SCOPE - Xander's head is sporadically visible \n               through the bus windows.\n\n               Kirill's finger tightens on the trigger...\n\n               As soon as the bus passes he FIRES!\n\n               But Xander's not there, he's ducked down to tie his shoe.\n\n               CRASH! The glass door behind him shatters. Feigning surprise, \n               Xander PUNCHES PETRA IN THE FACE and sprints down the block.\n\n               He runs bent low, the parked cars protecting him from the \n               sniper. Kirill fires anyway, taking out car windows.\n\n               At the end of the block is a long staircase with a METAL \n               RAIL down the middle.\n\n               As he runs by an outdoor restaurant Xander snatches the \n               SERVING TRAY from a startled WAITER, sending food and drink \n               flying.\n\n               He hops on the serving tray like it's a skateboard and does \n               a RAIL-SLIDE down the length of the stairs. He's moving too \n               fast for Kirill.\n\n               He jumps off at the bottom and the tray POPS UP INTO THE \n               AIR.\n\n               Kirill BLASTS it like a clay pigeon.\n\n               By now Xander is out of sight. Kirill pounds his rifle in \n               frustration.\n\n               Petra gets to the top of the stairs. She gives Kirill a \"Where \n               did he go?\" look. Her nose is bloody, helping to sell her \n               performance.\n\n               Then she turns and looks off after Xander. She sees his GTO \n               speeding away.\n\n                                                                   FADE TO:\n\n               EXT. NORWEGIAN FJORDS - LATE AFTERNOON\n\n               We're looking down at a SHIP moving through the fjord, seen \n               from high above. It's towing a SMALLER BOAT behind it. An \n               airplane? No, we're at the top of the Trollveggen, Norway's \n               legendary \"Troll Wall\". It's a near 5,000 foot sheer drop to \n               the ocean.\n\n               Six figures stand at the edge of the barren cliff. They wear \n               webbed \"squirrel\" jumpsuits, helmets and parachutes. On each \n               thigh they have pistols and on their chests they have silenced \n               MP-5 sub-machine guns. Together they stare down at the ship.\n\n               Petra is among them. She looks down at her watch. It is \n               precisely 5:59PM. She glances around. The top of the cliff \n               is rocky and flat. Xander is nowhere to be seen.\n\n               FIFTY YARDS AWAY - we see Xander sneaking forward military \n               style. He's got his \"stakeout suit\" on and is keeping low.\n\n               HE CHECKS HIS WATCH: \"6 PM\"\n\n               The members of Anarchy 99 put on their goggles and, without \n               saying a word, they leap off the Troll Wall.\n\n               Xander runs to the edge and looks down. He sees the group \n               freefailing down the sheer cliff face.\n\n                                     XANDER\n                         Very nice.\n\n               The six plummet away from him at incredible speed. In a hard \n               arch, they peak at 120 m.p.h.\n\n               Then, using the webbed wings under their arms and between \n               their legs, they go into aerodynamic \"track\" positions and \n               rocket away from the wall.\n\n               Like dark angels, they soar out over the water in formation.\n\n               ON THE SHIP BELOW --\n\n               The ship below is a scientific research vessel. On the deck, \n               a few SAILORS and SCIENTISTS watch the sun set.\n\n               The six dark figures close in rapidly.\n\n               At the last moment they pull their chutes and deftly glide \n               towards the ship.\n\n               A sailor looks up and spots them.\n\n               Before he can shout, he's SHOT IN THE LEG and goes down.\n\n               Seconds later, they're on the deck, tearing off their rigs.\n\n               They race across the deck, taking over the ship in a surgical \n               manner. They herd everyone back heading for the bridge.\n\n               Petra hangs back. She looks back at the cliff, up towards \n               Xander.\n\n               XANDER'S P.O.V.\n\n               Through his SUPER BINOCULARS we see them storming the bridge.\n\n               As they head inside, they disappear from view.\n\n               Xander hits a button on the side of the binoculars.\n\n                                     XANDER\n                         Let's see what's going on inside...\n\n               \"PENETRATOR\" P.O.V.\n\n               Now he can see THROUGH THE WALLS OF THE SHIP.\n\n               He sees THE CREW, herded into a room and LOCKED IN by Anarchy \n               99.\n\n               INT. SHIP - LATE AFTERNOON\n\n               Anarchy 99 seals the door, locking the crew away. They slap \n               five and bump chests, still totally amped up.\n\n               EXT. SHIP - LATE AFTERNOON\n\n               ANGLE ON - a LARGE SUBMERSIBLE VEHICLE. It's white and twelve \n               feet long. There are MOTORS on either side and a PANEL OF \n               SOLAR CELLS on the top of a periscope-like projection rising \n               from the back.\n\n               This is the AHAB DEVICE. It sits in the WET WELL at the back \n               of the ship, ready to be launched out the back sea doors.\n\n                                     YORGI\n                         Ready the boat.\n\n               There is a SMALLER BOAT moored to the back of the ship.\n\n               Kirill and Viktor hop onto it's deck. They start to WHISTLE \n               as they work. Sounds like the \"Andy Griffith\" theme.\n\n               XANDER'S BINOCULARS P.O.V.\n\n               He takes DIGITAL PHOTOS of the Ahab device.\n\n                                     XANDER\n                         What the hell are you guys stealing?\n\n               BACK ON THE SHIP\n\n               The smaller boat is launched and ready to do. Yorgi goes to \n               the WET WELL CONTROLS and hits a switch.\n\n               The aft doors open, letting water into the wet well. In \n               seconds Ahab starts to float. Anders loosens it from it's \n               moorings and they TIE AHAB TO THE BACK OF THE SMALLER BOAT.\n\n                                     KIRILL\n                         Ready.\n\n               Yorgi hits another switch, opening the BALLAST DOORS on the \n               port side of the ship. Air flows out, causing the ship to \n               list to one side.\n\n                                     PETRA\n                         What are you doing?\n\n                                     YORGI\n                         It all happened so fast. Such an \n                         unfortunate accident.\n\n               Yorgi MACHINE GUNS the wet well control panel.\n\n                                     YORGI\n                         Let's go.\n\n               They climb onto the boat. Petra is the last to board. She \n               looks up towards Xander and MACHINE GUNS the panel some more, \n               making sure he notices.\n\n               XANDER'S P.O.V.\n\n               He sees the smaller boat pulling away, the Ahab device being \n               towed behind. He pans over and ZOOMS IN on the shot-up control \n               panel.\n\n                                     XANDER\n                         What the hell...?\n\n               He pans over to the wet well and sees it's flooding.\n\n               With the ballast open on only one side, the ship starts \n               LISTING. The thing is going down.\n\n               He pans over, clicks into \"penetrator\" mode, and sees the \n               Crew pounding on the walls below decks. They're trapped, \n               their WRISTS AND ANKLES BOUND WITH PLEXI-CUFFS.\n\n               EXT. TOP OF TROLL WALL - LATE AFTERNOON\n\n               Xander puts down the binoculars and gets up.\n\n                                     XANDER\n                         No way, man, no way. I'm just supposed \n                         to be an observer. Aw shit. This job \n                         sucks.\n\n               He pats his jumpsuit, checking for the buckle.\n\n                                     XANDER\n                         Toby Lee Shavers, if this thing don't \n                         work, your ass is kicked.\n\n               Xander steels himself, takes a few deep breaths.\n\n               Then he sprints to the edge and JUMPS off the cliff...\n\n               And that's it. He's gone. One mile, straight down.\n\n               Suddenly we're falling with him.\n\n               We hear the rush of air as he free-falls a dozen feet from \n               the craggy rock face.\n\n               The force of the wind ripples his cheeks.\n\n               He streamlines himself into a track position and jets away \n               from the cliff like Superman.\n\n               Before he gets too low, he RIPS THE BUCKLE.\n\n               Immediately his jumpsuit TEARS OFF HIS BODY in MULTIPLE \n               LAYERS, unfurling into a full sized PARASAIL.\n\n               Xander looks up at his parasail, relieved, and glides towards \n               the ship.\n\n               EXT. SMALLER BOAT - LATE AFTERNOON\n\n               Petra spots the parasail and has to act quickly to keep Yorgi \n               from spotting it. She grabs him suddenly and KISSES him.\n\n                                     YORGI\n                         What was that for?\n\n                                     PETRA\n                         I'd forgotten how exciting it is \n                         working together.\n\n                                     YORGI\n                         You've been so quiet lately, Petra, \n                         I thought you no longer cared.\n\n                                     PETRA\n                         Why don't we go below decks and work \n                         off some of this adrenaline.\n\n                                     YORGI\n                              (smiles)\n                         Viktor! Stay the course.\n\n               Yorgi kisses her again and heads to the cabin below.\n\n               EXT. SHIP - LATE AFTERNOON\n\n               Xander comes in for a perfect landing. He lands on the listing \n               deck and undoes his harness.\n\n               He sees several WOUNDED scattered on the deck.\n\n                                     XANDER\n                         Son of a bitch!\n\n               He looks across the water, sees the smaller boat far away.\n\n               EXT. SMALLER BOAT - LATE AFTERNOON\n\n               Petra looks back one last time, catching sight of Xander on \n               the deck of the ship. She smiles, relieved.\n\n               Then she turns solemn as she heads below decks to pay the \n               price.\n\n               EXT. SHIP - LATE AFTERNOON\n\n               Xander gets to the wet well and sees the water flooding in.\n\n               With the ship listing like this, the water is pouring below \n               decks.\n\n               INT. SHIP - LATE AFTERNOON\n\n               Xander opens a hatch and lowers himself into the hold. Here \n               is where the entire Crew has been left to drown. They are \n               struggling to stay above water, their hands and feet bound.\n\n               As the far end of the room is another HATCH. Water pours in \n               from this one and Xander has to get it shut.\n\n               He swims through the struggling Crew, spots the CAPTAIN \n               holding his YOUNG SON above water. The water is rising \n               rapidly, filling up the compartment.\n\n               Xander braces his feet against the bulkhead and PUSHES, but \n               the force of the water is too much.\n\n               He surfaces. He's got to wait until the room floods before \n               he can close that door.\n\n               He watches as the Crew goes into a panic, the water rising \n               up to the ceiling. They are gasping in the last foot of air \n               that's available. He sees the Captain's Son, crying and \n               clutching at his father.\n\n               Xander takes a deep breath and dives down. He grabs the hatch \n               door, braces his feet and PULLS.\n\n               His muscles strain as the heavy metal door slowly swings \n               SHUT.\n\n               Xander surfaces and swims to the ladder. He CUTS the Captain's \n               plastic cuffs.\n\n                                     XANDER\n                         Is the boy alright?\n\n                                     CAPTAIN\n                         Yes. I will cut the others loose, \n                         you must run the bilge pumps!\n\n               The Captain takes the knife and swims to free his men.\n\n               Xander takes the Captain's Son and climbs up the ladder.\n\n               EXT. SHIP'S BRIDGE - LATE AFTERNOON\n\n               Xander scans the controls but has no idea what he's looking \n               for. The Captain's Son shows him the right switch.\n\n                                     XANDER\n                         You sure?\n\n               The Son nods and Xander flips the switch. MOTORS start to \n               HUM.\n\n               EXT. SHIP - LATE AFTERNOON\n\n               The bilge pumps spew out water furiously. Crew members come \n               up from below decks. They are soaked and grateful. They go \n               about tending to the wounded as Xander slumps down next to \n               the exhausted Captain.\n\n                                     XANDER\n                         Captain, huh? You get a lot of broads \n                         with that uniform?\n\n               They both laugh, relieved, as the ship slowly rights itself.\n\n                                                                   FADE TO:\n\n               INT. CONFERENCE ROOM - THAT NIGHT\n\n               Xander is in a room with the SCIENTISTS from the ship. They \n               have blueprints of the torpedo spread out. The Captain's Son \n               is wrapped in BLANKETS, shivering.\n\n               Xander is talking to Gibbons on his communicator.\n\n                                     XANDER\n                              (into communicator)\n                         They call it \"Ahab\", it's a solar \n                         powered submersible. It can \n                         circumnavigate the globe on it's \n                         own. They use it to track and study \n                         the migration patterns of whales.\n\n               INTERCUT WITH GIBBONS IN THE ULTIMATE INFORMATION ROOM\n\n               Gibbons jots down the information furiously.\n\n                                     GIBBONS\n                         You did say \"Ahab\"? You're sure about \n                         that?\n\n                                     XANDER\n                         Yeah, I sent you pictures. Here's \n                         what I'm thinking. If they take out \n                         the cameras and sensors, they could \n                         probably put a bomb in this thing. \n                         You drop it in the water in the Red \n                         Sea and three weeks later it's \n                         swimming up the Potomac.\n\n                                     GIBBONS\n                         This is good work, X, damn fine work. \n                         You need to press on at all costs, \n                         find out what they have planned with \n                         this \"Ahab\".\n\n                                     XANDER\n                         Hey, one miracle at a time. They're \n                         on to me now, remember?\n\n                                     GIBBONS\n                         I'm gonna be en route with a team \n                         shortly to relieve you. Just keep \n                         the pressure on until the cavalry \n                         arrives. And X? You done yourself \n                         proud helping those people today.\n\n               Xander tussles the hair of the Captain's Son.\n\n                                     XANDER\n                         Thanks.\n\n                                     GIBBONS\n                         You're a grungy little phoenix, you \n                         know that? Keep up the good work.\n\n                                     XANDER\n                         You ain't seen nothing yet.\n\n                                                                    CUT TO:\n\n               EXT. CZECH POLICE BUILDING - DAY\n\n               The GTO screeches into the lot. Shavers is on his way out \n               with his SUITCASE.\n\n                                     XANDER\n                         Get in. We've got work to do.\n\n               INT. POLICE BUILDING BASEMENT - DAY\n\n               PAN OVER WEAPONS - they're all laid out on the floor. 50 \n               cal. MACHINE GUNS, MINES, ROCKETS, BELTS OF AMMO.\n\n               We finally arrive at Xander leaning on his GTO. He sparks a \n               BLOWTORCH and lights a CIGAR.\n\n                                     XANDER\n                         I want all that...\n                              (he pats the GTO)\n                         In there.\n\n               Shavers looks on in shock. He's got a crew of MECHANICS with \n               him. Xander hands him the blowtorch and walks away.\n\n               EXT. PRAGUE OPEN AIR MARKET - DAY\n\n               This is a beautiful open air market in a town square \n               surrounded by old buildings. The place is PACKED.\n\n               In the midst of it all, we make out Petra moving through the \n               crowd. She stops to look at some vegetables when Xander passes \n               by her.\n\n                                     XANDER\n                         Right behind you.\n\n               They keep talking, pretending to shop.\n\n                                     XANDER\n                         So what's the plan with this Ahab? \n                         Are they selling it or what?\n\n                                     PETRA\n                         No, something worse. He says it's a \n                         surprise, but I know him. This is \n                         his masterpiece.\n\n                                     XANDER\n                         We've got to find out what it is. \n                         Can you handle that?\n\n                                     PETRA\n                              (beat)\n                         There's something I didn't have time \n                         to tell you before.\n\n                                     XANDER\n                         What's that?\n\n                                     PETRA\n                         I'm a agent as well. KGB. I've been \n                         undercover for over a year.\n\n                                     XANDER\n                         You're what? What the hell have you \n                         been doing?\n\n                                     PETRA\n                         I don't know. Eight months ago I \n                         stop hearing from my people. No \n                         explanation, just silence. So I stay \n                         and I wait like I was told. Soon I'm \n                         in so far, they'd kill me if I left. \n                         Now every day I get farther and \n                         farther away from what I was. I'm \n                         like you said, a criminal.\n\n                                     XANDER\n                         I'm busted up for you, but Jesus, \n                         what the hell are you doing? Those \n                         people almost drowned on that boat \n                         and you didn't lift a finger.\n\n               This stings her. She knows well the price she paid.\n\n                                     PETRA\n                         No, I guess I've been no help at all \n                         to you.\n\n                                     XANDER\n                         Get your head back in the game. There \n                         are lives at stake here.\n\n                                     PETRA\n                         Of course. I'll do what I can. I \n                         have to go, before they notice.\n\n                                     XANDER\n                         When can I see you again?\n\n                                     PETRA\n                         You can't, it's too risky. I'm not \n                         much help anyway, remember?\n\n               Then she's off into the crowd.\n\n               EXT. MEDIEVAL MANOR - NIGHT\n\n               The craggy surface of the wall is swathed in shadows. Xander \n               approaches and flattens himself against it. He's all in BLACK, \n               packed with weapons and sporting a COMBAT VEST.\n\n               He grabs a toehold on the wall and ZOOM! He SPEED CLIMBS up \n               the side.\n\n               He reaches the top in seconds and scopes out the manor house.\n\n               VIDEO CAMERAS, PATROLLING GUARDS. It's not gonna be easy.\n\n               Xander slips over the wall down to the courtyard below.\n\n               EXT. MEDIEVAL MANOR - COURTYARD - NIGHT\n\n               Xander places an EXPLOSIVE on a CONTROL BOX.\n\n               He waits for a GUARD to stroll by and then slips through a \n               basement window.\n\n               INT. MEDIEVAL MANOR - DARKENED ROOMS - NIGHT\n\n               Xander makes his way through a series of rooms. Finally he \n               finds himself in a study with a window overlooking the \n               CAVERNOUS BASEMENT of the Manor.\n\n               Laid out below he can see the AHAB DEVICE, hanging from \n               chains. TECHIES are working with the Anarchy 99 crew to \n               RETROFIT the thing.\n\n               They are installing a LAUNCHER RACK of TEN TUBES.\n\n               Xander can't hear a thing through the thick glass.\n\n               He takes a METAL BALL from his pocket. There's a sink in the \n               corner and he drops the metal ball down the drain.\n\n               INT. DRAIN PIPE\n\n               We follow the metal ball as it rolls through the trap and \n               down into the wall. The pipe zigzags around like a \n               rollercoaster and then levels off.\n\n               The ball rolls past a T-intersection, stops, and unrolls \n               like a pill bug.\n\n               Six metal legs appear and we see it's the ROACH CAM. It \n               scuttles back up the pipe and makes the turn.\n\n               INT. MANOR BASEMENT - MAIN HALL - NIGHT\n\n               We're close on a sink as the Roach Cam comes up the pipe. It \n               scurries into hiding just as a HAND reaches in to turn on \n               the water.\n\n               The roach peers out from between items on a workbench and we \n               PUSH IN on it's VIDEO CAMERA head.\n\n               INT. MEDIEVAL MANOR - STUDY - NIGHT\n\n               CLOSE ON - VIDEO MONITOR - ROACH CAM P.O.V.\n\n               We see a handheld video image of Viktor.\n\n                                     VIKTOR\n                         Okay, fire one.\n\n               Viktor pushes a button on Ahab and a VODKA BOTTLE launches \n               from tube one, SHATTERING against the ceiling.\n\n                                     YORGI\n                         Perfect!\n\n               Pull back to reveal Xander watching the image on his \n               communicator. Using a joystick he's able to control the roach.\n\n               He steers the camera towards Petra, gets a low-angle shot of \n               her legs in a punked-out CATHOLIC SCHOOL GIRL SKIRT.\n\n               He smiles, enjoying himself.\n\n                                     XANDER\n                         Great piece of hardware.\n\n               He plugs his earpiece in and listens in.\n\n               INT. MANOR BASEMENT - MAIN HALL - NIGHT\n\n               Petra works on a COMPUTER CONTROLLER.\n\n               The roach scurries across the floor, circling to get a better \n               look at Ahab.\n\n               Anders pushes a CART holding TEN GLASS CANISTERS OF LIQUID.\n\n               Each canister is separated in two, with a BLACK LIQUID on \n               top and a WHITE LIQUID on the bottom.\n\n               He hands the canisters to Viktor one by one.\n\n                                     ANDERS\n                              (singing)\n                         \"Silent Night... Holy Night\"\n\n               Viktor laughs and joins in.\n\n               Then Kirill looks down and SPOTS THE ROACH CAM.\n\n               He STOMPS it with his boot.\n\n               INT. MEDIEVAL MANOR - STUDY - NIGHT\n\n               Xander jerks out his earpiece and rubs his ear.\n\n                                     XANDER\n                         Damn.\n\n               He looks down into the room, sees Kirill bending down to \n               examine the roach. Time to go.\n\n               INT. MANOR BASEMENT - MAIN HALL - NIGHT\n\n               Kirill lifts the dead \"roach\" and sees its wires.\n\n                                     KIRILL\n                         There's some bullshit going on!\n\n               Yorgi hits an ALARM switch, alerting the guards.\n\n               The Anarchy boys grab weapons and start racing through the \n               house.\n\n               INT. MEDIEVAL MANOR - VARIOUS - NIGHT\n\n               The Anarchy boys move swiftly from room to room in practiced \n               close combat maneuvers.\n\n               Cueing each other with hand signals, they run through each \n               room, weapons ready.\n\n               INT. HALLWAY - NIGHT\n\n               Xander sprints down the hallway. With the Anarchy 99 boys \n               and Guards roaming the house, he's having a hard time finding \n               his way out.\n\n               INT. DINING HALL - NIGHT\n\n               He runs into a darkened dining hall, sprints across only to \n               find the opposite door locked. He hides behind one of the \n               many COLUMNS as his pursuers enter the room.\n\n               Kirill gives a thumbs up and puts on a pair of NIGHT VISION \n               GOGGLES. He scans the big room but sees nothing.\n\n               Xander, hidden at the opposite end, waits breathlessly.\n\n               Kirill advances slowly, his buddies covering him from the \n               door.\n\n                                     YORGI\n                         Xander, my friend, that can only be \n                         you. Why don't we put our weapons \n                         down for a few minutes and discuss \n                         this like friends. How would you \n                         like to come to work for us instead? \n                         We could Rage Against the Machine \n                         together.\n\n               Across the room, Xander sees a small window leading to the \n               courtyard. He has to run across open ground to reach it. He \n               calls out to Yorgi.\n\n                                     XANDER\n                         Speaking of people that are full of \n                         shit, funny you should mention those \n                         guys!\n\n               Xander's voice echoes around the empty hall, making it \n               impossible to pinpoint.\n\n                                     XANDER\n                         They put their records out through \n                         Sony, one of the biggest corporate \n                         machines on the planet. Some \n                         revolutionaries, huh?\n\n               He pulls out his gun as Kirill creeps ever closer.\n\n               Against the far wall Xander spots a FIRE EXTINGUISHER.\n\n                                     YORGI\n                         Come on, you're the one who's fooling \n                         yourself. Why risk your life for \n                         your government when we can offer \n                         you a future that is truly free?\n\n               Kirill is almost on top of him.\n\n               Xander sights up and FIRES.\n\n               The fire extinguisher EXPLODES, blinding Kirill.\n\n               Xander makes a run for it.\n\n               Everyone FIRES WILDLY (except for Petra), bullets tearing \n               tapestries off the walls.\n\n               Xander dives and crashes through the window.\n\n               EXT. COURTYARD - SUNRISE\n\n               Xander tuck and rolls, comes up running.\n\n               Guards are running around, unsure just what the hell is going \n               on.\n\n               Xander hops on one of the TRIALS MOTORCYCLES parked nearby \n               and fires up the engine. He hits a remote switch and BLAM!\n\n               The EXPLOSIVE CHARGE he left earlier blows-up.\n\n               He points the bike at a set of STONE STAIRS. They form a \n               \"ramp\" that he can use to JUMP THE WALL. He GUNS THE ENGINE.\n\n               A Guard races across the wall with a rifle, taking aim.\n\n               Xander races and JUMPS THE BIKE over the wail. As he goes by \n               he does a CAN-CAN AERIAL, KICKING THE GUARD OFF THE WALL \n               before he can shoot.\n\n               The Anarchy 99 guys run outside just in time to see him go.\n\n                                     YORGI\n                         He blew the gate control. Anders! \n                         Get the bastard!\n\n               Anders fires up the other trials bike, slings a submachine \n               gun across his back and goes up and over. Petra watches him \n               go, hoping for the best.\n\n               EXT. PRAGUE STREETS - DAYBREAK\n\n               (NOTE: action will be re-choreographed based on actual \n               locations. Any freestyle motorcycle moves will be motivated \n               by a physical reason)\n\n               Xander blazes down the street, Anders racing right behind \n               him. A wrong turn sends him into a dead end.\n\n               At the end is a panel truck parked next to a stone wall.\n\n               Xander slows the trials bike and drives it up the hood of \n               the truck and onto it's roof. Balancing on the rear wheel, \n               he hops onto the wall.\n\n               The machine gun blasts again. Xander drives off along the \n               top of the wall. Anders shoulders his gun and follows.\n\n               They are riding a 15' high wall that's only a foot wide.\n\n               They make several 90 degree turns, racing above a sleeping \n               neighborhood. Xander sees the end of the wall ahead and takes \n               a detour.\n\n               He hops onto the second floor balcony of a BUILDING UNDER \n               CONSTRUCTION.\n\n               INT. BUILDING UNDER CONSTRUCTION - MORNING\n\n               CONSTRUCTION WORKERS bolt out of the way as the motorcycle \n               leaps into their building.\n\n               Xander pops a wheelie and slams through a BLUEPRINT TABLE.\n\n               Anders follows, demolishing their SNACK TABLE.\n\n               Xander darts through the building, between beams and 2 x \n               4's, until he reaches a skeletal STAIRCASE.\n\n               More WORKERS appear at the bottom of the stairs so Xander \n               goes up. He cranks up three flights of stairs and bashes \n               onto the roof.\n\n               EXT. THE ROOFTOPS - MORNING\n\n               Xander looks around for a way out. The next building isn't \n               that far away. He revs up and JUMPS ACROSS.\n\n               Anders jams another magazine into his sub-machine gun and \n               follows Xander.\n\n               They jump from roof to roof, down a DESCENDING SERIES OF \n               ROOFTOPS towards the river. Anders pulls up alongside as \n               they race towards that last apartment building.\n\n               Neck and neck they head for the brink. At the last jump, \n               Xander pulls up behind Anders.\n\n               They hit the last roof in a crunch of gravel. Anders clamps \n               on the brakes and comes skidding to a stop, Xander right \n               behind him.\n\n               They skid to a stop at the very edge, with Anders balanced \n               on his front wheel. He looks down, sees street five stories \n               below.\n\n               He glances back at Xander, sweat beading, struggling to keep \n               his balance. Xander observes him coolly, totally in control.\n\n               Anders reaches for his machine gun. Xander pops a wheelie \n               and RAMS Anders over the edge.\n\n               The bike tumbles and PANCAKES into the pavement. Anders tears \n               through several AWNINGS before slamming into the ground.\n\n               Xander turns and rides to the next apartment building.\n\n               He hops down a steep series of roofs that will eventually \n               take him to street level.\n\n               As he makes his way down, Anders stirs. The guy is a bloody, \n               broken mess but he gets to his feet. He sees where Xander is \n               headed and he scurries off to intercept him.\n\n               EXT. ALLEY - MORNING\n\n               Xander is heading to the far end of a dead end alley. The \n               only way out is fenced in. But there's a RAMP leading up to \n               a LOADING DOCK. Xander will have to use that ramp to jump \n               the fence.\n\n               Anders climbs to the second floor of the building. There is \n               a small crane arm loaded with metal. If he pushes it at the \n               right time, it will swing out and knock Xander from his bike.\n\n               He giggles maniacally, blood dripping.\n\n               Xander drops down into the alley and heads towards the jump.\n\n               Anders times it perfectly and swings the crane arm out.\n\n               IN SLOW MOTION: The bike leaves the ramp and soars up over \n               the fence.\n\n               The crane arm swings out, on a collision course with Xander.\n\n               Xander sees it and THROWS HIMSELF OFF THE BIKE, grabbing \n               onto the back in a SUPERMAN SEAT-GRAB. He passes RIGHT \n               UNDERNEATH the swinging crane arm.\n\n               Anders's face falls when he sees Xander go by, hanging on \n               with ONE HAND. In his OTHER HAND Xander's got his PISTOL.\n\n               BLAP!\n\n               Xander pulls himself back onto the bike and lands. He stops, \n               sees Anders' BLOODY HELMET come bouncing into the alley. He \n               tucks his pistol away and roars off.\n\n               INT. DIRTY APARTMENT - DAY\n\n               Xander comes up the stairs and sees LIGHTS ON in his \n               apartment. He draws his gun and pushes the door open.\n\n                                     XANDER\n                         Slovo?\n\n               Slovo is sitting in the armchair.\n\n                                     XANDER\n                         Dude, what are you doing here?\n\n                                     SLOVO\n                         You killed me, remember? Now I have \n                         to hide out here with you. Where \n                         have you been?\n\n               Xander holsters his gun, searches around for his communicator.\n\n                                     XANDER\n                         I found something big enough for us \n                         to take these guys down with. They've \n                         got a of nerve agent they're gonna \n                         unleash.\n\n                                     SLOVO\n                         Is this what you're looking for?\n\n               Xander turns to see Slovo waving the communicator.\n\n                                     XANDER\n                         Yeah, give it here.\n\n               Slovo raises his pistol.\n\n                                     SLOVO\n                         Sorry, \"dude\".\n\n                                     XANDER\n                              (stunned beat)\n                         What's the deal?\n\n                                     SLOVO\n                         Oh come on, don't feel bad. You got \n                         played, so what? You're new at this. \n                         Did you think you could just stroll \n                         into this business one day and have \n                         all the angles figured out?\n\n                                     XANDER\n                         Why you dogging me up?\n\n                                     SLOVO\n                              (shrugs)\n                         They came and found me. They said \n                         they'd kill me unless I help them. \n                         Plus they offer me a lot of money. \n                         No big deal. These things happen. \n                         Dump your gun on the floor.\n\n               Xander does so.\n\n                                     SLOVO\n                         Where do you want it? The head to be \n                         quick? Or the chest for an open \n                         casket?\n\n               Suddenly GUNFIRE blasts through the closed door.\n\n               Bullets shatter a LAMP, a PICTURE, and finally tag Slovo in \n               a wild salvo.\n\n               Slovo crumples, never knowing what hit him.\n\n               The door creaks open. It's Petra, her gun still smoking.\n\n               She's with the Ivans.\n\n                                     PETRA\n                         Are you alright?\n\n                                     XANDER\n                         What the hell are you doing? You \n                         could've killed me!\n\n                                     PETRA\n                              (shrugs)\n                         I heard you talking. I could tell \n                         where you were in the room.\n\n                                     XANDER\n                         I don't know what's going on anymore. \n                         I thought I was square with that \n                         dude. Now everybody's switching sides \n                         like it's the WWF.\n\n               The Ivans go to Slovo's body, kicking the gun from his hands.\n\n               One of them SPITS on his corpse in disgust.\n\n                                     XANDER\n                         What are you doing with the Ivans?\n\n                                     PETRA\n                         I know which cops are good and which \n                         are bad. Come with me. Come on, right \n                         now.\n\n               She drags him to the door.\n\n               EXT. ST. CHARLES BRIDGE - DAY\n\n               The beautiful and historic St. Charles bridge spans the river. \n               There are BANNERS hanging in celebration of the coming PRAGUE \n               PEACE CONFERENCE. Petra leads Xander across it.\n\n                                     XANDER\n                         Where are we going?\n\n                                     PETRA\n                         We're getting out of this place. \n                         We've done enough.\n\n                                     XANDER\n                         Wait a minute, whoa. We can't go \n                         now. What's Yorgi got planned with \n                         that nerve agent?\n\n                                     PETRA\n                         It doesn't matter anymore, forget \n                         it.\n\n                                     XANDER\n                         Of course it matters. Hey, hold on!\n\n                                     PETRA\n                         What do we owe our governments? Yours \n                         kidnapped you, mine abandoned me.\n\n                                     XANDER\n                         Petra, this ain't about the people \n                         that sent us here, you know that.\n\n                                     PETRA\n                         No, now it's about us. Let's do \n                         something for us before we both get \n                         killed. Don't you want to get to \n                         Bora Bora, Xander?\n\n                                     XANDER\n                         We can't leave now. We have to do \n                         something.\n\n                                     PETRA\n                         Why? You're the one who believes in \n                         nothing. Screw the world, or whatever \n                         you said.\n\n               Xander grabs her by shoulders.\n\n                                     XANDER\n                         Alright, so I was full of shit. I \n                         thought believing in things was wrong. \n                         Turns out believing in nothing is \n                         worse. You might as well be dead. \n                         I'm not thrilled with the world, but \n                         I'm not gonna let those idiots start \n                         killing people. Come on, you're a \n                         cop, we've got to get these guys.\n\n               He's gotten through to her. She nods in agreement.\n\n                                     PETRA\n                         They left. To a fortress in the \n                         mountains.\n\n                                     XANDER\n                         We'll have to go after them.\n\n                                     PETRA\n                         Aren't you afraid?\n\n                                     XANDER\n                         A long time ago I learned how to put \n                         fear away in a little place in my \n                         head. Maybe that's my problem. If \n                         you don't feel fear you can do some \n                         amazing things, but you can also \n                         screw your life up in ways you can't \n                         imagine.\n\n                                     PETRA\n                         I must be healthy, then, because I'm \n                         scared to death. I guess I'd better \n                         get back to Yorgi.\n\n                                     XANDER\n                         You don't have to do that.\n\n                                     PETRA\n                         Yes, I do. You're right. I can't \n                         just let him go free. Besides, I can \n                         help you from the inside.\n\n                                     XANDER\n                         Aren't they gonna wonder were you've \n                         been?\n\n                                     PETRA\n                              (shrugs)\n                         I was supposed to wait for the cop \n                         to kill you and then kill the cop. \n                         They'll believe me.\n                              (beat)\n                         I've been lying for so long, one \n                         more time won't hurt.\n\n                                     XANDER\n                         When this is over, we're just gonna \n                         take off, the two of us. Take a \n                         vacation.\n\n                                     PETRA\n                         What the hell are we doing? We're \n                         doing all this together, trusting \n                         each other, making plans, and we \n                         haven't even slept together yet.\n\n               Xander kisses her.\n\n                                     XANDER\n                         That gives us something to live for.\n\n               Together they walk back across the bridge. We crane up, \n               revealing the PRAGUE PEACE CONFERENCE banners all over a big \n               BUILDING on the river.\n\n               EXT. MOUNTAIN - DAY\n\n               We see a craggy, gnarly mountain. The front side is a rock \n               strewn, near vertical drop.\n\n               Then we see Xander come scaling up from the back side. He's \n               got GEAR strapped to his back and it looks like it's been a \n               helluva climb.\n\n               Xander sits at the very peak and catches his breath. It's \n               beautiful up here.\n\n               He pulls a COLLAPSIBLE SNOWBOARD off his back, hits a switch \n               and the thing SWITCHBLADES OUT to full size. He clamps it on \n               his feet.\n\n               Xander moves to the edge and peers down. At the bottom of \n               the mountain he can see the CASTLE, an imposing medieval \n               fortress in the snow. He leans over the edge and starts down \n               the mountain. He doesn't get far before he notices something \n               else. He slides to a stop on the near vertical face, clinging \n               to rocks for balance.\n\n               On the mountain below him, between him and the castle, is a \n               GUARD OUTPOST. Right now he's in full view and he's been \n               spotted. He sees GUARDS scrambling out, hopping on \n               SNOWMOBILES. From up here they look like ants.\n\n               EXT. GUARD OUTPOST - DAY\n\n               Viktor, the goateed cold weather warrior, strides out of the \n               Outpost and looks up the mountain. He shouts orders to his \n               men.\n\n               A Guard runs up and brings him his weapon: A FLAME-THROWER.\n\n               Viktor straps it on and. climbs onto his SNOWMOBILE.\n\n               All around him the Guards are driving into position. They \n               form a gauntlet of AK-47's. There must be a DOZEN of them.\n\n               Viktor rides up twenty yards and waits, his engine idling.\n\n                                     VIKTOR\n                         Hold positions!\n\n               He squints up at the speck that is Xander.\n\n               EXT. MOUNTAIN TOP - DAY\n\n               Xander pulls a CONCUSSION GRENADE from his jacket.\n\n                                     XANDER\n                         Nothing like fresh powder.\n\n               He puts his goggles on and pulls the pin from the grenade.\n\n               Then he TOSSES IT OVER HIS SHOULDER.\n\n               The grenade lands in the snow above him and starts ROLLING \n               DOWNHILL TOWARDS HIM. Xander pushes off and starts bombing \n               down the mountain.\n\n               The grenade bounces after him and then WHAM! It goes up with \n               a tremendous shock.\n\n               There is a SHIFT in the snow, a GROAN of shifting weight, \n               then the ENTIRE CORNICE cracks loose and topples over the \n               brink.\n\n               Xander streaks down the mountain with that wall of snow at \n               his heels.\n\n               From down below it's an awesome sight. The slack-jawed Guards \n               watch as tons of churning snow bear down on them.\n\n               Shooting in and out of that powdery mass like a surfer, they \n               can see Xander skipping like a stone down the mountain face.\n\n               There's a mad scramble as Guards turn their snowmobiles and \n               ride for their lives. A furious Viktor spins around and makes \n               a run for it as well.\n\n               Nobody has a chance. The avalanche is coming like a freight \n               train, frothing like white water.\n\n               Xander blazes right through the scrambling Guards and hits a \n               JUMP. He goes soaring up and lands square on the sloped roof \n               of the Outpost.\n\n               The avalanche is right behind him, slamming down everything \n               and everyone in its way.\n\n               Guards are swallowed up and tossed, snowmobiles go tumbling \n               under the onslaught.\n\n               Xander grabs onto the chimney as the avalanche washes over \n               the Outpost. He holds on until the ocean of snow comes to a \n               stop.\n\n               Then it's all quiet.\n\n               Above him the slope is a battlefield of icy rubble. There's \n               nothing moving up there anymore. Xander pulls himself free.\n\n               Then he hears a gushing sound and a DEEP BENEATH THE SURFACE, \n               he sees the WARM ORANGE GLOW OF FLAME. It's Viktor and his \n               flame thrower. There's another SPURT and the glow fades for \n               good.\n\n               Xander boards to a rock and sits to catch his breath. He's \n               right above the Castle now. Then his communicator starts to \n               BEEP.\n\n                                     XANDER\n                              (into communicator)\n                         Gibbons, long time no talk. You \n                         wouldn't believe my day.\n\n               INTERCUT WITH GIBBONS ON THE PRIVATE JET WITH A TEAM OF \n               AGENTS.\n\n                                     GIBBONS\n                         What the hell has been going on, \n                         Triple X? How about a status report?\n\n               Xander looks down on the Castle. There seem to be MAFIYA \n               HENCHMEN all over the grounds.\n\n                                     XANDER\n                         Snow covered fortress. Army of bad \n                         guys. The usual.\n\n                                     GIBBONS\n                         I'm on the way with a team to relieve \n                         you. What's the latest?\n\n                                     XANDER\n                         They retrofitted Ahab with some kind \n                         of rocket launcher. They were loading \n                         canisters of liquid into it, light \n                         colored and dark colored in the same \n                         tube but separate. Something tells \n                         me this it that \"classified\" stuff \n                         you didn't want me to know about. \n                         Does the song \"Silent Night\" mean \n                         anything to you?\n\n                                     GIBBONS\n                         Yes it does.\n\n                                     XANDER\n                         Come on, Gibbons, you can do better \n                         then that.\n\n                                     GIBBONS\n                         Silent Night is the name of a top \n                         secret binary nerve agent. The glass \n                         canister is shot into the air and \n                         detonated. The black and white \n                         chemicals mix, forming a toxic cloud. \n                         When it settles down to Earth, it'll \n                         kill everything in the vicinity.\n\n                                     XANDER\n                         Jesus Christ, Gibbons, this is \n                         something we came up with?\n\n                                     GIBBONS\n                         Yeah, that's right. So now that you \n                         know, you understand why it's \n                         important that we get it back.\n\n                                     XANDER\n                         Kinda funny, though, isn't it? We're \n                         not supposed to be making weapons \n                         like that anyway. Guess we shoulda \n                         played by the rules.\n\n                                     GIBBONS\n                         Somebody else makes those decisions, \n                         not guys like you and me. You've \n                         done your job, X, head back to Prague. \n                         I'll be landing in 90 minutes. This \n                         is my operation now.\n\n                                     XANDER\n                         We don't have that kinda time, boss, \n                         I don't think Prague's gonna be around \n                         much longer. I've gotta go now. I've \n                         got a lot of bad guys to kill.\n\n               Xander hangs up and heads down the hill.\n\n               EXT. CASTLE - DAY\n\n               A GUARD patrols the rocky grounds outside the castle. He \n               stops for a smoke when Xander walks right up to him.\n\n               WHACK! With two quick blows he knocks him out and keeps \n               walking. He's a man on a mission.\n\n               He runs in a low crouch to the smooth castle wall. There's \n               no hand-holds, it's, a perfectly flat climb. A canyon of \n               ROCKS is below.\n\n               Xander reaches into his jacket and pulls out the \"TERMINATOR\" \n               CLIMBING CLAWS. He pulls on the metal gloves and CLAWS into \n               the solid rock.\n\n               Just like that he starts scaling the vertical surface.\n\n               We see him outlined against the mountains, steadily making \n               this impossible climb.\n\n               At the top is an overhang. It's a gnarly transition. As he's \n               rounding it, his FEET SLIP. His legs dangle over the rocky \n               chasm below.\n\n               Using all his strength, he pulls himself up the rest of the \n               way with his climbing claws.\n\n               At the top a GUARD leans over, aiming his gun at him. Xander \n               grabs him and pulls him over the edge.\n\n               The Guard FALLS into the chasm.\n\n               Xander rolls onto the parapet, exhausted. Then another GUARD \n               rushes him, grabbing for his rifle.\n\n               Xander springs, the claws lashing out, and tears the gun \n               from his hands. With the other hand he SLASHES, taking the \n               Guard down.\n\n               He pulls off the claws and heads into the Guard Tower.\n\n               INT. CASTLE - COURTYARD - DAY\n\n               Xander exits the Guard Tower at the ground level.\n\n               As he crosses the courtyard an EXPLOSION rocks the tower he \n               just left.\n\n               There is shouting as GUARDS race around the parapets, unsure \n               where the attack is coming from. A GUARD runs up to Xander.\n\n                                     GUARD\n                              (in Russian)\n                         What's going on?\n\n               Xander CLOTHESLINES him and catches his AK-47 as he drops.\n\n               Up inside the castle he can see Yorgi at a window. Yorgi \n               appears mildly shocked as they make EYE CONTACT.\n\n               Xander takes aim.\n\n               POV ON XANDER THRU SNIPER SCOPE\n\n               From up above, Kirill has Xander in his sights.\n\n               BLAW! The bullet hits Xander's AK, sending it spinning.\n\n               Xander rubs his sore hand but stays put. Kirill could have \n               killed him and he knows it. From a doorway comes Yorgi with \n               some Guards.\n\n               Yorgi walks up and SMASHES Xander in the face.\n\n                                     YORGI\n                         That was for Anders.\n\n                                     XANDER\n                         Don't forget goatee boy. I greased \n                         him up on the diamond run.\n\n               Yorgi punches him again.\n\n               INT. CASTLE - MAIN BUILDING - DAY\n\n               Petra sits at a desk working on a LAPTOP. Yorgi enters with \n               Xander and Kirill.\n\n                                     YORGI\n                         Look who we found playing outside.\n\n               Petra looks up. She can barely hide her shock.\n\n                                     YORGI\n                         Petra, my sweet dove, do you notice \n                         anything strange about X? He looks \n                         slightly less than dead.\n\n               Kirill aims his gun at Petra.\n\n                                     PETRA\n                         Yorgi, I thought he was --\n\n               Yorgi SLAPS her.\n\n                                     YORGI\n                         Do you think I didn't know about you \n                         all along? My contacts in the KGB \n                         told me you were coming. You show up \n                         undercover and, I must admit, you \n                         play your part to the hilt. When \n                         it's time to be cruel, you are cruel. \n                         When it's time to be passionate, you \n                         are very very passionate indeed.\n\n               Petra is devastated by this revelation.\n\n                                     YORGI\n                         I could have killed you, but I thought \n                         this would be so much more fun. To \n                         twist you and use you how I see fit. \n                         And to be honest, you went much \n                         farther than I ever expected you \n                         would for your country.\n\n               He runs this fingers through her hair and moves on to Xander.\n\n                                     YORGI\n                         And you. Why do you have such a \n                         problem staying away, my friend? Did \n                         you miss us that much?\n\n                                     XANDER\n                         I wanted to get the hell out of Prague \n                         before Silent Night falls.\n\n                                     YORGI\n                         Not bad, man, not bad. You put things \n                         together quick. Prague it is.\n\n                                     PETRA\n                         The Peace conference...\n\n                                     YORGI\n                         Nice place to start, don't you think?\n\n                                     XANDER\n                         What's the gimmick, Yorgi? That's \n                         the part I don't get. You gonna hold \n                         the world hostage with your gas bombs? \n                         I didn't think you were dumb enough \n                         to go with that hack cliche.\n\n                                     YORGI\n                         You think I'm after money? I told \n                         you, my friend. Anarchy. Time for a \n                         change. Money is good, but for true \n                         freedom you have to get rid of the \n                         rules themselves.\n\n                                     XANDER\n                         So all by yourself, you're going to \n                         destroy every government; in the \n                         world.\n\n                                     YORGI\n                         Easier than that, buddy. I'll get \n                         them to destroy each other. You kill \n                         an entire Peace conference, someone \n                         is going to have to pay. Then our \n                         friend Ahab continues down the river \n                         to the ocean and begins his world \n                         tour. London, Cairo, Beijing... Pretty \n                         soon everyone's involved. These guys \n                         bomb those guys, those guys invade \n                         these guys. Soon the whole world is \n                         like your wild West cowboy days. No \n                         rules, no law, everybody free to do \n                         what they want.\n\n                                     XANDER\n                         Including rape, pillage, murder.\n\n                                     YORGI\n                         Sure, if that's what you want. Why \n                         not? It's all human nature. So we \n                         just have to launch our baby and \n                         wait for the decline and fall of \n                         civilization as we know it.\n\n                                     XANDER\n                         And here I thought \"anarchy\" was \n                         just something cool to put on a \n                         Tshirt.\n\n                                     YORGI\n                         Come on, Xander. You used to stand \n                         for something. What happened to you, \n                         man? I thought you'd get it.\n\n                                     PETRA\n                         Don't you see, X? For the betterment \n                         of humanity, he's going to start \n                         World War Three.\n\n                                     XANDER\n                         He's a regular humanitarian. And all \n                         this time I thought he was just a \n                         tool.\n\n                                     YORGI\n                         You both could have been a part of \n                         it. You could have ridden with us \n                         into a new day, the dawning of a new \n                         age of --\n\n                                     XANDER\n                         Oh just shoot us already. I'm sorry \n                         I asked.\n\n               Yorgi's eye twitches.\n\n                                     YORGI\n                         Screw you too, buddy.\n\n               He raises his gun and suddenly BOOOOOM! A massive explosion \n               rocks the whole castle. Shrapnel shatters the windows, \n               spraying glass, and Yorgi's shot goes wide.\n\n               EXT. THE CASTLE - DAY\n\n               The front gates have just been blown apart. Through the smoke \n               and wreckage come Ivans 1 & 2 with a PLATOON OF CRACK CZECH \n               SECRET POLICE. Their submachine guns rattle in threeshot \n               bursts, sweeping Guards from the parapets.\n\n               INT. CASTLE - MAIN BUILDING - DAY\n\n               Kirill looks down at the carnage below. Xander takes advantage \n               of the distraction and charges at Yorgi.\n\n               Yorgi goes to shoot but his hand won't work. There's a HUGE \n               SHARD OF GLASS sticking through his forearm.\n\n               By the time he pulls it out, Xander is on top of him. He \n               body checks Yorgi, sending him flying over a desk. Kirill \n               spins and starts FIRING. Xander ducks for cover.\n\n               EXT. THE CASTLE - DAY\n\n               The Czech Secret Police are having their way. They cross the \n               courtyard and burst into the main building.\n\n               INT. CASTLE - MAIN BUILDING - DAY\n\n               The Police whip through the building like lightening, mowing \n               down everyone in their path.\n\n               One Czech Secret Policeman is wounded and the others retaliate \n               with a volley of RPG's that evaporates a pocket of resistance.\n\n               In the main room upstairs, Kirill is blasting away. Yorgi \n               starts rounding up the computer gear.\n\n                                     YORGI\n                         Hurry up, kill him!\n\n               Before Kirill can do so, Cops burst into the room, spraying \n               bullets everywhere.\n\n               Xander and Petra are pinned down, but Yorgi and Kirill manage \n               to make a fast exit out another door.\n\n                                     XANDER\n                         Hey! We're on your side!\n\n               The Cops keep shooting.\n\n               EXT. CASTLE - COURTYARD - DAY\n\n               Ivan 1 is talking on the radio when Yorgi appears behind him \n               and shoots him in the back.\n\n               They step over him and enter a GARAGE.\n\n               INT. CASTLE - GARAGE - DAY\n\n               The Ahab device is in the back of a flatbed TRUCK. Yorgi and \n               Kirill start up the truck and jam it into gear.\n\n               EXT. CASTLE - COURTYARD - DAY\n\n               The truck smashes through the garage doors and rumbles across \n               the courtyard.\n\n               Police open fire, but the truck tears out the gate and starts \n               heading down the mountain.\n\n               INT. CASTLE - MAIN BUILDING - DAY\n\n               Meanwhile, Xander and Petra are still pinned down.\n\n                                     XANDER\n                         Petra! Tell them something!\n\n               Petra starts calling out in RUSSIAN. Finally the cops stop \n               shooting.\n\n               EXT. CASTLE - COURTYARD - DAY\n\n               Xander and Petra are brought outside. They see the Police \n               working on the wounded Ivan 1. Ivan 2 walks up.\n\n                                     XANDER\n                         How's Ivan?\n\n                                     IVAN 2\n                         He is okay.\n\n                                     XANDER\n                         Thanks for coming, man, you guys \n                         were right on time.\n\n                                     IVAN 2\n                         We are always on time. Two have \n                         escaped, in truck.\n\n                                     PETRA\n                         Yorgi and Kirill.\n\n                                     XANDER\n                         Let me guess, they had a big white \n                         torpedo with them.\n\n                                     IVAN 2\n                         Yes. Your friend, the angry one, he \n                         send something for you.\n\n               EXT. CASTLE - DAY\n\n               A big truck pulls to a stop. Its ramp lowers and Xander's \n               blown-out '72 GTO comes rolling out.\n\n                                     IVAN 2\n                         We'll be right behind you.\n\n               Xander and Petra both strap on grenades and pistols.\n\n                                     XANDER\n                         Did you do your homework?\n\n                                     PETRA\n                              (nods)\n                         If they launch it, I know how to \n                         bring it back.\n\n                                     XANDER\n                         Let's do this.\n\n               They both climb in and the GTO peels out.\n\n               EXT. MOUNTAIN ROAD - DAY\n\n               Xander drives all out, trying hard to catch up.\n\n               He passes several of Ivan's Police Jeeps at a furious clip.\n\n               Up ahead they see the truck winding it's way down the \n               mountain.\n\n                                     XANDER\n                         Where's he headed?\n\n                                     PETRA\n                         He owns a big industrial complex on \n                         the river. He'll launch it from there.\n\n               Xander floors it.\n\n               Up ahead, in the flatbed truck, Yorgi drives. He can see the \n               GTO gaining on them.\n\n                                     YORGI\n                              (in Russian, subtitled)\n                         They're coming! Get back there.\n\n               Kirill loads his sniper rifle and climbs out of the cab. He \n               lays down, resting the rifle on the Ahab container.\n\n               As the GTO comes into view, he sights up and FIRES, WHACK! \n               The first shot goes clean through the windshield and blows \n               the headrest off Xander's seat.\n\n                                     XANDER\n                         You get down! I'll take care of this \n                         fool!\n\n               He pulls out an Mp-5 out and hangs it out the window.\n\n                                     PETRA\n                         No! Don't shoot! He's hiding behind \n                         the nerve agent!\n\n               Another shot blasts through, taking off the rear-view mirror.\n\n                                     XANDER\n                         Goddamit! He's gonna stop playing \n                         around soon and shoot something \n                         valuable!\n\n               Kirill laughs and takes aim once again. He puts Petra in the \n               sights.\n\n               Xander jerks the steering wheel and BLAM! the shot goes wide.\n\n               The GTO veers onto a dirt road that cuts down the mountain.\n\n               Xander fights for control as they slide around the turns.\n\n               The road flattens out and they can see the Industrial Complex \n               up ahead. They cut across a field, heading right for it.\n\n               EXT. OUTSIDE THE INDUSTRIAL COMPLEX - DAY\n\n               The truck heads through the gates of the industrial complex.\n\n               Quickly the gates are closed again. Armed GUARDS can be seen \n               up above.\n\n               The GTO comes at the gates at full speed.\n\n                                     XANDER\n                         Let's see what my man put together.\n\n               Xander opens a DASH PANEL, revealing a ROW OF SWITCHES. He \n               flips one.\n\n               The HEADLIGHTS EJECT, revealing a MINI-GUN IN EACH FENDER.\n\n               BRRRAAAAAAPPP!! The mini-guns spin.\n\n               The metal doors are getting SHREDDED.\n\n               Empty SHELLS spill down the sides of the GTO.\n\n               The metal doors come apart, falling in chunks.\n\n               The GTO slams through the wreckage without slowing down.\n\n               A Guard comes tumbling down and BOUNCES off the trunk as the \n               GTO zips inside.\n\n               EXT. INSIDE THE INDUSTRIAL COMPLEX - DAY\n\n               The Anarchy 99 guys seem to have a whole other army in here.\n\n               Guards spill onto the road, shooting at them from everywhere.\n\n               A BELLY PANEL on the GTO opens and ping-pong ball sized \n               MINIBOMBS dump onto the road. BLAM! BLAM! BLAM! The bombs \n               send the Guards scattering.\n\n               The GTO sizzles away.\n\n                                     XANDER\n                         Where'd the damn truck go?!\n\n                                     PETRA\n                         Go to the water, it's that way!\n\n               A tactical (a pick-up with a .50 cal machine gun attached) \n               pulls up behind them and opens fire.\n\n                                     XANDER\n                         Toadies right behind.\n\n                                     PETRA\n                         Let me.\n\n               Petra punches another button.\n\n               The REAR HUBCAPS pop off. They roll along the road on their \n               own. Inside they seem to be LINED WITH SPIKES.\n\n               As the Tactical pulls up in between the hubcaps they BLOW \n               UP, SPRAYING SPIKES at both sides of the Tactical.\n\n               All four wheels BLOW OUT and the Tactical goes out of control.\n\n               It crashes through a fence and pitches into the water, the \n               men going sprawling.\n\n                                     PETRA\n                         Fantastic options.\n\n               At the riverbank Yorgi and Kirill pull Ahab off the truck \n               and prepare for launching.\n\n               They remove it from it's box and carry it waist deep into \n               the water. Yorgi opens a panel and works feverishly on Ahab's \n               insides.\n\n                                     YORGI\n                         I've got it, go! Cover me!\n\n               Kirill grabs his sniper rifle and heads off.\n\n               He climbs up to a second story window of a wooden building \n               on a WHARF. From here he can shoot and NOT BE SEEN. He takes \n               his LIT CIGARETTE and tucks it behind his ear.\n\n               When the GTO rounds the corner he FIRES.\n\n               The bullet goes through the window and SLAMS into the steering \n               column.\n\n               Xander jams it into reverse. They retreat behind a building.\n\n               Petra clutches her arm, wounded.\n\n                                     XANDER\n                         You okay?\n\n                                     PETRA\n                         A piece of shrapnel hit me.\n\n                                     XANDER\n                         I'm sick of that guy. Let's stop \n                         playing nice.\n\n               Kirill chambers another bullet and waits for them to make \n               their second approach. The GTO comes roaring out, spinning \n               in circles wildly. Xander's is just doing donuts as fast as \n               he can.\n\n               Kirill aims, but with all the dust being kicked up he doesn't \n               have much of a target.\n\n                                     KIRILL\n                         What are you doing!\n\n               He doesn't notice Petra pop up from behind a fence with a \n               HEAT SEEKING MISSILE LAUNCHER.\n\n               ANGLE ON - the missile launcher's COMPUTER SCREEN. The green \n               display shows a faint red glow in the upstairs window. Its \n               the GLOWING POINT of Kirill's lit cigarette.\n\n               The Launcher BEEPS as it locks in and she FIRES.\n\n               Kirill looks up to see the missile blazing down the wharf at \n               him.\n\n               He gets it immediately. In a panic he fumbles for the \n               cigarette...\n\n               Too late. The missile zeroes in on his head.\n\n               WHOOOSH! The entire wooden shack blows apart.\n\n               Xander walks up to Petra.\n\n                                     XANDER\n                         I guess the surgeon general was right.\n\n               ANGLE ON - Ahab as Yorgi flips a switch and let's it go. The \n               electric motor purrs to life and Ahab zips out into the river.\n\n               Xander and Petra run to the water's edge in time to see Yorgi \n               escaping in a MOTORBOAT. In the opposite direction they see \n               the ripples of Ahab as it speeds towards it's destination.\n\n               Petra finds the CONTROLLER in the cab of the truck. She \n               presses buttons desperately.\n\n                                     PETRA\n                         He's shut out the communication \n                         circuit!\n\n                                     XANDER\n                         You can't talk to it?\n\n                                     PETRA\n                         No, it's like a safety. We are going \n                         to have to access the manual controls.\n\n                                     XANDER\n                         A manual control on a moving torpedo. \n                         This day keeps getting better and \n                         better.\n\n               Xander starts running towards a second moored MOTORBOAT.\n\n                                     XANDER\n                         Radio Ivan! Tell him what's going \n                         down! Have them evacuate downtown!\n\n               EXT. THE RIVER - DAY\n\n               Yorgi is motoring away, smiling, when he glances back and \n               sees Xander and Petra take off after Ahab. He pounds on his \n               steering wheel and turns around. His bigger boat closes on \n               them and he reloads his weapons.\n\n               Xander drives while Petra checks her controller.\n\n                                     PETRA\n                         It's running three meters down. Twenty \n                         knots.\n\n                                     XANDER\n                         It has to surface to release the \n                         nerve agent, right?\n\n                                     PETRA\n                         By then it's too late! The only way \n                         to safely dispose of the nerve agent \n                         is in deep water! The chemicals will \n                         break down and dissipate!\n\n                                     XANDER\n                         Use your grenades! Maybe we can blow \n                         it up underwater!\n\n               They're heading into downtown Prague now, the riverbank \n               getting more and more populated. Yorgi is closing fast.\n\n               Down below them Petra can see the white streak of Ahab beneath \n               the water.\n\n                                     PETRA\n                         There it is! Hold it steady!\n\n               Petra pulls the pin on a grenade. She tosses it out in front \n               of Ahab. WHOOMPH! A jet of water goes up, but too far behind. \n               She pulls another pin and is ready to throw when Yorgi's \n               boat pulls up alongside. Yorgi aims and FIRES and the bullet \n               GRAZES Petra's arm.\n\n                                     XANDER\n                         Petra!\n\n               She loses her grip and the grenade bounces down into the \n               engine compartment.\n\n               Xander grabs Petra and jumps. Together they land in Yorgi's \n               boat. The grenade explodes and their boat slams into a bridge \n               support and shatters.\n\n               They are in the heart of the old city now. We see piazza's \n               full of tourists, markets packed with locals, children playing \n               in front of cathedrals. And on the river Yorgi and\n\n               Xander battle it out while Petra steers the boat.\n\n                                     PETRA\n                         Xander! It's coming up!\n\n               Xander glances down, sees Ahab nearing the surface. Yorgi \n               clobbers him and Xander falls to the edge of the boat. Petra \n               tries to help, but Yorgi slugs her in her wounded arm.\n\n               Xander can see Ahab just a few inches under as Yorgi grabs \n               him from behind in a chokehold.\n\n                                     YORGI\n                         This is going to be exciting, buddy! \n                         Front row seats to the apocalypse! \n                         Come on, sing with me!\n                              (singing madly)\n                         \"I am an Antichrist / I am an \n                         anarchist / I... wan-na be... \n                         Anarchy!\"\n\n               Xander elbow's Yorgi's gut and breaks the chokehold. He flips \n               him and they both topple overboard.\n\n               They land on Ahab and both grab on. They punch and pummel \n               each other while desperately hanging on to the speeding \n               torpedo. It surfaces as it approaches the magnificent St. \n               Charles bridge.\n\n               On the bridge is a chaos of COPS, FIREMEN and CROWDS OF \n               PEOPLE. They are desperately trying to herd people away from \n               the river.\n\n               Xander pounds Yorgi's face and dunks him underwater. Yorgi \n               slips and falls back to the tail section, dragging along in \n               the torpedo's wake.\n\n               Ahab starts making noise and it's payload doors swing open.\n\n               Inside Xander can see the row of glass cannister containing \n               Silent Night. The first one rises up into FIRING POSITION.\n\n                                     XANDER\n                         No you don't.\n\n               He pries the first rocket off it's launcher. The thing is \n               BEEPING menacingly.\n\n               IN SLO-MOTION - Xander blinks at the liquid death in his \n               hands. He looks over at Petra. She's shouting at him, but he \n               doesn't hear a thing but his own HEARTBEAT.\n\n               He looks the other direction, to the mass of PEOPLE on the \n               bridge above him. Total strangers...\n\n               The fate of the whole world is in the hands of a former \n               nihilist.\n\n               Through the crowd, Xander sees Gibbons break through with \n               his squad of Agents. Gibbons and Xander make eye contact.\n\n               Then Yorgi lunges onto his back, trying to pull him into the \n               water. Xander HITS BUTTONS on the control panel and Ahab \n               starts to DIVE.\n\n               EXT. UNDERWATER - DAY\n\n               With Yorgi hanging on his back, Xander turns the rocket upside \n               down and stuffs it BACK IN THE LAUNCHER.\n\n               Ahab heads down to the bottom of the river, the two men \n               fighting.\n\n               We see one man get THROWN FREE, the other is caught up on \n               Ahab and continues downstream.\n\n               Then the booster rocket FIRES, giving off SPARKS and BUBBLES.\n\n               It's all in silhouette now as WHAM! The rocket EXPLODES, \n               setting off a CHAIN REACTION. WHAM! WHAM! WHAM! Ahab and \n               it's unfortunate passenger are DISINTEGRATED by the BLASTS.\n\n               The chemicals BELCH OUT in harmless clouds.\n\n               EXT. THE RIVER - DAY\n\n               A FUNNEL OF WATER blasts into the sky. The crowd recoils.\n\n               EXT. THE RIVERBANK - DAY\n\n               Ivan 2 helps Petra off the motorboat. They look down at the \n               water, but there's no sign of Xander.\n\n               Gibbons and his men push through the cordon of POLICE, \n               scanning the water. Nothing.\n\n               Tears well in Petra's eyes. Even Gibbons looks dejected.\n\n               Then Petra let's out a gasp and they look downstream.\n\n               There's a boat ramp leading into the water. At first they \n               see a ripple, then the top of a SHAVED HEAD emerges.\n\n               The whole crowd looks on as Xander rises from the water, \n               walking up the boat ramp.\n\n               His shirt is tattered, his tattooed body battered. But there's \n               a look on his face, a calm, a self-confidence we haven't \n               seen before. The Phoenix has risen.\n\n               Petra runs down to him and throws her arms around him. Xander \n               shakes Ivan 2's hand and then turns to Gibbons.\n\n                                     GIBBONS\n                         Thought you bought the farm down \n                         there, X. Glad as hell to see you.\n\n                                     XANDER\n                         I'm pretty happy to see me too. So \n                         are you done with me yet?\n\n                                     GIBBONS\n                         You've kept up your end of the \n                         bargain, I'll do the same. But you \n                         really should consider staying on, \n                         you make a decent agent.\n\n                                     XANDER\n                         But I hate cops, remember? Except \n                         for her.\n\n                                     GIBBONS\n                         Cut the crap, X, I saw you down there. \n                         You're a hero. Don't be afraid to \n                         join the good guys.\n\n                                     XANDER\n                         Who says you're the good guys?\n\n               He starts walking off with Petra.\n\n                                     GIBBONS\n                         You know what they say, the only way \n                         to change the system is from the \n                         inside.\n\n                                     XANDER\n                         Oh yeah? Why don't we start by taking \n                         this thing off my ankle? The poison \n                         needles?\n\n                                     GIBBONS\n                         On come on, X. Did you really think \n                         we were that barbaric?\n\n                                     XANDER\n                         No needles, huh? What about the acid \n                         bath?\n\n                                     GIBBONS\n                         All for show. Just a psychological \n                         mind game to get you to do the right \n                         thing.\n\n                                     XANDER\n                              (smiles)\n                         You're a jerk-off, you know that?\n\n               Gibbons waves.\n\n                                     GIBBONS\n                         We'll be talking soon, you'll see. \n                         You'll be back.\n\n               Xander and Petra move off through the crowd arm in arm.\n\n                                     PETRA\n                         I can't believe my mission is finally \n                         over. I don't even know what to do \n                         with myself.\n\n                                     XANDER\n                         You can't welch on me now. We had a \n                         deal.\n\n                                                               DISSOLVE TO:\n\n               ANGLE ON - a big \"X\" spelled out in SEASHELLS on the sand.\n\n               The camera shoots up into the sky, showing a perfect white \n               beach, a perfect lagoon, a lush green island... BORA BORA...\n\n               Then we hear the BUZZING of a TATTOO NEEDLE.\n\n                                                                    CUT TO:\n\n               A THIRD \"X\" BEING TATTOOED ON THE BACK OF XANDER'S HEAD.\n\n               INT. HUT - DAY\n\n               His ink done, Xander walks out onto the back deck.\n\n               EXT. BORA BORA - DAY\n\n               Craggy mountain peaks and perfect turquoise blue water.\n\n               Xander steps out of a hut built over the water.\n\n               We see Petra sprawled out on the deck in a bikini. She's got \n               a bucket of HINANO BEER chilling down. It's a vision of \n               heaven.\n\n               He lays down next to her, starts pulling her bikini bottom \n               off.\n\n                                     PETRA\n                              (laughing)\n                         What are you doing?\n\n                                     XANDER\n                         It's about your next mission. You \n                         need to be debriefed.\n\n               FROM UNDERWATER - we see the two of them dive into the lagoon \n               nude. There's too many bubbles to see any real skin, but we \n               know what they're up to.\n\n               Back on the surface we see BUBBLES rising and catch glimpses \n               of their outlines beneath the water.\n\n               The Camera pulls back to the deck, where we see Xander's \n               COMMUNICATOR on the table next to the beers. We hear them \n               surface and start SPLASHING off camera.\n\n               Then the damn communicator starts to BEEP.\n\n               FADE OUT.\n\n                                         THE END\n\n\n\n\nxXx\nWriters :   Rich Wilkes\nGenres :   Action  Adventure  Thriller\nUser Comments\n\n\n\n\n\nBack to IMSDb\n\n\n", "scraped": "2018-03-10 20:39:08.170005"}