{"title": "You Can Count On Me", "film_link": "/Movie Scripts/You Can Count On Me Script.html", "script_link": "/scripts/You-Can-Count-On-Me.html", "info_raw": "<table align=\"center\" class=\"script-details\">\n<tr>\n<td align=\"center\" colspan=\"2\"><h1>You Can Count On Me Script</h1></td>\n</tr>\n<tr>\n<td align=\"right\" valign=\"top\"><img class=\"avimg\" src=\"/images/no-poster.gif\" title=\"You Can Count On Me Script\"/></td>\n<td>\n<b>IMSDb opinion</b><br/>  None available<br/><br/>\n<b>IMSDb rating</b><br/>  Not available<br/>\n<b>Average user rating</b><br/>  <img src=\"/images/rating/9-stars.gif\"/> (8.80 out of 10)<br/>\n<!-- IMSDb Box -->\n<ins class=\"adsbygoogle\" data-ad-client=\"ca-pub-9108429103930209\" data-ad-slot=\"9761090053\" style=\"display:inline-block;width:300px;height:250px\"></ins>\n<script>(adsbygoogle = window.adsbygoogle || []).push({});</script>\n<br/>\n<b>Writers</b><br/>  <a href=\"/writer.php?w=Kenneth Lonergan\" title=\"Scripts by Kenneth Lonergan\">Kenneth Lonergan</a><br/><br/>\n<b>Genres</b><br/>  <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/>\n<b>Movie Release Date</b> : November 2000<br/>\n<br/>\n<a href=\"/scripts/You-Can-Count-On-Me.html\">Read \"You Can Count On Me\" Script</a>\n</td>\n</tr>\n</table>", "script": "<td class=\"scrtext\">\n<pre>                                  \"YOU CAN COUNT ON ME\"\n\n                                      Screenplay by\n\n                                     Kenneth Lonergan\n\n<b>                                      SHOOTING DRAFT\n</b>\n<b>                                           2000\n</b>\n<b>                \n</b>\n<b>               FADE IN:\n</b>\n<b>               INT./EXT. A CAR (MOVING). NIGHT\n</b>\n               The shifting lights from the odd passing car play over the \n               faces of MR. and MRS. PRESCOTT, a pleasant-looking couple in \n               their late thirties, dressed up for a night out. Mr. Prescott \n               drives them along a dark hilly two-lane highway.\n\n<b>                                     MRS. PRESCOTT\n</b>                         Why do they always put braces on \n                         teenage girls at the exact moment \n                         when they're the most self-conscious \n                         about their appearance?\n\n               Pause.\n\n<b>                                     MR. PRESCOTT\n</b>                         I don't know.\n\n               UP AHEAD, near the top of the oncoming hill, a RED PICKUP \n               TRUCK is poking its nose out of the short exit lane.\n\n<b>                                     MRS. PRESCOTT\n</b>                         Tom --\n\n<b>                                     MR. PRESCOTT\n</b>                         I see him...\n\n               The PICKUP LURCHES into the road, with not nearly enough \n               time to spare.\n\n<b>                                     MRS. PRESCOTT\n</b>                         Tom!\n\n<b>                                     MR. PRESCOTT\n</b>                         Jesus!\n\n               Mr. Prescott swerves OVER the DOUBLE SOLID WHITE LINE and \n               clears the truck as --\n\n               Another pair of HEADLIGHTS from an oncoming truck RISES UP \n               over the HILL directly in FRONT of them --\n\n<b>                                     MRS. PRESCOTT\n</b>                              (Screams)\n                         Tom!\n\n               Mr. Prescott's FOOT STOMPS on the BRAKE. We BLACK OUT and \n               there is the SOUND of a terrible CRASH.\n\n<b>                                                                    CUT TO:\n</b>\n<b>               EXT. THE PRESCOTTS' FRONT DOOR. NIGHT\n</b>\n               The SHADOW of a big man looms up onto the front door. A big \n               finger RINGS the BELL.\n\n               A moment.\n\n               AMY, a thirteen-year-old baby-sitter with braces, opens the \n               door and looks up. In the b.g. we see TWO CHILDREN, SAMMY \n               (Samantha) and TERRY PRESCOTT, in their pajamas, lying on \n               their stomachs in the living room, watching television. Sammy \n               is eleven. Terry is eight.\n\n               REVERSE: DARRYL, the SHERIFF, a portly fellow with glasses \n               and a mustache, looks down at AMY.\n\n<b>                                     SHERIFF\n</b>                         Hello, Amy.\n\n<b>                                     AMY\n</b>                              (Puzzled)\n                         Hi, Darryl.\n\n<b>                                     SHERIFF\n</b>                              (Thinking)\n                         Amy, would you please tell the kids \n                         you'll be right back, and then shut \n                         the door and come outside to talk to \n                         us for a minute?\n\n<b>                                     AMY\n</b><b>                         OK.\n</b>                              (To kids)\n                         Be right back, you guys!\n\n<b>                                     SAMMY\n</b>                         You're not supposed to go out, Amy.\n\n<b>                                     TERRY\n</b>                         She's going to smoke a cigarette.\n\n               AMY closes the door and looks expectantly up at Darryl. Darryl \n               doesn't know how to start.\n\n<b>               EXT. CHURCH. DAY\n</b>\n               CREDITS BEGIN OVER a blustery April day. The steeple of the \n               little white church stands out against the sharp blue sky.\n\n<b>               INT. TOWN CHURCH. DAY\n</b>\n               It's a small church and a small congregation, but it's full. \n               There's a CHOIR of mostly SENIOR CITIZENS arrayed in the \n               back. TWO CLOSED CASKETS are laid out in front of the \n               MINISTER, a fiftyish woman with thick glasses and salt-and-\n               pepper hair, who is giving a eulogy MOS.\n\n               Among the mourners in the second row sit Terry and Sammy, \n               both redeyed, and uncomfortable in their dress-up clothes. \n               Their Aunt Ruth, a pinch-faced woman in her forties, sits \n               next to them.\n\n               Sammy and Terry are holding hands tightly. Terry wipes his \n               eyes with his free hand.\n\n               The Minister addresses her remarks to the children. Sammy is \n               hanging on the Minister's every word; Terry is shifting his \n               eyes and his seat as if it will kill him to sit still another \n               minute.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. SCOTTSVILLE CEMETERY. SIXTEEN YEARS LATER. DAY\n</b>\n               On the beautiful hill overlooking the beautiful windy green \n               country, SAMMY, twenty-seven years old now, puts flowers on \n               her parents' graves with quick, practiced movements.\n\n               She is a nice-looking young woman of a neat appearance, saved \n               from primness by an elusive, pleasantly flustered quality. \n               An unsuccessfully neat person. She is dressed in office \n               clothes -- white blouse, dark skirt, high heels, light \n               raincoat over everything. She picks out a couple of weeds \n               and then bows her head and closes her eyes.\n\n<b>               CREDITS END.\n</b>\n<b>               EXT. SCOTTSVILLE -- MAIN STREET. DAY\n</b>\n               Scottsville is a small town. Main Street. Run-down old stores \n               next to a new bank, a couple of chain stores, a few \n               restaurants of varying ambitions. Civil War statue. World \n               War I statue. World War II statue. Residential streets \n               wandering away from Main Street up and down hills. You know \n               there's a minimall somewhere nearby. A fair amount of activity \n               during the daytime.\n\n               SAMMY'S CAR pulls up across the street from where an eight-\n               year-old BOY in a secondhand baseball jacket and a school \n               knapsack is waiting at the curb. This is her son, RUDY. SAMMY \n               calls out the car window.\n\n<b>                                     SAMMY\n</b>                         Rudy, come on! I'm really late!\n\n               Rudy hurries across the street and gets in the car, slinging \n               his knapsack into the backseat.\n\n<b>               INT. THE CAR (MOVING). DAY\n</b>\n<b>                                     SAMMY\n</b>                         How was school?\n\n<b>                                     RUDY\n</b>                         Stupid.\n\n<b>                                     SAMMY\n</b>                         Why do you say that?\n\n<b>                                     RUDY\n</b>                         We're supposed to write a story for \n                         English homework, but they didn't \n                         tell us what it's supposed to be \n                         about.\n\n<b>                                     SAMMY\n</b>                         What do you mean?\n\n<b>                                     RUDY\n</b>                         I mean they didn't tell us what it's \n                         supposed to be about. They said do \n                         whatever you want.\n\n<b>                                     SAMMY\n</b>                         So what's wrong with that?\n\n<b>                                     RUDY\n</b>                         Nothing. I just think it's \n                         unstructured.\n\n<b>                                     SAMMY\n</b>                              (Smiles)\n                         Well, I'm sure you'll be able to \n                         think of something. If you can't, \n                         I'll help you.\n\n<b>               INT./EXT. CAR/CAROL'S HOUSE. DAY\n</b>\n               Sammy stops the car outside a heavily THICKETED DRIVEWAY \n               (CAROL'S HOUSE), and RUDY gets out.\n\n<b>                                     SAMMY\n</b>                         Don't forget your backpack.\n\n               Rudy returns to take his knapsack out of the back.\n\n<b>                                     RUDY\n</b>                         It's not a backpack, it's a knapsack.\n\n<b>                                     SAMMY\n</b>                         Don't forget your knapsack.\n\n               Rudy hoists his knapsack out of the back.\n\n<b>                                     SAMMY\n</b>                         Give me a kiss.\n\n               Rudy gives her a kiss and puts his arms around her and \n               squeezes her neck.\n\n               He withdraws, slams the door. As Sammy DRIVES AWAY, he slogs \n               up the long twisting driveway.\n\n<b>               EXT. MERCHANTS NATIONAL TRUST -- PARKING LOT. DAY\n</b>\n               Sammy gets out of her car, which is parked in one of the \n               half dozen spaces in the little parking lot allocated for \n               bank employees.\n\n               She hurries toward the employees' entrance, fixing her skirt \n               as she goes.\n\n<b>               INT. MERCHANTS NATIONAL TRUST. DAY\n</b>\n               Sammy hurries down the clean hallway in the back past MABEL, \n               a pleasant-faced fellow employee.\n\n<b>                                     MABEL\n</b>                         Guess who's been asking for you?\n\n<b>                                     SAMMY\n</b>                         Oh no, really?\n\n               Mabel nods and passes by.\n\n               SAMMY KNOCKS on a big door that says \"Manager\" and has half \n               the letters of the previous branch manager's name taken off \n               it.\n\n<b>                                     BRIAN\n</b>                              (Inside)\n                         Yeah, come in!\n\n               Sammy swings open the door. BRIAN EVERETT, the new branch \n               manager, is unpacking a box. Sammy is surprised to see he is \n               in his early thirties and very good-looking in a boyish sort \n               of way; he wears shirt-sleeves and tie, and a wedding ring.\n\n<b>                                     SAMMY\n</b>                         Mr. Everett?\n\n<b>                                     BRIAN\n</b>                         Yeah: Brian.\n\n<b>                                     SAMMY\n</b>                         Brian. Hi. I'm Samantha Prescott -- \n                         I'm the lending officer?\n\n<b>                                     BRIAN\n</b>                         Yeah, hi, how are you? Come on in. \n                         Sit down.\n\n               Sammy comes into the office and sits.\n\n<b>                                     SAMMY\n</b>                         I am so sorry I was late...\n\n<b>                                     BRIAN\n</b>                         Yeah, we missed you before...\n\n<b>                                     SAMMY\n</b>                         I got held up. Believe me, it is not \n                         something I make a habit of...\n\n<b>                                     BRIAN\n</b>                         I'm sure it's not. Actually -- could \n                         you just, could you close that door \n                         for me? Thanks.\n\n               Sammy gets up and closes the door.\n\n<b>               INT. BRIAN'S OFFICE. LATER\n</b>\n               Sammy sits in front of Brian's desk. Brian is behind the \n               desk listening.\n\n<b>                                     SAMMY\n</b>                         -- so I always just run out at 3:15 \n                         to pick him up and then run him real \n                         quick over to the sitter's house. \n                         Anyway, Larry never minded about it \n                         and I was just hoping it would be OK \n                         with you too...\n\n<b>                                     BRIAN\n</b>                         Well -- Samantha -- I realize that \n                         Scottsville is not exactly a major \n                         banking center...\n\n<b>                                     SAMMY\n</b>                         No it's not...\n\n<b>                                     BRIAN\n</b>                         No -- I know it's not... But it's \n                         kind of a personal challenge to me \n                         to see what we can do to bring local \n                         service up to the same kinds of \n                         standards we'd be trying to meet if \n                         we were the biggest branch in the \n                         state. And that means I don't want \n                         anybody running out at 3:15 or 3:30, \n                         or whenever the bus happens to come \n                         in that day. Now is there anybody \n                         else who can pick your son up after \n                         school? Does your husband work in \n                         the area? Do you --\n\n<b>                                     SAMMY\n</b>                         Oh -- No -- Rudy Sr. isn't \"on the \n                         scene.\" So to speak.\n\n<b>                                     BRIAN\n</b>                         Well, I can give you a couple of \n                         days to make some other arrangement, \n                         but...\n\n<b>                                     SAMMY\n</b>                         Well -- Brian? I understand what \n                         you're saying, and I think it's great. \n                         I do. Because there's a lot of things \n                         around here that could use some \n                         attention. Believe me. But I've \n                         honestly been meeting that bus every \n                         day for four years now and it really \n                         does take just fifteen minutes, and \n                         if I take the time out of my lunch \n                         hour...\n\n<b>                                     BRIAN\n</b>                         I'd really prefer it if you would \n                         make some other arrangement. OK?\n\n<b>                                     SAMMY\n</b>                              (Brightly)\n                         I'll do my best...!\n\n               Brian kicks back in his chair and puts his hands behind his \n               head.\n\n<b>                                     BRIAN\n</b>                         How old's your son?\n\n<b>                                     SAMMY\n</b>                         He's eight.\n\n<b>                                     BRIAN\n</b>                         That's a terrific age.\n\n<b>               INT. SAMMY'S CAR (MOVING). DUSK\n</b>\n               Sammy and Rudy drive home in silence. The orange sunlight \n               flickers through the trees and onto their faces as they drive \n               along.\n\n<b>               EXT. PRESCOTT (SAMMY'S) HOUSE. DUSK\n</b>\n               The same house that Sammy grew up in, with sixteen years' \n               more wear on it.\n\n               Sammy's car swings expertly by the mailbox, and Rudy reaches \n               half his body out of the passenger window and gets the mail.\n\n<b>               INT. SAMMY'S HOUSE. DUSK\n</b>\n               Sammy comes into the house carrying two bags of groceries. \n               Rudy follows, looking through the mail. Sammy passes through \n               the house and goes into the kitchen.\n\n<b>                                     RUDY\n</b>                         You got a letter from Uncle Terry.\n\n<b>                                     SAMMY\n</b>                         What?!\n\n               Her whole face lights up and she grabs the letter. She tears \n               it open and reads it with growing excitement.\n\n<b>               INT. SAMMY'S BEDROOM. LATER\n</b>\n               Sammy opens her FILE DRAWER. Inside are tax files, household \n               files, miscellaneous files.\n\n               She puts Terry's letter away in a very full file marked \"Terry -- \n               Correspondence.\" The folder is stuffed with other letters, \n               on all different kinds of stationery from all over the \n               country, all from Terry.\n\n<b>               INT. DINING ROOM. NIGHT\n</b>\n               Sammy and Rudy are eating dinner. It's a biggish house for \n               just two people.\n\n<b>                                     RUDY\n</b>                         Whose room is he gonna stay in?\n\n<b>                                     SAMMY\n</b>                         He can stay in the little room.\n                              (Pause)\n                         But you know what? He's not going to \n                         live here. He's only gonna stay for \n                         a little while... And it's OK if you \n                         don't remember him, because you were \n                         only six the last time he was here... \n                         But it'll be nice if you got a chance \n                         to get to know each other a little \n                         bit. Don't you think?\n\n               Rudy looks worried and doesn't answer.\n\n<b>               INT. LIVING ROOM. LATER\n</b>\n               Rudy is on the floor, writing in his school composition \n               notebook. Sammy comes downstairs.\n\n<b>                                     SAMMY\n</b>                         Rudy? Would it distract you if I put \n                         on some music?\n\n<b>                                     RUDY\n</b>                         No.\n\n               She puts on a CD, sits down and picks up a book. She looks \n               at Rudy, who is writing away.\n\n<b>                                     SAMMY\n</b>                         Did you think of a story?\n\n<b>                                     RUDY\n</b>                         Uh huh.\n\n<b>                                     SAMMY\n</b>                         What's it about?\n\n<b>                                     RUDY\n</b>                         My father.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         What about your father?\n\n<b>                                     RUDY\n</b>                         It's just a made-up story about him.\n\n<b>                                     SAMMY\n</b>                         Can I read it when you're done?\n\n<b>                                     RUDY\n</b>                         It's not very good.\n\n<b>                                     SAMMY\n</b>                         Don't say that.\n\n               Rudy keeps writing.\n\n<b>               INT. LIVING ROOM. LATER\n</b>\n               Sammy is smoking a cigarette and drinking a glass of wine \n               and reading Rudy's story. It upsets her.\n\n<b>               INT. SAMMY'S BEDROOM. LATER\n</b>\n               Sammy sits on the edge of her bed, not dialing the phone. \n               She catches a glimpse of herself in her parents' floor-length \n               mirror with the worn, heavy wooden frame. Against her better \n               judgment she picks up the phone and dials.\n\n<b>               INT. DAWSON'S GRILL. NIGHT\n</b>\n               Sammy and BOB STEEGERSON are eating dinner at Dawson's, the \n               only fancy restaurant in town. Bob is in his mid-thirties, a \n               Realtor, a decent, ordinary guy.\n\n<b>                                     SAMMY\n</b>                         Anyway, Bob, it's sort of this \n                         adventure story, and Rudy's father \n                         is this secret agent or something, \n                         working for the government... And it \n                         just made me feel weird. You know? \n                         Because I never really say much to \n                         him about Rudy Sr., because I don't \n                         know what to say. And I don't know \n                         whether I should just let him imagine \n                         whatever he wants to imagine, or \n                         whether I should sit him down sometime \n                         and tell him, you know, that his \n                         father is not such a nice person. \n                         You know?\n\n<b>                                     BOB\n</b>                         Well... I don't know, Sammy. What \n                         have you told him already?\n\n<b>                                     SAMMY\n</b>                         Not much. He knows I don't have the \n                         highest opinion of him. And he knows \n                         I don't want to see him or know \n                         anything about him, ever. But I tried \n                         to keep it kind of neutral. Anyway... \n                         I could go into a lot more detail, \n                         believe me.\n\n<b>                                     BOB\n</b>                         Well... It's an interesting problem. \n                         But I don't really know what to tell \n                         you... It's a little outside my \n                         personal field of expertise...\n\n<b>                                     SAMMY\n</b>                         All right.\n\n<b>                                     BOB\n</b>                         I'd be glad to give it some thought...\n\n<b>                                     SAMMY\n</b><b>                         OK.\n</b>\n               He is smiling at her.\n\n<b>                                     SAMMY\n</b>                         What?\n\n<b>                                     BOB\n</b>                         Nothing... I'm just glad to see you... \n                         I'm glad you called me.\n\n<b>                                     SAMMY\n</b>                         I bet you were surprised...!\n\n<b>                                     BOB\n</b>                         Um -- a little.\n\n               Bob drains his wineglass. Sammy cuts at her steak.\n\n<b>               INT. BOB'S BEDROOM. NIGHT\n</b>\n               Sammy and Bob lie in Bob's bed, a few minutes after having \n               made love. They are very far away from each other, but trying \n               with difficulty not to let on.\n\n<b>                                     SAMMY\n</b>                         I should get going...\n\n<b>                                     BOB\n</b>                         Really?\n\n<b>                                     SAMMY\n</b>                         Yeah... I've got the baby-sitter... \n                         But... Thanks for a lovely evening.\n\n<b>                                     BOB\n</b>                         Oh. Thank you.\n\n               She kisses him. She tries to make it sexy, but he's not into \n               it anymore and he politely restricts the kissing.\n\n<b>               INT. SAMMY'S BATHROOM. NIGHT\n</b>\n               Sammy stands in her slip brushing her teeth in front of the \n               mirror. She brushes vigorously, looking at herself while she \n               brushes.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. STREET CORNER -- WORCESTER, MASS. DAWN\n</b>\n               The corner window of a grim little apartment building on a \n               very grim street in a grim little city.\n\n<b>               INT. TERRY'S APARTMENT -- WORCESTER, MASS. NIGHT\n</b>\n               A tiny apartment with a bed, chair, table, fridge, and not \n               much else. One window has a broken pane and an old sheet \n               neatly thumbtacked over it to keep the wind out.\n\n               TERRY PRESCOTT comes in. He is twenty-five years old: a real \n               mess with a certain natural appeal. He wears old jeans, very \n               old hiking boots, and a lumberjack-style coat. He takes a \n               wool hat off his head. His hair is longish and dirty.\n\n               SHEILA SADLER is sitting at the table by the fridge. She is \n               barely eighteen, frail and damaged.\n\n<b>                                     SHEILA\n</b>                         Hey, Terry.\n\n<b>                                     TERRY\n</b>                         Hey.\n\n               Terry looks at her and smiles encouragingly. She smiles back.\n\n<b>                                     SHEILA\n</b>                         Where'd you get the hat?\n\n<b>                                     TERRY\n</b>                         Oh, I got it on the street for a \n                         dollar.\n\n<b>                                     SHEILA\n</b>                         It's nice.\n\n<b>                                     TERRY\n</b>                         Well, you know, it's pretty much \n                         your standard woolen hat.\n\n<b>                                     SHEILA\n</b>                         Yeah, I had a very similar reaction \n                         to it.\n\n               Sheila looks away. Silence.\n\n<b>                                     TERRY\n</b>                         Can I get that money from you?\n\n<b>                                     SHEILA\n</b>                         Yeah. Sorry.\n\n               As she opens her purse, Terry takes a few vague steps toward \n               her. She takes out a tiny hippie-ish woven wallet and gives \n               Terry all the money in it: a twenty and two ones.\n\n<b>                                     TERRY\n</b>                         Is that all you have?\n\n<b>                                     SHEILA\n</b>                         Yeah.\n\n<b>                                     TERRY\n</b>                         Can you borrow some cash from your \n                         brother?\n\n<b>                                     SHEILA\n</b>                         Um, yeah, but that would involve \n                         speaking to him.\n\n<b>                                     TERRY\n</b>                         Well, I'm definitely gonna be gone \n                         for a couple of days at least, Sheila.\n\n<b>                                     SHEILA\n</b>                         Why do you have to stay so long?\n\n<b>                                     TERRY\n</b>                         Because my sister is not a bank, you \n                         know? I can't just show up and ask \n                         her for --\n\n<b>                                     SHEILA\n</b>                         You seem to think my brother's a \n                         bank!\n\n<b>                                     TERRY\n</b>                         Oh Sheila can we just cut out the \n                         puerile crap?! I'll be back just as \n                         soon as I can. OK? I am not the kind \n                         of man that everyone says I am.\n\n<b>                                     SHEILA\n</b>                         I know you're not.\n\n<b>                                     TERRY\n</b>                         I'll call you tonight.\n\n               Pause.\n\n<b>                                     SHEILA\n</b>                         Don't you wanna tell me you love me?\n\n<b>                                     TERRY\n</b>                         I love you.\n\n<b>                                     SHEILA\n</b>                         That was really convincing.\n\n<b>                                     TERRY\n</b>                         Well... I think after this is over \n                         you should seriously consider moving \n                         back home.\n\n<b>                                     SHEILA\n</b>                              (Short laugh)\n                         Oh, yeah.\n\n<b>                                     TERRY\n</b>                              (Gives up)\n                         All right...\n\n<b>                                     SHEILA\n</b>                         You gonna call tonight?\n\n<b>                                     TERRY\n</b>                         Definitely.\n\n               She puts her arms around him and holds on.\n\n<b>               EXT. NEW YORK STATE -- MOUNTAINS -- HIGHWAY. DAY\n</b>\n               Wide open shot of hilly country and a big sky overhead. A \n               GREYHOUND BUS drives into the shot along the curve of the \n               highway.\n\n<b>               INT. BUS (MOVING) -- BATHROOM. DAY\n</b>\n               Terry is seated on the toilet seat in the cramped bathroom \n               smoking a joint. He takes a huge hit and holds it in for as \n               long as humanly possible. He blows out what's left, takes \n               another equally huge hit and holds it in.\n\n<b>               EXT. LOCAL HIGHWAY. DAY\n</b>\n               The BUS WHOOSHES along a smaller, heavily wooded roller-\n               coaster road.\n\n<b>               INT. BUS (MOVING). DAY\n</b>\n               Terry looks out the window at the passing scenery. The \n               sunlight flickers on his face.\n\n               POV TERRY: The bus rolls past the hilltop cemetery.\n\n               Terry shifts uncomfortably in his seat.\n\n               POV TERRY: THE \"WELCOME TO SCOTTSVILLE\" SIGN whizzes by. \n               Houses start dotting the side of the road.\n\n               Terry starts getting very agitated.\n\n<b>               EXT. MAIN STREET. DAY\n</b>\n               Terry stands at one end of Main Street, backpack over his \n               shoulder, as the BUS DRIVES OFF. He looks around at the town \n               going about its Saturday afternoon business.\n\n<b>               INT. KITCHEN. SIMULTANEOUS\n</b>\n               Loud country-western music is blaring as Sammy, wearing an \n               apron, sets a big vase of flowers on the kitchen table and \n               hurries to the oven. There are also cookies, a pie, evidence \n               of massive fancy cooking. She puts on her oven mitts and \n               takes a lasagna out of the oven, as the phone rings. She \n               picks up.\n\n<b>                                     SAMMY\n</b>                              (Into phone)\n                         Hello?... TERRY!...\n\n<b>               EXT. SAMMY'S HOUSE. DAY\n</b>\n               Sammy practically bursts out the front door. She has changed \n               into nice clothes.\n\n<b>               EXT. ALLEY. DAY\n</b>\n               Terry secrets himself in a small dark alley. He takes out \n               his carefully wrapped half joint and lights it. SMOKING, he \n               looks at the sunlit slant of street beyond the alley.\n\n<b>               EXT. MAIN STREET. A FEW MOMENTS LATER\n</b>\n               Terry, fairly well stoned, walks along Main Street. A skinny \n               man emerges from his hardware store to greet Terry and shake \n               hands. Terry says \"Hi,\" but keeps on walking. He passes some \n               other people.\n\n               He almost runs right into SHERIFF DARRYL, sixteen years fatter \n               and grayer.\n\n<b>                                     SHERIFF\n</b>                         Whoa there!\n\n<b>                                     TERRY\n</b>                         Sorry.\n\n               The Sheriff recognizes Terry and breaks into a big smile.\n\n<b>                                     SHERIFF\n</b>                         God damn! Terry Prescott! How you \n                         doin'? Gimme a cuddle!\n\n               The Sheriff gives Terry a big bear hug. Terry is wasted and \n               selfconscious but smiling. He pats the Sheriff's back.\n\n<b>                                     TERRY\n</b>                         How you doin', Darryl?\n\n<b>                                     SHERIFF\n</b>                         Which way you headed?\n\n<b>                                     TERRY\n</b>                         I'm just goin' to see Sammy at \n                         Dawson's...\n\n<b>                                     SHERIFF\n</b>                         Can I walk with you a little?\n\n<b>                                     TERRY\n</b>                         Sure, yeah --\n\n<b>                                     SHERIFF\n</b>                         So Sammy says you been out in \n                         Alaska...?\n\n<b>                                     TERRY\n</b>                         Yeah, I was workin' out there for a \n                         little while...\n\n<b>               EXT. MAIN STREET. A FEW MOMENTS LATER\n</b>\n               The Sheriff walks along with Terry. Terry, very self-conscious \n               about smelling like pot, fumbles to light a cigarette. The \n               Sheriff does not seem to notice.\n\n<b>                                     SHERIFF\n</b>                         -- Sammy says she's gettin' postcards \n                         from all across the country.\n\n<b>                                     TERRY\n</b>                         Yeah, I've been all over the place...\n\n               They stop outside Dawson's.\n\n<b>                                     SHERIFF\n</b>                         Well, it's good to have you back \n                         here, I'll tell you that.\n\n<b>                                     TERRY\n</b>                         Thanks, Darryl. Keep enforcing the \n                         peace.\n\n<b>                                     SHERIFF\n</b>                         Well, that'll be a little harder now \n                         that you're home, but I'll do what I \n                         can.\n\n<b>                                     TERRY\n</b>                         No, man, I'm reformed.\n\n<b>                                     SHERIFF\n</b>                         Oh, yeah. Good to see you, kid.\n\n<b>                                     TERRY\n</b>                         Thanks, Darryl.\n\n               Darryl walks away. Terry stands outside the restaurant looking \n               for Sammy.\n\n               Behind him in the restaurant Sammy is sitting at a table, \n               talking to the waitress.\n\n               She sees Terry and gets up immediately, smiling like crazy \n               as she threads her way through the tables toward the door.\n\n               Terry turns and sees her. He breaks into a big smile, tosses \n               his cigarette and goes into the restaurant. Through the window \n               we see them make their way toward each other.\n\n               Sammy throws her arms around him. He hugs her back with a \n               big involuntary smile as the GLASS DOOR slowly CLOSES.\n\n<b>               INT. DAWSON'S -- AT THEIR TABLE. A FEW MOMENTS LATER\n</b>\n               Terry is studying the menu, over-intently. Sammy is beaming \n               at him.\n\n<b>                                     TERRY\n</b>                         Sorry about yesterday --\n\n<b>                                     SAMMY\n</b>                         I don't care --\n\n<b>                                     TERRY\n</b>                         I was studying the bus description... \n                         and I just... I got on the wrong bus -- \n                         I mean I missed my stop --\n\n<b>                                     SAMMY\n</b>                         I don't care, Terry. I'm just so \n                         glad to see you...!\n\n<b>                                     TERRY\n</b>                         I'm glad to see you too, Sammy. Um... \n                         are you coming from work?\n\n<b>                                     SAMMY\n</b>                         Um, no, it's Saturday...\n\n<b>                                     TERRY\n</b>                         Yeah, no, it's just... you're dressed \n                         so formally...\n\n<b>                                     SAMMY\n</b>                         Oh. No. You know, I just thought I'd -- \n                         You know I thought it was a special \n                         occasion... which it is...\n\n<b>                                     TERRY\n</b>                         No, it's good. I thought I'd dress \n                         up too.\n\n               He gestures to his shitty clothes.\n\n<b>                                     SAMMY\n</b>                         That's OK. You look fine.\n\n<b>                                     TERRY\n</b>                              (A strange, \n                              unsuccessful joke)\n                         Yeah, this is the haute cuisine of \n                         garments.\n\n<b>                                     SAMMY\n</b>                         What?\n\n<b>                                     TERRY\n</b>                         Nothing, nothing... Um... So how are \n                         you?\n\n<b>                                     SAMMY\n</b>                         I'm fine.\n\n<b>                                     TERRY\n</b>                         How's Rudy?\n\n<b>                                     SAMMY\n</b>                         We're fine, Terry. How are you?\n                              (Pause)\n                         I mean --\n\n<b>                                     TERRY\n</b>                         Yeah...\n\n<b>                                     SAMMY\n</b>                         -- Where have you been lately, Terry?\n\n<b>                                     TERRY\n</b>                         -- I know, I haven't been --\n\n<b>                                     SAMMY\n</b>                         I got a postcard from you from \n                         Alaska...?\n\n<b>                                     TERRY\n</b>                         Yeah, I was up there for a while...\n\n<b>                                     SAMMY\n</b>                         But that was in the Fall, Terry...\n\n<b>                                     TERRY\n</b>                         Yeah, I know I've been out of touch...\n\n<b>                                     SAMMY\n</b>                         I was a little worried.\n                              (Pause)\n                         I mean --\n\n<b>                                     TERRY\n</b>                         Oh, I been a lotta different places... \n                         Um... I went down to Florida for a \n                         while... I was doing some work in \n                         Orlando... I've been all over the \n                         place.\n\n<b>                                     SAMMY\n</b>                         Well... I just wish you would have \n                         let me know you were OK...\n\n<b>                                     TERRY\n</b>                         Yeah. I didn't realize it'd been so \n                         long...\n\n               He looks around the restaurant.\n\n<b>                                     SAMMY\n</b>                              (Beaming again)\n                         Are you gonna stay in town for a \n                         while?\n\n<b>                                     TERRY\n</b>                         Well, I don't know... I got all these \n                         things I gotta do back in Worcester...\n\n<b>                                     SAMMY\n</b>                         Oh...\n\n<b>                                     TERRY\n</b>                         ...Yeah, so I'm probably not gonna \n                         be able to stay more than a day or \n                         so...\n\n<b>                                     SAMMY\n</b>                         Oh... Well... That's all right...!\n\n<b>                                     TERRY\n</b>                         ...I'm kind of trying to keep to a \n                         schedule of sorts. It's a long and \n                         worthy story but I won't trouble you \n                         with it right now.\n\n               He twists around and looks all over the restaurant. She \n               watches him.\n\n<b>                                     SAMMY\n</b>                         Are you expecting someone?\n\n<b>                                     TERRY\n</b>                         Who would I be expecting here?\n\n<b>                                     SAMMY\n</b>                         You just keep looking around, that's \n                         all.\n\n<b>                                     TERRY\n</b>                         No, I was just wondering if we could \n                         get some more refreshments, actually.\n\n               He laughs. Looks down. Silence. He looks up at her.\n\n<b>                                     TERRY\n</b>                         I've actually got to confess to you, \n                         Sammy... that the reason you may not \n                         have heard from me for a little while \n                         is that I've been kind of unable to \n                         write... on account of the fact that \n                         I was in jail for a little while.\n\n<b>                                     SAMMY\n</b>                         You were what?\n\n               A couple of people in the restaurant look at them. Terry \n               notices but Sammy does not.\n\n<b>                                     TERRY\n</b>                         Well, I did a little time, I guess, \n                         in Florida. For, uh, just for \n                         bullshit...\n\n<b>                                     SAMMY\n</b>                         What?!\n\n<b>                                     TERRY\n</b>                         It was just bullshit...\n\n<b>                                     SAMMY\n</b>                         What did you do?\n\n<b>                                     TERRY\n</b>                         I didn't do anything. Does it occur \n                         to you that maybe I was wronged?\n\n<b>                                     SAMMY\n</b>                         No!\n\n<b>                                     TERRY\n</b>                         Well, could I please --\n\n<b>                                     SAMMY\n</b>                         Oh my God! --\n\n<b>                                     TERRY\n</b>                         Would you please let me --\n\n<b>                                     SAMMY\n</b>                         -- What happened?!\n\n<b>                                     TERRY\n</b>                         I got into a fight in a bar down in \n                         Florida. Which I was not the one who \n                         instigated it, at all. But they worked \n                         up all this bullshit against me and \n                         they threw me in the pen for three \n                         months. I didn't write you because I \n                         didn't want you to get all upset \n                         about it. I just figured you'd figure \n                         I was on the road for a little while. \n                         I know it was stupid and I'm sorry. \n                         I really didn't mean to make you \n                         worry. But you know what? I can't \n                         run around all the time doin' stuff \n                         or not doin' stuff because it's gonna \n                         make you worry! Because then I come \n                         back here, and I tell you about my \n                         fuckin'... traumas, and I get this \n                         wounded little \"I've Let You Down\" \n                         bullshit, over and over again, and \n                         it really just -- cramps me! Like I \n                         just want to get out from under it!... \n                         And here I am back in this fuckin' \n                         hole explaining myself to you again!\n\n<b>                                     SAMMY\n</b>                         OK -- Can you please stop cursing at \n                         me?\n\n<b>                                     TERRY\n</b>                         I mean, I realize I'm in no position \n                         to, uh, basically say anything, ever -- \n                         But it's not like I'm down there in \n                         some redneck bar in Florida having \n                         an argument with some stripper's \n                         boyfriend and I suddenly think, \"Hey! \n                         Maybe this'd be a good time to really \n                         stick it to Sammy and get myself \n                         locked up for a few months.\"\n\n<b>                                     SAMMY\n</b>                         I'm sorry.\n\n<b>                                     TERRY\n</b>                         Me too, man. I mean \"welcome home.\"\n\n<b>                                     SAMMY\n</b>                         Hey -- You don't write me for six \n                         months, I have no idea where you are --\n\n<b>                                     TERRY\n</b>                         I'm sorry --\n\n<b>                                     SAMMY\n</b>                         -- I don't know if you're alive or \n                         dead --\n\n<b>                                     TERRY\n</b>                         I'm sorry --\n\n<b>                                     SAMMY\n</b>                         -- and then you show up out of nowhere \n                         and tell me you were in jail?\n\n<b>                                     TERRY\n</b>                         I'm sorry, I'm sorry, I'm sorry, \n                         Sammy, I'm really sorry...!\n\n               The patrons are all either looking at them or trying not to \n               look. Silence.\n\n<b>                                     TERRY\n</b>                         Sammy...\n\n<b>                                     SAMMY\n</b>                         What?\n\n<b>                                     TERRY\n</b>                         Um... I'm in the midst of a slight \n                         predicament...\n\n<b>                                     SAMMY\n</b>                         What do you need? Money?\n\n<b>                                     TERRY\n</b>                         Um... Yeah... I'm broke. I gotta get \n                         back to Worcester tomorrow. I got \n                         this girl there, and she's kind of \n                         in a bad situation...? I just need \n                         to borrow some money. Whatever you \n                         can spare.\n                              (Pause)\n                         I'll pay you back... I'll pay you \n                         back, man.\n\n<b>                                     SAMMY\n</b>                         I really wish Mom was here.\n\n<b>                                     TERRY\n</b>                         So do I, man.\n\n<b>                                     SAMMY\n</b>                         Nobody knows what to do with you.\n\n<b>                                     TERRY\n</b>                         I know how they feel, man.\n\n               Silence, except for the sounds of the restaurant.\n\n<b>                                     SAMMY\n</b>                         Terry? Can I ask you something?\n\n<b>                                     TERRY\n</b>                         Sure.\n\n<b>                                     SAMMY\n</b>                              (With some difficulty)\n                         Well -- I mean, do you ever go to \n                         church anymore?\n\n<b>                                     TERRY\n</b>                         Come on, Sammy, can we not talk about \n                         that shit?\n\n<b>                                     SAMMY\n</b>                         Do you?\n\n<b>                                     TERRY\n</b>                         Um -- No, Sammy. I don't.\n\n<b>                                     SAMMY\n</b>                         Can you tell me why not?\n\n<b>                                     TERRY\n</b>                         Um, yeah. Because I think it's \n                         ridiculous.\n\n<b>                                     SAMMY\n</b>                         Well -- can you tell me without like, \n                         denigrating what I believe in?\n\n<b>                                     TERRY\n</b>                         Because I think it's primitive, OK? \n                         I think it's a fairy tale.\n\n<b>                                     SAMMY\n</b>                         Well -- I mean, have you ever \n                         considered that maybe that's part of \n                         what's making things so difficult \n                         for you?\n\n<b>                                     TERRY\n</b>                         No.\n\n<b>                                     SAMMY\n</b>                         -- That you've lost hold of -- well, \n                         not just your religious feeling, but \n                         lost hold of any kind of anchor, any \n                         kind of trust in anything... I mean \n                         no wonder you drift around so much. \n                         What could ever stop you? How would \n                         you ever know if you had found the \n                         right thing?\n\n<b>                                     TERRY\n</b>                         Well, uh, I'm not really looking for \n                         anything, man. I'm just, like, trying \n                         to get on with it.\n\n               The WAITRESS approaches with their salads.\n\n<b>                                     WAITRESS\n</b>                         Here we go...\n\n               She sets them down on the table.\n\n               SAMMY and TERRY Thank you.\n\n               The WAITRESS leaves. Silence. Terry picks at his salad. Sammy \n               doesn't touch hers. She watches him miserably.\n\n<b>               EXT. BANK -- ATM. DAY\n</b>\n               Terry watches while Sammy inserts her card in the ATM and \n               punches in her code. Terry waits. She punches in $300. The \n               machine grinds out her cash. She gives him the money.\n\n<b>                                     TERRY\n</b>                         Thank you, Sammy... I'm really gonna \n                         pay this back.\n\n               She takes her card back and puts it back in her wallet.\n\n<b>               INT. SAMMY'S CAR. DAY\n</b>\n               Sammy and Terry get in the car. Sammy isn't saying anything.\n\n<b>                                     TERRY\n</b>                         Where we going?\n\n<b>                                     SAMMY\n</b>                         To pick up Rudy.\n\n               She puts on her glasses and her seat belt. She won't look at \n               him.\n\n<b>                                     TERRY\n</b>                         Well... do you not even want me to \n                         visit now? 'Cause I can catch the \n                         bus at five o'clock if that's what \n                         you want.\n\n<b>                                     SAMMY\n</b>                         Well, of course I want you to visit, \n                         you idiot! I've been looking forward \n                         to seeing you more than anything! \n                         I've been telling everyone I know \n                         that you were coming home! I cleaned \n                         the whole fucking house so it would \n                         look nice for you! I thought you \n                         were gonna stay for at least a few \n                         days! It didn't occur to me that you \n                         were just broke again. I wish you \n                         would have just sent me an invoice!\n\n               She stops. Terry is now totally contrite.\n\n<b>               INT. BATHROOM. NIGHT\n</b>\n               Terry sits in the tub. Water drips from the faucet. He is \n               staring blankly up at the pristine blue-and-white tiled wall \n               and the neatly folded matching towels.\n\n<b>               INT. LIVING ROOM. LATER\n</b>\n               Sammy and Rudy are in the living room. Rudy is playing with \n               a Game Boy type game. In the b.g., TERRY is dialing the PHONE. \n               He looks clean and shaved, his hair is neatly combed.\n\n<b>                                     TERRY\n</b>                              (Into phone)\n                         Hi, is that Malcolm?... Hi, this is \n                         Terry Prescott?... I been trying to \n                         get ahold of Sheila and there's no \n                         answer, and I was just wondering if \n                         she -- She what?...\n\n               He sits down.\n\n<b>                                     TERRY\n</b>                              (Into phone)\n                         When?... Well -- Is she all right?... \n                         Well, could I talk to her?... Well, \n                         could you give her a message that I --\n\n               CLICK. He is hung up on. He slowly HANGS UP.\n\n               Sammy notices that something's wrong. He looks at her from \n               across the room.\n\n<b>                                     TERRY\n</b>                         That girl I'm with tried to kill \n                         herself.\n\n<b>                                     SAMMY\n</b>                         What?\n\n<b>                                     TERRY\n</b>                         She tried to kill herself.\n\n<b>               INT. TERRY'S ROOM. NIGHT\n</b>\n               Terry is sitting on the bed, addressing an envelope to SHEILA. \n               He puts the $300 in the ENVELOPE and seals it. He sees Sammy \n               standing in the doorway. He starts to unlace his boots.\n\n<b>                                     SAMMY\n</b>                         Do you have everything you need?\n\n<b>                                     TERRY\n</b>                         I think so.\n\n               Sammy comes into the room and sits next to him. He is very \n               busy with his laces.\n\n<b>                                     SAMMY\n</b>                         What are you going to do?\n\n<b>                                     TERRY\n</b>                         I don't know. Send the money I guess.\n\n<b>                                     SAMMY\n</b>                         Maybe you should stay home for a \n                         little while, Terry.\n\n<b>                                     TERRY\n</b>                         Yeah, maybe that'd be a good idea.\n\n               He starts crying. Sammy pats him.\n\n<b>               EXT. SCOTTSVILLE CHURCH. DAY\n</b>\n               A bright, clear, blue-skied Sunday morning in Scottsville. \n               Inside the little white church they're singing.\n\n<b>               EXT. CHURCH. DAY\n</b>\n               People are filing out of the church. We also see a couple of \n               the bank employees, including BRIAN and his very pretty six \n               months' PREGNANT wife, NANCY. We find SAMMY and RUDY. Sammy \n               is chatting to some neighbors. Rudy is bored out of his mind, \n               waiting for her.\n\n<b>               INT. SAMMY'S HOUSE -- LIVING ROOM. DAY\n</b>\n               Terry is lying on the sofa, smoking, with his feet up and \n               boots on, watching Sunday morning TV. On the coffee table \n               are his dirty ashtray, dirty bowl and spoon, Rice Krispies \n               box and a milk carton.\n\n<b>               EXT. SAMMY'S HOUSE. NIGHT\n</b>\n               Crickets buzz loudly outside the house.\n\n<b>               INT. STAIRS. NIGHT\n</b>\n               Sammy, in her bathrobe, comes down the stairs into the living \n               room. Terry is on the sofa playing with Rudy's Game Boy. He \n               barely looks up when she speaks to him.\n\n<b>                                     SAMMY\n</b>                         I'm going to bed. Do you have \n                         everything you need?\n\n<b>                                     TERRY\n</b>                         Yeah. Thanks.\n\n<b>                                     SAMMY\n</b>                         Good night.\n\n<b>                                     TERRY\n</b>                         Good night.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         Terry, I'm really glad you're home.\n\n               Terry tries to smile at her.\n\n<b>                                     TERRY\n</b>                         Yeah, me too, Sammy.\n\n               He goes back to his game. She hesitates, then heads back up \n               the stairs.\n\n<b>               INT. SAMMY'S KITCHEN. DAY\n</b>\n               Sammy, Terry and Rudy sit at the kitchen table. Sammy is \n               dressed for work. Rudy is dressed for school. Terry is also \n               fully dressed, drinking the last dregs of a mug of coffee. \n               He is tired, but listening to Sammy very carefully, as if \n               receiving difficult and critical instructions.\n\n<b>                                     SAMMY\n</b>                         OK. So we'll drop Rudy off at the \n                         bus, then all you have to do is drop \n                         me off at the bank, and just pick \n                         Rudy up at 3:30 in front of town \n                         hall, and drive him over to Carol's \n                         house. And that's it. She's on Harvey \n                         Lane, right past where the Dewitts \n                         used to live.\n\n<b>                                     TERRY\n</b><b>                         OK.\n</b>\n<b>                                     SAMMY\n</b>                         Rudy knows where she lives.\n\n               Terry glances at Rudy, then back at Sammy.\n\n<b>                                     TERRY\n</b><b>                         OK.\n</b>\n<b>               INT. BANK -- MABEL'S DESK. DAY\n</b>\n               Sammy walks past MABEL'S DESK, carrying a big stack of files. \n               She drops three of them on the desk. MABEL is typing away at \n               her PC. The colors are a garish PURPLE background with GREEN \n               letters.\n\n<b>                                     SAMMY\n</b>                         God, Mabel, don't those colors hurt \n                         your eyes?\n\n<b>                                     MABEL\n</b>                         Oh no, they keep me fresh.\n\n               Sammy proceeds down the hall and into --\n\n<b>               INT. BRIAN'S OFFICE. DAY\n</b>\n               Brian is at his desk, busy working between stacks of papers. \n               She knocks on the open door.\n\n<b>                                     BRIAN\n</b>                         Yeah!\n                              (Looks up)\n                         Hi, Sammy. What can I do for you?\n\n<b>                                     SAMMY\n</b>                         Um, Brian? Did you want us to turn \n                         this time sheet in at the end of the \n                         day, or do you want it at the end of \n                         the week...?\n\n<b>                                     BRIAN\n</b>                         Oh, yeah, end of the day'll be fine.\n\n<b>                                     SAMMY\n</b>                         Seems like an awful lot of extra \n                         paperwork...\n\n               Brian hesitates, shrugs and smiles.\n\n<b>                                     BRIAN\n</b>                         I like paperwork.\n\n               Sammy looks at him with a blank smile.\n\n<b>               INT. BANK -- SAMMY'S DESK. A MOMENT LATER\n</b>\n               Sammy sits down at her desk and notices the time: 3:30. She \n               reaches for the phone, then decides not to call.\n\n<b>               EXT. SCOTTSVILLE -- MAIN STREET. DAY\n</b>\n               The CLOCK on the front of the TOWN HALL reads 3:31.\n\n               The SCHOOL BUS pulls up across from the town hall and \n               disgorges a handful of kids. Rudy comes out with his knapsack, \n               looking around...\n\n               POV RUDY: Terry, across the street, sits on the hood of \n               Sammy's car, smoking.\n\n               Rudy walks over to him.\n\n<b>                                     RUDY\n</b>                         You showed up.\n\n<b>                                     TERRY\n</b>                         Looks that way.\n\n<b>               INT. SAMMY'S CAR (MOVING). DAY\n</b>\n               Terry and Rudy drive in silence. Terry glances at Rudy.\n\n<b>                                     TERRY\n</b>                         Put on your seat belt.\n\n<b>                                     RUDY\n</b>                         It pushes on my neck.\n\n<b>                                     TERRY\n</b>                         What?\n\n<b>                                     RUDY\n</b>                         It pushes on my neck. It's \n                         uncomfortable.\n\n<b>                                     TERRY\n</b>                         Well, when somebody slams into us \n                         and you go sailin' through the \n                         windshield, that's liable to be \n                         uncomfortable too. So put on your \n                         seat belt.\n\n               Rudy puts on his seat belt.\n\n<b>                                     RUDY\n</b>                         Mom's parents died in a car accident.\n\n<b>                                     TERRY\n</b>                         I know. They're my parents too.\n\n<b>                                     RUDY\n</b>                         They are?\n\n<b>                                     TERRY\n</b>                         Well, yeah. Your mom is my sister.\n\n<b>                                     RUDY\n</b>                         Yeah, I know.\n\n<b>                                     TERRY\n</b>                         So that means we have the same \n                         parents.\n\n<b>                                     RUDY\n</b>                         Oh yeah.\n\n               They drive in silence for a moment. Terry glances down at \n               Rudy.\n\n<b>               INT. BANK -- SAMMY'S DESK. DAY\n</b>\n               Sammy, laden with files, plops down at her desk as Mabel is \n               passing by. Mabel puts a phone message down in front of her.\n\n<b>                                     MABEL\n</b>                         Um -- Carol just called. She said \n                         Terry and Rudy never showed up at \n                         her house?\n\n<b>                                     SAMMY\n</b>                         You've got to be kidding me.\n\n               A MOMENT LATER: Brian, talking to an employee, sees Sammy, \n               across the bank, hurrying out the employees' exit.\n\n<b>                                     BRIAN\n</b>                         Hey, Sammy?\n\n               Sammy doesn't hear and exits.\n\n<b>               EXT. ORRIN'S BACKYARD. DAY\n</b>\n               Terry and Rudy are banging nails with RAY, a young guy Terry's \n               age. Terry, hammering with swift, accurate blows, glances up \n               and watches Rudy for a second. Rudy is hammering away with \n               no great skill.\n\n<b>                                     TERRY\n</b>                         Hey. Look.\n\n               He moves Rudy's hand down toward the end of the handle.\n\n<b>                                     TERRY\n</b>                         You hold it further down, you're \n                         gonna get a lot more power. You should \n                         be able to put that nail down with \n                         two or three hits. Look:\n\n               With two swift strokes he drives the nail flush into the \n               wood.\n\n<b>                                     TERRY\n</b>                         Try it.\n\n<b>                                     RUDY\n</b>                         That's not the way I hold it.\n\n<b>                                     TERRY\n</b>                         Well, the way you hold it is wrong.\n\n<b>                                     RUDY\n</b>                         Why can't I just do it my own way?\n\n               Terry looks at him unsympathetically for a moment.\n\n<b>                                     TERRY\n</b>                              (Shrugs)\n                         You can.\n\n               He goes back to work. Rudy resumes hammering. After a moment \n               he switches his grip and starts hammering Terry's way. Terry \n               looks up and watches him.\n\n<b>               EXT. IN FRONT OF ORRIN'S HOUSE. A MOMENT LATER\n</b>\n               Sammy pulls up, fast, and gets out of the car. Hearing the \n               hammering from the backyard, she walks quickly around the \n               side of the house and stops short when she sees Rudy hammering \n               happily away with Terry and Ray.\n\n               She watches them working, unobserved, with mixed annoyance \n               and relief, and finally with quiet pleasure, because it's a \n               very cheerful sight.\n\n<b>               INT. BANK. DAY\n</b>\n               Half the staff has gone home. Sammy, in her coat, picks a \n               NOTE up off her CHAIR. It reads:\n\n<b>               \"SAMMY, PLEASE SEE ME A.S.A.P!!! -- BRIAN\"\n</b>\n<b>               INT. BRIAN'S OFFICE. A MOMENT LATER\n</b>\n               Sammy stands in front of Brian's desk.\n\n<b>                                     SAMMY\n</b>                         Brian? Did you want to see me?\n\n<b>                                     BRIAN\n</b>                         Yeah. I was kind of wondering what \n                         happened to you today.\n\n<b>                                     SAMMY\n</b>                         Oh -- Didn't Mabel -- I had a false \n                         alarm about my son...\n\n<b>                                     BRIAN\n</b>                         Yeah, I kind of thought you were \n                         gonna work that out.\n\n<b>                                     SAMMY\n</b>                         Well, I did work it out -- more or \n                         less --\n\n<b>                                     BRIAN\n</b>                         Then why're you running outta here \n                         in the middle of the day without a \n                         word of explanation to me, Sammy?\n\n<b>                                     SAMMY\n</b>                         Brian, don't yell at me.\n\n<b>                                     BRIAN\n</b>                         I'm -- I'm not yelling. I'm just \n                         gettin' a little frustrated here.\n\n<b>                                     SAMMY\n</b>                         Well Brian:\n\n<b>                                     BRIAN\n</b>                         Sorry, could you close the door \n                         please?\n\n               Sammy closes the door.\n\n<b>               INT. DINING ROOM. NIGHT\n</b>\n               Sammy, Terry and Rudy sit at dinner. The atmosphere is lively \n               and cheerful.\n\n<b>                                     SAMMY\n</b>                         ...And Eddy Dwyer lives in Buffalo, \n                         with his wife and two sons, if you \n                         can believe it.\n\n<b>                                     TERRY\n</b>                         That is depressing.\n\n<b>                                     SAMMY\n</b>                         Why?\n\n<b>                                     TERRY\n</b>                         He just never struck me as the \n                         marrying type, that's all.\n\n<b>                                     RUDY\n</b>                         Who are you talking about?\n\n<b>                                     TERRY\n</b>                         Wild kids we used to know.\n\n<b>                                     RUDY\n</b>                         Were you a wild kid?\n\n<b>                                     TERRY\n</b>                         Not compared to your Mom.\n\n<b>                                     RUDY\n</b>                         Yeah, right.\n\n<b>                                     TERRY\n</b>                         You don't believe me?\n\n<b>                                     RUDY\n</b>                         No.\n\n<b>                                     TERRY\n</b>                         Ask her.\n\n<b>                                     RUDY\n</b>                         Mom, were you?\n\n<b>                                     SAMMY\n</b>                         No comment.\n\n               Rudy is amazed. Terry looks at him like, \"Told you so.\"\n\n<b>               INT. SAMMY'S BEDROOM. NIGHT\n</b>\n               Sammy is asleep in bed.\n\n<b>               INT. RUDY'S BEDROOM. NIGHT\n</b>\n               Rudy is asleep in bed.\n\n<b>               INT. BAR. NIGHT\n</b>\n               Terry sits at the bar, drinking beer. There are a few locals \n               in the place, but it's pretty dead. He looks around; his \n               energy is too restless for the near-empty bar.\n\n<b>               INT. RUDY'S BEDROOM. NIGHT\n</b>\n               The DOOR OPENS, and TERRY COMES IN, smoking a cigarette. \n               He's plastered. He looks around the room. Looks at Rudy's \n               toys. Picks up some superhero comics and sits on Rudy's bed. \n               Then he spies Rudy's COMPOSITION BOOK, picks it up and starts \n               reading it.\n\n<b>                                     RUDY (O.C.)\n</b>                         What are you doing?\n\n               Terry looks up. Rudy is half-sitting up in bed.\n\n<b>                                     TERRY\n</b>                         Oh -- Just readin' some of your \n                         compositions.\n\n<b>                                     RUDY\n</b>                         Why are you smoking?\n\n<b>                                     TERRY\n</b>                         Um... Because it's bad. Don't ever \n                         do it.\n\n<b>                                     RUDY\n</b>                         I won't.\n\n<b>                                     TERRY\n</b>                         You know this used to be my room?\n\n<b>                                     RUDY\n</b>                         Yeah...\n                              (Pause)\n                         Do you want it back?\n\n<b>                                     TERRY\n</b>                         No.\n\n               Rudy is very relieved. Terry keeps reading. Rudy watches \n               him.\n\n<b>                                     RUDY\n</b>                         Did you fight in Vietnam?\n\n<b>                                     TERRY\n</b>                         No. I wasn't even born yet.\n\n<b>                                     RUDY\n</b>                         Were you ever in the army?\n\n<b>                                     TERRY\n</b>                         No.\n\n<b>                                     RUDY\n</b>                         My father was in the army.\n\n<b>                                     TERRY\n</b>                         I know. Unfortunately he didn't fight \n                         in Vietnam either.\n\n<b>                                     RUDY\n</b>                         Were you friends with him?\n\n<b>                                     TERRY\n</b>                         Not really. We had some friends in \n                         common, I guess... I didn't like him \n                         very much.\n\n<b>                                     RUDY\n</b>                         Why not?\n\n<b>                                     TERRY\n</b>                         Well, he wasn't very likable.\n\n<b>                                     RUDY\n</b>                         Why do you say that?\n\n<b>                                     TERRY\n</b>                         I don't know. He was always -- He \n                         always had to be better than you at \n                         everything. You know. Like if you \n                         were all playing basketball or \n                         something, everybody's havin' like a \n                         friendly game and he's like ready to \n                         kill somebody if his team didn't \n                         win. Or like if you told like a joke \n                         or a story, he always had to tell a \n                         better one? Kinda gets annoying after \n                         a while. Plus it was pretty scummy \n                         how he split on your mom and you... \n                         He was a prick. Probably still a \n                         prick. Fortunately for you though, \n                         your mom is like, the greatest. So \n                         you had some bad luck and you had \n                         some good luck.\n                              (Pause)\n                         You mind if I ask you a personal \n                         question?\n\n<b>                                     RUDY\n</b>                         I don't know.\n\n<b>                                     TERRY\n</b>                         Do you like it here? I mean, in \n                         Scottsville?\n\n<b>                                     RUDY\n</b>                         Yeah...?\n\n<b>                                     TERRY\n</b>                         Why?\n\n<b>                                     RUDY\n</b>                         I don't know. My friends are here... \n                         I like the scenery... I don't know.\n\n<b>                                     TERRY\n</b>                         I know, I know, but it's so... There's \n                         nothing to do here.\n\n<b>                                     RUDY\n</b>                         Yes there is.\n\n<b>                                     TERRY\n</b>                         No there isn't, man! It's narrow. \n                         It's dull. It's a dull, narrow town \n                         full of dull, narrow people who don't \n                         know anything except... what things \n                         are like right around here. They \n                         have no perspective whatsoever. No \n                         scope. They might as well be living \n                         in the nineteenth century because \n                         they have no idea what's going on, \n                         and if you try to tell 'em that, \n                         they wanna fuckin' kill you.\n\n<b>                                     RUDY\n</b>                         What are you talking about?\n\n<b>                                     TERRY\n</b>                         I don't know...\n\n               Terry lies on his back and smokes.\n\n<b>                                     TERRY\n</b>                         You're a good kid.\n\n<b>               INT. BANK -- SAMMY'S DESK. MORNING\n</b>\n               There's a NOTE on Sammy's chair.\n\n<b>               \"SAMMY, PLEASE SEE ME -- BRIAN\"\n</b>\n               Sammy, just arrived at work and still in her coat, looks \n               down at the note.\n\n<b>               INT. BANK -- BRIAN'S OFFICE. DAY\n</b>\n               Sammy listens to Brian.\n\n<b>                                     BRIAN\n</b>                         Yeah. This doesn't apply to you \n                         directly, Sammy, but I've noticed \n                         that some of the employees have their \n                         PC monitors set with all kinds of \n                         crazy colors... Purple and polka \n                         dots or what have you. And it's not \n                         a big deal, but really, this is a \n                         bank. You know? It's not really \n                         appropriate. So I'm just asking that \n                         people stick to a more quote unquote \n                         normal range of colors in future...\n\n               Sammy looks at him blankly.\n\n<b>                                     BRIAN\n</b>                         Like I say, it doesn't really apply \n                         to you.\n\n<b>                                     SAMMY\n</b>                         No, my computer palette's pretty \n                         conservative.\n\n<b>               INT. BANK -- MABEL'S DESK. DAY\n</b>\n               Mabel is typing angrily at a GRAY SCREEN with BLACK LETTERS. \n               Sammy walks by. Mabel is so mad she doesn't even look up.\n\n<b>               INT. BANK -- SAMMY'S DESK. DAY\n</b>\n               Sammy sits agitated for a moment. She makes a decision, picks \n               up the phone and dials.\n\n<b>               INT. BOB'S OFFICE. SIMULTANEOUS\n</b>\n               Bob is in his little realty office with two CLIENTS, a husband \n               and wife. He picks up his RINGING PHONE.\n\n<b>                                     BOB\n</b>                              (Into phone)\n                         Bob Steegerson.\n\n<b>                                     SAMMY\n</b>                              (On phone)\n                         What are you wearing?\n\n<b>                                     BOB\n</b>                              (Into phone)\n                         Mom?\n\n               Sammy LAUGHS.\n\n<b>               INT. SAMMY'S HOUSE -- DOWNSTAIRS HALL. NIGHT\n</b>\n               Terry is holding a broom looking up at the ceiling. Sammy \n               passes by and stops.\n\n<b>                                     SAMMY\n</b>                         What's up?\n\n               Terry taps the broom handle against the ceiling.\n\n<b>                                     TERRY\n</b>                         Do you know you have an enormous \n                         leak from the upstairs hall?\n\n               He pokes again. A portion of the ceiling collapses on his \n               head in wet chunks of plaster and muck.\n\n<b>                                     SAMMY\n</b>                         Um, yeah, thanks, I did.\n\n<b>               INT. SAMMY'S ROOM. NIGHT\n</b>\n               Sammy, in front of the mirror, finishes dolling herself up \n               for her date. O.C. we hear loud banging. Sammy puts on her \n               earrings and goes into --\n\n<b>               INT. HALL. CONTINUOUS\n</b>\n<b>                                     SAMMY\n</b>                         Are you guys sure you're gonna be \n<b>                         OK?\n</b>\n<b>                                     TERRY\n</b>                         Yes. Yes.\n\n               Sammy approaches RUDY and TERRY. They are bent over a big \n               nasty trench in the floorboard. There are wood shavings and \n               greasy pipe segments all over, and black smeary smudges on \n               the walls nearby.\n\n<b>                                     SAMMY\n</b>                         What is happening here?\n\n<b>                                     TERRY\n</b>                         It's just -- The problem is that the \n                         pipe is corroded all the way along \n                         the length of the hall. So every \n                         time I put in a new piece it starts \n                         leaking further down.\n\n<b>                                     SAMMY\n</b>                         Why don't I just call the plumber?\n\n<b>                                     TERRY\n</b>                         Why? He's not gonna do anything \n                         different than what I'm doing.\n\n<b>                                     RUDY\n</b>                              (Happily)\n                         Yeah. We're making it worse!\n\n<b>                                     TERRY\n</b>                         No we're not. Shut up.\n\n               Terry yanks the wrench and a SPRAY of FILTHY WATER comes out \n               of the pipe and splatters the wallpaper and pictures and \n               Sammy with gritty gray water. She looks at them.\n\n<b>                                     SAMMY\n</b>                         Thank you. Thank you both.\n\n<b>               INT. HALLWAY. NIGHT\n</b>\n               Bob and Sammy -- cleaned up and wearing a different outfit -- \n               are bustling out the front door. Terry stands by.\n\n<b>                                     SAMMY\n</b>                         Now, call if there's any problem, \n                         and if I'm not there, I'm either on \n                         my way or on my way back home.\n\n<b>                                     TERRY\n</b><b>                         OK.\n</b>\n               Sammy gets into her coat. Bob opens the front door.\n\n<b>                                     SAMMY\n</b>                              (To TERRY)\n                         So lights out at ten... and don't \n                         spend the whole night watching TV.\n\n<b>                                     TERRY\n</b>                         Nice to meet you, Bob.\n\n<b>                                     BOB\n</b>                         You too.\n\n<b>                                     TERRY\n</b>                              (To SAMMY)\n                         What's your idea of the whole night?\n\n<b>                                     SAMMY\n</b>                         Two hours tops.\n\n               Bob holds the door for Sammy and smiles at her. There is \n               some confusion about who should go out first. Finally she \n               goes and Bob follows. The atmosphere between them is fairly \n               awkward.\n\n<b>               INT. SAMMY'S HOUSE. NIGHT\n</b>\n               Terry and Rudy are watching TV from the sofa.\n\n<b>                                     TERRY\n</b>                         What's your feeling about Bob?\n\n<b>                                     RUDY\n</b>                         I don't really know him that well.\n\n               Terry looks at his watch.\n\n<b>                                     TERRY\n</b>                         I have bad news for you.\n\n               He picks up the remote...\n\n<b>                                     RUDY\n</b>                         No...!\n\n               ...and turns off the TV. They sit there in the sudden silence.\n\n<b>                                     RUDY\n</b>                         Great. What are we supposed to do \n                         now?\n\n<b>                                     TERRY\n</b>                         Do you know how to play pool?\n\n<b>                                     RUDY\n</b>                         I've played it.\n\n<b>               EXT. THE WILD MOOSE. NIGHT\n</b>\n               The Wild Moose is a noisy roadside bar sitting under the \n               stars. Terry and Rudy get out of the car. Rudy looks \n               apprehensive.\n\n<b>                                     RUDY\n</b>                         I don't think they let kids in there.\n\n<b>                                     TERRY\n</b>                         Well, we're not allowed to watch any \n                         more TV, so it's this or nothing... \n                         But if we run into any trouble, let \n                         me do the talking.\n\n<b>                                     RUDY\n</b><b>                         OK.\n</b>\n               Terry swings the door open.\n\n<b>               INT. THE WILD MOOSE. NIGHT\n</b>\n               POV RUDY: A lot of men and women at the bar or in booths, \n               eating and drinking. Smoky, crowded and very loud. As he \n               follows Terry through the crowd various patrons notice him -- \n               some of the looks are friendly, some blank, some cold, i.e., \n               what's a kid doing in here?\n\n               AT THE POOL TABLE: Terry and Rudy stand side by side facing \n               the players and waiting players gathered around the table. \n               Terry waves a few bills.\n\n<b>                                     TERRY\n</b>                         I got a hundred bucks here says me \n                         and my nephew can beat anybody in \n                         here. Only we gotta get the next \n                         game 'cause he's gotta be in bed by \n                         ten o'clock.\n\n               A MOMENT LATER: RUDY, very nervous, and the 1st Pool Player \n               are side by side shooting for break. Terry is behind Rudy \n               coaching him.\n\n<b>                                     TERRY\n</b>                         Just hit it nice and soft... Nice \n                         and soft.\n\n               They hit the balls. Rudy just clips his ball and it doesn't \n               go anywhere. 1st Pool Player's ball hits the opposite bank \n               and comes almost all the way back.\n\n<b>                                     RUDY\n</b>                              (To TERRY)\n                         Sorry.\n\n<b>                                     TERRY\n</b>                         God damn, Rudy. I thought you said \n                         you could play.\n\n               Rudy doesn't answer. Terry winks at him.\n\n               A MOMENT LATER: 1ST POOL PLAYER BREAKS -- WHACK! -- The balls \n               scatter. Nothing drops. TERRY steps up to the table, chalking \n               up his cue.\n\n<b>                                     TERRY\n</b>                         Boys, it's all over but the cryin'.\n\n               QUICK CUTS: Of Terry running the table and everyone watching. \n               Three-ball in the side. One-ball in the corner. Nine-ball \n               off three cushions and into the corner, and the eleven-ball \n               into the side. Rudy watches him.\n\n<b>               INT. BOB'S APARTMENT. NIGHT\n</b>\n               Bob and Sammy sit at Bob's dining room table. The little \n               bachelor apartment looks pretty good. Tablecloth, candles, \n               wine, everything. Bob has just dropped a huge bombshell.\n\n<b>                                     SAMMY\n</b>                         Bob... Are you serious?\n\n<b>                                     BOB\n</b>                         Yeah.\n\n<b>                                     SAMMY\n</b>                         I... I don't know what to say. I --\n\n<b>                                     BOB\n</b>                         I mean, I know I haven't exactly \n                         been the most... decisive... guy. In \n                         the past... I don't know: I'm tired \n                         of foolin' around. And I love you.\n\n<b>                                     SAMMY\n</b>                         I... I'm totally... I don't know \n                         what to say.\n\n<b>                                     BOB\n</b>                         Well, you could always say \"Yes.\"\n                              (Pause)\n                         Or you could think about it first.\n\n<b>                                     SAMMY\n</b>                         That's it: I want to think about it.\n\n<b>                                     BOB\n</b>                         OK... Fair enough.\n\n<b>               INT. WILD MOOSE. NIGHT\n</b>\n               Terry has sunk everything but the eight ball. He leans over \n               to sink it. It's a fairly easy shot. He lines it up carefully, \n               and deliberately shoots it so it stops two inches from the \n               corner pocket.\n\n<b>                                     TERRY\n</b>                         Ohhhh!\n\n               A FEW MOMENTS LATER: Terry and Rudy sit side by side watching \n               as the 2nd Pool Player passes back and forth between them \n               and the camera, running the table. \"Oohs\" and \"All rights\" \n               emit from the spectators.\n\n               Sudden silence. Then the clack of the balls connecting. A \n               great common GROAN goes up. RUDY looks up at Terry.\n\n<b>                                     TERRY\n</b>                         It's all yours, baby.\n\n               Rudy looks at the TABLE: The eight-ball is two inches off \n               the corner. The cue ball is a few inches away from it. A \n               piece of cake, for an adult. Rudy looks deeply unconfident.\n\n               He gets up and tries to line up the eight-ball. Terry is \n               right next to him.\n\n<b>                                     TERRY\n</b>                         Just make sure to hit it really \n                         gentle. But firm. And hit it a little \n                         low so you get some backspin. Don't \n                         even hit it. Just kiss it.\n\n               A long moment.\n\n<b>                                     RUDY\n</b>                         What do you mean, kiss it?\n\n<b>                                     TERRY\n</b>                         I mean tap it. Firm but very, very \n                         softly. And don't shoot until you \n                         know it's going in. OK?\n\n<b>                                     RUDY\n</b><b>                         OK.\n</b>\n               Everyone is relatively quiet. Rudy takes a few practice \n               strokes and then hits the cue ball, straight, but too softly. \n               It crawls toward the eight and taps it toward the corner, \n               slower and slower, hangs there, and DROPS.\n\n               A GENERAL \"HEYYY!\" GOES UP and everyone claps and cheers. \n               Terry grabs Rudy. Rudy smiles, ecstatic.\n\n<b>                                     TERRY\n</b>                         That was great!\n\n               AT THE BAR: Darryl the SHERIFF, in his civvies, drinking a \n               pint of beer, notices Rudy and Terry.\n\n               AT THE POOL TABLE: Terry picks Rudy up and turns him upside \n               down. Rudy laughs.\n\n<b>               EXT. SAMMY'S HOUSE. NIGHT\n</b>\n               The house is dark. Terry and Rudy are walking from the car \n               to the house.\n\n<b>                                     RUDY\n</b>                         We creamed those guys! We creamed \n                         them!\n\n<b>                                     TERRY\n</b>                              (Stopping suddenly)\n                         Ssh...! Don't move.\n\n               They listen. A CAR is COMING.\n\n<b>                                     TERRY\n</b>                         It's them!\n\n               They break for the door, Terry fumbling for his key. He gets \n               the door open.\n\n<b>                                     TERRY\n</b>                         Go! Go! Go!\n\n               He and Rudy run inside the house. The lights go on. BOB'S \n               CAR pulls into the DRIVEWAY.\n\n<b>               INT. THE HOUSE -- FRONT DOOR. SIMULTANEOUS\n</b>\n               Rudy runs up the stairs.\n\n<b>                                     TERRY\n</b>                         Wait a minute, gimme your jacket!\n\n               Rudy tries to take his jacket off fast but gets his arm caught \n               in the sleeve. He tries to shake it off.\n\n<b>                                     TERRY\n</b>                         What are you doing?\n\n<b>                                     RUDY\n</b>                         I can't get my sleeve out...!\n\n               They HEAR Bob's CAR DOORS SLAM. Terry makes a comic panicked \n               face and leaps up the stairs two at a time.\n\n               OUTSIDE THE HOUSE: Sammy waves to Bob. Bob waves back as he \n               drives off. Sammy goes to the front door, opens it:\n\n               Terry and Rudy are in a giggly tangled panicked heap at the \n               top of the stairs, shaking Rudy's arm and sleeve, frantically \n               trying to get the jacket off.\n\n               Sammy comes in. They freeze.\n\n<b>                                     SAMMY\n</b>                         What is going on in here?\n\n<b>                                     TERRY\n</b>                         Um -- We were just out doing some \n                         star-gazing, and, uh, Rudy lost track \n                         of the time. Which I totally warned \n                         him about.\n                              (To Rudy)\n                         You are a bad kid.\n\n<b>               INT. BATHROOM. LATER\n</b>\n               Rudy is brushing his teeth. Terry pokes his head in.\n\n<b>                                     TERRY\n</b>                              (In a low voice)\n                         Hey: I think it's OK. Just don't \n                         tell her where we went, 'cause she'll \n                         be really mad at me. OK?\n\n<b>                                     RUDY\n</b>                         I won't.\n\n<b>                                     TERRY\n</b>                              (Suddenly dark)\n                         Hey -- I'm not kidding, Rudy.\n\n<b>                                     RUDY\n</b>                         I won't!\n\n               Terry gives him a \"You better not\" look, then leaves. Rudy \n               continues brushing his teeth.\n\n<b>               INT. RUDY'S ROOM. NIGHT\n</b>\n               Sammy is tucking Rudy in, stroking his hair.\n\n<b>                                     SAMMY\n</b>                         Did you know my Mommy used to take \n                         me and Uncle Terry out at night to \n                         look at the constellations?\n\n<b>                                     RUDY\n</b>                         Yeah.\n\n<b>                                     SAMMY\n</b>                         Did you see that one, what's the one -- \n                         It looks like a big \"W\"? Cassiopeia?\n\n<b>                                     RUDY\n</b>                         Yeah.\n\n<b>               INT. HALL. NIGHT\n</b>\n               Sammy comes out of Rudy's room, smiling. It's dark. She sees \n               a LIGHT on under TERRY'S DOOR. She walks toward it and steps \n               into the TRENCH, falling down violently.\n\n<b>                                     SAMMY\n</b>                         Ow! Shit!\n\n<b>               INT. BATHROOM. NIGHT\n</b>\n               Terry is putting a butterfly Band-Aid on Sammy's wound. It's \n               a nasty, bloody gash, just shy of needing stitches.\n\n<b>                                     SAMMY\n</b>                         I've got a great idea. Why don't you \n                         let me call the plumber?\n\n<b>                                     TERRY\n</b>                         Do whatever you want.\n\n<b>                                     SAMMY\n</b>                         Oh, does that make you mad?\n\n<b>                                     TERRY\n</b>                         No...\n\n<b>               INT. SAMMY'S ROOM. NIGHT\n</b>\n               RAIN patters on the ROOF as Sammy LIMPS back and forth across \n               the room changing into her nightgown.\n\n<b>               EXT. TERRY'S WINDOW. NIGHT\n</b>\n               Terry is smoking pot with his head and shoulders stuck outside \n               the window. RAIN FALLS on his HEAD.\n\n<b>                                                               DISSOLVE TO:\n</b>\n<b>               EXT. BANK. MORNING\n</b>\n               Early morning. The RAIN is still falling. Only a few cars \n               are in the employee parking lot yet.\n\n<b>               INT. BANK -- BRIAN'S OFFICE. DAY\n</b>\n               The RAIN runs down Brian's office window. BRIAN, in a wet \n               raincoat, turns on his light.\n\n               A MOMENT LATER: Brian turns on his PC. The SCREEN lights up. \n               The COLORS are a garish GREEN and ORANGE.\n\n<b>                                                                    CUT TO:\n</b>\n               LATER: SAMMY and BRIAN are both on their feet. The door is \n               closed.\n\n<b>                                     SAMMY\n</b>                         Brian, get off my ass!\n\n<b>                                     BRIAN\n</b>                         Excuse me?\n\n<b>                                     SAMMY\n</b>                         I didn't change the colors on your \n                         stupid computer screen.\n\n<b>                                     BRIAN\n</b>                         Well, that's all you gotta say!\n\n<b>                                     SAMMY\n</b>                              (On \"that's\")\n                         There is nothing wrong with the work \n                         I do here. I have been doing just \n                         fine, the whole time before you came \n                         here -- And if you think that riding \n                         people in this petty, ridiculous way \n                         is the way to improve service in \n                         this bank or anywhere else I think \n                         you're out of your mind!\n\n               Pause.\n\n<b>                                     BRIAN\n</b>                         I didn't say there was. Could I please -- \n                         Could I please -- May I respond?\n\n<b>                                     SAMMY\n</b>                         No, that's really all I have to --\n\n<b>                                     BRIAN\n</b>                         May I respond?\n                              (Beat)\n                         First of all, I don't appreciate \n                         being spoken to with that kind of \n                         language. That's not the way I talk \n                         to you, and I'd appreciate it if you \n                         wouldn't talk that way to me --\n\n<b>                                     SAMMY\n</b>                         Well --\n\n<b>                                     BRIAN\n</b>                         Second of all, if you say you didn't \n                         change the colors on my computer \n                         screen, then of course I accept your \n                         answer. But you and I are gonna have \n                         to find a way to work together --\n\n<b>                                     SAMMY\n</b>                         Brian --\n\n<b>                                     BRIAN\n</b>                         But that's not gonna happen with the \n                         attitude, it's not gonna happen with \n                         the lateness, it's not gonna happen \n                         by fighting me every step of the way -- \n                         OK, well not you, you're not late, \n                         but too much of that stuff goes on \n                         around here --\n\n<b>                                     SAMMY\n</b>                         I am not late and I do not have an \n                         attitude -- Well then don't tell me \n                         I'm late if I'm not late!\n\n<b>                                     BRIAN\n</b>                         I'd really like to finish!\n\n               OUTSIDE BRIAN'S OFFICE: The whole staff is listening to the \n               muffled raised VOICES from inside the office.\n\n               MABEL especially is listening guiltily.\n\n<b>               EXT. MAIN STREET. DAY\n</b>\n               The rain falls on Main Street.\n\n<b>               EXT. ORRIN'S BACKYARD. DAY\n</b>\n               The rain comes down hard on Orrin's construction project. \n               Tarps cover everything. No work today.\n\n<b>               EXT. MAIN STREET -- LUNCH PLACE. DAY\n</b>\n               The rain comes down on the SHERIFF, looking through the \n               restaurant WINDOW at SAMMY, eating lunch alone at the counter. \n               He goes inside, shakes the rain off himself and goes over to \n               her. They start talking. We HEAR:\n\n<b>                                     SAMMY\n</b>                         They were where?\n\n<b>               INT. SAMMY'S HOUSE -- LIVING ROOM. DAY\n</b>\n               The RAIN on the roof makes a sleepy, pleasant country sound.\n\n               TERRY is lying on the sofa, smoking a joint, watching TV, in \n               a funk. O.C. we LOUD BANGING ON THE PIPES.\n\n               LATER: A YOUNG PLUMBER, about Terry's age, comes thumping \n               down the stairs and goes into the living room, carrying his \n               toolbox. Terry looks up at him.\n\n<b>                                     PLUMBER\n</b>                         OK, you're all set.\n\n               Terry glares at him. The plumber turns and goes out.\n\n<b>               EXT. BUS STOP. DAY\n</b>\n               RUDY is WAITING in a doorway for Terry. He is wet and cold. \n               The RAIN pours down.\n\n<b>               INT. BANK. DAY\n</b>\n               Brian is showing his wife, NANCY, the bank. He is very \n               solicitous of her, nervously introducing her to the employees, \n               who are not responding very warmly. Nancy is not in a warm \n               mood either; she's very testy with Brian.\n\n<b>                                     BRIAN\n</b>                         This is Chuck. Chuck, this is my \n                         wife, Nancy.\n\n<b>                                     CHUCK\n</b>                         Hello.\n\n<b>                                     NANCY\n</b>                         Nice to meet you.\n\n<b>                                     BRIAN\n</b>                         This is Mabel...\n\n<b>                                     MABEL\n</b>                         Hi.\n\n<b>                                     NANCY\n</b>                         Nice to meet you.\n\n               SAMMY, at her desk, watches Brian and Nancy make their \n               progress through the bank. Nobody is being very friendly, \n               and Brian suddenly seems awkward and vulnerable. Brian and \n               Nancy reach Sammy's desk.\n\n<b>                                     BRIAN\n</b>                         This is Sammy, our lending officer. \n                         Sammy, this is my wife, Nancy.\n\n<b>                                     SAMMY\n</b>                              (Friendly)\n                         Hi. It's nice to meet you.\n\n<b>                                     NANCY\n</b>                         Brian -- I gotta sit down.\n\n<b>                                     BRIAN\n</b>                         Sure -- Let's go in my office.\n\n               He glances nervously at Sammy as he leads Nancy away from \n               her desk and toward his office. He murmurs something to Nancy, \n               who responds in a low but very testy voice:\n\n<b>                                     NANCY\n</b>                         I'm fine...!\n\n               She roughly pulls her arm away from his. Sammy watches them \n               go into his office.\n\n<b>               EXT. MAIN STREET. DAY\n</b>\n               Rudy trudges resolutely through the pouring rain toward the \n               center of town. He is completely drenched.\n\n<b>               INT. BRIAN'S OFFICE. DAY\n</b>\n               Sammy knocks on Brian's open door.\n\n<b>                                     SAMMY\n</b>                         Brian...?\n\n<b>                                     BRIAN\n</b>                         Yeah.\n\n<b>                                     RUDY (O.C.)\n</b>                         Mom!\n\n               Sammy sees to her left, down the hallway --\n\n<b>                                     SAMMY\n</b>                         Rudy!\n\n               Rudy is at the end of the hall, drenched and shivering, but \n               cheerful.\n\n<b>               EXT. EMPLOYEE PARKING LOT. DAY\n</b>\n               Rudy is in the car, somewhat dried off, waiting. Sammy and \n               Terry stand in the employee entrance doorway.\n\n<b>                                     SAMMY\n</b>                         Look, I'm glad you guys are getting \n                         along so well -- like, you have no \n                         idea -- but if I can't rely on you \n                         to remember to get him once a day...\n\n<b>                                     TERRY\n</b>                         You can!\n\n<b>                                     SAMMY\n</b>                         -- And what are you doing taking him \n                         to play pool in the middle of the \n                         night, and then telling him to lie \n                         to me about it?\n\n               Pause.\n\n<b>                                     TERRY\n</b>                         I don't know.\n\n<b>               INT./EXT. SAMMY'S CAR/CAROL'S DRIVEWAY. DAY\n</b>\n               Terry and Rudy pull up in front of the driveway. Terry is in \n               a silent rage. The rain has let up.\n\n<b>                                     TERRY\n</b>                         Get out of the car.\n\n<b>                                     RUDY\n</b>                         What are we doing?\n\n<b>                                     TERRY\n</b>                         You're going to Carol's house and \n                         I'm going home.\n\n<b>                                     RUDY\n</b>                         Why can't I come with you?\n\n<b>                                     TERRY\n</b>                         Because if you're such a baby you \n                         gotta tell your Mommy about us playin' \n                         pool when I totally asked you not \n                         to, and I gotta listen to her shit \n                         all day, then you're goin' to the \n                         baby-sitter's so you can stay at the \n                         baby house.\n\n<b>                                     RUDY\n</b>                         But I didn't tell her!\n\n<b>                                     TERRY\n</b>                         You know what? Don't even fuckin' \n                         talk to me.\n\n<b>                                     RUDY\n</b>                         I didn't!\n\n<b>                                     TERRY\n</b>                         Just get out of the car.\n\n               He leans over Rudy roughly and pushes open the door. Rudy \n               gets out of the car and marches down the long driveway. He \n               bursts into tears.\n\n               Terry watches him go, then drives off.\n\n<b>               INT. BANK -- HALL. A FEW MOMENTS LATER\n</b>\n               Sammy walks through the empty bank hall and into Brian's \n               office. Brian is at his desk.\n\n<b>                                     BRIAN\n</b>                         You're working late.\n\n<b>                                     SAMMY\n</b>                         How did your wife like the bank?\n\n<b>                                     BRIAN\n</b>                         Oh, fine. She wasn't feeling so great.\n\n<b>                                     SAMMY\n</b>                         That's too bad.\n\n<b>                                     BRIAN\n</b>                         No -- I don't mean -- She's not ill. \n                         She's just... I don't know...\n\n<b>                                     SAMMY\n</b>                         Pregnant?\n\n<b>                                     BRIAN\n</b>                         That's it. She's pregnant.\n\n<b>                                     SAMMY\n</b>                         It can make you kind of cranky.\n\n<b>                                     BRIAN\n</b>                         Yeah...\n\n               Pause.\n\n<b>                                     BRIAN\n</b>                         Listen, I'm sorry we've been stepping \n                         on each other's toes -- I -- I'm not \n                         actually that bad a guy --\n\n<b>                                     SAMMY\n</b>                         Yeah, I am too... I know you're not, \n                         Brian, but you're driving everybody \n                         crazy.\n\n<b>                                     BRIAN\n</b>                         Well, I -- I'm just trying to do my \n                         best here -- And I'm gettin' it from \n                         all sides.\n\n<b>                                     SAMMY\n</b>                         I know you are...\n\n<b>                                     BRIAN\n</b>                         Anyway... We'll work it out...\n\n<b>                                     SAMMY\n</b>                         Well... I could use a beer.\n\n<b>                                     BRIAN\n</b>                         I could use a tranquilizer.\n\n<b>               INT. PUB. NIGHT\n</b>\n               Brian and Sammy sit at a table in the corner of the dimly \n               lit pub. It's a medium noisy place with various locals \n               drinking beers and eating hamburgers and chicken dinners.\n\n<b>                                     SAMMY\n</b>                         Last I heard, Rudy's Dad was living \n                         over in Auburn. But that was last \n                         year.\n\n<b>                                     BRIAN\n</b>                         Must be so tough raising a kid on \n                         your own... Although I'm beginning \n                         to get the idea my wife wouldn't \n                         mind a crack at it.\n\n<b>                                     SAMMY\n</b>                         Oh... It's just the hormones.\n\n<b>                                     BRIAN\n</b>                         Well, no, it isn't. But never mind.\n\n               The waitress brings them two boilermakers.\n\n               SAMMY and BRIAN Thanks.\n\n               She leaves. Sammy and Brian pick up their shots.\n\n<b>                                     BRIAN\n</b>                         Well, here's to improved employee-\n                         management relations.\n\n<b>                                     SAMMY\n</b>                         Amen.\n\n               They click shot glasses and drink.\n\n<b>                                     SAMMY\n</b>                         You can't judge all of Scottsville \n                         by the people in that bank, believe \n                         me.\n\n<b>                                     BRIAN\n</b>                         Well -- Let's -- Let's not talk about \n                         the bank.\n\n<b>                                     SAMMY\n</b><b>                         OK.\n</b>\n<b>                                     BRIAN\n</b>                         Let's just forget about the bank for \n                         tonight.\n\n<b>                                     SAMMY\n</b>                         Good idea.\n\n               They sip their drinks, smiling. Sammy looks at him \n               appraisingly.\n\n<b>               INT./EXT. BRIAN'S CAR/WOODED ROAD. NIGHT\n</b>\n               Sammy and Brian are making out in the front seat of his car. \n               This goes on for a while, getting heavier and heavier.\n\n<b>                                     BRIAN\n</b>                         Sammy?\n\n<b>                                     SAMMY\n</b>                         Yeah?\n\n<b>                                     BRIAN\n</b>                         I want you to tell me who changed \n                         the colors on my computer screen.\n\n<b>                                     SAMMY\n</b>                         I'll never tell.\n\n               They start kissing again in the cramped space. Brian bangs \n               his head. They laugh.\n\n<b>               EXT. OUTSIDE THE CAR. CONTINUOUS\n</b>\n               We pull back and away from the car. The sodden trees spout \n               faucets of water down on the car.\n\n<b>               INT. KITCHEN. NIGHT\n</b>\n               The kitchen is dark. Sammy comes in, her hair a little wet, \n               and turns on the light. She goes to the telephone.\n\n               There's a NOTE in Terry's handwriting:\n\n<b>               \"BOB CALLED.\"\n</b>\n<b>                                     TERRY (O.C.)\n</b>                         Where were you?\n\n               Sammy jumps, startled. Terry is in the kitchen doorway.\n\n<b>                                     SAMMY\n</b>                         Nowhere. I had dinner with my boss.\n\n<b>                                     TERRY\n</b>                         Kind of a late dinner, ain't it?\n\n<b>                                     SAMMY\n</b>                         Yeah. How was Rudy?\n\n<b>                                     TERRY\n</b>                         Fine.\n\n<b>                                     SAMMY\n</b>                         Did the plumber come?\n\n<b>                                     TERRY\n</b>                         Yes, the fucking plumber came.\n\n<b>                                     SAMMY\n</b>                         Terry -- Give me a break!!!\n\n               Pause.\n\n<b>                                     TERRY\n</b>                         What's the matter with you?\n\n<b>                                     SAMMY\n</b>                         Nothing. I'm just tired.\n\n<b>                                     TERRY\n</b>                         You want to smoke some pot?\n\n<b>                                     SAMMY\n</b>                         No I don't. Why, you got some?\n\n<b>               EXT. PORCH. NIGHT\n</b>\n               Sammy and Terry stand side by side on the porch, passing a \n               joint back and forth. It has stopped raining but the trees \n               and roof are still dripping. The crickets are chirping loudly.\n\n<b>                                     SAMMY\n</b>                         So... Bob asked me to marry him.\n\n<b>                                     TERRY\n</b>                         Wow.\n                              (Pause)\n                         Are you going to?\n\n<b>                                     SAMMY\n</b>                         I don't know. If he'd've asked me \n                         this time last year I would have \n                         probably said yes. But the minute he \n                         said it, I don't know, I felt like \n                         somebody was trying to strangle me.\n\n<b>                                     TERRY\n</b>                         Well... bad sign.\n\n<b>                                     SAMMY\n</b>                         I know.\n                              (Pause)\n                         Plus, Terry...\n                              (Whispers)\n                         I fucked my boss...!\n\n<b>                                     TERRY\n</b>                         What?\n\n<b>                                     SAMMY\n</b>                         I know! And his wife is six months \n                         pregnant.\n\n<b>                                     TERRY\n</b>                         Jesus Christ, Sammy...!\n\n<b>                                     SAMMY\n</b>                         I know, I know.\n\n               He passes her the joint. She declines. He puffs away. The \n               water drips off the porch and the crickets chirp. She puts \n               her head on his shoulder. He puts one arm around her and \n               puffs away with the joint in his free hand.\n\n<b>                                     SAMMY\n</b>                         Terry, I'm sorry I got so mad before. \n                         I just don't want him, you know -- \n                         terrified of \"telling,\" if there's --\n\n<b>                                     TERRY\n</b>                         Uh, well, that's not really his \n                         problem, Sammy.\n\n               Sammy straightens up.\n\n<b>                                     SAMMY\n</b>                         Oh really? What's his problem?\n\n<b>                                     TERRY\n</b>                         His problem is that he's like totally \n                         sheltered because you treat him like \n                         he's three, instead of eight, so \n                         that's how he behaves.\n\n<b>                                     SAMMY\n</b>                         Oh yeah? And how do you think he \n                         should behave?\n\n<b>                                     TERRY\n</b>                         I think he shouldn't have to run and \n                         tell his Mommy every time he does \n                         something she might not like, for \n                         one thing.\n\n<b>                                     SAMMY\n</b>                         Uh huh. And what do you --\n\n<b>                                     TERRY\n</b>                              (On \"and\")\n                         I mean I took him to play pool! It \n                         was a little clandestine thing we \n                         did for fun! It wasn't like a big \n                         secret, I mean who cares? I was \n                         actually trying to be nice to him. \n                         But he's so freaked out that he \n                         disobeyed your orders that he has to \n                         fuckin' squeal on me and I have to \n                         listen to your fuckin' shit all day \n                         when I didn't even fuckin' do \n                         anything!\n\n<b>                                     SAMMY\n</b>                         First of all, he didn't tell me \n                         anything: Darryl did. OK? Second of \n                         all, I don't really give a shit if \n                         you took him to play pool: I was mad \n                         at you because you left him standing \n                         at the bus stop in the rain. But no, \n                         I don't want you telling him not to \n                         squeal, because I don't want him put \n                         in that position!\n\n<b>                                     TERRY\n</b>                              (Losing ground)\n                         Well... that... is a perfect example \n                         of what I'm talking about.\n\n<b>                                     SAMMY\n</b>                         You are in idiot.\n\n               They stand apart now. Silence.\n\n<b>                                     TERRY\n</b>                         Darryl told you?\n\n<b>                                     SAMMY\n</b>                         Yes!\n\n               They stand there. The rain gutters drip.\n\n<b>               INT. BANK. MORNING\n</b>\n               Sammy, coat on, arrives at her desk and puts her purse down. \n               There's a NOTE on her CHAIR.\n\n<b>               \"SAMMY -- PLEASE SEE ME.\"\n</b>\n<b>               INT. BANK -- HALLWAY. A MOMENT LATER\n</b>\n               TRACKING SAMMY, coat off, carrying a stack of folders, as \n               she walks from her desk, around the corner, down the hall, \n               past a couple of employees and to BRIAN'S OPEN DOOR. She \n               taps on it. Brian is at his desk.\n\n<b>                                     SAMMY\n</b>                         Morning.\n\n<b>                                     BRIAN\n</b>                         Yeah, good morning. Could you get \n                         the door?\n\n               OUTSIDE THE OFFICE: Sammy shuts the door. MABEL and DORIS, \n               standing near the door, look at each other: i.e., Sammy's in \n               trouble again.\n\n               INSIDE THE OFFICE: Sammy stands by the closed door. Brian \n               comes out around his desk.\n\n<b>                                     SAMMY\n</b>                         Listen -- I just --\n\n               Brian kisses her. She drops her folders and they make out \n               against the door.\n\n               OUTSIDE THE OFFICE: The employees click away at their PCs. \n               Mabel exchanges a quiet word with Chuck.\n\n               INSIDE THE OFFICE: Brian has Sammy pressed against the wall \n               with her skirt hiked up and is trying to get both of their \n               underwear out of the way. It's not so easy in their office \n               clothes. Sammy tears away.\n\n<b>                                     SAMMY\n</b>                         Brian, that's enough.\n\n               BRIAN falls back, breathless.\n\n<b>                                     BRIAN\n</b>                         OK. Sorry.\n\n               He lunges at her again. They kiss some more.\n\n               OUTSIDE THE OFFICE. A MOMENT LATER: Sammy comes out of the \n               office, more or less composed, carrying her folders. She \n               heads down the hall past the other employees, including Mabel, \n               and surreptitiously readjusts her scrunched-up underwear.\n\n<b>               INT. DAWSON'S. DAY\n</b>\n               Sammy and Bob sit at lunch. Sammy is picking at her food.\n\n<b>                                     BOB\n</b>                         You're awfully quiet.\n\n<b>                                     SAMMY\n</b>                         I'm sorry.\n\n<b>                                     BOB\n</b>                         Um... Have you thought at all about \n                         what I said?\n\n<b>                                     SAMMY\n</b>                         Of course I've been thinking about \n                         it.\n\n<b>                                     BOB\n</b>                         So... Any decisions? Or -- do you \n                         still want to think about it some \n                         more...?\n\n<b>                                     SAMMY\n</b>                         Well -- I mean -- I don't know, Bob. \n                         I mean, we haven't exactly been going \n                         steady the last few months, if you \n                         know what I mean --\n\n<b>                                     BOB\n</b>                         Yeah, no, I know --\n\n<b>                                     SAMMY\n</b>                         -- and then we see each other twice \n                         and you suddenly say you want to get \n                         married? I mean...\n\n<b>                                     BOB\n</b>                         No, you're right, you're right --\n\n<b>                                     SAMMY\n</b>                         What are you talking about?\n\n               Pause.\n\n<b>                                     BOB\n</b>                         I don't know... I... Maybe this is... \n                         Last year I sort of thought you were \n                         possibly interested in that... idea... \n                         but I was the one who, you know, \n                         wasn't \"ready\" at that point -- So \n                         that's why I thought things kind of \n                         slowed down with us...\n\n<b>                                     SAMMY\n</b>                         Don't make me feel bad for you.\n\n<b>                                     BOB\n</b>                              (Bristling)\n                         I don't want you to feel bad for me.\n\n<b>               INT. LIVING ROOM. NIGHT\n</b>\n               Sammy, Terry and Rudy are all watching TV. Sammy and Rudy \n               are in pajamas. Nobody's happy and nobody's talking.\n\n               The PHONE RINGS. Sammy goes to it and picks up, surprised \n               because of the hour.\n\n<b>                                     SAMMY\n</b>                              (Into phone)\n                         Hello?\n\n<b>                                     BRIAN\n</b>                              (On phone)\n                         It's Brian.\n\n               Sammy turns away and lowers her voice so Terry and Rudy won't \n               overhear her.\n\n<b>                                     SAMMY\n</b>                         Brian. Where are you?\n\n<b>               EXT. GAS STATION. SIMULTANEOUS\n</b>\n               Brian is on the pay phone outside a gas station.\n\n<b>                                     BRIAN\n</b>                         I'm buying milk. I just thought I'd \n                         say hello.\n\n               WE CUT BETWEEN THEM. Sammy doesn't say anything.\n\n<b>                                     BRIAN\n</b>                         Look, I know it's probably too late, \n                         but is there any way you can come \n                         out for a little while?\n\n<b>                                     SAMMY\n</b>                         Brian, I think you're going crazy.\n\n<b>                                     BRIAN\n</b>                         I know I am. Can you meet me?\n\n<b>                                     SAMMY\n</b>                         Um, OK.\n\n<b>               INT. LIVING ROOM. NIGHT\n</b>\n               SAMMY comes down the stairs, fully dressed, into the living \n               room, where Terry and Rudy are still watching TV.\n\n<b>                                     SAMMY\n</b>                         Um -- I have to go out for a minute. \n                         Do you want anything?\n\n<b>                                     TERRY\n</b>                         Like what?\n\n<b>                                     SAMMY\n</b>                         I don't know.\n\n<b>                                     RUDY\n</b>                         Where are you going?\n\n<b>                                     TERRY\n</b>                         Yeah, where are you going?\n\n<b>                                     SAMMY\n</b>                         I just have to go out for a little \n                         while.\n\n<b>                                     RUDY\n</b>                         Where?\n\n<b>                                     TERRY\n</b>                         Yeah, where?\n\n<b>                                     SAMMY\n</b>                         I just have to go to Mabel's house.\n\n<b>                                     RUDY\n</b>                         Why?\n\n<b>                                     SAMMY\n</b>                         You know what, Rudy? It's personal. \n                         This is a personal matter that has \n                         to do with Mabel. I just have to go \n                         see her for a little while.\n\n               Terry gives Sammy a look like, \"You've got to be kidding.\" \n               Sammy tries to shush him with a conspiratorial look back. \n               She goes out.\n\n               LATER. Terry and Rudy sit in front of the TV, alone.\n\n<b>                                     TERRY\n</b>                         Listen. Listen. I'm sorry I said you \n                         squealed on me. I was totally out of \n                         line, and I really owe you an apology.\n                              (Pause)\n                         Did you hear what I said?\n\n<b>                                     RUDY\n</b>                              (Staring at the TV)\n                         I don't care.\n\n<b>               INT. SAMMY'S CAR (MOVING). NIGHT\n</b>\n               Sammy drives, listening to music. She shakes her head at \n               herself.\n\n<b>               EXT. MOTEL. NIGHT\n</b>\n               Sammy's car and Brian's car are parked side by side outside \n               a roadside motel.\n\n<b>               INT. MOTEL ROOM. NIGHT\n</b>\n               In the motel room, Sammy and Brian, half-clothed, make love \n               rather hurriedly on top of the unmade creaky bed.\n\n<b>               EXT. MOTEL. NIGHT\n</b>\n               Outside the motel, Sammy and Brian get into their respective \n               cars and start their motors.\n\n<b>               INT. SAMMY'S CAR (MOVING). NIGHT\n</b>\n               Sammy drives in the other direction. She breaks into a smile, \n               and then she laughs. Then she stops.\n\n<b>               INT. SAMMY'S BEDROOM. NIGHT\n</b>\n               Sammy lies awake plagued by guilty feelings.\n\n<b>               EXT. CHURCH -- RECTORY. DAY\n</b>\n               Sammy heads toward the little white church building.\n\n<b>               INT. CHURCH -- RECTORY -- OFFICE. DAY\n</b>\n               RON the MINISTER and Sammy drink coffee in silence.\n\n<b>                                     RON\n</b>                              (Gently)\n                         What's on your mind, Sammy?\n\n<b>                                     SAMMY\n</b>                         Well, a lot. But principally... I \n                         was just wondering if you had an \n                         opinion. If you know someone, in \n                         your family, or just someone you \n                         really care about, and they just \n                         can't seem to get ahold of \n                         themselves...\n\n<b>               EXT. MAIN STREET. DAY\n</b>\n               The SUN SHINES on Main Street.\n\n<b>               INT. SPORTING GOODS STORE. DAY\n</b>\n               Rudy watches wide-eyed as Terry places on the sales counter \n               two rods and reels, a bunch of lures, two fishing hats, a \n               box of swivels, a knife and a fish scaler.\n\n<b>                                     TERRY\n</b>                         You know who this is for?\n\n<b>                                     RUDY\n</b>                         Me!\n\n<b>                                     TERRY\n</b>                         That's right, my little friend.\n                              (To the saleslady)\n                         Hello. We're going fishing.\n\n<b>               INT. SAMMY'S HOUSE -- KITCHEN. DAY\n</b>\n               Sammy, Terry and Rudy are all putting away the groceries. \n               Everybody seems to be getting along.\n\n<b>                                     RUDY\n</b>                         I got a new rod and reel, five lures, \n                         I got a hat, I got a knife and I got \n                         a fish scaler.\n\n<b>                                     SAMMY\n</b>                         That's great, honey.\n\n               O.C., the DOORBELL RINGS. Sammy starts to move toward the \n               door, but Terry is closer.\n\n<b>                                     TERRY\n</b>                         I'll get it.\n\n               Sammy watches him go.\n\n<b>               INT./EXT. FRONT DOOR. DAY\n</b>\n               Terry opens the door. It's Ron, the minister, in his civvies.\n\n<b>               EXT. FRONT YARD. DAY\n</b>\n               Rudy is playing basketball by himself.\n\n<b>               INT. SAMMY'S HOUSE -- LIVING ROOM. DAY\n</b>\n               Terry, Sammy and RON sit in the living room. Sammy and Ron \n               are drinking coffee. Through the window we see occasional \n               glimpses of Rudy playing basketball in the backyard. There \n               is a heavy silence in the room.\n\n<b>                                     TERRY\n</b>                         Well... I'm not really sure why you're \n                         here, Ron. I mean, I realize I haven't \n                         exactly been a model citizen since I \n                         got here, but compared to how things \n                         have been goin' for me lately, I \n                         thought I was doing pretty well.\n\n               He turns to Sammy.\n\n<b>                                     TERRY\n</b>                         And I also find it kind of \n                         discouraging that you seem to think \n                         I need some kind of spiritual \n                         counseling or what have you, so much \n                         so that you're willing to disregard \n                         the fact that I don't believe in any \n                         of this stuff at all --\n\n<b>                                     SAMMY\n</b>                         Well... I didn't mean to discourage \n                         you --\n\n<b>                                     TERRY\n</b>                         I mean it's really kind of insulting.\n\n<b>                                     RON\n</b>                         Can I say something here?\n                              (Pause)\n                         Sammy asked me to come and talk to \n                         you, because it's her opinion that \n                         you're not gonna find what you're \n                         looking for the way you're looking \n                         for it --\n\n<b>                                     TERRY\n</b>                         How would she know?\n\n<b>                                     RON\n</b>                         But I'm really not here to try to \n                         get you to do anything, or to believe \n                         anything. And I'll tell you the same \n                         thing I told her, which is that as \n                         far as I'm concerned the only way \n                         she can help you is by her example -- \n                         by trying to be a model for you, by \n                         the way she lives her life...\n\n               Terry smiles.\n\n<b>                                     RON\n</b>                         And that doesn't mean she's supposed \n                         to be a saint, either, if that's \n                         what you're smiling about.\n\n<b>                                     TERRY\n</b>                         I didn't realize I was smiling.\n\n               A moment.\n\n<b>                                     RON\n</b>                         You know, Terry, a lot of people \n                         come to see me with all kinds of \n                         problems. Drugs, alcohol, marital \n                         problems, sexual problems, health \n                         problems --\n\n<b>                                     TERRY\n</b>                         Great job you got.\n\n<b>                                     RON\n</b>                         Well... I like it. Because even in \n                         this little town, I feel like what I \n                         do is very connected with the real \n                         center of people's lives. I'm not \n                         saying I'm always Mr. Effective, but \n                         I don't feel like my life is off to \n                         the side of what's important. You \n                         know? I don't feel my happiness and \n                         comfort are based on closing my eyes \n                         to trouble within myself or trouble \n                         in other people. I don't feel like a \n                         negligible little scrap, floating \n                         around in some kind of empty void, \n                         with no sense of connectedness to \n                         anything around me except by virtue \n                         of whatever little philosophies I \n                         can scrape together on my own...\n\n<b>                                     TERRY\n</b>                         Well --\n\n<b>                                     RON\n</b>                         Can I ask you, Terry: Do you think \n                         your life is important?\n\n<b>                                     TERRY\n</b>                         You mean -- Like, me personally, my \n                         individual life?\n\n<b>                                     RON\n</b>                         Yeah.\n\n<b>                                     TERRY\n</b>                         Well... I'm not sure -- What do you \n                         mean? It's important to me. I guess. \n                         And like, to my, you know, the people \n                         who care about me...\n\n<b>                                     RON\n</b>                         But do you think it's important?\n\n<b>                                     TERRY\n</b><b>                         I --\n</b>\n<b>                                     RON\n</b>                         Do you think it's important in the \n                         scheme of things? Not just because \n                         it's yours, or because you're \n                         somebody's brother. Because I don't \n                         really get the impression that you \n                         do.\n\n<b>                                     TERRY\n</b>                         Well, I don't think... I don't \n                         particularly think anybody's life \n                         has any particular importance besides \n                         whatever -- you know -- whatever we \n                         arbitrarily give it. Which is fine. \n                         I mean we might as well... I think \n                         I'm as important as anybody else...\n\n               Silence.\n\n<b>                                     TERRY\n</b>                         I don't know: A lot of what you're \n                         saying has a real appeal to me, Ron. \n                         A lot of the stuff they told us when \n                         we were kids... But I don't want to \n                         believe something or not believe it \n                         because I might feel bad. I want to \n                         believe it because I think it's true \n                         or not... I'd like to think that my \n                         life is important... Or that it's \n                         connected to something important...\n\n<b>                                     RON\n</b>                         Well, isn't there any way for you to \n                         believe that without calling it God, \n                         or religion, or whatever term it is \n                         you object to?\n\n<b>                                     TERRY\n</b>                         Yes. I believe that.\n\n<b>               INT. DINING ROOM. NIGHT\n</b>\n               Sammy, Terry and Rudy are all eating dinner. Terry is drinking \n               a beer. His mood is dark.\n\n<b>                                     TERRY\n</b>                         So Sammy, what example will you be \n                         setting for us tonight?\n\n               Sammy doesn't answer.\n\n<b>               INT. LIVING ROOM. NIGHT\n</b>\n               Terry, Sammy and Rudy are watching TV. Terry has another \n               beer.\n\n<b>                                     RUDY\n</b>                         What time are we getting up to go \n                         fishing?\n\n<b>                                     TERRY\n</b>                         We're not going fishing.\n\n<b>                                     SAMMY\n</b>                         What do you mean?\n\n<b>                                     RUDY\n</b>                         Why not?\n\n<b>                                     TERRY\n</b>                         I think you should go fishing with \n                         Father Ron.\n\n<b>                                     RUDY\n</b>                         I don't want to go fishing with Father \n                         Ron.\n\n<b>                                     TERRY\n</b>                         Well, I'm not takin' you.\n\n               Sammy starts to say something to Terry, stops herself.\n\n<b>                                     SAMMY\n</b>                         I'll take you, sweetie.\n\n               Rudy doesn't answer.\n\n<b>               INT. HALLWAY. NIGHT\n</b>\n               Sammy and Terry are in the hallway. Sammy holds a stack of \n               folded sheets.\n\n<b>                                     SAMMY\n</b>                         I realize that you're mad at me --\n\n<b>                                     TERRY\n</b>                              (Deadpan)\n                         I'm not mad at you...\n\n<b>                                     SAMMY\n</b>                         -- but he didn't do anything to you. \n                         And you cannot promise a little boy \n                         that you're gonna --\n\n<b>                                     TERRY\n</b>                              (On \"boy\")\n                         ...I just, you know, after all that \n                         religious conversation, I just \n                         realized it's probably not so good \n                         for him to be spending so much time \n                         with someone like me who doesn't \n                         believe his life is important in the \n                         scheme of things --\n\n<b>                                     SAMMY\n</b>                         Would you please...\n\n<b>                                     TERRY\n</b>                         I'm serious.\n\n<b>                                     SAMMY\n</b>                              (Practically choking)\n                         Listen.\n                              (Pause)\n                         I am sure, if you put your mind to \n                         it, you can think of some other way \n                         of getting back at me besides this. \n                         So would you please just give it \n                         some thought, and take him fishing \n                         tomorrow?\n\n<b>                                     TERRY\n</b>                         I would, Sammy, I just don't think \n                         it'd be good for him.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         You suck.\n\n               She throws the sheets at him and storms away. Terry walks \n               through the living room and OUT the front door, SLAMMING it \n               behind him.\n\n<b>               INT. SAMMY'S ROOM. NIGHT\n</b>\n               Sammy sits by the phone in her bathrobe. She picks it up and \n<b>               DIALS.\n</b>\n               INTERCUT: BRIAN'S LIVING ROOM. NANCY, watching TV on the \n               sofa with Brian, picks up the RINGING PHONE.\n\n<b>                                     NANCY\n</b>                              (Into the phone)\n                         Hello?\n\n               SAMMY HANGS UP. She gets up, walks around, sits down again. \n               Picks up the phone and DIALS. It RINGS.\n\n               INTERCUT: BOB'S KITCHENETTE. Bob, making a sandwich for \n               himself, picks up the phone.\n\n<b>                                     BOB\n</b>                              (Into the phone)\n                         Hello?\n\n               SAMMY HANGS UP. Pause. She sweeps the TELEPHONE and ANSWERING \n               MACHINE OFF the nightstand. Pause. She calms down and puts \n               them back. The ancient answering machine is CLICKING \n               convulsively. She WHACKS IT and it stops.\n\n<b>               EXT. CHURCH. DAY\n</b>\n               The congregation is coming out of the church and milling \n               around at the steps. SAMMY, with Rudy at her side, is saying \n               good-bye to some neighbors. She watches pregnant NANCY and \n               BRIAN go down the steps.\n\n               POV SAMMY: Beyond Brian and Nancy, TERRY pulls up at the \n               curb in her car. He rummages around and produces FISHING \n               RODS which he waves, somewhat sheepishly.\n\n               REVERSE: At top speed, Rudy runs away from Sammy and the \n               church, toward Terry and the car. Terry and Sammy exchange a \n               look from the distance.\n\n<b>               EXT. RECTORY. DAY\n</b>\n               Services are over. Everyone has gone home.\n\n<b>               INT. RON'S OFFICE. LATER\n</b>\n               Sammy sits with Ron.\n\n<b>                                     SAMMY\n</b>                         Anyway... I don't know what the \n                         church's position is on adultery and \n                         fornication these days, but I felt \n                         really hypocritical not saying \n                         anything to you about it before, \n                         so... What is the official position \n                         on that stuff these days?\n\n<b>                                     RON\n</b>                         Well... it's a sin.\n\n<b>                                     SAMMY\n</b>                         Good: I think it should be.\n\n<b>                                     RON\n</b>                         ...but we don't tend to focus on \n                         that aspect of it, right off the bat --\n\n<b>                                     SAMMY\n</b>                         Why not?\n\n<b>                                     RON\n</b>                         Well --\n\n<b>                                     SAMMY\n</b>                         I think you should.\n\n<b>                                     RON\n</b>                         Well --\n\n<b>                                     SAMMY\n</b>                         Maybe it was better when you came in \n                         and they screamed at you for having \n                         sex with your married boss, and were \n                         really mean to you, and told you \n                         what a terrible thing it was. Maybe \n                         it'd be better if you told me how \n                         I'm endangering my immortal soul, \n                         and if I don't quit I'm going to \n                         burn in hell. Don't you ever think \n                         that?\n\n<b>                                     RON\n</b>                         Um... No.\n\n<b>                                     SAMMY\n</b>                         Well, it's a lot better than all \n                         this \"Why do you think you're in \n                         this situation\" psychological bullshit \n                         you hear all the time.\n\n<b>                                     RON\n</b>                         Well... Why do you think you're in \n                         this situation?\n\n<b>                                     SAMMY\n</b>                         With which one?\n\n<b>                                     RON\n</b>                         All of them.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         I feel sorry for them.\n                              (Pause)\n                         Isn't that ridiculous?\n\n               Ron shrugs: i.e., \"not necessarily.\"\n\n<b>               EXT. STREAM -- BRIDGE. DAY\n</b>\n               Terry and Rudy are side by side on a small footbridge over a \n               wide running stream, fishing. The sunlight slants through \n               the canopy of trees; the birds are chattering; it's gorgeous \n               and peaceful.\n\n<b>                                     RUDY\n</b>                         I've never been so bored in my life.\n\n<b>                                     TERRY\n</b>                         Yeah... We really shoulda been out \n                         here around seven or eight A.M.\n\n<b>                                     RUDY\n</b>                         What time is it now?\n\n<b>                                     TERRY\n</b>                         Two-thirty.\n\n               Silence. The birds sing.\n\n<b>                                     RUDY\n</b>                         Was my father a good fisherman?\n\n<b>                                     TERRY\n</b>                         Yeah, your father was good at all \n                         that stuff. He knew everything about \n                         the woods, everything about fishing, \n                         everything about hunting and \n                         everything about cars. If he wasn't \n                         such a pain in the ass he would've \n                         been a lot of fun to be around.\n\n<b>                                     RUDY\n</b>                         Maybe he's nicer now.\n\n<b>                                     TERRY\n</b>                         I doubt it.\n\n<b>                                     RUDY\n</b>                         Well, I think he is.\n\n<b>                                     TERRY\n</b>                         How would you know? Did you ever \n                         meet him?\n\n<b>                                     RUDY\n</b>                         No.\n\n<b>                                     TERRY\n</b>                         Were you ever curious to meet him?\n\n<b>                                     RUDY\n</b>                         I guess so.\n\n<b>                                     TERRY\n</b>                         Well, he doesn't live very far from \n                         here.\n\n<b>                                     RUDY\n</b>                         I thought he lived in Alaska.\n\n<b>                                     TERRY\n</b>                         No -- I lived in Alaska. Your dad \n                         lives in Auburn. Far as I know.\n                              (Pause)\n                         We could look him up in the phone \n                         book. Wanna try?\n\n<b>                                     RUDY\n</b>                         All right.\n\n<b>                                     TERRY\n</b>                         OK -- But -- I'm sure I don't have \n                         to say this, but I'm not kidding, \n                         man: Don't -- tell -- your -- mother.\n\n<b>               INT. BOB'S APARTMENT. DAY\n</b>\n               BOB is standing by his kitchenette, extremely nervous. Sammy \n               sits on his sofa.\n\n<b>                                     BOB\n</b>                         Do you want to go for a walk, or a \n                         drive? It's really nice out.\n\n<b>                                     SAMMY\n</b>                         No. I'm not gonna stay long. Bob, I \n                         don't want to get married.\n\n               Pause.\n\n<b>                                     BOB\n</b><b>                         OK.\n</b>\n<b>                                     SAMMY\n</b>                         I've really thought about it a lot, \n                         and if you had asked me last year \n                         I'm sure I would have said yes.\n\n<b>                                     BOB\n</b>                         Oh. Thank you.\n\n<b>                                     SAMMY\n</b>                         But I'm not sure it would have been \n                         a good idea then either. I'm going \n                         through a really hard time right now \n                         and I just think that getting engaged \n                         to you or anyone would be just about \n                         the stupidest most self-destructive \n                         thing I could possibly do.\n\n<b>                                     BOB\n</b><b>                         OK.\n</b>\n<b>                                     SAMMY\n</b>                         And I really think you have to grow \n                         up.\n\n<b>                                     BOB\n</b>                         Well, how about we fix up my \n                         personality some other time?\n\n<b>                                     SAMMY\n</b><b>                         OK.\n</b>                              (Pause)\n                         I really hope we can still be friends.\n\n<b>                                     BOB\n</b>                              (Quietly sarcastic)\n                         Oh, yes, me too.\n\n               She looks at him miserably.\n\n<b>                                     SAMMY\n</b>                         Bob... This is so crazy... I mean... \n                         I don't even understand why you... I \n                         don't even get it.\n\n<b>                                     BOB\n</b>                         What do you want me to say? Everything \n                         you said about me was true, Sammy. I \n                         was just a big chickenshit jerk, and \n                         now I'm payin' the price.\n\n<b>                                     SAMMY\n</b>                         Bob...!\n\n               She goes over to him. He gets up.\n\n<b>                                     BOB\n</b>                         What?\n\n<b>                                     SAMMY\n</b>                         Well -- I don't know...\n\n<b>                                     BOB\n</b>                         I don't know. Sammy, I love you. I \n                         wish I could say it in a more \n                         interesting way. I just -- I love \n                         you.\n\n<b>                                     SAMMY\n</b>                         Well -- I mean -- I love you too --\n\n               He puts his arms around her and kisses her. She responds \n               very warmly. Just as things are heating up, she suddenly \n               remembers something and jolts away.\n\n<b>                                     SAMMY\n</b>                         Oh shit.\n\n<b>                                     BOB\n</b>                         What's the matter?\n\n<b>                                     SAMMY\n</b>                         I gotta go. I'm sorry --\n\n<b>                                     BOB\n</b>                         Where do you have to go?\n\n<b>                                     SAMMY\n</b>                              (Off the top of her \n                              head)\n                         I'm supposed to -- I gotta get Mabel \n                         back her car.\n\n<b>                                     BOB\n</b>                         Well... I don't understand. How are \n                         we leaving things?\n\n<b>                                     SAMMY\n</b>                         Oh God, I don't know. Call me later.\n\n<b>               INT. MOTEL. DAY\n</b>\n               Brian sits on the edge of one of the beds watching some \n               daytime Sunday show on the motel TV. There is a knock at the \n               door. He gets up, turns off the TV and opens the door. It's \n               Sammy.\n\n<b>                                     SAMMY\n</b>                         Sorry I'm so late.\n\n<b>                                     BRIAN\n</b>                         Yeah, I was just about to give up on \n                         you.\n\n<b>                                     SAMMY\n</b>                         Well -- maybe it would've been better \n                         if you had...\n\n               She comes into the room and starts walking around briskly \n               and nervously.\n\n<b>                                     SAMMY\n</b>                         I mean -- Look, I don't mean to be \n                         unsympathetic about your domestic \n                         situation, whatever it is, but I'm \n                         just beginning to think that if people \n                         tried a little harder to stick to \n                         their commitments and started taking \n                         a little responsibility for their \n                         actions, they might end up having a \n                         lot less trouble generally. That's \n                         all.\n\n<b>                                     BRIAN\n</b>                         Hey, that's what I've been trying to \n                         tell you guys at the bank.\n\n<b>                                     SAMMY\n</b>                         Well, I really don't think I can do \n                         this anymore.\n\n<b>                                     BRIAN\n</b><b>                         OK.\n</b>\n<b>               INT. MOTEL ROOM. LATER\n</b>\n               Brian and Sammy lie under the starchy sheets. Brian's eyes \n               are shut. Sammy is very upset with herself.\n\n<b>                                     SAMMY\n</b>                         This is incredible.\n\n<b>                                     BRIAN\n</b>                         Mmmm.\n\n<b>                                     SAMMY\n</b>                         That is not what I mean.\n\n<b>               INT. SAMMY'S CAR (MOVING). DAY\n</b>\n               Terry and Rudy drive along. Terry looks down at Rudy and \n               smiles. Rudy is tense and won't look at him.\n\n               OVER TERRY AND RUDY'S SHOULDERS as Terry drives slowly past \n               dilapidated little houses in a very depressed residential \n               area. Terry is scanning the house numbers.\n\n<b>                                     RUDY\n</b>                         Maybe we should call first.\n\n<b>                                     TERRY\n</b>                         Well -- We're right here.\n\n               He pulls up outside a small, plain, run-down ranch-style \n               house with a lot of junk out front, and gets out of the car. \n               Rudy stays in.\n\n<b>                                     TERRY\n</b>                         Come on.\n\n               Rudy gets out of the car and comes around. Terry waits for \n               him, and then they walk up to the front door. The buzzer \n               says \"KOLINSKI.\"\n\n<b>                                     TERRY\n</b>                         There he is.\n\n<b>                                     RUDY\n</b>                         His last name is Kolinski?\n\n<b>                                     TERRY\n</b>                         Yeah. Ring the bell.\n\n               Rudy pushes the doorbell. They wait. There's some noise inside \n               and some voices. The sound of WALKING.\n\n               THE DOOR OPENS. JANIE, a tired-looking young woman around \n               Terry's age, opens the door.\n\n<b>                                     JANIE\n</b>                         Yes?\n\n<b>                                     TERRY\n</b>                         Hi. We're looking for Rudy?\n\n<b>                                     JANIE\n</b>                         Who should I say is calling?\n\n<b>                                     TERRY\n</b>                         An old friend.\n\n<b>                                     RUDY SR. (O.C.)\n</b>                         Who is it?\n\n<b>                                     JANIE\n</b>                         He says an old friend!\n\n<b>                                     RUDY SR. (O.C.)\n</b>                         How old is he?\n\n               RUDY SR. appears behind Janie. He's around thirty, wiry, \n               dressed in jeans and an old shirt. He doesn't look good. He \n               recognizes Terry.\n\n<b>                                     RUDY SR.\n</b>                         Hey!\n\n<b>                                     TERRY\n</b>                         Hey, Rudy.\n\n               Rudy Sr. sees Rudy, who is looking up at him. His face falls.\n\n<b>                                     RUDY SR.\n</b>                         Hey.\n\n               Rudy doesn't answer.\n\n<b>                                     TERRY\n</b>                              (To JANIE)\n                         Hi, I'm Terry.\n\n<b>                                     JANIE\n</b>                         Hello.\n\n<b>                                     TERRY\n</b>                         And this is Rudy.\n\n<b>                                     JANIE\n</b>                         You don't say.\n\n<b>                                     TERRY\n</b>                         Rudy, meet Rudy.\n\n               Rudy Sr. looks away, shaking his head. JANIE moves away from \n               the door.\n\n<b>                                     JANIE\n</b>                         I'll just be in the kitchen.\n\n<b>                                     TERRY\n</b>                         Nice to meet you.\n\n               Janie goes into the kitchen. Rudy Sr. watches her go.\n\n<b>                                     TERRY\n</b>                         OK if we come in for a minute?\n\n<b>                                     RUDY SR.\n</b>                         What the hell are you doin'?\n\n<b>                                     TERRY\n</b>                         What do you mean what am I doin' --\n\n               Rudy Sr. starts walking toward Terry to make him go back out \n               the door.\n\n<b>                                     RUDY SR.\n</b>                         Could you step away from the door \n                         please?\n\n<b>                                     TERRY\n</b>                         Well we just wanna --\n\n<b>                                     RUDY SR.\n</b>                         Could you step away from the door \n                         please?\n\n<b>                                     TERRY\n</b>                         All right, all right.\n\n               They all go outside. Rudy Sr. pulls the door closed behind \n               him.\n\n<b>                                     RUDY SR.\n</b>                         What are you doin' here?\n\n<b>                                     TERRY\n</b>                         I just wanted the kid to see you --\n\n<b>                                     RUDY SR.\n</b>                         Well, now he saw me.\n                              (He looks at Rudy)\n                         Now you saw me. OK?\n                              (To Terry)\n                         Now would you mind?\n\n<b>                                     TERRY\n</b>                         Man, you are really --\n\n<b>                                     RUDY SR.\n</b>                         Look: I'm tryin' to be polite. So \n                         would you just take off? It's OK: \n                         Just take off.\n\n<b>                                     TERRY\n</b>                         I just wanna --\n\n<b>                                     RUDY SR.\n</b>                         Do you know what you're doin'? Just \n                         get outta here!\n\n<b>                                     TERRY\n</b>                         You know what, man? You're still a \n                         fuckin' asshole.\n\n<b>                                     RUDY SR.\n</b>                         I'm an asshole? Get outta here!\n\n               Rudy Sr. shoves Terry. Terry belts him, and suddenly they \n               are throwing wild punches at each other. Rudy goes sprawling \n               in the dirt.\n\n               Terry knocks Rudy Sr. down and starts pummeling him brutally. \n               Janie comes out of the house and jumps on his back, trying \n               to pull him off.\n\n<b>                                     JANIE\n</b>                         Get your fuckin' hands off him...!\n\n               Terry throws Janie off him, grabs Rudy Sr. again and resumes \n               beating him up. Janie jumps back on top of him.\n\n               Two neighbors run toward the melee to break it up.\n\n<b>                                                                    CUT TO:\n</b>\n               A FEW MOMENTS LATER: The cops have arrived. The 1ST COP is \n               talking to Rudy and Janie. The 2ND COP is talking to Terry. \n               Rudy Sr.'s face looks puffy and beaten up. A 3RD COP stands \n               apart with Rudy, who is watching the whole thing. WE CUT \n               rapidly and jerkily through this section:\n\n<b>                                     1ST COP\n</b>                         And you're not the boy's legal \n                         guardian?\n\n<b>                                     RUDY SR.\n</b>                         I don't even know if that's my kid!\n\n<b>                                     JANIE\n</b>                         They just showed up! We never seen \n                         them before...\n\n<b>                                     RUDY SR.\n</b>                         I used to know his sister --\n\n<b>                                     TERRY\n</b>                         I just came down here to talk to the \n                         guy and all of a sudden he starts \n                         shovin' me!\n\n<b>                                     2ND COP\n</b>                         Listen up. Listen up. You're gonna \n                         have to step back and just calm down --\n\n<b>                                     TERRY\n</b>                              (To RUDY SR.)\n                         You're a lyin' fuckin' piece of shit.\n\n<b>                                     2ND COP\n</b>                              (To TERRY)\n                         You're gonna have to step back.\n\n<b>                                     JANIE\n</b>                         We have a right to protect ourselves. \n                         What else do you need to know?\n\n               A MOMENT LATER: The 2ND COP puts handcuffs on Terry. Rudy \n               watches.\n\n<b>                                     2ND COP\n</b>                         Now give me your right hand...\n\n<b>                                     TERRY\n</b>                         This is such bullshit. He started \n                         the whole thing and you're arresting \n                         me?\n\n<b>                                     2ND COP\n</b>                         Listen up. Now -- Listen up! Stop \n                         talkin'. Terry, stop talkin'.\n\n<b>                                                                    CUT TO:\n</b>\n               A MOMENT LATER: As the 3RD COP walks Rudy to one cop car, \n               Rudy watches the 2ND COP guide the HANDCUFFED TERRY into the \n               other car.\n\n               Rudy gets in the back of the car and looks out at RUDY SR. \n               and JANIE talking to the 1ST COP. Rudy Sr. is looking at him \n               over the 1st cop's shoulder.\n\n<b>                                     2ND COP\n</b>                         -- idea where we might be able to \n                         contact his mother?\n\n<b>                                     RUDY SR.\n</b>                         No, because he's not my Goddamn kid.\n\n               The cop cars' doors slam first on Terry and then on Rudy.\n\n<b>               INT. MOTEL ROOM. NIGHT\n</b>\n               The room is dark. Sammy and Brian are asleep, half under the \n               covers. SAMMY WAKES with a START.\n\n<b>                                     SAMMY\n</b>                         What time is it?\n\n<b>                                     BRIAN\n</b>                              (Startled awake)\n                         What's the matter?\n\n               Sammy looks at the clock radio. 9:20.\n\n<b>                                     SAMMY\n</b>                         Oh my gosh.\n\n               A FEW MOMENTS LATER: Sammy and Brian are on opposite sides \n               of the bed, getting dressed.\n\n<b>                                     BRIAN\n</b>                         Hey, you know, Nancy's gonna be gone \n                         for the rest of the week...\n\n<b>                                     SAMMY\n</b>                         You know... Brian...\n\n<b>                                     BRIAN\n</b>                         Yeah?\n\n<b>                                     SAMMY\n</b>                         Well, I don't want to... I mean, \n                         couldn't we just... I mean, could we \n                         give it a rest?\n\n               Pause.\n\n<b>                                     BRIAN\n</b>                         Um -- Yeah. Sure. If you want to.\n\n<b>                                     SAMMY\n</b>                         I mean... I just think... I don't \n                         know: We had a great little fling. \n                         You know? Let's not push it.\n                              (Pause)\n                         I mean, is that OK? I just --\n\n<b>                                     BRIAN\n</b>                         Yeah. Sure. OK. You're right.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         So are we still friends?\n\n<b>                                     BRIAN\n</b>                              (Nods tersely)\n                         Mm hm. Sure.\n\n<b>                                     SAMMY\n</b>                         All right. Good...!\n\n<b>               EXT. SAMMY'S HOUSE. NIGHT\n</b>\n               The crickets are chattering. The phone is ringing inside the \n               house.\n\n<b>               INT. SAMMY'S BEDROOM. SIMULTANEOUS\n</b>\n               The PHONE is ringing on the NIGHTSTAND. The battered answering \n               machine CLICKS convulsively but does not pick up.\n\n<b>               INT. SAMMY'S KITCHEN. NIGHT\n</b>\n               Sammy is on the phone in her bathrobe.\n\n<b>                                     SAMMY\n</b>                         Around two o'clock this afternoon... \n                         Yeah, a ninety three Toyota Tercel. \n                         New York plates V127AC... Please.\n\n<b>               INT. SAMMY'S HOUSE -- FRONT DOOR. NIGHT\n</b>\n               Sammy, dressed now, opens the door for BOB. She is very \n               anxious.\n\n<b>                                     SAMMY\n</b>                         Thanks for coming over. I just want \n                         to have a car handy just in case.\n\n<b>                                     BOB\n</b>                         No problem.\n\n<b>               INT. KITCHEN. NIGHT\n</b>\n               Sammy is on the phone. Bob sits at the table.\n\n<b>                                     SAMMY\n</b>                              (Into the phone)\n                         Well -- what about other towns?... \n                         Yes! Yes! I called the highway patrol \n                         four times... Well what am I supposed \n                         to do all night?\n\n<b>               INT. SAMMY'S LIVING ROOM. LATER\n</b>\n               Sammy and Bob sit silently in the living room, waiting. She \n               is smoking. The CLOCK READS 12:40. Sammy is going crazy with \n               anxiety.\n\n<b>               EXT. SAMMY'S HOUSE. MORNING\n</b>\n               The PHONE rings inside the house as the early morning sun \n               slants through the trees around the house.\n\n<b>               INT. LIVING ROOM. SIMULTANEOUS\n</b>\n               The RINGING PHONE wakes BOB, on the sofa in his clothes --\n\n<b>               INT. SAMMY'S BEDROOM. SIMULTANEOUS\n</b>\n               -- and Sammy, half asleep on top of her bed, also in her \n               clothes. She GRABS the PHONE.\n\n<b>                                     SAMMY\n</b>                              (Into phone)\n                         Hello?\n\n<b>               INT. BOB'S CAR (MOVING). DAY\n</b>\n               Bob drives Sammy along the highway. She stares out the window. \n               She turns and watches Bob drive for a long moment.\n\n<b>               INT. BANK. DAY\n</b>\n               Brian walks through the morning bank activity and stops at \n               Mabel's desk.\n\n<b>                                     BRIAN\n</b>                         Anyone hear from Sammy this morning?\n\n<b>                                     MABEL\n</b>                         I didn't.\n\n<b>                                     BRIAN\n</b>                         Uh huh. Well, if anyone ever hears \n                         from her ever again, will you let me \n                         know?\n\n<b>                                     MABEL\n</b>                         Yes.\n\n<b>               EXT. AUBURN POLICE STATION. DAY\n</b>\n               On the steps of the police station, Sammy, Rudy and Bob wait \n               as Sheriff Darryl shakes hands with the Auburn Sheriff. The \n               Auburn Sheriff goes inside. Darryl comes over to Sammy.\n\n<b>                                     SHERIFF\n</b>                         It's gonna be all right... We got on \n                         the phone and talked to Rudy Sr. a \n                         little bit and he's calmed down, \n                         just wants to forget about the whole \n                         thing...\n\n<b>                                     SAMMY\n</b>                         Darryl, I really appreciate this...\n\n               The Sheriff nods, but he's not thrilled to be here.\n\n<b>               INT. SAMMY'S LIVING ROOM. DUSK\n</b>\n               The PHONE IS RINGING. Sammy comes in the front door, Terry \n               and Rudy behind her. She snaps on the lights, hurries to the \n               phone and picks up.\n\n               Behind her, Rudy goes upstairs and Terry plunks down on the \n               sofa and turns on the TV.\n\n<b>                                     SAMMY\n</b>                         Hello?\n\n<b>               INTERCUT WITH BRIAN, AT THE BANK.\n</b>\n<b>                                     BRIAN\n</b>                         Yeah, it's Brian.\n\n<b>                                     SAMMY\n</b>                         Brian --\n\n<b>                                     BRIAN\n</b>                         What the hell happened to you today, \n                         lady?\n\n               SAMMY is about to answer, but she just HANGS UP instead.\n\n               BRIAN is stunned into sheer gaping fury. Feverishly he hangs \n               up and dials again. It RINGS.\n\n               Sammy picks up.\n\n<b>                                     SAMMY\n</b>                         Hello?\n\n<b>                                     BRIAN\n</b>                         You're fired!\n\n<b>                                     SAMMY\n</b><b>                         GOOD!\n</b>\n               She hangs up again.\n\n<b>               INT. RUDY'S ROOM. NIGHT\n</b>\n               Sammy is tucking Rudy into bed.\n\n<b>                                     SAMMY\n</b>                         Rudy?\n\n<b>                                     RUDY\n</b>                         Yeah?\n\n<b>                                     SAMMY\n</b>                         Is there anything you want to ask \n                         me, about your father?\n\n<b>                                     RUDY\n</b>                         Oh, that wasn't my father.\n\n<b>                                     SAMMY\n</b>                         What?\n\n<b>                                     RUDY\n</b>                         That wasn't him. I heard him tell \n                         the cops.\n\n<b>                                     SAMMY\n</b>                         No -- Rudy -- that was him. But that \n                         was him. I wish it wasn't, but it \n                         was.\n\n<b>                                     RUDY\n</b>                              (Very quiet)\n                         No it wasn't.\n\n<b>                                     SAMMY\n</b>                         Rudy. Yes it was. Your father's name \n                         is Rudy Kolinski. He lives in \n                         Auburn...\n\n<b>               INT. HALLWAY. NIGHT\n</b>\n               Sammy comes out of Rudy's room, shutting the door softly. We \n               HEAR the TV going downstairs. She stands at the top of the \n               stairs for a moment.\n\n<b>               INT. LIVING ROOM. NIGHT\n</b>\n               Terry is watching TV on the sofa with his feet up on the \n               coffee table. Sammy comes down the stairs and into the living \n               room. He keeps watching TV. She doesn't sit. She is trembling.\n\n<b>                                     SAMMY\n</b>                         Could you turn that off for a minute \n                         please?\n\n               He turns off the TV.\n\n<b>                                     TERRY\n</b>                         You don't have to say anything, Sammy.\n\n<b>                                     SAMMY\n</b>                         I want you to leave.\n\n               Terry looks at her.\n\n<b>                                     TERRY\n</b>                         What do you mean?\n\n<b>                                     SAMMY\n</b>                         I mean I don't think you should live \n                         here anymore. I don't think you know \n                         how to behave around an eight-year-\n                         old and I don't know how to make you \n                         stop, so I think you shouldn't live \n                         here. I don't know what else to say.\n\n<b>                                     TERRY\n</b>                         I don't know how to behave around an \n                         eight-year-old?\n\n<b>                                     SAMMY\n</b>                         That's right --\n\n<b>                                     TERRY\n</b>                         I think you don't know how to behave \n                         around an eight-year-old.\n\n<b>                                     SAMMY\n</b>                         Are you out of your MIND!?!\n\n               Silence.\n\n<b>                                     SAMMY\n</b>                         Now you just listen to me. I may not \n                         be the greatest mother in the world, \n                         but I'm doing the best I know how. \n                         And he doesn't need you to rub his \n                         face in shit because you think it's \n                         good for him. He's going to find out \n                         the world is a horrible place and \n                         that people suck soon enough, and \n                         without any help from you. Believe \n                         me!\n\n               Sammy tries to get ahold of herself. Her voice is shaking.\n\n<b>                                     SAMMY\n</b>                         I think you should get your own place. \n                         I thought, if you want, you could -- \n                         I'll be glad to help you out \n                         financially --\n\n<b>                                     TERRY\n</b>                         What do you mean, Get my own place?\n\n<b>                                     SAMMY\n</b>                         I mean I --\n\n<b>                                     TERRY\n</b>                         You mean in Scottsville?\n\n<b>                                     SAMMY\n</b>                         Yes.\n\n<b>                                     TERRY\n</b>                         Why would I do that? Why don't I \n                         just leave, period?\n\n<b>                                     SAMMY\n</b>                              (Quietly)\n                         Well... If that's what you want to \n                         do, that's fine. But that's not what \n                         I'm saying. You are a very important \n                         person to Rudy, and you are the most \n                         important person to me. But I'm saying \n                         that I can't take any more of this --\n\n<b>                                     TERRY\n</b>                         Well --\n\n<b>                                     SAMMY\n</b>                         -- I thought -- maybe you could sell \n                         your half of the house to me, and I \n                         could pay you whatever it is over a \n                         certain amount of time, and that way --\n\n<b>                                     TERRY\n</b>                         No, you know what? I'll just go.\n\n               He turns the TV back on.\n\n<b>                                     SAMMY\n</b>                              (Very quietly)\n                         Well -- that's not what I'm saying.\n\n               Terry shrugs and watches TV.\n\n<b>               INT. TERRY'S ROOM. NIGHT\n</b>\n               Terry is packing his bag. Rudy is watching.\n\n<b>                                     RUDY\n</b>                         Where are you going?\n\n<b>                                     TERRY\n</b>                         I don't know. I just want to get out \n                         of this town. And if you've got any \n                         sense when you get old enough you'll \n                         get out of here too. Your Mom's gonna \n                         live in this town for the rest of \n                         her life, and you know why? Because \n                         she thinks she has to. Don't ask me \n                         why, but that's the truth. She thinks \n                         there's all these things she has to \n                         do, but you want to know one thing \n                         about your Mom? She's a bigger fuck-\n                         up than I ever was. I mean, I know I \n                         messed up. You think I enjoy getting \n                         thrown in jail because I wanted you \n                         to face that prick your Dad like a \n                         little man and see what kind of a \n                         guy he is? I know I got a little \n                         carried away, and I lost my temper \n                         just a little bit -- which is not \n                         the end of the world either, by the \n                         way, just for future reference --And \n                         now she's kickin' me out of my own \n                         house because -- you know, because I \n                         fucked up a little bit. Which I \n                         totally admit. I was like -- totally \n                         ready to admit that.\n\n               He is finished stuffing his clothes into his backpack.\n\n<b>                                     RUDY\n</b>                         I could go with you.\n\n<b>                                     TERRY\n</b>                         Well, thanks, man. But I, uh, I can't \n                         really take care of you.\n\n<b>               INT. LIVING ROOM. NIGHT\n</b>\n               Sammy is flipping channels on the TV. The DOORBELL RINGS. \n               She is surprised. She gets up. Terry comes thundering down \n               the stairs, carrying his backpack.\n\n<b>                                     SAMMY\n</b>                         Is that for you?\n\n<b>                                     TERRY\n</b>                         Yeah, I'm just gonna stay at Ray's \n                         till I take off.\n\n<b>                                     SAMMY\n</b>                         You don't have to do that.\n\n<b>                                     TERRY\n</b>                         Yeah. Well, that's what I wanna do, \n                         so --\n\n<b>                                     SAMMY\n</b>                         Well but -- Are you gonna come back \n                         to say good-bye?\n\n<b>                                     TERRY\n</b>                         No -- I'm just gonna take off. I'll \n                         see you later.\n\n<b>                                     SAMMY\n</b>                         Well --\n\n               Terry opens the door. RAY is there. Terry closes the door \n               behind him. Sammy listens to the PICKUP TRUCK DRIVE OFF. The \n               sound FADES.\n\n<b>               INT. RAY'S HOUSE. NIGHT\n</b>\n               Terry is bunked down on Ray's horrible sofa. In the b.g., \n               there is a light on in the bedroom. Terry fluffs his pillow \n               and shuts his eyes.\n\n<b>               EXT. SAMMY'S HOUSE. DAY\n</b>\n               Dressed for work and school, Sammy and Rudy walk to the car.\n\n<b>                                     SAMMY\n</b>                         Look. I know you're upset about Uncle \n                         Terry leaving, and so am I. But he's \n                         just not in control of himself, and \n                         I don't want him hurting your feelings \n                         anymore -- or mine. And you may not \n                         like it, but that's how it's gotta \n                         be. OK?\n\n<b>                                     RUDY\n</b>                         I don't care.\n\n<b>                                     SAMMY\n</b>                         You don't care. I don't care either.\n\n<b>               INT. BRIAN'S OFFICE. DAY\n</b>\n               Sammy sits in front of Brian's desk.\n\n<b>                                     BRIAN\n</b>                         Well... I'm sorry you're havin' all \n                         this trouble...\n\n<b>                                     SAMMY\n</b>                         Thank you.\n\n<b>                                     BRIAN\n</b>                         But you made a pretty good speech to \n                         me yesterday about people sticking \n                         to their commitments...\n\n<b>                                     SAMMY\n</b>                         Yeah...?\n\n<b>                                     BRIAN\n</b>                         Well... you made a commitment to \n                         this bank, Sammy. To this job.\n\n<b>                                     SAMMY\n</b>                         I know I'd --\n\n<b>                                     BRIAN\n</b>                         And to working things out with this \n                         tough new son of a bitch boss of \n                         yours. And whatever might have passed \n                         between us after hours doesn't mean \n                         you just walk away from that \n                         commitment -- yeah, even when you \n                         have a legitimate family emergency.\n\n<b>                                     SAMMY\n</b>                         I'm really sorry I didn't --\n\n<b>                                     BRIAN\n</b>                         Which is why I think in the calm \n                         cold light of day, we should both \n                         think real hard about whether or not \n                         you really want to continue on here \n                         at Merchants National Trust.\n\n<b>                                     SAMMY\n</b>                         You're not serious.\n\n<b>                                     BRIAN\n</b>                         ...you're not happy, I'm not happy, \n                         it's not good for you and it sure as \n                         heck isn't good for the bank.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         You know you're the worst manager \n                         we've ever had?\n\n<b>                                     BRIAN\n</b>                         Come on, Sammy...\n\n<b>                                     SAMMY\n</b>                         By far the worst.\n\n<b>                                     BRIAN\n</b>                         ...I don't wanna trade insults with \n                         you.\n\n<b>                                     SAMMY\n</b>                         Well, I don't want to be fired, Brian. \n                         I've been working here for seven \n                         years.\n\n<b>                                     BRIAN\n</b>                         Well --\n\n<b>                                     SAMMY\n</b>                         And if I were you I'd be a little \n                         nervous about firing an employee I \n                         just had an affair with. OK?\n\n<b>                                     BRIAN\n</b>                         That's -- Don't threaten me, Sammy: \n                         I'm not threatening you. I -- It's \n                         just an area I think we should \n                         explore.\n\n<b>                                     SAMMY\n</b>                         I'm not thr -- You explore it. I'm \n                         going back to work.\n\n               She heads for the door, stops.\n\n<b>                                     SAMMY\n</b>                         Oh, and I have to pick up Rudy today \n                         because there's no one else to do \n                         it. But I'll find someone as soon as \n                         I have time.\n\n<b>                                     BRIAN\n</b>                         Yeah. Fine. Why don't you just take \n                         over the whole bank?\n\n               Sammy hesitates in the doorway. This thought has never \n               occurred to her before. She goes out.\n\n<b>               INT. LUNCH PLACE. DAY\n</b>\n               THROUGH THE WINDOW we see Sammy and Bob having lunch. Sammy \n               watches him eat, full of mixed feelings about him.\n\n<b>               INT. KITCHEN. DAY\n</b>\n               Sammy is at the stove, making pancakes. She puts a last \n               pancake onto Rudy's plate and brings it to him.\n\n<b>                                     SAMMY\n</b>                         Well, I called where Uncle Terry \n                         said he was gonna stay, and there \n                         was no answer, so I don't know if \n                         he's still in town or not.\n\n               Rudy doesn't answer.\n\n<b>                                     SAMMY\n</b>                         Rudy? Are you not speaking to me?\n\n               Rudy doesn't answer.\n\n<b>                                     SAMMY\n</b>                         Well, I'm sorry you're so mad at me, \n                         but I only did what I thought I had \n                         to do, and I hope you don't stay mad \n                         at me for the rest of your life.\n\n               He opens the maple syrup and pours it on the pancakes.\n\n<b>                                     SAMMY\n</b>                         Rudy, that's too much.\n\n               He keeps pouring. She grabs the bottle from him and upsets \n               some of the dishes on the table.\n\n<b>                                     SAMMY\n</b>                         You gotta cut this out!\n\n<b>                                     RUDY\n</b>                         What did I do?\n\n<b>                                     SAMMY\n</b>                         You don't know what you're talking \n                         about! There was nothing else I could \n                         do! I can't explain it better than \n                         that, but you can't go on like this \n                         because you don't know anything about \n                         it and you don't know what you're \n                         doing!\n\n<b>                                     RUDY\n</b>                              (Frightened)\n                         OK, I'm sorry!\n\n<b>                                     SAMMY\n</b>                         I don't want you to be sorry, I just \n                         want you to STOP IT!\n\n<b>                                     RUDY\n</b>                         I will! I will! I'm stopping, I'm \n                         sorry.\n\n               He comes around the table to her.\n\n<b>                                     RUDY\n</b>                         See? I'm stopping! I'm not doing it. \n                         See? I'm not.\n\n               He's very alarmed. Sammy looks at him for a long moment.\n\n<b>               EXT. CEMETERY. DAY\n</b>\n               Terry walks through the little cemetery gate and makes his \n               way up the hill through the tombstones. He reaches his \n               parents' graves. He looks at the tombstones for a moment. He \n               puts his hand on top of one headstone, then the other.\n\n               He sits down and smokes. He looks up at the SKY. It's a \n               beautiful deep blue sky dotted with billowy white clouds.\n\n               He looks out over the hilly scenery. After a moment he shakes \n               his head a few times. He doesn't even know he's doing it. He \n               sits there.\n\n<b>               INT. RAY'S HOUSE. DAY\n</b>\n               The PHONE IS RINGING as Terry walks into the house. He walks \n               past it, to the fridge, gets a beer and opens it. It KEEPS \n               RINGING. He picks it up.\n\n<b>                                     TERRY\n</b>                              (Into phone)\n                         Ray's house.\n\n<b>               INT. BANK -- SAMMY'S DESK. DAY\n</b>\n               Sammy is at her desk on the phone.\n\n<b>                                     SAMMY\n</b>                         Hi.\n\n               WE CUT BETWEEN THEM. Terry doesn't say anything.\n\n<b>                                     SAMMY\n</b>                         I didn't know if you left yet.\n\n<b>                                     TERRY\n</b>                         No -- I'm leavin' tomorrow.\n\n<b>                                     SAMMY\n</b>                         Well -- What time?\n\n<b>                                     TERRY\n</b>                         There's a bus at nine.\n\n<b>                                     SAMMY\n</b>                         Well -- Can I -- I'd like to see you \n                         before you go. I mean, can I give \n                         you a lift? Or do you want to have \n                         breakfast or anything? And I think \n                         Rudy would really like to say good-\n                         bye.\n\n<b>                                     TERRY\n</b>                         Yeah -- I don't know... I mean --\n\n<b>                                     SAMMY\n</b>                         Terry, you can't just leave like \n                         this. I --\n\n<b>                                     TERRY\n</b>                         All right, all right. I'll come by \n                         in the morning.\n\n<b>                                     SAMMY\n</b>                         All right -- But just -- We have to \n                         be out of the house by eight, so -- \n                         I don't want to tell Rudy you're \n                         coming unless you really think you \n                         can make it --\n\n<b>                                     TERRY\n</b>                         Yeah -- No -- I'll be there.\n\n<b>                                     SAMMY\n</b>                         All right.\n\n<b>                                     TERRY\n</b>                         All right.\n\n<b>               INT. KITCHEN. MORNING\n</b>\n               Sammy is clearing the breakfast dishes. Rudy is finishing up \n               his cereal. The clock reads 7:50.\n\n<b>                                     SAMMY\n</b>                         You should get your sneakers on.\n\n<b>               EXT. HOUSE. A MOMENT LATER\n</b>\n               Sammy comes out and looks up and down the road.\n\n<b>               INT. LIVING ROOM. A FEW MOMENTS LATER\n</b>\n               Rudy sits in the living room in his baseball jacket. His \n               knapsack is on the floor beside him. He looks at the CLOCK: \n               8:06. Sammy comes into the living room and looks at him.\n\n<b>                                     SAMMY\n</b>                         Sweetie, I'm sorry, we have to go.\n\n<b>                                     RUDY\n</b>                         Why can't I miss school one day?\n\n               They HEAR the PICKUP PULL UP OUTSIDE, O.C. Rudy gets up \n               immediately.\n\n<b>               EXT. THE HOUSE. A MOMENT LATER\n</b>\n               Terry jumps out of RAY'S PICKUP. Sammy opens the front door \n               and Rudy runs out toward Terry.\n\n<b>                                     RUDY\n</b>                         Hi!\n\n<b>                                     TERRY\n</b>                         Hey, how's it goin', man?\n\n               Rudy stops short in front of Terry. Terry looks at Sammy, in \n               the doorway.\n\n<b>                                     TERRY\n</b>                         Sorry I'm late.\n\n<b>               EXT./INT. CAR. DAY\n</b>\n               The car stops across the street from the BUS. The LAST KIDS \n               are getting in. SAMMY HONKS for the bus driver, and Sammy, \n               Terry and Rudy all get out.\n\n<b>                                     TERRY\n</b>                         So Rudy... If I write you a letter, \n                         will you write me back?\n\n<b>                                     RUDY\n</b>                         Yeah.\n\n<b>                                     TERRY\n</b>                         OK, well, that's gonna be pretty \n                         nice for you, because I write a pretty \n                         Goddamn interesting letter.\n\n<b>                                     RUDY\n</b>                         Yeah, we'll see.\n\n<b>                                     TERRY\n</b>                         All right. Well, say good-bye.\n\n<b>                                     RUDY\n</b>                         Bye.\n\n               Rudy hugs Terry. Terry hugs him back. He is suddenly overcome \n               and presses his lips to the top of Rudy's head.\n\n               Rudy walks to the BUS and gets on. The bus pulls away.\n\n               Alone now, Sammy and Terry are not that comfortable. He moves \n               to get back in the car, and she does the same.\n\n<b>               EXT. BENCH. DAY\n</b>\n               Sammy and Terry sit on a bench near the bus stop. Terry's \n               backpack is by his side.\n\n<b>                                     SAMMY\n</b>                         Do you need some cash for the bus?\n\n<b>                                     TERRY\n</b>                         No, I got a few bucks... Aren't you \n                         gonna be late for work?\n\n<b>                                     SAMMY\n</b>                         Oh -- Yeah. That's OK.\n                              (Pause)\n                         Terry, I don't even know where you're \n                         going.\n\n<b>                                     TERRY\n</b>                         Oh, well, I didn't really have a \n                         concrete plan yet. I have to go back \n                         to Worcester and get my stuff...\n\n<b>                                     SAMMY\n</b>                         Oh, are you gonna try to see that \n                         girl?\n\n<b>                                     TERRY\n</b>                         Well... Yeah... You know... Thought \n                         maybe I'd try to show my face... Let \n                         her brother have a crack at me...\n\n<b>                                     SAMMY\n</b>                         What?\n\n<b>                                     TERRY\n</b>                         No...\n\n<b>                                     SAMMY\n</b>                         ...I don't want anyone to have a \n                         crack at you.\n\n<b>                                     TERRY\n</b>                         I'm just kidding. I just thought... \n                         Just thought I'd check up on her...\n                              (Pause)\n                         Anyway, after that, I don't really \n                         know. I've been thinking about Alaska \n                         a lot. I still got some friends out \n                         there. I don't really know. Anyway, \n                         I'll write you.\n\n<b>                                     SAMMY\n</b>                         You will?\n\n<b>                                     TERRY\n</b>                         Sure, Sammy. Of course I will. You \n                         know that.\n\n               Pause.\n\n<b>                                     SAMMY\n</b>                         What is gonna happen to you?\n\n<b>                                     TERRY\n</b>                         Nothing too bad... But I gotta tell \n                         you, I know things didn't work out \n                         too well this time...\n\n<b>                                     SAMMY\n</b>                         Well, Terry --\n\n<b>                                     TERRY\n</b>                         ...but it's always really good to \n                         know that wherever I am, whatever \n                         stupid shit I'm doing, you're back \n                         at my home, rooting for me.\n\n<b>                                     SAMMY\n</b>                         I do root for you.\n\n               She starts crying, and looks down.\n\n<b>                                     TERRY\n</b>                         Come on, Sammy. Everything's gonna \n                         be all right... Comparatively... And \n                         I'll be back this way...\n\n<b>                                     SAMMY\n</b>                         I feel like I'm never gonna see you \n                         again...!\n\n<b>                                     TERRY\n</b>                         Of course you will, Sammy. You never \n                         have to worry about that.\n\n<b>                                     SAMMY\n</b>                         Please don't go till you know where \n                         you're going. Please...!\n\n<b>                                     TERRY\n</b>                         I do know where I'm going. I'm going \n                         to Worcester and I'm gonna try to \n                         see that girl. And then depending on \n                         what happens there, I thought I'd \n                         try to see if there's any work for \n                         me out West. And if there is, I'm \n                         gonna head out there for the summer \n                         and try to make some money. And if \n                         there isn't, I'll figure something \n                         else out. Maybe I'll stay around the \n                         East. I don't know... I really liked \n                         it in Alaska. It was really beautiful. \n                         You just -- It made me feel good. \n                         And before things got so messed up I \n                         was doin' pretty well out there. \n                         Seriously. But I couldn't stay here \n                         long, Sammy: I don't want to live \n                         here. But I'm gonna stay in touch. \n                         And I'll be back. 'Cause I want to \n                         see you and I want to see Rudy. I'll \n                         come home for Christmas. How about \n                         that? We'll have Christmas together.\n                              (Pause)\n                         Come on, Sammy. You can trust me...\n\n               Still looking down, Sammy shakes her head, tears leaking \n               down her cheeks.\n\n<b>                                     TERRY\n</b>                         Come on, Sammy... Look at me... Look \n                         at me...\n\n               She looks at him.\n\n<b>                                     TERRY\n</b>                         Hey, Sammy... Remember when we were \n                         kids, remember what we always used \n                         to say to each other . . .?\n                              (Pause)\n                         Remember when we were kids?\n\n<b>                                     SAMMY\n</b>                         Of course I do...!\n\n               She throws her arms around his neck. He pats her gently.\n\n<b>               INT./EXT. BUS. DAY\n</b>\n               The DOORS OPEN and Terry comes up the steps and into the \n               bus. Outside, Sammy watches him pay the driver and move \n               through the bus toward his seat. The BUS DOORS CLOSE.\n\n<b>               EXT. BUS. CONTINUOUS\n</b>\n               Sammy waves till the BUS DRIVES all the way down MAIN STREET, \n               turns a corner and is gone.\n\n<b>               INT. BUS. CONTINUOUS\n</b>\n               Terry, in his seat, turns forward and watches the view go \n               by. He smiles a little.\n\n<b>               INT. SAMMY'S CAR (MOVING). DAY\n</b>\n               The morning sunlight flickers through the windshield into \n               the car as Sammy drives along toward work. She passes the \n               TOWN HALL CLOCK and sees that it's 9:20.\n\n               She dries her damp cheek with a forearm and rolls down her \n               window to let the morning breeze blow through.\n\n               Squaring her shoulders a little, she drives through town at \n               a slow and easy pace.\n\n<b>                                         THE END\n</b></pre><br/>\n<table align=\"center\" border=\"0\" cellpadding=\"5\" cellspacing=\"0\" class=\"body\" style=\"BORDER-TOP: #000000 1px solid; BORDER-RIGHT: #000000 1px solid; BORDER-LEFT: #000000 1px solid; BORDER-BOTTOM: #000000 1px solid;\" width=\"85%\">\n<tr>\n<td align=\"center\">\n</td><td><h1>You Can Count On Me</h1><br/><br/>\n<b>Writers</b> :   <a href=\"/writer.php?w=Kenneth Lonergan\" title=\"Scripts by Kenneth Lonergan\">Kenneth Lonergan</a><br/>\n<b>Genres</b> :   <a href=\"/genre/Drama\" title=\"Drama Scripts\">Drama</a><br/><br/><br/>\n<a href=\"http://www.imsdb.com/Movie Scripts/You Can Count On Me Script.html#comments\" title=\"You Can Count On Me comments\">User Comments</a>\n</td>\n</tr></table>\n<br/><br/>\n<div align=\"center\">\n<a href=\"http://www.imsdb.com\" title=\"Internet Movie Script Database\"><img alt=\"Internet Movie Script Database\" border=\"1\" src=\"http://www.imsdb.com/images/lilbutton.gif\" style=\"border: 1px solid black;\"/><br/>\nBack to IMSDb</a>\n</div><br/>\n<br/><br/>\n</td>", "scraped": "2018-03-10 22:20:53.901683"}